{
  "doc_name": "1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD",
  "pdf_source": "1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf",
  "metadata": {
    "document_name": "1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD",
    "source_pdf": "1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf",
    "judges": [
      "AMIT BANSAL"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "835/2018",
      "835/2018",
      "835/2018",
      "835/2018",
      "835/2018",
      "835/2018",
      "835/2018",
      "835/2018",
      "835/2018",
      "12048/2019",
      "12049/2019",
      "3096/2020"
    ],
    "dhc_numbers": [
      "2022/DHC/005588",
      "2022/DHC/005588",
      "2022/DHC/005588",
      "2022/DHC/005588",
      "2022/DHC/005588",
      "2022/DHC/005588",
      "2022/DHC/005588"
    ],
    "ia_numbers": [],
    "decision_date": "13 December, 2022",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [],
    "defendants": [],
    "appellants": [],
    "respondents": [],
    "plaintiff_advocates": [],
    "defendant_advocates": [],
    "appellant_advocates": [],
    "respondent_advocates": [],
    "damages_claimed": "1,00,01,000",
    "damages_awarded": null,
    "key_issues": [
      "Here are the main legal issues extracted from the document:",
      "* Whether the applicant is a necessary or proper party in the present suit",
      "* Infringement of intellectual property rights under the Customs Intellectual Property Rights (Imported Goods) Enforcement Rules, 2007",
      "* Jurisdictional issue: whether the court can consider the import of goods by the defendant as a basis for infringement of the plaintiff's trademarks",
      "* Right to seize and confiscate goods under Section 111(d) of the Customs Act, 1962",
      "* Effectiveness of Rule 11 of the Customs Rules in destruction of seized goods pending legal proceedings",
      "* Interpretation of paragraph 2.3 of the Foreign Trade Policy, 2015-20 on importation of goods",
      "* Whether the plaintiff's suit for injunction precludes the applicant from proceeding under the IPR Enforcement Rules during the pendency of the suit",
      "* Scope of impleadment in the present suit and the rights of the plaintiff to choose parties against whom he wishes to litigate (in relation to Mumbai International Airport (P) Ltd. v. Regency Convention Centre & Hotels (P) Ltd.)",
      "* Requirement for a \"No-Objection Certificate\" from the intellectual property right holder under Rule 11 of the Customs Rules"
    ],
    "decision_summary": "**Case Summary:**\n\nThis is a civil case No. CS(COMM) 835/2018 of Western Digital Technologies, Inc & Anr vs Syt Solutions Pvt. Ltd., wherein the present judgment has been delivered by Hon'ble Mr. Justice Amit Bansal on December 13th, 2022.\n\n**Background:**\n\nThe plaintiff company had filed a suit against the defendant company, alleging infringement of their trademarks. The applicant in this case, Commissioner of Customs (General), Air Cargo Complex, Sahar, Andheri (East), Mumbai, sought to be impleaded as a proper party in this suit on the grounds of infringement of intellectual property rights under the Custom Intellectual Property Rights (Imported Goods) Enforcement Rules, 2007.\n\n**Legal Issues:**\n\nThe main legal issue that arose was whether the applicant should be impleaded as a necessary or proper party to this suit. The applicant claimed that they had passed a seizure memo on goods imported by the defendant company under Section 110(1) of the Customs Act, 1962, which was in violation of the provisions of the Foreign Trade Policy.\n\n**Arguments:**\n\nThe plaintiff argued that the applicant is not a necessary or proper party to this suit as it has been filed solely for trademark infringement and does not involve any proceedings related to customs. The defendant also opposed the application on similar grounds. On the other hand, the applicant claimed that they are entitled to be impleaded due to their interest in seeing the customs procedures followed.\n\n**Court Findings:**\n\nThe court noted the tests laid down by the Supreme Court in Kasturi v. Iyyamperumal (2005) 6 SCC 733 for determining a necessary and proper party, which includes:\n\n*   A person whose presence is necessary for deciding the rights of parties or whose interest may be affected.\n*   The applicant must not merely claim an interest, but should demonstrate his direct association with the controversy.\n\nConsidering these guidelines, the court observed that there are two aspects of jurisdiction that need to be satisfied: (a) when all persons claimed as necessary or proper parties have been added; and, (b) whether all such parties have taken active participation in the proceedings.\n\n**Arguments Rebuttal:**\n\nThe counsel for the applicants argued that the defendant's refusal to consent would not vitiate plaintiff's claim regarding impleadment of the applicant. They relied on the provision of Rule 11 of the Customs Rules which suggests that \"if infringing goods have been confiscated and no legal proceedings are pending in relation to such goods, the applicant may proceed to destroy the goods after obtaining 'No-Objection Certificate' from the intellectual property right holder.\"\n\nThe counsel for the applicants argued that this shows they were prepared to comply with Rule 11 but needed the required cooperation and support of the IP Holders so as to ensure their duties are carried out under Section 110(1) of Customs Act. If IPR is not violated, the case will not require adjudication by a Court.\n\n**Decision:**\n\nHowever, in accordance with the Supreme Court's observation that \"the general rule with regard to impleadment of parties is that the plaintiff in a suit, being dominus litis, may choose the persons against whom he wishes to litigate and cannot be compelled to sue a person against whom he does not seek any relief,\" as stated in Mumbai International Airport (P) Ltd. v. Regency Convention Centre & Hotels (P) Ltd., the Hon'ble Justice Amit Bansal dismissed the applicant's plea.",
    "legal_precedents": [
      "In Kasturi Iyyamperumal",
      "(2012) 8 SCC 384",
      "(2010) 7 SCC 417",
      "(2005) 6 SCC 733"
    ],
    "full_text": "\n--- PAGE 1 ---\n2022/DHC/005588 \n \nCS(COMM) 835/2018                                                                                                      Page 1 of 7 \n \n$~7 \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n \n% \n \n \n \n                  Date of decision: 13th December, 2022 \n \n+  \nCS(COMM) 835/2018, I.A. 12048/2019(O-XI R-1 of CPC), I.A. \n12049/2019(for condonation of delay of 203 days in re-filing the \napplication) \n \n \nWESTERN DIGITAL TECHNOLOGIES,  \nINC & ANR \n \n \n \n \n \n..... Plaintiffs \nThrough: \nMr. Prithvi Singh and Ms. Devyani \nNath, Advocates \n \n \n \n \n \nversus \n \n \nSYT SOLUTIONS PVT. LTD.  \n \n \n..... Defendant \n \n \n \n \nThrough: \nMr. Nakul Mohta, Advocate \nMr. Ajay Kumar Pandey, Senior \nPanel \nCounsel \nfor \nthe \napplicant/custom \nin \nIA.3096/2020 \nwith Mr. Vikas Kumar Sharma, \nAdvocate \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nAMIT BANSAL, J. (Oral) \n \n \nI.A. 3096/2020(O.I R.10 of CPC) \n1. \nThe present application has been filed on behalf of Commissioner of \nCustoms (General), Air Cargo Complex, Sahar, Andheri (East), Mumbai – \n400009 seeking impleadment in the present suit as a proper party. \n2. \nThe application is premised on the infringement of the intellectual \nproperty rights of the plaintiff in terms of the Custom Intellectual Property \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.12.2022 12:11:23\nSignature Not Verified\n\n--- PAGE 2 ---\n2022/DHC/005588 \n \nCS(COMM) 835/2018                                                                                                      Page 2 of 7 \n \nRights (Imported Goods) Enforcement Rules, 2007 (hereinafter referred to \nas „IPR Enforcement Rules‟), on account of the import of goods by the \ndefendant. The applicant had passed a seizure memo dated 2nd May, 2018 in \nrespect of 9,644pieces of the goods imported by the defendant under Section \n110(1) of the Customs Act, 1962. It is also the case of the applicant that \ngoods which have been imported into India are in violation of paragraph 2.3 \nof the Foreign Trade Policy, 2015-20 and are therefore, liable for \nconfiscation under Section 111(d) of the Customs Act, 1962. \n3. \nBoth the plaintiff and the defendants have opposed the present \napplication. Plaintiffs have filed reply in opposition to the aforesaid \napplication, wherein it stated that the present suit has been filed on the basis \nof infringement of the plaintiffs‟ trademarks by the defendant and therefore, \nthe applicant is neither a necessary and nor a proper party for the \nadjudication of the present suit. The applicant, vide its letter dated 24th April, \n2018, asked the plaintiff of its willingness to join the proceedings, failing \nwhich the applicant would release the seized goods. Rule 11 of the Customs \nRules states that if the infringing goods have been confiscated and no legal \nproceedings are pending in relation to such goods, the applicant may \nproceed to destroy the goods after obtaining „No-Objection Certificate‟ from \nthe intellectual property right holder. Since the plaintiff has chosen to file \nthe present suit for injunction, the applicant cannot proceed under the IPR \nEnforcement Rules during the pendency of the present suit. Therefore, the \napplicant is neither a necessary party nor a proper party. \n4. \nI have heard the counsels for the parties. \n5. \nThe \nSupreme \nCourt \nin Mumbai \nInternational \nAirport \n(P) \nLtd. v. Regency Convention Centre & Hotels (P) Ltd., (2010) 7 SCC 417, \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.12.2022 12:11:23\nSignature Not Verified\n\n--- PAGE 3 ---\n2022/DHC/005588 \n \nCS(COMM) 835/2018                                                                                                      Page 3 of 7 \n \nhas observed that the general rule with regard to impleadment of parties is \nthat the plaintiff in a suit, being dominus litis, may choose the persons \nagainst whom he wishes to litigate and cannot be compelled to sue a person \nagainst whom he does not seek any relief. \n6. \nIn Kasturi v. Iyyamperumal, (2005) 6 SCC 733, the Supreme Court \nlaid down the tests to determine as to who is a necessary party and proper \nparty in a suit. The relevant portions are set out below: \n“7*.  In our view, a bare reading of this provision, namely, \nsecond part of Order 1 Rule 10 sub-rule (2) CPC would \nclearly show that the necessary parties in a suit for specific \nperformance of a contract for sale are the parties to the \ncontract or if they are dead, their legal representatives as also \na person who had purchased the contracted property from the \nvendor. In equity as well as in law, the contract constitutes \nrights and also regulates the liabilities of the parties. A \npurchaser is a necessary party as he would be affected if he \nhad purchased with or without notice of the contract, but a \nperson who claims adversely to the claim of a vendor is, \nhowever, not a necessary party. From the above, it is now \nclear that two tests are to be satisfied for determining the \nquestion who is a necessary party. Tests are — (1) there must \nbe a right to some relief against such party in respect of the \ncontroversies involved in the proceedings; (2) no effective \ndecree can be passed in the absence of such party. \n… \n11. As noted hereinearlier, two tests are required to be \nsatisfied to determine the question who is a necessary party, \nlet us now consider who is a proper party in a suit for specific \nperformance of a contract for sale. For deciding the question \nwho is a proper party in a suit for specific performance the \nguiding principle is that the presence of such a party is \nnecessary to adjudicate the controversies involved in the suit \nfor specific performance of the contract for sale. Thus, the \nquestion is to be decided keeping in mind the scope of the \nsuit. …” \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.12.2022 12:11:23\nSignature Not Verified\n\n--- PAGE 4 ---\n2022/DHC/005588 \n \nCS(COMM) 835/2018                                                                                                      Page 4 of 7 \n \n7. \nIn Vidur Impex & Traders (P) Ltd. v. Tosh Apartments (P) Ltd., \n(2012) 8 SCC 384, the Supreme Court has succinctly laid down the \nprinciples to be followed while deciding an application filed under Order 1 \nRule 10(2) of the CPC. Paragraph 36 in this regard is set out below : \n“36. Though there is apparent conflict in the observations \nmade in some of the aforementioned judgments, the broad \nprinciples which should govern disposal of an application for \nimpleadment are : \n \n1. The court can, at any stage of the proceedings, either \non an application made by the parties or otherwise, \ndirect impleadment of any person as party, who ought \nto have been joined as plaintiff or defendant or whose \npresence before the court is necessary for effective and \ncomplete adjudication of the issues involved in the suit. \n \n2. A necessary party is the person who ought to be \njoined as party to the suit and in whose absence an \neffective decree cannot be passed by the court. \n \n3. A proper party is a person whose presence would \nenable the court to completely, effectively and \nproperly adjudicate upon all matters and issues, \nthough he may not be a person in favour of or against \nwhom a decree is to be made. \n \n4. 4. If a person is not found to be a proper or necessary \nparty, the court does not have the jurisdiction to order \nhis impleadment against the wishes of the plaintiff.” \n \n8. \nAt this stage, a reference may be made to the prayers made in the \nplaint, which are set out below: \n“A. A decree of permanent injunction restraining the \ndefendants, their partners, representatives and/or others \nacting for and on their behalf for importing, selling, offering \nfor sale, advertising or otherwise dealing in infringing goods \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.12.2022 12:11:23\nSignature Not Verified\n\n--- PAGE 5 ---\n2022/DHC/005588 \n \nCS(COMM) 835/2018                                                                                                      Page 5 of 7 \n \nbearing the plaintiffs’ registered trademarks WESTERN \nDIGITAL,\n and/or WD under nos.1345682, 1349235 and \n1325732 in Class 9. \n \nB. \nAn order of delivery up of all the infringing goods \nbearing the plaintiffs’ trademarks WESTERN DIGITAL,\n \nand/or WD including packaging(s), cartons, labels, stickers, \nand/or publicity material bearing the impugned trademarks for \nthe purposes of destruction/erasure. \n \nC. \nAn order for damages of Rs.1,00,01,000. \n \n9. \nAs can be seen from the above, no relief has been sought against the \napplicant. The entire case of the plaintiff is based on the infringement of the \ntrademarks of the plaintiffs by the defendant. Therefore, it cannot be said \nthat an effective decree cannot be passed in the present suit in the absence of \nthe applicant. It is not even the case of the applicant that the applicant is a \nnecessary party, as the present application seeks impleadment only on the \nbasis of the applicant being a proper party. \n10. \nIn terms of the legal position discussed above, for a person to be a \nproper party to a suit, it is to be seen whether the presence of such person \nwould enable the Court to completely, effectively and properly adjudicate \nupon the issue in the case. \n11. \nAt this stage, a reference may be made to Rule 11 of the IPR \nEnforcement Rules, the relevant portion is set out below: \n“11. Disposal of  infringing goods. –  \n \n(1) Where upon determination by the Deputy Commissioner \nof Customs or Assistant Commissioner of Customs, as the case \nmay be, it is found that the goods detained or seized have \ninfringed intellectual property rights, and have been \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.12.2022 12:11:23\nSignature Not Verified\n\n--- PAGE 6 ---\n2022/DHC/005588 \n \nCS(COMM) 835/2018                                                                                                      Page 6 of 7 \n \nconfiscated under Section 111(d) of the Customs Act, 1962 \nand no legal proceedings are pending in relation to such \ndetermination, the Deputy Commissioner of Customs or \nAssistant Commissioner of Customs, as the case may be, shall \ndestroy the goods under official supervision or dispose them \noutside the normal channels of commerce after obtaining “no \nobjection” or concurrence of the right holder or his authorized \nrepresentative. \n \n \n \n…” \n \n12. \nIn terms of the aforesaid Rule, the applicant has the jurisdiction to \ndetermine if the seized goods are infringing the Intellectual Property Rights \nof the plaintiffs, only in the event of no legal proceedings being pending in \nrelation to such determination. However, the present suit is such a legal \nproceeding in which a determination is to be made whether the goods \nimported by the defendant are infringing or not. Therefore, in terms of Rule \n11 of IPR Enforcement Rules, the applicant cannot go into the question of \ninfringement till the final adjudication of the present suit. \n13. \nIn the event, this Court comes to a finding that the defendant has not \ninfringed the trademarks of the plaintiffs, the said determination shall be \nbinding on the applicant and there cannot be any question of destruction of \nthe infringing goods.  On the other hand, if a final determination is made by \nthis Court that the goods have infringed the trademarks of the plaintiffs, \nappropriate orders shall be passed with regard to the aforesaid goods. \n14. \nIn view of the discussion above, the applicant is neither a necessary \nparty nor a proper party for the adjudication of the suit. There is no merit in \nthe present application and the same is dismissed. \n15. \nNeedless to state this is without prejudice to any other statutory \nrights/remedy of the applicant.  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.12.2022 12:11:23\nSignature Not Verified\n\n--- PAGE 7 ---\n2022/DHC/005588 \n \nCS(COMM) 835/2018                                                                                                      Page 7 of 7 \n \nCS(COMM) 835/2018 \n16. \nIn the order dated 5th July, 2019, the submission of the counsel for the \nplaintiff has been recorded that the present suit is a fit case for the Court to \nproceed to pass a summary judgment under Order 13A of the Code of Civil \nProcedure, 1908. \n17. \nIn terms of the aforesaid order, both sides have filed their respective \nwritten submissions along with judgments in support thereof. \n18. \nList for hearing on 21st March, 2023. \n \n \nAMIT BANSAL, J. \nDECEMBER 13, 2022 \ndk \n \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.12.2022 12:11:23\nSignature Not Verified\n"
  },
  "total_pages": 7,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "**Case Summary**\n\nThe case is Western Digital Technologies, Inc & ANR vs Syt Solutions PVT. LTD., 2022/DHC/005588, decided on December 13, 2022.\n\n**Parties:**\n\n* Plaintiffs: Western Digital Technologies, Inc & ANR (represented by Mr. Prithvi Singh and Ms. Devyani Nath)\n* Defendant: Syt Solutions PVT. LTD. (represented by Mr. Nakul Mohta, Advocate)\n* Intervenor: Commissioner of Customs (General), Air Cargo Complex, Sahar, Andheri (East), Mumbai\n\n**Facts:**\n\n* The plaintiffs alleged infringement of their trademarks by the defendant.\n* The commissioner of customs sought to implead themselves as a proper party in the suit, claiming infringement of intellectual property rights under the Custom Intellectual Property Rights Enforcement Rules, 2007.\n\n**Arguments and Decision:**\n\n* The plaintiffs opposed the application, arguing that the commissioner is neither a necessary nor a proper party.\n* The Supreme Court's decision in Mumbai International Airport (P) Ltd v. Regency Convention Centre & Hotels (P) Ltd. was cited to support this argument.\n* The Honorable Justice Amit Bansal decided not to admit the application, citing Rule 11 of the Customs Rules.\n\n**Dates and Amounts:**\n\n* May 2, 2018: secession memo dated\n* April 24, 2018: letter from applicant to plaintiff relating their intention to release seized goods\n\nSource:\nPDF source: WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf in the section Case Header and Parties",
      "pdf_source": "1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "**Case Summary**\n\nSource: WESTERN DIGITAL TECHNOLOGIES VS SYT SOLUTIONS PVT LTD (2022/DHC/005588) - CS(COMM) 835/2018\n\n**Key Facts and Proceedings**\n\n* The High Court of Delhi at New Delhi issues a judgment on December 13, 2022.\n* Western Digital Technologies Inc. & Anr vs Syt Solutions Pvt Ltd is the subject matter of the suit (CS(COMM) 835/2018).\n* Commissioner of Customs (General), Air Cargo Complex, Mumbai seeks impleadment as a proper party via I.A. 3096/2020.\n* The application is filed to address infringement on Western Digital's intellectual property rights related to Custom Intellectual Property.\n\n**Parties and Counsel**\n\n* Plaintiffs: Western Digital Technologies Inc. & Anr (represented by Mr. Prithvi Singh and Ms. Devyani Nath, Advocates)\n* Defendant: Syt Solutions Pvt Ltd (represented by Mr. Nakul Mohta, Advocate and Mr. Ajay Kumar Pandey, Senior Panel Counsel)\n\n**Coram**\n\n* Hon'ble Mr. Justice Amit Bansal heard the application.",
          "content": "2022/DHC/005588 \n \nCS(COMM) 835/2018                                                                                                      Page 1 of 7 \n \n$~7 \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n \n% \n \n \n \n                  Date of decision: 13th December, 2022 \n \n+  \nCS(COMM) 835/2018, I.A. 12048/2019(O-XI R-1 of CPC), I.A. \n12049/2019(for condonation of delay of 203 days in re-filing the \napplication) \n \n \nWESTERN DIGITAL TECHNOLOGIES,  \nINC & ANR \n \n \n \n \n \n..... Plaintiffs \nThrough: \nMr. Prithvi Singh and Ms. Devyani \nNath, Advocates \n \n \n \n \n \nversus \n \n \nSYT SOLUTIONS PVT. LTD.  \n \n \n..... Defendant \n \n \n \n \nThrough: \nMr. Nakul Mohta, Advocate \nMr. Ajay Kumar Pandey, Senior \nPanel \nCounsel \nfor \nthe \napplicant/custom \nin \nIA.3096/2020 \nwith Mr. Vikas Kumar Sharma, \nAdvocate \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nAMIT BANSAL, J. (Oral) \n \n \nI.A. 3096/2020(O.I R.10 of CPC) \n1. \nThe present application has been filed on behalf of Commissioner of \nCustoms (General), Air Cargo Complex, Sahar, Andheri (East), Mumbai – \n400009 seeking impleadment in the present suit as a proper party. \n2. \nThe application is premised on the infringement of the intellectual \nproperty rights of the plaintiff in terms of the Custom Intellectual Property \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.12.2022 12:11:23\nSignature Not Verified",
          "pdf_source": "1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "Based on Page 2 of the provided PDF (WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD), here is a summary of the legal facts, proceedings, arguments, decisions, dates, names, and amounts:\n\n**Proceedings**: The Court is considering an application (I.A. No. 12048/2019) filed by the Applicant, Western Digital Technologies Inc.\n\n**Background**: The Applicant seized goods worth Rs. 8,54,000 from the Defendant under Section 110(1) of the Customs Act, 1962.\n\n**Arguments**: Both parties have opposed the application. The Plaintiff (Western Digital) argues that the Applicant is not a necessary party to the suit for trademark infringement. The Applicant claims that it cannot destroy the seized goods without the intellectual property right holder's consent or a No-Objection Certificate.\n\n**Decisions**:\n\n* The Suit was filed on April 24, 2018.\n* The seizure memo was passed by the Applicant on May 2, 2018.\n* The Plaintiff will not provide a No-Objection Certificate, citing pendency of the suit for injunction.\n\n**Sources**: PDF source: WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD (2022/DHC/005588). Court File Number: CS(COMM) 835/2018",
          "content": "2022/DHC/005588 \n \nCS(COMM) 835/2018                                                                                                      Page 2 of 7 \n \nRights (Imported Goods) Enforcement Rules, 2007 (hereinafter referred to \nas „IPR Enforcement Rules‟), on account of the import of goods by the \ndefendant. The applicant had passed a seizure memo dated 2nd May, 2018 in \nrespect of 9,644pieces of the goods imported by the defendant under Section \n110(1) of the Customs Act, 1962. It is also the case of the applicant that \ngoods which have been imported into India are in violation of paragraph 2.3 \nof the Foreign Trade Policy, 2015-20 and are therefore, liable for \nconfiscation under Section 111(d) of the Customs Act, 1962. \n3. \nBoth the plaintiff and the defendants have opposed the present \napplication. Plaintiffs have filed reply in opposition to the aforesaid \napplication, wherein it stated that the present suit has been filed on the basis \nof infringement of the plaintiffs‟ trademarks by the defendant and therefore, \nthe applicant is neither a necessary and nor a proper party for the \nadjudication of the present suit. The applicant, vide its letter dated 24th April, \n2018, asked the plaintiff of its willingness to join the proceedings, failing \nwhich the applicant would release the seized goods. Rule 11 of the Customs \nRules states that if the infringing goods have been confiscated and no legal \nproceedings are pending in relation to such goods, the applicant may \nproceed to destroy the goods after obtaining „No-Objection Certificate‟ from \nthe intellectual property right holder. Since the plaintiff has chosen to file \nthe present suit for injunction, the applicant cannot proceed under the IPR \nEnforcement Rules during the pendency of the present suit. Therefore, the \napplicant is neither a necessary party nor a proper party. \n4. \nI have heard the counsels for the parties. \n5. \nThe \nSupreme \nCourt \nin Mumbai \nInternational \nAirport \n(P) \nLtd. v. Regency Convention Centre & Hotels (P) Ltd., (2010) 7 SCC 417, \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.12.2022 12:11:23\nSignature Not Verified",
          "pdf_source": "1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0005",
      "start_index": 3,
      "end_index": 3,
      "summary": "Here is a summary of Section \"Background and Facts\" from the PDF \"1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf\":\n\n**Case Details**\n\n* Case No: CS(COMM) 835/2018\n* Date of decision: 13th December, 2022\n* Court: High Court of Delhi at New Delhi\n\n**Parties involved**\n\n* Plaintiffs: Western Digital Technologies Inc. and another (hereinafter referred to as \"Western Digital\")\n* Other parties not explicitly mentioned in the section.\n\n**Background**\n\nThe court begins by discussing the principle that a plaintiff, being dominus litis, has the discretion to choose against whom they wish to litigate.\n\n**Kasturi v. Iyyamperumal case reference**\n\nIn this case, the Supreme Court laid down tests for determining necessary and proper parties in a suit:\n\n* Necessary party: (1) the party must have a right to some relief against such party; (2) no effective decree can be passed without their presence.\n* Proper party: The guiding principle is the necessity of adjudicating controversies involved in the suit.\n\n**Condonation of delay**\n\nWestern Digital had applied for condonation of delay in re-filing an application, which was granted.\n\n**Judicial observation**\n\nThe court observed that a person who claims adversely to the claim of the vendor is not a necessary party in a suit for specific performance of a contract.\n\nThis summary is under 300 words and focuses on legal proceedings, facts, arguments, decisions, parties, dates, and amounts from Section \"Background and Facts\".",
      "pdf_source": "1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "Here is a summary of page 3 from the PDF:\n\n**WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf**\n\nThe Delhi High Court case (2022/DHC/005588) discusses the concept of necessary and proper parties in a suit for specific performance of a contract.\n\nSixth paragraph (5) quotes from Kasturi v. Iyyamperumal, (2005) 6 SCC 733, stating that:\n\n* A necessary party must have a right to some relief against another party in respect of the controversy involved.\n* No effective decree can be passed without such a party's presence.\n\n Eleventh paragraph (11) further explains that two tests are required to determine a necessary party: (1) right to relief and (2) no decree possible without such party. \n\nThe focus is on defining necessary and proper parties in a suit for specific performance of a contract for sale, setting out the legal framework as per Order 1 Rule 10 sub-rule (2) CPC.\n\n**PDF Source:** WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf",
          "content": "2022/DHC/005588 \n \nCS(COMM) 835/2018                                                                                                      Page 3 of 7 \n \nhas observed that the general rule with regard to impleadment of parties is \nthat the plaintiff in a suit, being dominus litis, may choose the persons \nagainst whom he wishes to litigate and cannot be compelled to sue a person \nagainst whom he does not seek any relief. \n6. \nIn Kasturi v. Iyyamperumal, (2005) 6 SCC 733, the Supreme Court \nlaid down the tests to determine as to who is a necessary party and proper \nparty in a suit. The relevant portions are set out below: \n“7*.  In our view, a bare reading of this provision, namely, \nsecond part of Order 1 Rule 10 sub-rule (2) CPC would \nclearly show that the necessary parties in a suit for specific \nperformance of a contract for sale are the parties to the \ncontract or if they are dead, their legal representatives as also \na person who had purchased the contracted property from the \nvendor. In equity as well as in law, the contract constitutes \nrights and also regulates the liabilities of the parties. A \npurchaser is a necessary party as he would be affected if he \nhad purchased with or without notice of the contract, but a \nperson who claims adversely to the claim of a vendor is, \nhowever, not a necessary party. From the above, it is now \nclear that two tests are to be satisfied for determining the \nquestion who is a necessary party. Tests are — (1) there must \nbe a right to some relief against such party in respect of the \ncontroversies involved in the proceedings; (2) no effective \ndecree can be passed in the absence of such party. \n… \n11. As noted hereinearlier, two tests are required to be \nsatisfied to determine the question who is a necessary party, \nlet us now consider who is a proper party in a suit for specific \nperformance of a contract for sale. For deciding the question \nwho is a proper party in a suit for specific performance the \nguiding principle is that the presence of such a party is \nnecessary to adjudicate the controversies involved in the suit \nfor specific performance of the contract for sale. Thus, the \nquestion is to be decided keeping in mind the scope of the \nsuit. …” \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.12.2022 12:11:23\nSignature Not Verified",
          "pdf_source": "1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0009",
      "start_index": 4,
      "end_index": 6,
      "summary": "**Western Digital Technologies vs. Syt Solutions Pvt Ltd., Court Case: 2022/DHC/005588**\n\nThis legal document is a High Court of Delhi judgment from December 13, 2022, in case CS(COMM) 835/2018.\n\n**Pertinent Facts and Arguments:**\n\n* Western Digital Technologies (Plaintiff) filed a suit against Syt Solutions Pvt Ltd. for trademark infringement.\n* The Plaintiff prayed for permanent injunction, delivery up of infringing goods, and damages of Rs.1,00,01,000.\n* The case turned on whether the applicant, whose identity remains unknown from the text, is a proper party to be impleaded in the suit.\n\n**Key Legal Arguments:**\n\nThe court relied on Vidur Impex & Traders (P) Ltd. v. Tosh Apartments (P) Ltd., 2012 SCC 384, which distinguished necessary parties, proper parties, and applicants who can be impleaded at any stage of proceedings.\n\n* The Plaintiff did not seek relief against the applicant.\n* The issue in question related to trademark infringement by the Defendant and not the Applicant, which led the court to rule that an effective decree could still be passed without impleading the Applicant as a necessary party (para 9).\n\n**Decision:**\n\nThe Court ruled that, for someone to be considered a proper party, their presence would need to enable the court to \"completely, effectively and properly adjudicate upon all matters and issues\" in the case. As per Rule 11 of IPR Enforcement Rules, disposal of infringing goods is governed by Customs authorities. The Applicant's inclusion would not have affected the effective passage of an ordinance. Thus, the application for impleadment was rejected.\n\nSource: WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf",
      "pdf_source": "1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf",
      "nodes": [
        {
          "title": "Page 4",
          "node_id": "0006",
          "start_index": 4,
          "end_index": 4,
          "summary": "Based on page 4 of the provided PDF (1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf), here is a summary of the legal facts:\n\n**Case Details**\n\n* Case: 2022/DHC/005588, CS(COMM) 835/2018\n* Date of Decision: December 13th, 2022\n\n**Supreme Court Ruling**\n\nThe Supreme Court laid down principles in Vidur Impex & Traders (P) Ltd. v. Tosh Apartments (P) Ltd., (2012) 8 SCC 384:\n\n1. The court can direct impleadment of anyone who ought to be joined as a party.\n2. A necessary party is one whose absence prevents an effective decree.\n3. A proper party enables the court to completely adjudicate on matters and issues.\n4. If someone is not a proper or necessary party, the court lacks jurisdiction to order their impleadment.\n\n**Plaintiffs' Prayers**\n\nThe plaintiffs, Western Digital Technologies, Inc., and another, prayed for:\n\n* A permanent injunction restraining defendants from importing, selling, or dealing in infringing goods.",
          "content": "2022/DHC/005588 \n \nCS(COMM) 835/2018                                                                                                      Page 4 of 7 \n \n7. \nIn Vidur Impex & Traders (P) Ltd. v. Tosh Apartments (P) Ltd., \n(2012) 8 SCC 384, the Supreme Court has succinctly laid down the \nprinciples to be followed while deciding an application filed under Order 1 \nRule 10(2) of the CPC. Paragraph 36 in this regard is set out below : \n“36. Though there is apparent conflict in the observations \nmade in some of the aforementioned judgments, the broad \nprinciples which should govern disposal of an application for \nimpleadment are : \n \n1. The court can, at any stage of the proceedings, either \non an application made by the parties or otherwise, \ndirect impleadment of any person as party, who ought \nto have been joined as plaintiff or defendant or whose \npresence before the court is necessary for effective and \ncomplete adjudication of the issues involved in the suit. \n \n2. A necessary party is the person who ought to be \njoined as party to the suit and in whose absence an \neffective decree cannot be passed by the court. \n \n3. A proper party is a person whose presence would \nenable the court to completely, effectively and \nproperly adjudicate upon all matters and issues, \nthough he may not be a person in favour of or against \nwhom a decree is to be made. \n \n4. 4. If a person is not found to be a proper or necessary \nparty, the court does not have the jurisdiction to order \nhis impleadment against the wishes of the plaintiff.” \n \n8. \nAt this stage, a reference may be made to the prayers made in the \nplaint, which are set out below: \n“A. A decree of permanent injunction restraining the \ndefendants, their partners, representatives and/or others \nacting for and on their behalf for importing, selling, offering \nfor sale, advertising or otherwise dealing in infringing goods \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.12.2022 12:11:23\nSignature Not Verified",
          "pdf_source": "1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf",
          "nodes": []
        },
        {
          "title": "Page 5",
          "node_id": "0007",
          "start_index": 5,
          "end_index": 5,
          "summary": "**Summary of Page 5 from PDF: Western Digital Technologies vs Syt Solutions PVT LTD**\n\n**Case:** CS(COMM) 835/2018, I.A. 12048/2019(O-XI R-1 of CPC), I.A. 12049/2019\n**Date:** December 13, 2022 (Decision Date)\n**Court:** High Court of Delhi\n\nThe plaintiffs demand relief against Syt Solutions PVT LTD for trademark infringement. The requested relief involves:\n\nA. A permanent injunction to restrain the defendant from using infringing marks.\nB. Delivery up and destruction/erasure of infringing goods bearing the plaintiff's trademarks.\nC. Damages of Rs. 1,00,01,000.\n\nThe court rules that the applicant (Syt Solutions PVT LTD) must be impleaded as a proper party to ensure an effective decree can be passed in the suit.\n\n**References:**\n\n* Rule 11 of the IPR Enforcement Rules\n\n**Source:** Page 5 of \"1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf\" (2022/DHC/005588)",
          "content": "2022/DHC/005588 \n \nCS(COMM) 835/2018                                                                                                      Page 5 of 7 \n \nbearing the plaintiffs’ registered trademarks WESTERN \nDIGITAL,\n and/or WD under nos.1345682, 1349235 and \n1325732 in Class 9. \n \nB. \nAn order of delivery up of all the infringing goods \nbearing the plaintiffs’ trademarks WESTERN DIGITAL,\n \nand/or WD including packaging(s), cartons, labels, stickers, \nand/or publicity material bearing the impugned trademarks for \nthe purposes of destruction/erasure. \n \nC. \nAn order for damages of Rs.1,00,01,000. \n \n9. \nAs can be seen from the above, no relief has been sought against the \napplicant. The entire case of the plaintiff is based on the infringement of the \ntrademarks of the plaintiffs by the defendant. Therefore, it cannot be said \nthat an effective decree cannot be passed in the present suit in the absence of \nthe applicant. It is not even the case of the applicant that the applicant is a \nnecessary party, as the present application seeks impleadment only on the \nbasis of the applicant being a proper party. \n10. \nIn terms of the legal position discussed above, for a person to be a \nproper party to a suit, it is to be seen whether the presence of such person \nwould enable the Court to completely, effectively and properly adjudicate \nupon the issue in the case. \n11. \nAt this stage, a reference may be made to Rule 11 of the IPR \nEnforcement Rules, the relevant portion is set out below: \n“11. Disposal of  infringing goods. –  \n \n(1) Where upon determination by the Deputy Commissioner \nof Customs or Assistant Commissioner of Customs, as the case \nmay be, it is found that the goods detained or seized have \ninfringed intellectual property rights, and have been \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.12.2022 12:11:23\nSignature Not Verified",
          "pdf_source": "1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf",
          "nodes": []
        },
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "Here is a summary of page 6 from the PDF:\n\n**Case Details:**\n\n* Case No.: CS(COMM) 835/2018\n* Application No.: I.A. 12048/2019 (O-XI R-1 of CPC)\n* Date: December 13, 2022\n\n**Legal Facts and Proceedings:**\n\n* Section 111(d) of the Customs Act, 1962 requires destruction of goods after determination by Deputy Commissioner of Customs or Assistant Commissioner of Customs.\n* Rule 11 IPR Enforcement Rules restricts applicant's jurisdiction to determine if seized goods infringe Intellectual Property Rights when legal proceedings are pending.\n\n**Arguments and Decisions:**\n\n* The Court holds that the applicant cannot determine infringement until the final adjudication of the present suit.\n* If the court finds no infringement, the determination shall be binding on the applicant, preventing destruction of goods.\n* If the court determines infringement, appropriate orders will be passed regarding the goods.\n\n**Dismissing Application:**\n\n* The application is dismissed with no merit.",
          "content": "2022/DHC/005588 \n \nCS(COMM) 835/2018                                                                                                      Page 6 of 7 \n \nconfiscated under Section 111(d) of the Customs Act, 1962 \nand no legal proceedings are pending in relation to such \ndetermination, the Deputy Commissioner of Customs or \nAssistant Commissioner of Customs, as the case may be, shall \ndestroy the goods under official supervision or dispose them \noutside the normal channels of commerce after obtaining “no \nobjection” or concurrence of the right holder or his authorized \nrepresentative. \n \n \n \n…” \n \n12. \nIn terms of the aforesaid Rule, the applicant has the jurisdiction to \ndetermine if the seized goods are infringing the Intellectual Property Rights \nof the plaintiffs, only in the event of no legal proceedings being pending in \nrelation to such determination. However, the present suit is such a legal \nproceeding in which a determination is to be made whether the goods \nimported by the defendant are infringing or not. Therefore, in terms of Rule \n11 of IPR Enforcement Rules, the applicant cannot go into the question of \ninfringement till the final adjudication of the present suit. \n13. \nIn the event, this Court comes to a finding that the defendant has not \ninfringed the trademarks of the plaintiffs, the said determination shall be \nbinding on the applicant and there cannot be any question of destruction of \nthe infringing goods.  On the other hand, if a final determination is made by \nthis Court that the goods have infringed the trademarks of the plaintiffs, \nappropriate orders shall be passed with regard to the aforesaid goods. \n14. \nIn view of the discussion above, the applicant is neither a necessary \nparty nor a proper party for the adjudication of the suit. There is no merit in \nthe present application and the same is dismissed. \n15. \nNeedless to state this is without prejudice to any other statutory \nrights/remedy of the applicant.  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.12.2022 12:11:23\nSignature Not Verified",
          "pdf_source": "1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0011",
      "start_index": 7,
      "end_index": 7,
      "summary": "This is a court decision document from the High Court of Delhi at New Delhi, dated December 13, 2022 (pdf: WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD). The case number is CS(COMM) 835/2018.\n\n**Background:** The plaintiffs are Western Digital Technologies, Inc. and another party (named), while the defendant is Syt Solutions Pvt Ltd.\n\n**Court Decision:** The court has ordered a hearing to decide on a summary judgment under Order 13A of the Code of Civil Procedure, 1908. Both parties have filed written submissions with accompanying judgments in support of their arguments.\n\n**Important Dates and Timeline:**\n\n* July 5, 2019: Court order recording plaintiff's submission to proceed with a summary judgment.\n* March 21, 2023: List for hearing scheduled.\n* December 13, 2022 (dated): The court decision is made by Justice Amit Bansal.\n\n**Key Information:**\n\n* Case type: Commercial Suit (COMM)No. CS(COMM) 835/2018\n* Application numbers: IA 12048/2019 and IA 12049/2019.\n* Specific amounts or orders are not mentioned in the summary section provided.\n\n**Summary:** The High Court of Delhi has scheduled a hearing to consider a summary judgment in the case of Western Digital Technologies vs. Syt Solutions Pvt Ltd, allowing both parties to present their written submissions and supporting judgments.",
      "pdf_source": "1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf",
      "nodes": [
        {
          "title": "Page 7",
          "node_id": "0010",
          "start_index": 7,
          "end_index": 7,
          "summary": "Unfortunately, it seems that there is no content on page 7 of the provided PDF. The last pages mentioned in the snippet are page 6 (not shown) and page 1 of 7. \n\nHowever, looking at the previous pages (page 1-6), here's a summary of the relevant legal facts:\n\n**Case Details:**\n\n* Case Number: CS(COMM) 835/2018\n* Case Type: Company Commercial Suit\n* Parties:\n\t+ Plaintiffs: Western Digital Technologies, Inc. & Anr.\n\t+ Defendant: Syt Solutions Pvt Ltd (not mentioned directly in pages 1-6)\n\n**Proceedings:**\n\n* The court fixed a date for hearing on April 23, 2019 (omitted in snippet)\n* Written submissions were filed by both parties\n* Counsel for plaintiff sought to proceed with summary judgment under Order 13A of the Code of Civil Procedure, 1908\n\n**Judgment and Decision:**\n\n* Case has been listed for hearing on March 21, 2023\n\nThe PDF is titled \"WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD\" and was uploaded as 1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf",
          "content": "2022/DHC/005588 \n \nCS(COMM) 835/2018                                                                                                      Page 7 of 7 \n \nCS(COMM) 835/2018 \n16. \nIn the order dated 5th July, 2019, the submission of the counsel for the \nplaintiff has been recorded that the present suit is a fit case for the Court to \nproceed to pass a summary judgment under Order 13A of the Code of Civil \nProcedure, 1908. \n17. \nIn terms of the aforesaid order, both sides have filed their respective \nwritten submissions along with judgments in support thereof. \n18. \nList for hearing on 21st March, 2023. \n \n \nAMIT BANSAL, J. \nDECEMBER 13, 2022 \ndk \n \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.12.2022 12:11:23\nSignature Not Verified",
          "pdf_source": "1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-16T11:51:59.926150",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}