{
  "doc_name": "10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED",
  "pdf_source": "10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf",
  "metadata": {
    "document_name": "10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED",
    "source_pdf": "10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf",
    "judges": [
      "AMIT BANSAL"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "21/2018",
      "21/2018",
      "21/2018",
      "21/2018",
      "21/2018",
      "21/2018",
      "21/2018",
      "21/2018",
      "21/2018",
      "364/2018",
      "17720/2019",
      "364/2018"
    ],
    "dhc_numbers": [
      "2022/DHC/005847",
      "2022/DHC/005847",
      "2022/DHC/005847",
      "2022/DHC/005847",
      "2022/DHC/005847",
      "2022/DHC/005847",
      "2022/DHC/005847"
    ],
    "ia_numbers": [],
    "decision_date": "21 December, 2022",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      {
        "name": "M/s RPG Enterprises Limited",
        "lawyers": [
          "Mr. Himanshu Deora",
          "Ms. Sejal Tayal",
          "Ms. Neeharika",
          "Mr. Naqeeb Nawab"
        ]
      }
    ],
    "defendants": [
      {
        "name": "RPG Developers Private Limited & Others",
        "lawyers": [
          "None"
        ]
      }
    ],
    "appellants": [],
    "respondents": [],
    "plaintiff_advocates": [
      "Mr. Himanshu Deora",
      "Ms. Sejal Tayal",
      "Ms. Neeharika",
      "Mr. Naqeeb Nawab"
    ],
    "defendant_advocates": [
      "None"
    ],
    "appellant_advocates": [],
    "respondent_advocates": [],
    "damages_claimed": "3,00,000",
    "damages_awarded": null,
    "key_issues": [
      "Here are the key legal issues from the document:",
      "Trademark infringement",
      "Passing off",
      "Well-known trademarks under the Trade Marks Act, 1999",
      "Copyright ownership and infringement",
      "Registered trademark registrations in India and foreign countries",
      "Domain name ownership and related rights",
      "Association with associated/joint venture/group company claims",
      "Misrepresentation to the public through trade names and marks",
      "Unfair competition law"
    ],
    "decision_summary": "**Background**\n\nThe case CS(COMM) 21/2018 was filed by M/s RPG Enterprises Limited (the plaintiff) against RPG Developers Private Limited and others (the defendants). The plaintiff is a leading Indian industrial conglomerate with diverse businesses in infrastructure, tyres, technology, and speciality. The company has been using the \"RPG\" word mark since 1979 and claims to have acquired the status of well-known trademarks within the meaning of Section 2(1)(zg) of the Trade Marks Act, 1999.\n\n**Legal Issues**\n\nThe plaintiff alleged that the defendants were infringing their trademarks and copyrights by using the \"RPG\" mark, passing off their goods as those of the plaintiff, and misrepresenting themselves to be associated with the plaintiff. The plaintiff claimed that they had been using the \"RPG\" marks since 1979 and had registered them in various foreign countries.\n\n**Arguments**\n\nThe plaintiff argued that the defendants' use of the \"RPG\" mark was an infringement of their trademarks and copyrights, as it created confusion among the public about the origin and quality of goods being sold. The plaintiff also claimed that they had issued cease and desist notices to the defendants in 2017, which were ignored.\n\n**Court Findings**\n\nThe Court, through its order dated 10th January, 2018, granted an ex parte ad interim injunction in favour of the plaintiff under I.A. 364/2018. The court restrained the defendants from using the mark \"RPG\".\n\n**Decision**\n\nBased on the arguments and evidence presented by the plaintiff, the Court held that the defendants were guilty of infringing the plaintiff's trademarks and copyrights. The Court found that the defendants' use of the \"RPG\" mark was a clear case of passing off, which would cause confusion among the public about the origin and quality of goods being sold.\n\nThe Court also observed that the defendants had ignored cease and desist notices issued by the plaintiff in 2017, indicating their intent to continue infringing on the plaintiff's rights.\n\n**Consequence**\n\nAs a result of the decision, the Court ordered the defendants to:\n\n1. Infringe or threatened infringement of the trade marks registered in favour of the plaintiffs.\n2. Any further interference with the plaintiffs' business.\n3. Recall and destroy all infringing goods and promotional materials.\n4. Give an undertaking not to use the mark \"RPG\" without the plaintiff's permission in future.\n\n**Other Notable Points**\n\n* The Court noted that the trademark registrations of the plaintiff's \"RPG\" marks were also valid in various foreign countries, as provided in paragraph 6 of the plaint.\n* The plaintiff was recognized by the court to be the proprietor of well-known trademarks under Section 2(1)(zg) of the Trade Marks Act, 1999.\n\nThis conclusion highlights that trade mark rights must be respected and not exploited as shown in this case.",
    "legal_precedents": [
      "Enterprises Limited Riju Ghoshal"
    ],
    "full_text": "\n--- PAGE 1 ---\n                                  2022/DHC/005847 \nCS(COMM) 21/2018                                                                                                                                          Page 1 of 7 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n% \n \n \n \n                 Date of decision: 21st December, 2022 \n \n+  \nCS(COMM) 21/2018 & I.A. 364/2018 (O-XXXIX R-1 & 2 of \nCPC), I.A. 17720/2019 (O-V R-20 (1A)) \n \n \nM/S RPG ENTERPRISES LIMITED  \n \n..... Plaintiff \nThrough: \nMr. Himanshu Deora with Ms. Sejal \nTayal, \nMs. \nNeeharika \nand \nMr. \nNaqeeb Nawab, Advocates. \n \n \n \n \n \nversus \n \n \nRPG DEVELOPERS PRIVATE LIMITED  \n& OTHERS  \n \n \n \n \n \n..... Defendants \n \n \n \n \nThrough: \nNone. \n \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \n \n \n \n \nJUDGMENT \nAMIT BANSAL, J. (Oral) \nCS(COMM) 21/2018 \n1. \nThe present suit has been filed seeking relief of permanent injunction \nrestraining the defendants from infringing the trademarks and copyrights of \nthe plaintiff, passing off their goods as that of the plaintiff‟s and other \nancillary reliefs. \nPLEADINGS IN THE PLAINT \n2. \nThe case set up by the plaintiff in the plaint is as follows: \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:24.12.2022 18:20:37\nSignature Not Verified\n\n--- PAGE 2 ---\n                                  2022/DHC/005847 \nCS(COMM) 21/2018                                                                                                                                          Page 2 of 7 \n \n2.1 \nThe plaintiff, M/s RPG Enterprises Limited is an Indian industrial \nconglomerate comprising of over twenty companies in the area of \ninfrastructure, tyres, technology and speciality.  \n2.2 \nThe plaintiff has been has been using the „RPG‟ word mark since \n1979. \n2.3 \nThe plaintiff is the proprietor of the registered trademark „RPG‟, \n, \n  and other related marks in Classes 5, \n9, 12, 16 and 30 of the Trade Marks Act, 1999. The said marks have come to \nbe exclusively associated with the plaintiff. Details of the trademark \nregistrations of the plaintiff‟s „RPG‟ marks have been tabulated in paragraph \n5 of the plaint. \n2.4 \nThe said marks of the plaintiff are also registered by the plaintiff in \nvarious foreign countries, details of which have been provided in paragraph \n6 of the plaint. \n2.5 \nThe plaintiff‟s „RPG‟ marks have acquired the status of well-known \ntrademarks within the meaning of Section 2(1)(zg) of the Trade Marks Act, \n1999, which fact is recognised in the judgment of RPG Enterprises Limited \nv. Riju Ghoshal and Another, (2022) 90 PTC 312. \n2.6 \nThe plaintiff is also the registered copyright owner of the RPG \nEnterprises Logo (Label) in India and has been using the same since 1987. \nThe aforesaid label was granted registration on 30th June, 1988. The plaintiff \nalso owns the domain names „www.rpggroup.com‟ and „www.rpg.in‟.  \n2.7 \nThe defendant no. 1, M/s RPG Developers is a company engaged in \nthe selling and renting of properties in various parts of India. The defendant \nno. 2, Mr. Rampal Goswami, is the director of the defendant company.  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:24.12.2022 18:20:37\nSignature Not Verified\n\n--- PAGE 3 ---\n                                  2022/DHC/005847 \nCS(COMM) 21/2018                                                                                                                                          Page 3 of 7 \n \n2.8 \nSometime in August, 2017, the plaintiff came across the infringing \nactivities of the defendants. The defendants are deliberately using the trade \nname „M/s RPG Developers‟ with an intent to misrepresent to the public that \nthe defendants are associated with the plaintiff as an associate/joint \nventure/group company. The defendants have adopted the „RPG‟ mark and \nare using the mark \n. \n2.9 \nThe defendants‟ website mentions various projects using the word \nmark „RPG‟ titled as „RPG Sathya Nagar,‟ „RPG Metro City,‟ „RPG Vel \nNagar,‟ „RPG Global City,‟ „RPG Metro City,‟ „RPG Swarna Boomi,‟ „RPG \nAravindar City‟ and „RPG Rokkisha Bhoomi.‟  \n2.10 Plaintiff issued cease and desist notices dated 10th August, 2017 to the \ndefendants, inter alia, calling upon the defendants to stop selling/offering for \nsale their projects under the mark „RPG‟, recall their finished infringing \ngoods/promotional materials and give an undertaking to the effect that they \nshall not infringe the marks of the plaintiff in the future. However, despite \nservice, no reply to the said letters has been received by the plaintiff.  \n3. \nAccordingly, the plaintiff filed the present suit seeking to restrain the \ndefendants from carrying on their infringing activities.  \nPROCEEDINGS IN THE SUIT \n4. \nThis Court, vide order dated 10th January, 2018 granted an ex parte ad \ninterim injunction in favour of the plaintiff under I.A. 364/2018, retraining \nthe defendants from using the mark „RPG‟. The relevant portion of the said \norder is as under: \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:24.12.2022 18:20:37\nSignature Not Verified\n\n--- PAGE 4 ---\n                                  2022/DHC/005847 \nCS(COMM) 21/2018                                                                                                                                          Page 4 of 7 \n \n“Keeping in view the aforesaid, this Court is of the \nopinion that a prima facie case of infringement and passing off is \nmade out in favour of the plaintiff and balance of convenience is \nalso in its favour. Further, irreparable harm or injury would be \ncaused to the plaintiff if an interim injunction order is not \npassed.  \nConsequently, till further orders, the defendants, \ndirectors/proprietors/partners, their principals, employees, \nagents, distributors, franchisees, representatives and assigns \nare restrained from giving any services, in any manner \nwhatsoever and/or using the registered trademark RPG and/or \nRPG Developers and/or artistic work which is a colourable \nimitation of the plaintiff‟s artistic work or any other \ntrademark/artistic work confusingly similar to the registered \ntrade mark/copyright of the plaintiff.” \n5. \nThe matter was thereafter placed before the Joint Registrar for \neffecting service and completion of pleadings. \n6. \nEven though the defendant no.4 was served through ordinary mode on \n17th February, 2018, none appeared for the defendant no.4 on 16th March, \n2018, 9th May, 2018 and 15th May, 2018. Further, no written statement was \nfiled on behalf of the defendant no.4. Consequently, the defendant no.4 was \nproceeded against ex parte on 15th May, 2018. \n7. \nFresh service of summons was directed for the defendants no.1 to 3 \nand 5 on 3rd March, 2020 and 22nd September, 2021  \n8. \nOn 12th January, 2022, the counsel for the plaintiff submitted that all \nthe defendants, with the exception of the defendant no.4, have been duly \nserved and that an affidavit of service has also been filed in this regard. \n9. \nThereafter, vide order dated 6th July, 2022 passed by the Joint \nRegistrar, the defendants no.1 to 3 and 5 were deemed to be served on the \nbasis of the affidavit of service filed on behalf of the plaintiff.  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:24.12.2022 18:20:37\nSignature Not Verified\n\n--- PAGE 5 ---\n                                  2022/DHC/005847 \nCS(COMM) 21/2018                                                                                                                                          Page 5 of 7 \n \n10. \nOn 6th December, 2022, the Joint Registrar closed the right of the \ndefendants no.1 to 3 and 5 to file written statement and the matter was \nplaced before the Court.  \n11. \nIn view of the above, the counsel for the plaintiff prays for a decree of \npermanent injunction and damages along with costs in the suit. \nANALYSIS AND FINDINGS \n12. \nI have heard the counsel for the plaintiff and perused the record of the \ncase. \n13. \nAt the outset, it may be relevant to note that the defendants no.1 to 3 \nand 5 has been served through speed post, courier and email. Despite this, \nthe defendants no.1 to 3 and 5 have chosen not to enter appearance. The \ndefendant no.4 has also been proceeded against ex parte on 15th May, 2018. \nAmple opportunity has been given to the defendants to appear before the \nCourt and defend the case. \n14. \nSince the defendants have failed to enter appearance or even take any \nsteps requisite to contest the present suit, despite having suffered an ad \ninterim injunction order, it is evident that they have no defence to put forth \non merits.  \n15. \nAt this stage, it may be relevant to note the comparison between the \nmarks of the plaintiff and the defendants, which is as under: \nPLAINTIFF’S MARK \nDEFENDANTS’ MARK \n \n \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:24.12.2022 18:20:37\nSignature Not Verified\n\n--- PAGE 6 ---\n                                  2022/DHC/005847 \nCS(COMM) 21/2018                                                                                                                                          Page 6 of 7 \n \n16. \nFrom a perusal of the competing marks above, this Court is of the \nview that the defendants‟ use of the „RPG‟ marks is nothing but an attempt \nto ride on the goodwill and reputation of the plaintiff‟s well-known \ntrademarks. This is further evidenced from the prominent use of the marks \n„RPG‟/ \n \non \nthe \ndefendants‟ \nwebsite \n“www.rpgdevelopers.in”, screenshots of which have been annexed at pages \n45 to 47 of the documents filed along with the plaint. \n17. \nBased on the averments in the plaint and the discussion above, this \nCourt is of the view that this is a fit case for granting relief of permanent \ninjunction. The defendants are restrained from offering/rendering any \nservices using the impugned trademark „RPG‟ and/or „RPG DEVELOPERS‟ \nand/or artistic work which is a colourable imitation of the plaintiff‟s artistic \nwork or any other trademark/artistic work deceptively similar to the „RPG‟ \nmarks of the plaintiff. \n18. \nAccordingly, the present suit is decreed in terms of prayer clauses „a.‟, \n„b.‟ and „c.‟ of the plaint.  \n19. \nAt this stage, counsel for the plaintiff does not press for the reliefs \ncontemplated in prayer clauses „d.‟ and „e.‟ of the plaint. \n20. \nInsofar as the relief of damages as sought in prayer clause „f.‟ is \nconcerned, the defendants are trading under the name „M/s RPG \nDEVELOPERS‟ in order to dupe the general public into believing that the \ndefendants are a subsidiary/group company/joint venture of the plaintiff, \nwhich is a reputed industrial conglomerate in the business of infrastructure. \nProjects of the defendants are being listed on their website using the „RPG‟ \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:24.12.2022 18:20:37\nSignature Not Verified\n\n--- PAGE 7 ---\n                                  2022/DHC/005847 \nCS(COMM) 21/2018                                                                                                                                          Page 7 of 7 \n \nmark of the plaintiff. The defendants have also failed to respond to the legal \nnotices dated 10th August, 2017 sent to them on behalf of the plaintiff, \nrequiring them to cease and desist from their use of the „RPG‟ mark of the \nplaintiff. Moreover, the defendants have also chosen to stay away from the \npresent proceedings, despite service. \n21. \nIn view of the foregoing facts and circumstances, this Court is of the \nview that this is not a case of innocent adoption. The Court cannot ignore \nsuch flagrant misuse of the plaintiff‟s marks by the defendants. Therefore, \nconsidering the dishonest conduct of the defendant, the suit is decreed in \nfavour of the plaintiff for Rs.3,00,000/- as damages. Additionally, \nRs.3,00,000/- is awarded to the plaintiff as costs to be paid by the \ndefendants. \n22. \nThe defendants shall pay the said amount to the plaintiff within eight \nweeks, failing which the plaintiff is permitted to commence execution \nproceedings against the defendants. \n23. \nAll pending applications are disposed of. \n24. \nDecree sheet be drawn up. \n \n \nAMIT BANSAL, J. \nDECEMBER 21, 2022 \nat \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:24.12.2022 18:20:37\nSignature Not Verified\n"
  },
  "total_pages": 7,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "**Case Summary**\n\n**Case Details**\n\n* Case Number: 2022/DHC/005847\n* Court: High Court of Delhi at New Delhi\n* Date of Decision: December 21st, 2022\n\n**Parties**\n\n* Plaintiff: RPG Enterprises Limited (Indian industrial conglomerate)\n\t+ Representation: Mr. Himanshu Deora and others\n* Defendants:\n\t1. RPG Developers Private Limited\n\t2. Mr. Rampal Goswami (director of Defendant 1)\n\n**Nature of Suit**\n\n* The plaintiff seeks a permanent injunction to restrain the defendants from infringing their trademarks, copyrights, and passing off goods as those of the plaintiff.\n\n**Facts and Arguments**\n\n* The plaintiff has used the „RPG‟ word mark since 1979 and is registered in various classes under the Trade Marks Act, 1999.\n* The marks have become well-known and are recognized as such in a previous judgment.\n* The plaintiff also owns copyrights to their RPG Enterprises Logo (Label) in India and domain names „www.rpggroup.com‟ and „www.rpg.in‟.\n\n**Decisions**\n\n* As per the summary, there is no specific decision mentioned in this section of the document. However, the judgment likely concerns granting or denying relief to the plaintiff based on their arguments.\n\n**PDF Source**\n\n10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf",
      "pdf_source": "10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "Here is a summary of page 1 from the provided PDF:\n\n**Case Details**\n\n* Court: High Court of Delhi at New Delhi\n* Case Number: CS(COMM) 21/2018\n* Date of Decision: December 21, 2022\n* Citation: 2022/DHC/005847\n\n**Parties**\n\n* Plaintiff: M/S RPG Enterprises Limited (represented by Mr. Himanshu Deora and others)\n* Defendants: RPG Developers Private Limited and others\n\n**Suit**\n\n* The plaintiff has filed a suit seeking relief of permanent injunction to restrain the defendants from infringing their trademarks and copyrights, passing off goods as their own, and other ancillary reliefs.\n\n**Proceedings**\n\n* None of the defendants have appeared in the case.\n* The court has been notified by Mr. Amit Bansal, J (Oral).\n\nThe PDF source is: 10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf",
          "content": "2022/DHC/005847 \nCS(COMM) 21/2018                                                                                                                                          Page 1 of 7 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n% \n \n \n \n                 Date of decision: 21st December, 2022 \n \n+  \nCS(COMM) 21/2018 & I.A. 364/2018 (O-XXXIX R-1 & 2 of \nCPC), I.A. 17720/2019 (O-V R-20 (1A)) \n \n \nM/S RPG ENTERPRISES LIMITED  \n \n..... Plaintiff \nThrough: \nMr. Himanshu Deora with Ms. Sejal \nTayal, \nMs. \nNeeharika \nand \nMr. \nNaqeeb Nawab, Advocates. \n \n \n \n \n \nversus \n \n \nRPG DEVELOPERS PRIVATE LIMITED  \n& OTHERS  \n \n \n \n \n \n..... Defendants \n \n \n \n \nThrough: \nNone. \n \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \n \n \n \n \nJUDGMENT \nAMIT BANSAL, J. (Oral) \nCS(COMM) 21/2018 \n1. \nThe present suit has been filed seeking relief of permanent injunction \nrestraining the defendants from infringing the trademarks and copyrights of \nthe plaintiff, passing off their goods as that of the plaintiff‟s and other \nancillary reliefs. \nPLEADINGS IN THE PLAINT \n2. \nThe case set up by the plaintiff in the plaint is as follows: \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:24.12.2022 18:20:37\nSignature Not Verified",
          "pdf_source": "10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "Here is a summary of page 2 from PDF: \"10. RPG Enterprises Limited vs. RPG Developers Private Limited\" (2022/DHC/005847):\n\nThe plaintiff, M/s RPG Enterprises Limited, an Indian industrial conglomerate with diverse business interests, has been using the mark \"RPG\" since 1979 and is now a well-known trademark in India. The company owns several registered trademarks (in Classes 5, 9, 12, 16, and 30) and related marks, as tabulated in paragraph 5 of the plaint.\n\nThe plaintiff also has foreign trademark registrations and is the registered copyright owner of its Logo (Label) since 1988. It further owns the domain names \"www.rpggroup.com\" and \"www.rpg.in\".\n\nThe defendant companies involved are RPG Developers Private Limited and Mr. Rampal Goswami, who claims to be using a similar mark and logo, leading to infringement.\n\nKey points:\n\n* Plaintiff: M/s RPG Enterprises Limited\n* Defendant: RPG Developers Private Limited and Mr. Rampal Goswami\n* Trademark registration date: 1979 (in India), with foreign registrations also\n* Domain names: \"www.rpggroup.com\" and \"www.rpg.in\"\n\nSource:\n\"10. RPG Enterprises Limited vs. RPG Developers Private Limited.pdf\"",
          "content": "2022/DHC/005847 \nCS(COMM) 21/2018                                                                                                                                          Page 2 of 7 \n \n2.1 \nThe plaintiff, M/s RPG Enterprises Limited is an Indian industrial \nconglomerate comprising of over twenty companies in the area of \ninfrastructure, tyres, technology and speciality.  \n2.2 \nThe plaintiff has been has been using the „RPG‟ word mark since \n1979. \n2.3 \nThe plaintiff is the proprietor of the registered trademark „RPG‟, \n, \n  and other related marks in Classes 5, \n9, 12, 16 and 30 of the Trade Marks Act, 1999. The said marks have come to \nbe exclusively associated with the plaintiff. Details of the trademark \nregistrations of the plaintiff‟s „RPG‟ marks have been tabulated in paragraph \n5 of the plaint. \n2.4 \nThe said marks of the plaintiff are also registered by the plaintiff in \nvarious foreign countries, details of which have been provided in paragraph \n6 of the plaint. \n2.5 \nThe plaintiff‟s „RPG‟ marks have acquired the status of well-known \ntrademarks within the meaning of Section 2(1)(zg) of the Trade Marks Act, \n1999, which fact is recognised in the judgment of RPG Enterprises Limited \nv. Riju Ghoshal and Another, (2022) 90 PTC 312. \n2.6 \nThe plaintiff is also the registered copyright owner of the RPG \nEnterprises Logo (Label) in India and has been using the same since 1987. \nThe aforesaid label was granted registration on 30th June, 1988. The plaintiff \nalso owns the domain names „www.rpggroup.com‟ and „www.rpg.in‟.  \n2.7 \nThe defendant no. 1, M/s RPG Developers is a company engaged in \nthe selling and renting of properties in various parts of India. The defendant \nno. 2, Mr. Rampal Goswami, is the director of the defendant company.  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:24.12.2022 18:20:37\nSignature Not Verified",
          "pdf_source": "10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0005",
      "start_index": 3,
      "end_index": 3,
      "summary": "Here's a summary of the Background and Facts section from the PDF:\n\n**Case Details**\n\n* Case Number: CS(COMM) 21/2018\n* Date of Decision: 21st December, 2022\n* Court: High Court of Delhi at New Delhi\n\n**Parties Involved**\n\n* Plaintiff: M/S RPG Enterprises Limited (through: Mr...)\n* Defendant: RPG Developers Private Limited\n\n**Background and Facts**\n\n* The plaintiff alleges that the defendants are using its trade name \"M/s RPG Developers\" to misrepresent an association with the plaintiff as a joint venture or group company.\n* The defendants have adopted the mark  and used it in various project titles, including „RPG Sathya Nagar‟, „RPG Metro City‟, etc.\n* The plaintiff issued cease and desist notices on August 10, 2017, asking the defendants to stop using the mark „RPG‟. However, no reply was received from the defendants.\n* Despite this, the defendants continued with their infringing activities, prompting the plaintiff to file a suit seeking a permanent injunction.\n\n**Proceedings**\n\n* The court granted an ex parte ad interim injunction on January 10, 2018, restraining the defendants from using the mark „RPG‟.\n\nThe PDF source is: \"`RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf`\"",
      "pdf_source": "10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "Here is a summary of page 3 from the PDF: 10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf\n\n**Court Proceedings**\n\nThe Plaintiff (RPG Enterprises Limited) filed the present suit against the Defendants (RPG Developers Private Limited) to restrain them from carrying on their infringing activities.\n\n**Previous Court Orders**\n\n* On August 10, 2017, the plaintiff issued cease and desist notices to the defendants, calling upon them to stop using the mark \"RPG\" and recall finished goods/promotional materials.\n* No reply was received by the plaintiff despite service of the notices.\n* On January 10, 2018, this Court granted an ex parte ad interim injunction in favor of the plaintiff, restraining the defendants from using the mark \"RPG\".\n\n**Current Suit**\n\nThe plaintiff seeks to restrain the defendants from continuing their infringing activities.\n\nSource: 10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf (2022/DHC/005847)",
          "content": "2022/DHC/005847 \nCS(COMM) 21/2018                                                                                                                                          Page 3 of 7 \n \n2.8 \nSometime in August, 2017, the plaintiff came across the infringing \nactivities of the defendants. The defendants are deliberately using the trade \nname „M/s RPG Developers‟ with an intent to misrepresent to the public that \nthe defendants are associated with the plaintiff as an associate/joint \nventure/group company. The defendants have adopted the „RPG‟ mark and \nare using the mark \n. \n2.9 \nThe defendants‟ website mentions various projects using the word \nmark „RPG‟ titled as „RPG Sathya Nagar,‟ „RPG Metro City,‟ „RPG Vel \nNagar,‟ „RPG Global City,‟ „RPG Metro City,‟ „RPG Swarna Boomi,‟ „RPG \nAravindar City‟ and „RPG Rokkisha Bhoomi.‟  \n2.10 Plaintiff issued cease and desist notices dated 10th August, 2017 to the \ndefendants, inter alia, calling upon the defendants to stop selling/offering for \nsale their projects under the mark „RPG‟, recall their finished infringing \ngoods/promotional materials and give an undertaking to the effect that they \nshall not infringe the marks of the plaintiff in the future. However, despite \nservice, no reply to the said letters has been received by the plaintiff.  \n3. \nAccordingly, the plaintiff filed the present suit seeking to restrain the \ndefendants from carrying on their infringing activities.  \nPROCEEDINGS IN THE SUIT \n4. \nThis Court, vide order dated 10th January, 2018 granted an ex parte ad \ninterim injunction in favour of the plaintiff under I.A. 364/2018, retraining \nthe defendants from using the mark „RPG‟. The relevant portion of the said \norder is as under: \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:24.12.2022 18:20:37\nSignature Not Verified",
          "pdf_source": "10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0009",
      "start_index": 4,
      "end_index": 6,
      "summary": "Here is a summary of the legal document section from PDF \"10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf\":\n\n**Court Case Details:**\n\n* Case Number: CS(COMM) 21/2018\n* Date of Decision: December 21, 2022\n* PDF Source: 10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf\n\n**Parties Involved:**\n\n* Plaintiff: M/S RPG Enterprises Limited\n* Defendants:\n\t+ Defendant No.1-3 and 5 (served through speed post, courier, and email)\n\t+ Defendant No.4 (proceeded against ex parte on May 15, 2018)\n\n**Summary of Proceedings:**\n\n* The plaintiff sought an interlocutory order of injunction to restrain the defendants from using their registered trademark \"RPG\" and artistic work.\n* The court granted the interlocutory order on December 21, 2022, holding that a prima facie case of infringement and passing off was established in favor of the plaintiff.\n* The defendants were restrained from giving services under the trademark \"RPG\" or any similar mark that may cause confusion.\n* The matter was placed before the Joint Registrar for service and completion of pleadings. However, none of the defendants appeared despite being served.\n* On January 12, 2022, the counsel for the plaintiff submitted that all the defendants were duly served, except Defendant No.4.\n* The court deemed Defendants No.1-3 and 5 to be served on July 6, 2022, based on an affidavit of service filed by the plaintiff.\n* On December 6, 2022, the Joint Registrar closed the right of the defendants to file a written statement.\n\n**Next Steps:**\n\n* The counsel for the plaintiff has prayed for a decree of permanent injunction and damages along with costs in the suit.",
      "pdf_source": "10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf",
      "nodes": [
        {
          "title": "Page 4",
          "node_id": "0006",
          "start_index": 4,
          "end_index": 4,
          "summary": "Here is a summary of page 4 from the provided PDF:\n\nAccording to Order CS(COMM) 21/2018 dated 21st December, 2022 (PDF: 10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf), the court passes an interim injunction order in favor of the plaintiff, M/S RPG Enterprises Limited.\n\nKey points from page 4:\n\n* The court holds that a prima facie case of infringement and passing off is made out for the plaintiff.\n* Balance of convenience and irreparable harm or injury to the plaintiff justify the interim injunction.\n* Defendants, directors/partners/employees, agents, distributors, franchisees, representatives, and assigns are restrained from:\n\t+ Providing any services\n\t+ Using trademarks RPG and/or RPG Developers\n\t+ Using artistic works similar to the plaintiff's\n\nImportant dates:\n\n* 16th March, 2018: Defendant no.4 fails to appear.\n* 5th September, 2022: Defendants no.1-3 and 5 were deemed served (Order by Joint Registrar).\n* 21st December, 2022: Order passed in favor of the plaintiff.\n\nSource: PDF: 10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf",
          "content": "2022/DHC/005847 \nCS(COMM) 21/2018                                                                                                                                          Page 4 of 7 \n \n“Keeping in view the aforesaid, this Court is of the \nopinion that a prima facie case of infringement and passing off is \nmade out in favour of the plaintiff and balance of convenience is \nalso in its favour. Further, irreparable harm or injury would be \ncaused to the plaintiff if an interim injunction order is not \npassed.  \nConsequently, till further orders, the defendants, \ndirectors/proprietors/partners, their principals, employees, \nagents, distributors, franchisees, representatives and assigns \nare restrained from giving any services, in any manner \nwhatsoever and/or using the registered trademark RPG and/or \nRPG Developers and/or artistic work which is a colourable \nimitation of the plaintiff‟s artistic work or any other \ntrademark/artistic work confusingly similar to the registered \ntrade mark/copyright of the plaintiff.” \n5. \nThe matter was thereafter placed before the Joint Registrar for \neffecting service and completion of pleadings. \n6. \nEven though the defendant no.4 was served through ordinary mode on \n17th February, 2018, none appeared for the defendant no.4 on 16th March, \n2018, 9th May, 2018 and 15th May, 2018. Further, no written statement was \nfiled on behalf of the defendant no.4. Consequently, the defendant no.4 was \nproceeded against ex parte on 15th May, 2018. \n7. \nFresh service of summons was directed for the defendants no.1 to 3 \nand 5 on 3rd March, 2020 and 22nd September, 2021  \n8. \nOn 12th January, 2022, the counsel for the plaintiff submitted that all \nthe defendants, with the exception of the defendant no.4, have been duly \nserved and that an affidavit of service has also been filed in this regard. \n9. \nThereafter, vide order dated 6th July, 2022 passed by the Joint \nRegistrar, the defendants no.1 to 3 and 5 were deemed to be served on the \nbasis of the affidavit of service filed on behalf of the plaintiff.  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:24.12.2022 18:20:37\nSignature Not Verified",
          "pdf_source": "10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf",
          "nodes": []
        },
        {
          "title": "Page 5",
          "node_id": "0007",
          "start_index": 5,
          "end_index": 5,
          "summary": "Summary of Page 5 from PDF:\n\nSource: 10. RPG Enterprises Limited vs. RPG Developers Private Limited.pdf (2022/DHC/005847)\n\n**Case Proceedings**\n\n* Defendants nos. 1-3 and 5 were served through speed post, courier, and email.\n* Despite service, they failed to enter an appearance or take any steps to defend the case.\n* Defendant no. 4 had been proceeded against ex parte on May 15, 2018.\n\n**Analysis by the Court**\n\n* The court notes that the defendants have failed to appear despite being served and having suffered an interim injunction order.\n* This suggests they have no defense to offer in the case.\n* A comparison of the plaintiff's mark with the defendants' marks is made (but not provided in this summary).\n\n**Key Names and Dates**\n\n* RPG Enterprises Limited (Plaintiff)\n* RPG Developers Private Limited (Defendant)\n* Date of decision: December 21, 2022\n\nNote: The above summary only includes information from page 5 of the PDF.",
          "content": "2022/DHC/005847 \nCS(COMM) 21/2018                                                                                                                                          Page 5 of 7 \n \n10. \nOn 6th December, 2022, the Joint Registrar closed the right of the \ndefendants no.1 to 3 and 5 to file written statement and the matter was \nplaced before the Court.  \n11. \nIn view of the above, the counsel for the plaintiff prays for a decree of \npermanent injunction and damages along with costs in the suit. \nANALYSIS AND FINDINGS \n12. \nI have heard the counsel for the plaintiff and perused the record of the \ncase. \n13. \nAt the outset, it may be relevant to note that the defendants no.1 to 3 \nand 5 has been served through speed post, courier and email. Despite this, \nthe defendants no.1 to 3 and 5 have chosen not to enter appearance. The \ndefendant no.4 has also been proceeded against ex parte on 15th May, 2018. \nAmple opportunity has been given to the defendants to appear before the \nCourt and defend the case. \n14. \nSince the defendants have failed to enter appearance or even take any \nsteps requisite to contest the present suit, despite having suffered an ad \ninterim injunction order, it is evident that they have no defence to put forth \non merits.  \n15. \nAt this stage, it may be relevant to note the comparison between the \nmarks of the plaintiff and the defendants, which is as under: \nPLAINTIFF’S MARK \nDEFENDANTS’ MARK \n \n \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:24.12.2022 18:20:37\nSignature Not Verified",
          "pdf_source": "10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf",
          "nodes": []
        },
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "Here is a summary of page 6 from the PDF document \"RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf\" (2022/DHC/005847):\n\nThis court has been presented with several marks, including:\n\n* Plaintiff's mark: „RPG‟\n* Defendant's mark: „RPG‟ and/or „RPG DEVELOPERS‟\n\nThe court notes that the defendant's use of the \"RPG\" mark is an attempt to ride on the goodwill and reputation of the plaintiff's well-known trademarks. The defendant's prominent use of the marks on their website \"www.rpgdevelopers.in\" shows this intention.\n\nBased on these findings, the court grants a permanent injunction against the defendants from:\n\n* Offering/rendering services using the impugned trademark „RPG‟ and/or „RPG DEVELOPERS‟\n* Using artistic work deceptively similar to the plaintiff's \"RPG\" marks\n\nThis decree is effective as per prayer clauses „a.‟, „b.‟, and „c.‟ of the plaint.\n\nSource: PDF document \"RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf\" (2022/DHC/005847)",
          "content": "2022/DHC/005847 \nCS(COMM) 21/2018                                                                                                                                          Page 6 of 7 \n \n16. \nFrom a perusal of the competing marks above, this Court is of the \nview that the defendants‟ use of the „RPG‟ marks is nothing but an attempt \nto ride on the goodwill and reputation of the plaintiff‟s well-known \ntrademarks. This is further evidenced from the prominent use of the marks \n„RPG‟/ \n \non \nthe \ndefendants‟ \nwebsite \n“www.rpgdevelopers.in”, screenshots of which have been annexed at pages \n45 to 47 of the documents filed along with the plaint. \n17. \nBased on the averments in the plaint and the discussion above, this \nCourt is of the view that this is a fit case for granting relief of permanent \ninjunction. The defendants are restrained from offering/rendering any \nservices using the impugned trademark „RPG‟ and/or „RPG DEVELOPERS‟ \nand/or artistic work which is a colourable imitation of the plaintiff‟s artistic \nwork or any other trademark/artistic work deceptively similar to the „RPG‟ \nmarks of the plaintiff. \n18. \nAccordingly, the present suit is decreed in terms of prayer clauses „a.‟, \n„b.‟ and „c.‟ of the plaint.  \n19. \nAt this stage, counsel for the plaintiff does not press for the reliefs \ncontemplated in prayer clauses „d.‟ and „e.‟ of the plaint. \n20. \nInsofar as the relief of damages as sought in prayer clause „f.‟ is \nconcerned, the defendants are trading under the name „M/s RPG \nDEVELOPERS‟ in order to dupe the general public into believing that the \ndefendants are a subsidiary/group company/joint venture of the plaintiff, \nwhich is a reputed industrial conglomerate in the business of infrastructure. \nProjects of the defendants are being listed on their website using the „RPG‟ \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:24.12.2022 18:20:37\nSignature Not Verified",
          "pdf_source": "10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0011",
      "start_index": 7,
      "end_index": 7,
      "summary": "**Source:** RPG Enterprises Limited vs. RPG Developers Private Limited (PDF: 10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf)\n\n**Court Decision:**\n\nIn this case, the High Court of Delhi at New Delhi delivered a judgment on December 21, 2022, in favor of M/S RPG Enterprises Limited against RPG Developers Private Limited.\n\n**Background:**\n\nThe plaintiff (RPG Enterprises) alleged that the defendants (RPG Developers) had misused their registered trademark \"RPG\" by using it in its business. The plaintiff claimed damages and sought to stop the defendants from using their mark.\n\n**Court Ruling:**\n\n1. The court found that the defendants' use of the \"RPG\" mark was a \"**flagrant misuse**\" and not an innocent adoption.\n2. Considering the defendants' dishonest conduct, the court decreed the suit in favor of the plaintiff for:\n\t* Rs. 3,00,000/- as damages\n\t* Rs. 3,00,000/- as costs to be paid by the defendants\n3. The court directed the defendants to pay the amount within eight weeks.\n4. If the defendants fail to comply, the plaintiff may commence execution proceedings.\n\n**Parties and Dates:**\n\n* **Plaintiff:** M/S RPG Enterprises Limited\n* **Defendants:** RPG Developers Private Limited\n* **Date of decision:** December 21, 2022\n* **Additional judge's signature date:** December 24, 2022",
      "pdf_source": "10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf",
      "nodes": [
        {
          "title": "Page 7",
          "node_id": "0010",
          "start_index": 7,
          "end_index": 7,
          "summary": "Source: RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED (2022/DHC/005847) - PDF (page 7 of 7)\n\n**Key Legal Facts and Decisions**\n\n* The Court decrees the suit in favor of the Plaintiff, RPG Enterprises Limited, for damages.\n* The Defendants, RPG Developers Private Limited, have misused the \"RPG\" mark and failed to respond to legal notices (August 10, 2017).\n* The Court finds this is a case of dishonest conduct, not innocent adoption.\n* Damages: Rs.3,00,000/- awarded to Plaintiff as damages.\n* Costs: Another Rs.3,00,000/- awarded to Plaintiff to be paid by Defendants as costs.\n\n**Proceedings and Decisions**\n\n* Justice Amit Bansal delivered the judgment on December 21, 2022 (Digitally signed on December 24, 2022).\n* The Court gives the Defendants eight weeks to pay the damages and costs.\n* Failing payment, Plaintiff is permitted to commence execution proceedings against Defendants.\n\nNote: The PDF source contains a summary of the court's decision, including key legal facts and proceedings.",
          "content": "2022/DHC/005847 \nCS(COMM) 21/2018                                                                                                                                          Page 7 of 7 \n \nmark of the plaintiff. The defendants have also failed to respond to the legal \nnotices dated 10th August, 2017 sent to them on behalf of the plaintiff, \nrequiring them to cease and desist from their use of the „RPG‟ mark of the \nplaintiff. Moreover, the defendants have also chosen to stay away from the \npresent proceedings, despite service. \n21. \nIn view of the foregoing facts and circumstances, this Court is of the \nview that this is not a case of innocent adoption. The Court cannot ignore \nsuch flagrant misuse of the plaintiff‟s marks by the defendants. Therefore, \nconsidering the dishonest conduct of the defendant, the suit is decreed in \nfavour of the plaintiff for Rs.3,00,000/- as damages. Additionally, \nRs.3,00,000/- is awarded to the plaintiff as costs to be paid by the \ndefendants. \n22. \nThe defendants shall pay the said amount to the plaintiff within eight \nweeks, failing which the plaintiff is permitted to commence execution \nproceedings against the defendants. \n23. \nAll pending applications are disposed of. \n24. \nDecree sheet be drawn up. \n \n \nAMIT BANSAL, J. \nDECEMBER 21, 2022 \nat \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:24.12.2022 18:20:37\nSignature Not Verified",
          "pdf_source": "10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-16T11:48:35.232755",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}