{
  "doc_name": "12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS",
  "pdf_source": "12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf",
  "metadata": {
    "document_name": "12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS",
    "source_pdf": "12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf",
    "judges": [
      "AMIT BANSAL"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "460/2016",
      "460/2016",
      "460/2016",
      "460/2016",
      "460/2016",
      "460/2016",
      "460/2016",
      "460/2016",
      "460/2016",
      "13923/2015"
    ],
    "dhc_numbers": [
      "2023/DHC/000458",
      "2023/DHC/000458",
      "2023/DHC/000458",
      "2023/DHC/000458",
      "2023/DHC/000458",
      "2023/DHC/000458",
      "2023/DHC/000458"
    ],
    "ia_numbers": [],
    "decision_date": "17 January, 2023",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      {
        "name": "ZINO DAVIDOFF SA",
        "type": "Legal Entity"
      }
    ],
    "defendants": [
      {
        "names": [
          "BHALANI ENTERPRISES",
          "ORs"
        ],
        "type": "Legal Entity"
      }
    ],
    "appellants": [],
    "respondents": [],
    "plaintiff_advocates": [
      {
        "name": "Mr. Ajay Amitabh Suman",
        "type": "Lawyer/Advocate"
      },
      {
        "name": "",
        "type": ""
      }
    ],
    "defendant_advocates": [
      {
        "name": "Ms. Snehima Jauhari",
        "type": "Lawyer/Advocate"
      },
      {
        "name": "Mr. Sohrab Singh Mann",
        "type": "Lawyer/Advocate"
      }
    ],
    "appellant_advocates": [],
    "respondent_advocates": [],
    "damages_claimed": "3,00,000",
    "damages_awarded": null,
    "key_issues": [
      "Here are the main legal issues extracted from the document:",
      "1. Infringement of plaintiff's trademarks and copyrights by defendants.",
      "2. Passing off goods as those of the plaintiff by defendants.",
      "3. Liability for damages due to sale of counterfeit products by defendants.",
      "4. Validity of the cease and desist notice issued by plaintiff to defendants.",
      "5. Effectiveness of trademark registration in various countries on the plaintiff's claim.",
      "6. Involvement of defendant no.3 as a third party responsible for hosting infringing products.",
      "7. Civil remedy for trademark infringement under the Trade Marks Act, 1999.",
      "8. Doctrine of \"passing off\" and its application to the plaintiff's case.",
      "9. Scope of \"vast goodwill and reputation\" in determining trademark infringement."
    ],
    "decision_summary": "Here's a comprehensive summary of the case:\n\n**Case Summary:**\n\nZino Davidoff SA v. Bhalani Enterprises & Ors.\n\nHigh Court of Delhi at New Delhi\nDate of Decision: 17th January, 2023\nCivil Suit (COMM) No. 460/2016\n\n**Background:**\nThe plaintiff, Zino Davidoff SA, is a company that manufactures and sells perfumes and fragrances under the trademark \"DAVIDOFF\". The defendants are Bhalani Enterprises, an Indian entity, and two other entities (hereinafter referred to as the Defendants). The plaintiff alleged that the Defendants were selling counterfeit products bearing its trademark \"DAVIDOFF\" through an e-commerce website called ShopClues.\n\n**Legal Issues:**\n\n1. **Trademark Infringement:** The plaintiff claimed that the Defendants' use of the DAVIDOFF mark constituted trademark infringement under the Trademarks Act, 1999.\n2. **Passing Off:** The plaintiff alleged that the Defendants were passing off their counterfeit products as those of the plaintiff, which was a further aspect of trademark infringement.\n\n**Arguments:**\n\nThe plaintiff's main arguments were:\n\n* The Plaintiff has been using the mark \"DAVIDOFF\" since 1984 and has acquired vast goodwill and reputation worldwide.\n* The Defendants' use of the DAVIDOFF mark is infringing as they are selling counterfeit products under the same mark.\n* The Defendants' defense of innocence (Defendant No. 2) was untenable, as it admitted to using the product without questioning its authenticity.\n\n**Court Findings:**\n\nThe Hon'ble Court of Delhi considered various factors in determining the validity of the plaintiff's claims:\n\n1. **Bad Faith:** The court held that there was no good faith on the part of the Defendants, as they were selling counterfeit products despite being aware of their infringing nature.\n2. **Passing Off:** The court found that the Defendants had established a close similarity between the goods sold by them and those of the Plaintiff, suggesting intention to pass off their product as the genuine one.\n3. **Counterfeit Goods:** The Court observed that a number of impugned products were counterfeit perfumes and fragrances bearing the plaintiff's trademark \"DAVIDOFF\", which was evidence of passing off.\n\n**Decision:**\n\nThe Hon'ble Judge ordered:\n\n1. Permanently restraining the Defendants from using the DAVIDOFF mark, selling any goods bearing the same, or in any manner using the similar marks that could cause confusion among consumers.\n2. Directing the Defendants to desist from promoting their products through websites, print and electronic media by removing all content bearing the Plaintiff's trademark \"DAVIDOFF\".\n3. Holding the Defendants responsible for losses suffered by the plaintiff.\n\n**Key Takeaways:**\n\nThis case highlights the importance of protecting intellectual property rights in India, including trademarks and copyrights. The judgment showcases the High Court's strong stance against counterfeit products bearing original company logos, resulting in significant relief to the original trademark holder (the Plaintiff).",
    "legal_precedents": [],
    "full_text": "\n--- PAGE 1 ---\n2023/DHC/000458 \n \nCS(COMM) 460/2016 \n                                                                                                      Page 1 of 7 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n% \n \n \n \n \nDate of Decision : 17th January, 2023 \n+  \n \n \n \nCS(COMM) 460/2016 \n \nZINO DAVIDOFF SA \n \n \n \n \n..... Plaintiff \n \n \n \n \nThrough: \nMr. Ajay Amitabh Suman, Advocate. \n \n \n \n \n \nversus \n \n \nBHALANI ENTERPRISES & ORS  \n \n..... Defendants \nThrough: \nMs. Snehima Jauhari with Mr. Sohrab \nSingh Mann, Advocates for D-3. \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nAMIT BANSAL, J. (Oral) \n \n \n \n \n \nCS(COMM) 460/2016 \n1. \nThe present suit has been filed seeking relief of permanent injunction \nrestraining the defendants from infringing the trademarks and copyrights of \nthe plaintiff, passing off their goods as that of the plaintiff’s and other \nancillary reliefs.  \nPLEADINGS IN THE PLAINT \n2. \nThe case set up by the plaintiff in the plaint is as follows:  \n2.1   The plaintiff is in the business of manufacturing, selling and \ndistributing various products including perfumes and fragrances under the \ntrademark ‘DAVIDOFF’.  \n2.2     The plaintiff has been using the trademark ‘DAVIDOFF’ since 1984 \nin respect of its perfumes and fragrances.  \n2.3     The plaintiff is the proprietor of the registered trademark \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:21.01.2023 17:07:53\nSignature Not Verified\n\n--- PAGE 2 ---\n2023/DHC/000458 \n \nCS(COMM) 460/2016 \n                                                                                                      Page 2 of 7 \n \n‘DAVIDOFF’ and other related marks of the plaintiff in Classes 3, 33 and \n25 of the Trade Marks Act, 1999, details of which are provided in paragraph \n8 of the plaint. The said marks of the plaintiff are also registered by the \nplaintiff in various foreign countries.  \n2.4        The goods of the plaintiffs are sold in more than 100 countries of the \nworld including India. The plaintiff’s trademark ‘DAVIDOFF’ has acquired \nvast goodwill and reputation all over the world including India. The \ntrademark ‘DAVIDOFF’ of the plaintiff has come to be exclusively \nassociated with the plaintiff. \n2.5      The trademark ‘DAVIDOFF’ has also been adopted by the plaintiff in \nrespect of its domain name www.zinodavidoff.com. The plaintiff has been \nusing the said domain name in relation to its goods and businesses.  \n2.6      In April, 2015, the plaintiff came across the infringing activities of \nthe defendants. The defendants no.1 and 2 are conducting their business of \nselling counterfeit perfumes and fragrances bearing the plaintiff’s trademark \n‘DAVIDOFF’ (hereinafter ‘impugned products’) through the website of the \ndefendant no.3, www.shopclues.com.  \n2.7    The packaging of the impugned products purchased by the plaintiff \nthrough the aforesaid website does not contain the names of the distributer \nand manufacturer, which indicates that the impugned products sold through \nthe said website are counterfeit products.  \n2.8     The plaintiff issued cease and desist notice to the defendants on 30th \nApril, 2015 calling upon the defendants to refrain from selling, displaying, \nadvertising or offering for sale products bearing the plaintiff’s trademark \n‘DAVIDOFF’. No response to the said notice was received by the plaintiff \non behalf of the defendant no.1. The defendants no.2 and 3 replied to the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:21.01.2023 17:07:53\nSignature Not Verified\n\n--- PAGE 3 ---\n2023/DHC/000458 \n \nCS(COMM) 460/2016 \n                                                                                                      Page 3 of 7 \n \nsaid notice vide letters dated 13th May, 2015 and 27th May, 2015 \nrespectively. In its reply, the defendant no.2 pleaded ignorance on the \ncounterfeit nature of the impugned products and undertook to refrain from \ndealing with the impugned products in future. The defendant no.3 in its \nreply denied its involvement in the infringement activities undertaken by the \ndefendants no.1 and 2.  \n3. \nAccordingly, the plaintiff has filed the present suit.  \nPROCEEDINGS IN THE SUIT \n4. \nThis court, vide order dated 15th July, 2015, granted ex parte ad \ninterim injunction in favour of the plaintiff under I.A. 13923/2015, \nrestraining the defendants from selling impugned products under the \ntrademark ‘DAVIDOFF’. The relevant portion of the said order is set out as \nunder:  \n           “I have heard the contentions of learned counsel for the plaintiff and \n perused the plaint along with documents annexed therewith and am  \nof the view that plaintiff has disclosed a, prima facie, case in its \nfavour for grant of ex-parte injunction. In case the defendants are not \nrestrained from selling the counterfeit products under the mark \n'DAVIDOFF', plaintiff shall suffer irreparable loss and injury, \ninasmuch as, balance of convenience is also in favour of the plaintiff \nand against the defendants. Accordingly, till next date of hearing, \ndefendants are restrained from selling the goods more particularly \nperfumes and fragrances under the mark 'DAVIDOFF' or any \ndeceptively similar mark as that of the plaintiff, in any manner, \nincluding through the website www.shopclues.com.” \n \n5. \nThe matter was thereafter placed before the Joint Registrar on 7th \nOctober, 2015 for effecting service and completion of pleadings. Counsel \nappeared on behalf of the defendant no. 3 on the said date. The defendants \nno.1 and 2 could not be served despite repeated attempts. Ultimately, the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:21.01.2023 17:07:53\nSignature Not Verified\n\n--- PAGE 4 ---\n2023/DHC/000458 \n \nCS(COMM) 460/2016 \n                                                                                                      Page 4 of 7 \n \ndefendants no.1 and 2 were served by way of publication on 29th June, 2017.   \n6. \nWritten statement was filed on behalf of the defendant no.3 on 20th \nOctober, 2015 and the replication thereto was filed by the plaintiff. Order \ndated 30th January, 2017 records the undertaking of the defendant no.3 to \ntake down any existing listing with regard to the mark ‘ZINO DAVIDOFF’ \nwithin 72 hours and any other listing as and when identified by the plaintiff.  \n7. \nOn 16th November, 2017, the defendants no.1 and 2 were proceeded \nagainst ex parte in the present suit.  \n8. \nOn 1st March, 2018, the following issues were framed:  \n1.Whether the suit against the defendant no. 3 being an intermediary \nas provided under Section 2(1)(w) of the Information Technology Act, \n2000 is maintainable or not? OPD \n \n2.Whether the defendant no. 3 had 'actual knowledge' of the allegedly \ninfringing nature of the goods listed by defendant nos. 1 and 2 on its \nwebsite www.shopclues.com and if so, how the knowledge mandated \nby Section 79(3)(b) of the Information Technology Act, 2000 was \nsatisfied to render the defendants liable? OPP \n \n3. Whether the defendants had conspired or abetted or aided or \ninduced, whether by threats or promise or otherwise in the \ncommission of the acts of passing off and/or infringement by \ndefendant nos. 1 and 2? OPP \n \n          4. Relief. \n9. \nOn 10th April, 2019, the matter was referred for mediation and the \nmatter was settled vide Settlement Agreement dated 5th December, 2022 \nentered into between the plaintiff and the defendant no.3. The Settlement \nAgreement dated 5th December, 2022 has been placed on record. The said \nSettlement Agreement has been signed by the representatives of the plaintiff \nand defendant no.3. It is stated in the Settlement Agreement that the terms of \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:21.01.2023 17:07:53\nSignature Not Verified\n\n--- PAGE 5 ---\n2023/DHC/000458 \n \nCS(COMM) 460/2016 \n                                                                                                      Page 5 of 7 \n \nthe settlement are confidential. \n10. \nIn view of the above, the counsel for the plaintiff prays for a decree of \npermanent injunction and damages along with costs in the suit against the \ndefendants no.1 and 2 and a decree in terms of the Settlement Agreement \nagainst the defendant no.3.  \nANALYSIS AND FINDING  \n11. \nI have heard the counsel for the plaintiff and the defendant no.3 and \nperused the record of the case. \n12. \n In the present case, the defendants no.1 and 2 have failed to appear \nbefore this Court despite service. Therefore, the defendants no.1 and 2 have \nbeen proceeded against ex parte on 16th November, 2017.  \n13. \n Since the aforesaid defendants have failed to enter appearance or \neven take any requisite steps to contest the present suit, despite having \nsuffered an ad interim injunction order, it is evident that they have no \ndefence to put forth on merits. \n14. \n From a perusal of the material on record, this Court is of the view \nthat the defendants no.1 and 2 have been selling impugned products with a \nview to trade upon the established goodwill and reputation of the plaintiff. \nBy their aforesaid conduct, the defendants no.1 and 2 are infringing the \ntrademarks of the plaintiff, as also passing off their goods as that of the \nplaintiff.  \n15. \n Based on the averments in the plaint and the discussion above, this \nCourt is of the view that this is a fit case for granting relief of permanent \ninjunction in favour of the plaintiff and against the defendants no.1 and 2. \nAccordingly, the defendants no.1 and 2 are restrained from manufacturing \nand selling counterfeit products bearing the plaintiff’s trademark \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:21.01.2023 17:07:53\nSignature Not Verified\n\n--- PAGE 6 ---\n2023/DHC/000458 \n \nCS(COMM) 460/2016 \n                                                                                                      Page 6 of 7 \n \n‘DAVIDOFF’ or any other trademark deceptively similar to the \n‘DAVIDOFF’ marks of the plaintiff on the website, www.shopclues.com, or \nany other website in relation to the business of perfumes, fragrances and \nrelated products.   \n16. \nIn so far as the reliefs of damages and cost prayed for in the plaint, the \ndefendant no.2 has given an undertaking not to deal with the impugned \nproducts vide reply dated 13th May, 2015 to the cease and desist notice. In \nmy considered view, it is not the case of the plaintiff that after the aforesaid \nreply, the defendant no.2 continued to sell the impugned products. \nTherefore, I do not deem it proper to award damages and costs against the \ndefendant no.2.    \n17. \nAs regards defendant no.1, the defendant no.1 neither replied to the \nlegal notice, nor appeared before this Court. There can be no justification for \nmanufacturing and selling perfumes and fragrances in counterfeit \n‘DAVIDOFF’ branded packaging. The use of the impugned products on \nhuman body can cause adverse reactions. Clearly, customers are being \nmisled by the defendants no.1 and the entire effort is deliberate and \ndishonest. This amounts to dilution of the reputation and goodwill of the \nplaintiff’s trademarks and causing loss to the plaintiff in business and \nreputation. The defendant no.1 has been making unlawful gains at the \nexpense of the plaintiff.  \n18. \nIn view of the foregoing facts and circumstances, this Court is of the \nview that this is not a case of innocent adoption by the defendant no.1. The \nCourt cannot ignore such flagrant misuse of the plaintiff’s marks by the \ndefendant no.1. Therefore, the suit is decreed in favour of the plaintiff for \nRs.3,00,000/- towards damages to be paid by the defendant no.1. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:21.01.2023 17:07:53\nSignature Not Verified\n\n--- PAGE 7 ---\n2023/DHC/000458 \n \nCS(COMM) 460/2016 \n                                                                                                      Page 7 of 7 \n \nAdditionally, Rs.2,00,000/- is awarded to the plaintiff as costs to be paid by \nthe defendant no.1.  \n19. \nThe defendants no.1 shall pay the said amount to the plaintiff within \neight weeks, failing which the plaintiff is permitted to commence execution \nproceedings against the defendant no.1.  \n20. \nAccordingly, the present suit is decreed against the defendant no.1 in \nterms of prayer clauses ‘a’, ‘e’ and ‘g’ of the plaint and against the \ndefendant no.2 in terms of prayer clause ‘a’ of the plaint.   \n21. \nCounsel for the plaintiff does not press for the reliefs contemplated in \nprayer clauses ‘b’, ‘c’, ‘d’ and ‘f’ of the plaint against the defendants no.1 \nand 2. \n22. \nInsofar as the defendant no.3 is concerned, the suit is decreed against \nthe defendant no.3 in terms of the Settlement Agreement dated 5th \nDecember, 2022. The said Settlement agreement shall form part of the \ndecree.  \n23.    Decree sheet be drawn up. \n24.    All pending applications stand disposed of. \n \n \n \nAMIT BANSAL, J. \nJANUARY 17, 2023 \nat \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:21.01.2023 17:07:53\nSignature Not Verified\n"
  },
  "total_pages": 7,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "Here is a summary of the document section:\n\n**Case Header and Parties**\n\n* Case No.: CS(COMM) 460/2016\n* Filed: 2023/DHC/000458\n* Date of Decision: 17th January, 2023\n* Court: High Court of Delhi at New Delhi\n\n**Parties**\n\n* Plaintiff: ZINO DAVIDOFF SA (represented by Mr. Ajay Amitabh Suman, Advocate)\n* Defendants:\n\t+ BHALANI ENTERPRISES (represented by Ms. Snehima Jauhari, Mr. Sohrab Singh Mann, Advocates)\n\n**Case Summary**\n\nThe plaintiff seeks a permanent injunction to prevent the defendants from infringing its trademarks and copyrights, passing off their goods as those of the plaintiff's, and other ancillary reliefs.\n\n**Facts**\n\n* The plaintiff has been using the trademark 'DAVIDOFF' since 1984 in respect of perfumes and fragrances.\n* The plaintiff is the proprietor of registered trademarks 'DAVIDOFF' and related marks in Classes 3, 33, and 25 of the Trade Marks Act, 1999.\n* The defendants have been selling counterfeit perfumes and fragrances bearing the plaintiff's trademark 'DAVIDOFF' through a website.\n\n**Proceedings**\n\n* The plaintiff issued a cease and desist notice to the defendants on 30th April, 2015, which was not responded to by defendant no.1 but replied to by defendants nos.2 and 3.\n* A permanent injunction is sought against the defendants for infringing the trademarks and copyrights of the plaintiff.\n\n**References**\n\nSource: Section: Case Header and Parties from PDF file 12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf",
      "pdf_source": "12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "Here is a summary of page 1 from the PDF:\n\n**Source:** 12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf (2023/DHC/000458)\n\n**Case Details:**\n\n* CS(COMM) 460/2016\n* Plaintiff: ZINO DAVIDOFF SA\n* Defendants: BHALANI ENTERPRISES & ORS\n* Date of Decision: 17th January, 2023\n\n**Summary:**\n\nThe plaintiff has filed a suit seeking permanent injunction against the defendants for infringing trademarks and copyrights, passing off goods as the plaintiff's, and other ancillary reliefs. The plaintiff claims to have been using the trademark 'DAVIDOFF' since 1984 in respect of perfumes and fragrances.\n\n**Key Facts:**\n\n* Plaintiff uses the trademark 'DAVIDOFF' since 1984\n* Plaintiff is the proprietor of a registered trademark\n* Suit filed for infringement, passing off, and other ancillary reliefs\n\n**Parties:**\n\n* Plaintiff: ZINO DAVIDOFF SA (through Mr. Ajay Amitabh Suman)\n* Defendants: BHALANI ENTERPRISES & ORS (through Ms. Snehima Jauhari and Mr. Sohrab Singh Mann)",
          "content": "2023/DHC/000458 \n \nCS(COMM) 460/2016 \n                                                                                                      Page 1 of 7 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n% \n \n \n \n \nDate of Decision : 17th January, 2023 \n+  \n \n \n \nCS(COMM) 460/2016 \n \nZINO DAVIDOFF SA \n \n \n \n \n..... Plaintiff \n \n \n \n \nThrough: \nMr. Ajay Amitabh Suman, Advocate. \n \n \n \n \n \nversus \n \n \nBHALANI ENTERPRISES & ORS  \n \n..... Defendants \nThrough: \nMs. Snehima Jauhari with Mr. Sohrab \nSingh Mann, Advocates for D-3. \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nAMIT BANSAL, J. (Oral) \n \n \n \n \n \nCS(COMM) 460/2016 \n1. \nThe present suit has been filed seeking relief of permanent injunction \nrestraining the defendants from infringing the trademarks and copyrights of \nthe plaintiff, passing off their goods as that of the plaintiff’s and other \nancillary reliefs.  \nPLEADINGS IN THE PLAINT \n2. \nThe case set up by the plaintiff in the plaint is as follows:  \n2.1   The plaintiff is in the business of manufacturing, selling and \ndistributing various products including perfumes and fragrances under the \ntrademark ‘DAVIDOFF’.  \n2.2     The plaintiff has been using the trademark ‘DAVIDOFF’ since 1984 \nin respect of its perfumes and fragrances.  \n2.3     The plaintiff is the proprietor of the registered trademark \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:21.01.2023 17:07:53\nSignature Not Verified",
          "pdf_source": "12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "**High Court of Delhi case summary**\n\nSource: 12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf (2023/DHC/000458)\n\n**Key points:**\n\n* Plaintiff Zino Davidoff SA claims trademark infringement by defendants Bhalani Enterprises & Ors.\n* The plaintiff's brand \"DAVIDOFF\" is registered in various countries, including India, and has global goodwill and reputation.\n* Defendants no. 1 and 2 sell counterfeit perfumes with the \"DAVIDOFF\" mark on website www.shopclues.com (defendant no. 3).\n* In April 2015, the plaintiff issued a cease-and-desist notice to defendants, but only defendant no. 2 responded.\n* The packaging of alleged counterfeit products lacks manufacturer and distributor information.\n\n**Proceedings:**\n\n* Case filing: CS(COMM) 460/2016\n* Decision date: January 17, 2023\n\n**Parties involved:**\n\n* Plaintiff: Zino Davidoff SA (represented by Mr. Ajay Amitabh Suman)\n* Defendants: Bhalani Enterprises & Ors.",
          "content": "2023/DHC/000458 \n \nCS(COMM) 460/2016 \n                                                                                                      Page 2 of 7 \n \n‘DAVIDOFF’ and other related marks of the plaintiff in Classes 3, 33 and \n25 of the Trade Marks Act, 1999, details of which are provided in paragraph \n8 of the plaint. The said marks of the plaintiff are also registered by the \nplaintiff in various foreign countries.  \n2.4        The goods of the plaintiffs are sold in more than 100 countries of the \nworld including India. The plaintiff’s trademark ‘DAVIDOFF’ has acquired \nvast goodwill and reputation all over the world including India. The \ntrademark ‘DAVIDOFF’ of the plaintiff has come to be exclusively \nassociated with the plaintiff. \n2.5      The trademark ‘DAVIDOFF’ has also been adopted by the plaintiff in \nrespect of its domain name www.zinodavidoff.com. The plaintiff has been \nusing the said domain name in relation to its goods and businesses.  \n2.6      In April, 2015, the plaintiff came across the infringing activities of \nthe defendants. The defendants no.1 and 2 are conducting their business of \nselling counterfeit perfumes and fragrances bearing the plaintiff’s trademark \n‘DAVIDOFF’ (hereinafter ‘impugned products’) through the website of the \ndefendant no.3, www.shopclues.com.  \n2.7    The packaging of the impugned products purchased by the plaintiff \nthrough the aforesaid website does not contain the names of the distributer \nand manufacturer, which indicates that the impugned products sold through \nthe said website are counterfeit products.  \n2.8     The plaintiff issued cease and desist notice to the defendants on 30th \nApril, 2015 calling upon the defendants to refrain from selling, displaying, \nadvertising or offering for sale products bearing the plaintiff’s trademark \n‘DAVIDOFF’. No response to the said notice was received by the plaintiff \non behalf of the defendant no.1. The defendants no.2 and 3 replied to the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:21.01.2023 17:07:53\nSignature Not Verified",
          "pdf_source": "12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0005",
      "start_index": 3,
      "end_index": 3,
      "summary": "**Section:** Background and Facts from **12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf**\n\nThis court case involves Zino Davidoff SA (Plaintiff) vs. Bhalani Enterprises & Others (Defendants) in the High Court of Delhi at New Delhi.\n\n**Background:**\nOn May 13th and 27th, 2015, Defendant No. 1 sent notice letters to Defendants No. 2 and 3 regarding alleged infringement activities related to the trademark \"DAVIDOFF\". \n\n**Facts:**\n\n*   Defendant No. 2 claimed ignorance about the counterfeit nature of products but agreed not to deal with further products.\n*   Defendant No. 3 denied involvement in the infringement activities undertaken by Defendants No. 1 and 2.\n\n**Procedural Developments:**\nOn July 15, 2015, an ex parte ad interim injunction was granted in favor of the Plaintiff (Zino Davidoff SA), which restricted Defendants from selling products under the trademark 'DAVIDOFF' or any deceptively similar mark.\nCourt orders and proceedings have been ongoing on this matter, including placing it before a Joint Registrar for effecting service and completion of pleadings on October 7th, 2015.\n\n**Decision Date:** The case was decided on January 17th, 2023.\n\n\nThis summary focuses mainly on legal proceedings, facts, arguments, decisions, parties, dates, and amounts based on the given PDF source.",
      "pdf_source": "12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "Here is a summary of page 3 from the PDF:\n\nThe plaintiff, ZINO DAVIDOFF SA, filed a suit against BHALANI ENTERPRISES & ORS (defendants). The defendants received notice to cease selling counterfeit products under the trademark 'DAVIDOFF' via letters dated May 13 and 27, 2015. Defendant No. 2 pleaded ignorance about the counterfeit nature of the products but undertook not to deal with them in future. Defendant No. 3 denied involvement in infringement activities.\n\n**Proceedings:**\n\n* The plaintiff filed a suit (CS(COMM) 460/2016)\n* Order dated July 15, 2015 granted ex parte ad interim injunction against defendants to sell products under the trademark 'DAVIDOFF'\n\n**Key Dates and Facts:**\n\n* May 13, 2015: Defendant Nos. 1-2 received notice\n* May 27, 2015: Defendant Nos. 1-2 received notice (again)\n* July 15, 2015: Ex parte ad interim injunction granted\n* October 7, 2015: Matter placed before the Joint Registrar for service and completion of pleadings\n\n**Source:** PDF from \"2023/DHC/000458\" Case ID CS(COMM) 460/2016 (file uploaded to this platform).",
          "content": "2023/DHC/000458 \n \nCS(COMM) 460/2016 \n                                                                                                      Page 3 of 7 \n \nsaid notice vide letters dated 13th May, 2015 and 27th May, 2015 \nrespectively. In its reply, the defendant no.2 pleaded ignorance on the \ncounterfeit nature of the impugned products and undertook to refrain from \ndealing with the impugned products in future. The defendant no.3 in its \nreply denied its involvement in the infringement activities undertaken by the \ndefendants no.1 and 2.  \n3. \nAccordingly, the plaintiff has filed the present suit.  \nPROCEEDINGS IN THE SUIT \n4. \nThis court, vide order dated 15th July, 2015, granted ex parte ad \ninterim injunction in favour of the plaintiff under I.A. 13923/2015, \nrestraining the defendants from selling impugned products under the \ntrademark ‘DAVIDOFF’. The relevant portion of the said order is set out as \nunder:  \n           “I have heard the contentions of learned counsel for the plaintiff and \n perused the plaint along with documents annexed therewith and am  \nof the view that plaintiff has disclosed a, prima facie, case in its \nfavour for grant of ex-parte injunction. In case the defendants are not \nrestrained from selling the counterfeit products under the mark \n'DAVIDOFF', plaintiff shall suffer irreparable loss and injury, \ninasmuch as, balance of convenience is also in favour of the plaintiff \nand against the defendants. Accordingly, till next date of hearing, \ndefendants are restrained from selling the goods more particularly \nperfumes and fragrances under the mark 'DAVIDOFF' or any \ndeceptively similar mark as that of the plaintiff, in any manner, \nincluding through the website www.shopclues.com.” \n \n5. \nThe matter was thereafter placed before the Joint Registrar on 7th \nOctober, 2015 for effecting service and completion of pleadings. Counsel \nappeared on behalf of the defendant no. 3 on the said date. The defendants \nno.1 and 2 could not be served despite repeated attempts. Ultimately, the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:21.01.2023 17:07:53\nSignature Not Verified",
          "pdf_source": "12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0009",
      "start_index": 4,
      "end_index": 6,
      "summary": "Here is a summary of the given legal document:\n\n**Case Details:**\n\n* Case No.: 2023/DHC/000458\n* Court: High Court of Delhi at New Delhi\n* Date of Decision: 17th January, 2023\n* Parties:\n\t+ Plaintiff: Zino Davidoff SA\n\t+ Defendants: Bhalani Enterprises & ORS (defendants no.1 and 2), shopclues.com (defendant no.3)\n\n**Legal Arguments and Decisions:**\n\n* The plaintiff filed a suit against the defendants for trademark infringement, passing off, and conspiracy.\n* The court framed four issues to be decided:\n\t+ Whether the suit against defendant no.3 is maintainable?\n\t+ Whether defendant no.3 had actual knowledge of the infringing nature of goods listed by defendants nos. 1 and 2?\n\t+ Did the defendants conspire or abet the commission of acts of passing off and/or infringement?\n\t+ Relief to be granted\n* The court found that:\n\t+ Defendants nos. 1 and 2 failed to appear before the court despite service, and were proceeded against ex parte.\n\t+ They have been selling impugned products infringing the plaintiff's trademarks and passing off their goods as the plaintiff's.\n\t+ Permanent injunction in favor of the plaintiff and against defendants nos. 1 and 2.\n\n**Mediation and Settlement:**\n\n* The matter was referred for mediation, and a settlement agreement was entered into between the plaintiff and defendant no.3 on 5th December, 2022.\n* The terms of the settlement are confidential.\n\n**Sources:**\n\n12.ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf (PDF source)",
      "pdf_source": "12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf",
      "nodes": [
        {
          "title": "Page 4",
          "node_id": "0006",
          "start_index": 4,
          "end_index": 4,
          "summary": "Source: 12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf, 2023/DHC/000458\n\n**Summary of Page 4:**\n\n* Defendants no. 1 and 2 were served by way of publication on June 29, 2017.\n* Defendant no. 3 filed a written statement on October 20, 2015, with the plaintiff filing a replication thereto.\n* On January 30, 2017, defendant no. 3 undertook to take down existing listings with regard to the mark \"ZINO DAVIDOFF\" within 72 hours and any other listing as identified by the plaintiff.\n* On November 16, 2017, defendants no. 1 and 2 were proceeded against ex parte in the suit.\n* On March 1, 2018, the following issues were framed:\n\t+ Whethere the suit against defendant no. 3 is maintainable under Section 2(1)(w) of the Information Technology Act, 2000.\n\t+ Whether defendant no. 3 had \"actual knowledge\" of the infringing nature of goods listed by defendants nos. 1 and 2 on its website.\n\t+ Whethere the defendants conspired or abetted in committing acts of passing off and/or infringement.\n\nNote: The PDF source is a judgment from the High Court of Delhi, India, dated January 17, 2023",
          "content": "2023/DHC/000458 \n \nCS(COMM) 460/2016 \n                                                                                                      Page 4 of 7 \n \ndefendants no.1 and 2 were served by way of publication on 29th June, 2017.   \n6. \nWritten statement was filed on behalf of the defendant no.3 on 20th \nOctober, 2015 and the replication thereto was filed by the plaintiff. Order \ndated 30th January, 2017 records the undertaking of the defendant no.3 to \ntake down any existing listing with regard to the mark ‘ZINO DAVIDOFF’ \nwithin 72 hours and any other listing as and when identified by the plaintiff.  \n7. \nOn 16th November, 2017, the defendants no.1 and 2 were proceeded \nagainst ex parte in the present suit.  \n8. \nOn 1st March, 2018, the following issues were framed:  \n1.Whether the suit against the defendant no. 3 being an intermediary \nas provided under Section 2(1)(w) of the Information Technology Act, \n2000 is maintainable or not? OPD \n \n2.Whether the defendant no. 3 had 'actual knowledge' of the allegedly \ninfringing nature of the goods listed by defendant nos. 1 and 2 on its \nwebsite www.shopclues.com and if so, how the knowledge mandated \nby Section 79(3)(b) of the Information Technology Act, 2000 was \nsatisfied to render the defendants liable? OPP \n \n3. Whether the defendants had conspired or abetted or aided or \ninduced, whether by threats or promise or otherwise in the \ncommission of the acts of passing off and/or infringement by \ndefendant nos. 1 and 2? OPP \n \n          4. Relief. \n9. \nOn 10th April, 2019, the matter was referred for mediation and the \nmatter was settled vide Settlement Agreement dated 5th December, 2022 \nentered into between the plaintiff and the defendant no.3. The Settlement \nAgreement dated 5th December, 2022 has been placed on record. The said \nSettlement Agreement has been signed by the representatives of the plaintiff \nand defendant no.3. It is stated in the Settlement Agreement that the terms of \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:21.01.2023 17:07:53\nSignature Not Verified",
          "pdf_source": "12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 5",
          "node_id": "0007",
          "start_index": 5,
          "end_index": 5,
          "summary": "Here is a summary of page 5 from the provided PDF:\n\n**Case Details**\n\n* Case Number: CS(COMM) 460/2016\n* Date of Decision: 17th January, 2023\n* Court: High Court of Delhi at New Delhi\n* Parties:\n\t+ Plaintiff: ZINO DAVIDOFF SA (through Mr. Ajay Amitabh Suman)\n\t+ Defendants: BHALANI ENTERPRISES & ORS (including defendants no.1 and 2 through Ms. Snehima Jauhari)\n\n**Proceedings**\n\n* The plaintiff prays for a decree of permanent injunction, damages, and costs against defendants no.1 and 2, as well as a decree in terms of the Settlement Agreement against defendant no.3.\n\n**Analysis and Finding**\n\n* This Court finds that defendants no.1 and 2 have failed to appear before the court despite service and have been proceeded against ex parte.\n* The Court concludes that defendants no.1 and 2 infringe the plaintiff's trademarks by selling impugned products with a view to trade upon the plaintiff's goodwill.\n\n**Source**: PDF: ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS, 2023/DHC/000458",
          "content": "2023/DHC/000458 \n \nCS(COMM) 460/2016 \n                                                                                                      Page 5 of 7 \n \nthe settlement are confidential. \n10. \nIn view of the above, the counsel for the plaintiff prays for a decree of \npermanent injunction and damages along with costs in the suit against the \ndefendants no.1 and 2 and a decree in terms of the Settlement Agreement \nagainst the defendant no.3.  \nANALYSIS AND FINDING  \n11. \nI have heard the counsel for the plaintiff and the defendant no.3 and \nperused the record of the case. \n12. \n In the present case, the defendants no.1 and 2 have failed to appear \nbefore this Court despite service. Therefore, the defendants no.1 and 2 have \nbeen proceeded against ex parte on 16th November, 2017.  \n13. \n Since the aforesaid defendants have failed to enter appearance or \neven take any requisite steps to contest the present suit, despite having \nsuffered an ad interim injunction order, it is evident that they have no \ndefence to put forth on merits. \n14. \n From a perusal of the material on record, this Court is of the view \nthat the defendants no.1 and 2 have been selling impugned products with a \nview to trade upon the established goodwill and reputation of the plaintiff. \nBy their aforesaid conduct, the defendants no.1 and 2 are infringing the \ntrademarks of the plaintiff, as also passing off their goods as that of the \nplaintiff.  \n15. \n Based on the averments in the plaint and the discussion above, this \nCourt is of the view that this is a fit case for granting relief of permanent \ninjunction in favour of the plaintiff and against the defendants no.1 and 2. \nAccordingly, the defendants no.1 and 2 are restrained from manufacturing \nand selling counterfeit products bearing the plaintiff’s trademark \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:21.01.2023 17:07:53\nSignature Not Verified",
          "pdf_source": "12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "**Document:** ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS (2023/DHC/000458)\n\n**Page 6 Summary:**\n\nThe plaintiff, ZINO DAVIDOFF SA, sought a decree against the defendants for trademark infringement and passing off.\n\n* The defendant no.2 had given an undertaking not to deal with impugned products after receiving a cease and desist notice.\n* No damages or costs were awarded against defendant no.2 as they did not continue to sell the impugned products after the reply.\n\n* Defendant no.1, who manufactured and sold perfumes in counterfeit 'DAVIDOFF' branded packaging, was held liable for damages.\n* The Court found that the sale of these products caused harm to customers, misled them, and diluted the plaintiff's trademarks, causing loss to business and reputation.\n* A decree was passed against defendant no.1 for Rs.3,00,000 (three lakhs) towards damages.\n\n**Key dates:**\n\n* 17th January, 2023: Date of decision\n* 13th May, 2015: Date of cease and desist notice reply by defendant no.2\n\n**Parties involved:**\n\n* Plaintiff: ZINO DAVIDOFF SA (represented by Mr. Ajay Amitabh Suman)\n* Defendant no.1: Bhalani Enterprises\n* Defendant no.2: (no further details provided)",
          "content": "2023/DHC/000458 \n \nCS(COMM) 460/2016 \n                                                                                                      Page 6 of 7 \n \n‘DAVIDOFF’ or any other trademark deceptively similar to the \n‘DAVIDOFF’ marks of the plaintiff on the website, www.shopclues.com, or \nany other website in relation to the business of perfumes, fragrances and \nrelated products.   \n16. \nIn so far as the reliefs of damages and cost prayed for in the plaint, the \ndefendant no.2 has given an undertaking not to deal with the impugned \nproducts vide reply dated 13th May, 2015 to the cease and desist notice. In \nmy considered view, it is not the case of the plaintiff that after the aforesaid \nreply, the defendant no.2 continued to sell the impugned products. \nTherefore, I do not deem it proper to award damages and costs against the \ndefendant no.2.    \n17. \nAs regards defendant no.1, the defendant no.1 neither replied to the \nlegal notice, nor appeared before this Court. There can be no justification for \nmanufacturing and selling perfumes and fragrances in counterfeit \n‘DAVIDOFF’ branded packaging. The use of the impugned products on \nhuman body can cause adverse reactions. Clearly, customers are being \nmisled by the defendants no.1 and the entire effort is deliberate and \ndishonest. This amounts to dilution of the reputation and goodwill of the \nplaintiff’s trademarks and causing loss to the plaintiff in business and \nreputation. The defendant no.1 has been making unlawful gains at the \nexpense of the plaintiff.  \n18. \nIn view of the foregoing facts and circumstances, this Court is of the \nview that this is not a case of innocent adoption by the defendant no.1. The \nCourt cannot ignore such flagrant misuse of the plaintiff’s marks by the \ndefendant no.1. Therefore, the suit is decreed in favour of the plaintiff for \nRs.3,00,000/- towards damages to be paid by the defendant no.1. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:21.01.2023 17:07:53\nSignature Not Verified",
          "pdf_source": "12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0011",
      "start_index": 7,
      "end_index": 7,
      "summary": "**Source:** Section from PDF \"12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf\"\n\n**Case Details:**\n\n* Case Number: CS(COMM) 460/2016\n* Date of Decision: January 17, 2023 (digitally signed on January 21, 2023)\n* High Court of Delhi at New Delhi\n\n**Parties Involved:**\n\n* Plaintiff: ZINO DAVIDOFF SA (represented by Mr. Ajay Amitabh Suman, Advocate)\n* Defendants:\n\t+ BHALANI ENTERPRISES & ORS (represented by Ms. Snehima Jauhari with Mr. Sohrab...)\n\t+ Defendant No. 2 (party name not specified in the relevant section)\n\t+ Defendant No. 3\n\n**Decree:**\n\n* The court decreed the suit against:\n\t+ Defendant No. 1 in terms of prayer clauses 'a', 'e', and 'g' of the plaint.\n\t+ Defendant No. 2 in terms of prayer clause 'a' of the plaint.\n\t+ Defendant No. 3 in accordance with the Settlement Agreement dated December 5, 2022.\n\n**Costs:**\n\n* The court awarded Rs. 2,00,000 (two lakhs) as costs in favor of the plaintiff to be paid by Defendant No. 1 within eight weeks.\n\n**Remedies and Future Actions:**\n\n* Failing payment, the plaintiff is permitted to commence execution proceedings against Defendant No. 1.\n* Decree sheet be drawn up and pending applications stand disposed of.",
      "pdf_source": "12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf",
      "nodes": [
        {
          "title": "Page 7",
          "node_id": "0010",
          "start_index": 7,
          "end_index": 7,
          "summary": "**Case Summary: ZINO DAVIDOFF SA vs BHALANI ENTERPRISES & ORS**\n\nPDF Source: 12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf (2023/DHC/000458)\n\n**Key Facts and Decisions:**\n\n* The High Court of Delhi at New Delhi delivered its judgment on January 17, 2023.\n* The plaintiff, ZINO DAVIDOFF SA, was awarded Rs.2,00,000/- as costs against defendant no.1.\n* Defendant no.1 must pay the amount within eight weeks; otherwise, execution proceedings will be initiated.\n* The suit is decreed in favor of the plaintiff against defendants no.1 and 2 for some claims (prayer clauses 'a', 'e', and 'g' for no.1 and 'a' for no.2).\n* Defendant no.3 is also decreed in favor of the plaintiff based on a Settlement Agreement dated December 5, 2022.\n\n**Amounts Mentioned:**\n\n* Rs.2,00,000/- (awarded as costs against defendant no.1)\n* Not specified\n\n**Names and Court Details:**\n\n* ZINO DAVIDOFF SA (plaintiff)\n* BHALANI ENTERPRISES & ORS (defendants)\n* Amit Bansal, J. (Judge)",
          "content": "2023/DHC/000458 \n \nCS(COMM) 460/2016 \n                                                                                                      Page 7 of 7 \n \nAdditionally, Rs.2,00,000/- is awarded to the plaintiff as costs to be paid by \nthe defendant no.1.  \n19. \nThe defendants no.1 shall pay the said amount to the plaintiff within \neight weeks, failing which the plaintiff is permitted to commence execution \nproceedings against the defendant no.1.  \n20. \nAccordingly, the present suit is decreed against the defendant no.1 in \nterms of prayer clauses ‘a’, ‘e’ and ‘g’ of the plaint and against the \ndefendant no.2 in terms of prayer clause ‘a’ of the plaint.   \n21. \nCounsel for the plaintiff does not press for the reliefs contemplated in \nprayer clauses ‘b’, ‘c’, ‘d’ and ‘f’ of the plaint against the defendants no.1 \nand 2. \n22. \nInsofar as the defendant no.3 is concerned, the suit is decreed against \nthe defendant no.3 in terms of the Settlement Agreement dated 5th \nDecember, 2022. The said Settlement agreement shall form part of the \ndecree.  \n23.    Decree sheet be drawn up. \n24.    All pending applications stand disposed of. \n \n \n \nAMIT BANSAL, J. \nJANUARY 17, 2023 \nat \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:21.01.2023 17:07:53\nSignature Not Verified",
          "pdf_source": "12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-16T11:55:38.447895",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}