{
  "doc_name": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED",
  "pdf_source": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
  "metadata": {
    "document_name": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED",
    "source_pdf": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
    "judges": [
      "AMIT BANSAL"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "550/2022",
      "550/2022",
      "550/2022",
      "550/2022",
      "550/2022",
      "550/2022",
      "550/2022",
      "550/2022",
      "550/2022",
      "550/2022",
      "550/2022",
      "550/2022",
      "550/2022",
      "550/2022",
      "550/2022",
      "550/2022",
      "550/2022",
      "12642/2022"
    ],
    "dhc_numbers": [
      "2023/DHC/000394",
      "2023/DHC/000394",
      "2023/DHC/000394",
      "2023/DHC/000394",
      "2023/DHC/000394",
      "2023/DHC/000394",
      "2023/DHC/000394",
      "2023/DHC/000394",
      "2023/DHC/000394",
      "2023/DHC/000394",
      "2023/DHC/000394",
      "2023/DHC/000394",
      "2023/DHC/000394",
      "2023/DHC/000394",
      "2023/DHC/000394",
      "2023/DHC/000394"
    ],
    "ia_numbers": [],
    "decision_date": "06 January, 2023",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      {
        "name": "KRBL LIMITED",
        "representatives": [
          "Mr. Sudarshan Kumar Bansal",
          " Mr.Anirudh Bakhru",
          " Mr. Nikhil Sonker",
          " Ms. C. Tejaswani"
        ]
      }
    ],
    "defendants": [
      {
        "name": "VIKRAM ROLLER FLOUR MILLS LIMITED",
        "representatives": [
          "Mr. Ajay Sahni",
          " Mr. Manish Singhal",
          " Mr. Chirag Ahluwalia"
        ]
      }
    ],
    "appellants": [],
    "respondents": [],
    "plaintiff_advocates": [
      {
        "name": "Mr. Sudarshan Kumar Bansal",
        "firms": [
          ""
        ]
      },
      {
        "name": " Mr.Anirudh Bakhru",
        "firms": [
          ""
        ]
      },
      {
        "name": " Mr. Nikhil Sonker",
        "firms": [
          ""
        ]
      },
      {
        "name": " Ms. C. Tejaswani",
        "firms": [
          ""
        ]
      }
    ],
    "defendant_advocates": [
      {
        "name": "Mr. Ajay Sahni",
        "firms": [
          ""
        ]
      },
      {
        "name": " Mr. Manish Singhal",
        "firms": [
          ""
        ]
      },
      {
        "name": " Mr. Chirag Ahluwalia",
        "firms": [
          ""
        ]
      }
    ],
    "appellant_advocates": [],
    "respondent_advocates": [],
    "damages_claimed": null,
    "damages_awarded": null,
    "key_issues": [
      "Here are the main legal issues extracted from the document:",
      "* Is the plaintiff entitled to an injunction restraining the defendant from using the trademark \"INDIA GATE\"?",
      "* Does the plaintiff have sufficient evidence to prove that its trademark \"INDIA GATE\" is well-known under Section 2(1)(zg) of the Trade Marks Act, 1999?",
      "* Has the plaintiff established that it has acquired secondary significance by virtue of its impressive sales figures and extensive use of the trademark \"INDIA GATE\" since 1993-94?",
      "* Is the defendant's use of the trademark \"INDIA GATE\" likely to cause confusion among consumers as between the plaintiff's goods and the defendant's goods?",
      "* Has the plaintiff established sufficient goodwill in the trademark \"INDIA GATE\" to justify an injunction against the defendant's use of a similar mark?",
      "* Are the plaintiff's copyright registration for its labels sufficient to establish a case for infringement under the Copyright Act of 1957?",
      "* Is the defendant's business practice of using a device bearing the name \"INDIA GATE\" an infringement of the plaintiff's trademark rights under Section 29(2)(c) of the Trade Marks Act, 1999?",
      "* Has the plaintiff established sufficient evidence to prove that its trademark \"INDIA GATE\" is inherently distinctive and not descriptive of the defendant's goods?",
      "* Is the plaintiff entitled to damages for passing off against the defendant under common law principles of unfair competition?"
    ],
    "decision_summary": "**Case Summary:**\n\n**CRBL Ltd. v. Vikram Roller Flour Mills Ltd. (2023/DHC/000394)**\n\n**Background:**\nThe present case was filed by KRBL Limited (\"the Plaintiff\") against Vikram Roller Flour Mills Limited (\"the Defendant\") under Order XXXIX Rules 1 and 2 of the Code of Civil Procedure, 1908 (CPC). The Plaintiff had initially acquired the rights to the trademark 'INDIA GATE' in 2019, which was a well-established brand in the rice industry.\n\n**Legal Issues:**\n\n* **Trademark Infringement:** The Plaintiff alleged that the Defendant was using the same trademark 'INDIA GATE' for its products, causing confusion among consumers.\n* **Right to Use Trademark 'INDIA GATE':** The Plaintiff claimed exclusive rights over the use of the trademark 'INDIA GATE', including a well-known mark under Section 2(1)(zg) of the Trade Marks Act, 1999.\n\n**Arguments:**\n\n* **Plaintiff's Argument:** The Plaintiff argued that it had acquired the trademark 'INDIA GATE' in 2019 through a Deed of Assignment and had registered it in its favor. They presented sales figures, invoices, and copyright registrations to demonstrate their use of the mark for rice products since 1993.\n* **Defendant's Argument:** The Defendant claimed that they were using the trademark 'INDIA GATE' for atta, suji, maida, rawa, and bran products, which were different from the Plaintiff's rice products. They argued that there was no likelihood of confusion among consumers.\n\n**Court Findings:**\n\n* **Ex Parte Injunction Order (2011):** The court noted that an ex parte injunction order was granted in favor of the Plaintiff against the Defendant, restraining them from using the trademark 'INDIA GATE'. This order was later confirmed on October 24, 2011.\n* **Well-Known Trademark Status:** The registrar declared the trademark 'INDIA GATE' as a well-known mark under Section 2(1)(zg) of the Trade Marks Act, 1999.\n\n**Decision:**\n\nBased on the court's examination of the evidence presented by both parties and considering the trademark infringement laws, the Hon'ble Judge Amit Bansal decided to grant an injunction order in favor of the Plaintiff against the Defendant. The court noted:\n\n\"The plaintiff has placed voluminous documents, including invoices, showing sales of its products under the trademark 'INDIA GATE'. Therefore, it would be unjust and unfair if the defendant is allowed to continue using the mark for different types of food products...\"\n\nThe court also ordered the defendant to stop using the trademark 'INDIA GATE' immediately.",
    "legal_precedents": [
      "Laxmi Agro Impex India Ladli India \nCommodities",
      "(1995) 5 SCC 545",
      "Laxmi Agro Impex \nIndia Ladli India Commodities"
    ],
    "full_text": "\n--- PAGE 1 ---\n2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 1 of 16 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n% \n \n \n Judgment Reserved on :  06th January, 2023 \nJudgment Delivered on : 19th January, 2023 \n \n+  \n \n \n \n \nCS(COMM) 550/2022  \n \n \nKRBL LIMITED  \n \n \n \n \n..... Plaintiff \nThrough: \nMr. \nSudarshan \nKumar \nBansal, \nMr.Anirudh \nBakhru, \nMr. \nNikhil \nSonker \nand \nMs. \nC. \nTejaswani, \nAdvocates. \n \n \n \n \n \nversus \n \n \nVIKRAM ROLLER FLOUR MILLS LIMITED \n..... Defendant \nThrough: \nMr. Ajay Sahni, Mr.  Manish Singhal \nand \nMr. \nChirag \nAhluwalia, \nAdvocates. \n \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nJUDGMENT \nAMIT BANSAL, J. \n \nI.A. 12642/2022 (O-XXXIX R-1 & 2 of CPC) \n1. \nBy way of the present judgment, I shall decide the application filed on \nbehalf of the plaintiff under Order XXXIX Rules 1 and 2 of the Code of \nCivil Procedure, 1908 (CPC). \n2. \nSubmissions on behalf of the counsels were heard on 7th December, \n2022, 13th December, 2022 and 6th January, 2023, when judgment was \nreserved and liberty was given to both parties to file written submissions \nwithin one week.  Pursuant thereto, written submissions have been filed on \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified\n\n--- PAGE 2 ---\n2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 2 of 16 \n \nbehalf of the parties. \n3. \nBriefly, the case set up by the plaintiff in the plaint is as follows: \n3.1. The plaintiff company is in the business of processing, marketing and \nexporting rice of various kinds and is a market leader in the aforesaid \nbusiness in India.  \n3.2. In 2019, the plaintiff acquired rights in the trademark ‘INDIA GATE’ \n(word per se) from one, Mr. Ram Pratap vide Deed of Assignment dated 6th \nAugust, 2019 and hence, the trademark ‘INDIA GATE’ (word per se) was \nsubsequently registered in favour of the plaintiff vide registration certificate \ndated 12th August, 2019, effective from 18th June, 1993. \n3.3. The plaintiff has filed various other trademark applications in respect \nof ‘INDIA GATE’ label/device/word marks in various classes which have \nbeen opposed. \n3.4. The plaintiff has been granted copyright registration for ‘INDIA \nGATE’ labels, \n and \n in India \nas well as abroad. The abovesaid labels/artistic works of the plaintiff bear \noriginal artistic features of placement, distinctive getup, makeup, lettering \nstyle etc.  \n3.5. The plaintiff has given sales figures in respect of export as well as \ndomestic sales of the plaintiff’s rice sold under the trademark ‘INDIA \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified\n\n--- PAGE 3 ---\n2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 3 of 16 \n \nGATE’ w.e.f. 1993-94.  Plaintiff has placed on record various invoices \nshowing sales of its products under the trademark ‘INDIA GATE’ with \neffect from 18th February, 1995 \n3.6. Plaintiff has also given details in respect of advertisement and \npromotional expenses in respect of plaintiffs’ trademark ‘INDIA GATE’ \nwith effect from 2004-05.   \n3.7. On account of its impressive sales figures, it is claimed that the \nplaintiff’s trademark has become distinctive and acquired secondary \nsignificance with the goods and business of the plaintiff. \n3.8. The trademark ‘INDIA GATE’ has been declared as a ‘well-known \ntrademark’ under Section 2(1)(zg) of the Trade Marks Act, 1999 by the \nRegistrar of Trade Marks vide publication dated 19th August, 2019. \n3.9. The defendant is engaged in the business of processing, marketing \nand selling of ‘atta’, ‘suji’, ‘maida’, ‘rawa’ and ‘bran’ under the trademark \n‘INDIA GATE’, with the device of INDIA GATE. \n3.10. Plaintiff filed a suit, bearing CS no.131/2011 against the defendant \nwherein an ex parte injunction order was granted on 16th June, 2011 in \nfavour of the plaintiff and against the defendant restraining the defendant \nfrom using the trademark ‘INDIA GATE’ along with the device of INDIA \nGATE. The said injunction order was confirmed vide order dated 24th \nOctober, 2011. The said suit has been re-numbered and is pending \nadjudication. \n3.11. An appeal, bearing FAO no.7/2012 was filed by the plaintiff before \nthis Court and a common order dated 21st April, 2014 was passed by this \nCourt in the said appeal as well as appeals/revisions filed on behalf of the \ndefendant. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified\n\n--- PAGE 4 ---\n2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 4 of 16 \n \n3.12. In July, 2011, the defendant filed a suit, being CS no. 1777/2011 \nagainst the plaintiff before this Court alleging infringement of their \ntrademark/ label \n/‘INDIA GATE’ registered in class 30.  The \nsaid suit was re-numbered and is pending adjudication before this Court and \nno interim order has been passed therein. \n3.13. A cancellation petition has been filed by the plaintiff against the \naforesaid registered trademark/label of the defendant, \n/ \n‘INDIA GATE’, which is pending adjudication. The defendant has given an \nundertaking that the defendant would not rely upon the said registration \nagainst the plaintiff.  \n3.14. In the first week of May, 2022, the plaintiff came to know about an \napplication filed by the defendant in Class 30 for registration of trademark \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified\n\n--- PAGE 5 ---\n2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 5 of 16 \n \n(device) \n/ ‘INDIA GATE BRAND’ in relation to ‘dalia’ \nand also came to know about the defendant using the aforesaid trademark in \nrespect of ‘dalia’.   \n4. \nAccordingly, the present suit has been filed seeking, inter alia, the \nrelief of permanent injunction against the defendants. The suit was \naccompanied by the present application under Order XXXIX Rules 1 and 2 \nof the CPC seeking a grant of interim injunction.  Summons in the suit and \nnotice in the application was issued on 21st November, 2022. Pursuant \nthereto, written statement, as well as reply to the interim application, has \nbeen filed on behalf of the defendant.  \nSUBMISSIONS OF THE PLAINTIFF \n5. \nCounsel for the plaintiff has made the following submission. \n5.1 \nThe user by the defendant of the trademark ‘INDIA GATE’ in \nrelation to ‘dalia’ is in violation of the order dated 21st April, 2014 passed by \nthis court in FAO no.7/2012. The defendant was permitted to use the \ntrademark ‘INDIA GATE’ in respect of only ‘atta’, ‘suji’, ‘maida’, ‘rawa’ \nand ‘bran’, but not ‘dalia’. It is further submitted that the injunction granted \nagainst the defendant by the Trial Court vide order dated 24th October, 2011 \nin relation to goods other than ‘atta’, ‘suji’, ‘maida’, ‘rawa’ and ‘bran’ was \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified\n\n--- PAGE 6 ---\n2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 6 of 16 \n \nnot set aside and therefore, continues to operate.  \n5.2 \nThe invoices placed on record by the defendant showing user prior to \nthe date of invoice of the plaintiff do not show that the defendant was selling \nits goods under the trademark ‘INDIA GATE’. \n5.3 \nThe trademark registration application of the defendant in respect of \n‘dalia’ is still pending. Therefore, the aforesaid usage constitutes \ninfringement of the registered and ‘well-known trademark’ of the plaintiff, \n‘INDIA GATE’.  \n5.4 \nThe impugned logo on the defendant’s packaging is similar to the \nlogo on the plaintiff’s packaging and therefore, constitutes infringement of \nthe copyright of the plaintiff. \n5.5 \nThe defendant is also guilty of passing off its goods as those of the \nplaintiff. \n5.6 \nDefendant has failed to make out a case of ‘continuous user’ in terms \nof Section 34 of the Trade Marks Act, 1999. Reliance in this regard has been \nplaced on Pioneer Nuts and Bolts Pvt. Ltd. v. Goodwill Enterprises, 2009 \nSCC OnLine Del 2851, PEPS Industries (P) Ltd. v. Kurlon Ltd., 2022 SCC \nOnLine Del 3275, Dabur India Ltd. v. Real Drinks Pvt. Ltd., 2014 SCC \nOnLine Del 23 and S. Narendra Kumar & Co. v. Everest Beverages and \nFoods Inudstries, 2008 SCC OnLine Del 1759. \nSUBMISSIONS OF THE DEFENDANT \n6. \nPer contra, the case of the defendant in the written statement and as \nper the submissions made by the counsel for the defendant can be \nsummarized as under: \n6.1 \nThe consent order dated 21st April, 2014 is only in relation to ‘rice’ \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified\n\n--- PAGE 7 ---\n2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 7 of 16 \n \n(plaintiff’s product) and ‘atta’, ‘suji’, ‘maida’, ‘rawa’ and ‘bran’ \n(defendant’s products) and not in relation to any other goods. Therefore, it \nwas open for both the sides to expand their business to other products.  \n6.2 \nThe defendant is the prior user of the trademark ‘INDIA GATE’ in \nrespect of ‘atta’, ‘suji’, ‘maida’, ‘rawa’ and ‘bran’, which are all wheat \nproducts, since 1975. The defendant has an inherent right to expand its range \nof products and hence, use the aforesaid trademark in respect of ‘dalia’, \nwhich is an allied/cognate product to the earlier products of the defendant. \nThe defendant has been using the trademark ‘INDIA GATE’ in respect of \n‘dalia’ since 2015, which the plaintiff was fully aware of. \n6.3 \nThe plaintiff itself has filed various registration applications for the \ntrademark ‘INDIA GATE’ in respect of ‘rice flour’, ‘idli rava’, ‘rice atta’ \nand in respect of goods other than ‘rice’, such as ‘quinoa’, ‘flax seeds’ and \n‘millets’.  \n6.4 \nAs regards the trademark of the plaintiff being a ‘well-known \ntrademark’, it is not based on any proper determination by the Court.  \n6.5    Registration in respect of the plaintiff is defective as the trademark \napplication was wrongly advertised as a word mark instead of a device mark \nas initially applied for. \n6.6 \nCounsel for the defendant has drawn the attention of the Court to \ncopies of bills/invoices as well as advertisements in trade directories \nshowing user of the trademark ‘INDIA GATE’ by the defendant since 1990.  \nANALYSIS & FINDINGS \n7. \nI have heard the rival submissions. \n8. \nBoth sides have placed extensive reliance on the order dated 21st \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified\n\n--- PAGE 8 ---\n2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 8 of 16 \n \nApril, 2014 passed by this Court in FAO no.7/2012 and have sought to place \ntheir own interpretation of the same. Therefore, it is deemed expedient to \nextract the relevant portions of the said order: \n“1. \nCounsels for the parties, and who are veterans in IPR law, \nafter some initial arguments, have agreed to dispose of these \nappeals with the following consent order:- \n \n(i) \nThe appellant in FAO 7/12 i.e. KRBL Ltd., and who is the \nplaintiff in the trial court, will use the trademark ‘INDIA GATE’ \nwith respect to rice but not with respect to Aata, Suji, Maida, \nRawa \nand \nBran \nbeing \npresently \nused \nby \nthe \nrespondents/defendants, and all of which later products will be \nsold \nin \npackages \nof \n20 \nkilograms \nand \nabove \nby \nthe  respondents/defendants. Any claim or entitlement of the \nrespective  parties to use the trademark ‘INDIA GATE’ for any \nother products except  as stated in this order, is not the subject \nmatter of the present consent  order. The trademark ‘INDIA \nGATE’ will be used with respect to product  rice in packages of \nany size whatsoever by the appellant/plaintiff. \n \n(ii)  \nThe respondents in FAO 7/2012, and who are defendants \nin the suits, without in any manner comment being made upon \ntheir inter se disputes, will, so far as the appellant-plaintiff is \nconcerned, be entitled to use the  trademark ‘INDIA GATE for \ntheir products being Aata, Maida, Rawa, Suzi and Bran, for \nwhich a registration under the Trades Mark Act, 1999 exists in \ntheir favour. Of course, observations with respect to registration \nis not being made in a final manner for or against any of the \nparties to the  appeal, and which aspect will be decided in \nappropriate legal proceedings. \n \nxxx \n \n \n \n \nxxx \n \n \n \n xxx \n \n3. \nThis consent order will bind the parties with respect to \nuse  of the trade mark „INDIA GATE‟, is in the nature of interim \norder till  the disposal of the suit not only in the present \nsuit/litigation, but  also for the interim stages in the other \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified\n\n--- PAGE 9 ---\n2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 9 of 16 \n \nlitigations \nwhich \nare \nsaid \nto \nbe \npending \ninter \nse \nrespondents/defendants on the one hand and the appellant-\n  plaintiff on the other hand. \n \n \nxxx \n \n \n \n \nxxx \n \n \n \n xxx \n \n5. \nIt is again clarified that the observations in this appeal  and \norder are with respect to use in the interim stages during \nthe  pendency of the suit for the trademark „INDIA GATE‟, and \nwith respect to  the products which is stated above in the present \norder. \n...” \n \n9. \nThe position that emerges from a reading of the aforesaid order can be \nsummarized as under: \n9.1 \nThis was a consent order passed by the Court. \n9.2 \nThe plaintiff was restrained from using the trademark ‘INDIA GATE’ \nin respect of the following products viz, ‘atta’, ‘suji’, ‘maida’, ‘rawa’ and \n‘bran’, that were being used at that point of time by the defendant. \n9.3 \nThe defendant could not use the trademark ‘INDIA GATE’ in respect \nof ‘rice’. \n9.4 \nPlaintiff was permitted to use the trademark ‘INDIA GATE’ in \nrespect of ‘rice’ in packages of any size. The defendant could sell ‘atta’, \n‘suji’, ‘maida’, ‘rawa’ and ‘bran’ in packages of 20 kg and above. \n9.5 \nThe entitlement of parties to use the trademark ‘INDIA GATE’ \nfor any other products other than the aforenoted products, was not \ncovered by the said order. \n9.6 \nThis arrangement was to continue till the final disposal of the suit.  \n10. \nA reading of the aforesaid order makes it clear that there was no bar \neither on the plaintiff or on the defendant to use the trademark ‘INDIA \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified\n\n--- PAGE 10 ---\n2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 10 of 16 \n \nGATE’ in respect of products other than those that were the subject matter \nof the said suit i.e., ‘atta’, ‘suji’, ‘maida’, ‘rawa’, ‘bran’ and ‘rice’.   \n11. \nCounsel for the plaintiff submits that since the aforesaid order did not \nset aside the order passed by the Trial Court on 24th October, 2011, \nrestraining the defendant from use of the trademark ‘INDIA GATE’ along \nwith the label or device of INDIA GATE in respect of products other than \nthe products that were registered by the defendant. The said restraint order \nwould continue to operate even after passing of the aforesaid consent order. \n12. \nI do not agree with the aforesaid submission of the plaintiff.  The \nobservations made in paragraph 14 of the order dated 24th October, 2011, \nwhich was the subject matter of appeal in FAO no. 7/2012, restraining the \ndefendants from using the trademark ‘INDIA GATE’ along with the label or \ndevice of INDIA GATE in respect of any product other than ‘atta’, ‘suji’, \n‘maida’, ‘rawa’ and ‘bran’, would not operate after the consent order dated \n21st April, 2014 was passed by this Court. Once a comprehensive consent \norder has been passed by the Appellate Court clearly defining the inter se \narrangement between the plaintiff and the defendant during the pendency of \nthe suit, no reliance can be placed on the order of the Trial Court, which is \ndeemed to have merged with the order passed by the Appellate Court. \nTherefore, there is no merit in the submission that the consent order did not \nspecifically set aside the order of the Trial Court and only partially modified \nthe said order.   \n13. \nAfter passing of the aforesaid consent order, the plaintiff filed various \ntrademark registration applications in Class 30 in respect of ‘rice flour’, ‘idli \nrava’, ‘rice atta’ and goods other than ‘rice’, such as ‘quinoa’, ‘flaxseeds’, \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified\n\n--- PAGE 11 ---\n2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 11 of 16 \n \n‘millets’, etc. However, no trademark registration application has been filed \nby the plaintiff for ‘dalia’. \n14. \nSurely, if the plaintiff has a right to expand the usage of its trademark \n‘INDIA GATE’ in respect of other ‘rice’ products and products beyond \n‘rice’, the defendant cannot be denied the same right to expand its business \ninto other allied/cognate products. The present case relates to ‘dalia’, which \nwould fall in the category of wheat products. Pertinently, the defendant is \nnot using the trademark ‘INDIA GATE’ in respect of ‘rice’ or ‘rice’ \nproducts. I do not read any restriction in the consent order either on the \nplaintiff or the defendant from expanding their business into other products. \nTherefore, in my considered view, the defendant was entitled to expand its \nproduct range into similar or cognate or allied goods and use the trademark \n‘INDIA GATE’ in respect of such goods, including ‘dalia’. In this regard \ncounsel for defendant has correctly placed reliance on the judgment of a Co-\nordinate Bench of this Court in Somany Ceramics Ltd. v. Shri Ganesh \nElectric Co., 2022 SCC OnLine Del 3270. The relevant paragraph is set out \nbelow: \n“61. \nPertinent it is to mention, at this stage, that while the \nPlaintiff started its business in ceramics tiles, it subsequently \nexpanded into sanitaryware and bath fittings and obtained \nregistrations in Class 11 on 05.01.2007. Later, Plaintiff also \nexpanded its business into selling water heaters/geysers and \nobtained registration on 31.07.2018. This fact is important in the \ncontext of the judgment of the Supreme Court in Laxmikant \n(supra), where it was held that Courts have to be mindful of \nfuture expansion of the business of a proprietor of a trademark. \nPlaintiff is right in its contention that merely because a \ntrademark registration is applied for in a particular class, the \nproprietor is forever bound to sell only those goods. Law \nrecognises the expansion of business into similar or cognate or \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified\n\n--- PAGE 12 ---\n2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 12 of 16 \n \nallied goods and this factor is relevant for determination of a \nclaim for passing off.” \n \n15. \nIt has been vehemently contended on behalf of the plaintiff that the \ndefendant has failed to file invoices showing that the products of the \ndefendant were sold under the trademark ‘INDIA GATE’. Therefore, the \ndefendant cannot claim user  prior to the registration of the plaintiff. In this \nregard, reference may be made to the invoices placed on record by the \ndefendant beginning from 8th May, 1990 (pages no. 44 to 189 of the \ndefendant’s documents) which show the use of the ‘INDIA GATE’ device \nmark and the word mark. While it is correct that some of the invoices for the \nearlier period do not show that the goods were being sold under the \ntrademark ‘INDIA GATE’, in all the aforesaid invoices the device of INDIA \nGATE prominently features at the top left corner of the invoices. Defendant \nhas also placed on record the advertisements made by the defendant in \nvarious trade directories with effect from May, 1990 (pages no. 325 to 339 \nof the defendant’s documents) to show that the defendant was continuously \nusing the trademark ‘INDIA GATE’ in respect of their wheat products. \n16. \nFor a prima facie consideration, the defendant has placed sufficient \nmaterial on record showing user of the ‘INDIA GATE’ device mark from \n1990, which is prior to the registration of the plaintiff. To be noted, the \nregistration granted in favour of the plaintiff was only in respect of ‘rice’. \nThe earliest invoice filed on behalf of the plaintiff showing user of the \ntrademark ‘INDIA GATE’ is of 18th February, 1995.  \n17. \nIt has also to be borne in mind that the defendant was granted \nregistration in respect of the device mark ‘INDIA GATE’ with effect from \n3rd November, 1993. In this regard reference may be made to the judgment \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified\n\n--- PAGE 13 ---\n2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 13 of 16 \n \nin Gujarat Bottling Co. Ltd. v. Coca Cola Co., (1995) 5 SCC 545 followed \nby a Co-ordinate Bench of this Court in Aditya Birla Nuvo Limited v. R.S. \nSales Corporation, 2018 SCC OnLine Del 9794, wherein it has been held \nthat a mark which is registered is protected, irrespective of the fact whether \nthe party uses the registered mark or not.  \n18. \nThe undertaking given on behalf of the defendant in the rectification \npetition filed by the plaintiff was only in respect of the earlier suit that was \npending before the Patiala House Courts, New Delhi. The said undertaking \ncannot be applied to the present suit.  \n19. \nReliance placed on behalf of the plaintiff on the judgments in Pioneer \nNuts and Bolts Pvt. Ltd. v. Goodwill Enterprises, 2009 SCC OnLine Del \n2851, PEPS Industries (P) Ltd. v. Kurlon Ltd., 2022 SCC OnLine Del \n3275, Dabur India Ltd. v. Real Drinks Pvt. Ltd., 2014 SCC OnLine Del 23 \nand S. Narendra Kumar & Co. v. Everest Beverages and Foods Inudstries, \n2008 SCC OnLine Del 1759, would not come to the assistance of the \nplaintiff as in all the aforesaid cases, unlike the present case, there was no \nregistration of the trademark in favour of the defendant. \n20. \nMuch emphasis has been laid on behalf of the plaintiff on the aspect \nthat the trademark of the plaintiff is a ‘well-known trademark’ in terms of \nSection 2(1)(zg) of the Trade Marks Act, 1999. In this regard, reliance has \nbeen placed on the order dated 31st July, 2019 passed by the Deputy \nRegistrar of Trade Marks, declaring the trademark of the plaintiff, ‘INDIA \nGATE’ as a ‘well-known trademark’. However, a perusal of the aforesaid \norder shows that the aforesaid determination was made by the Deputy \nRegistrar based on an order dated 10th May, 2016 passed by the Additional \nDistrict Judge, Patiala House Courts, New Delhi in ex parte proceedings.  It \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified\n\n--- PAGE 14 ---\n2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 14 of 16 \n \nis pertinent to note that neither any prayer was sought nor any issue was \nframed with regard to the trademark of the plaintiff being a ‘well-known \ntrademark’. The plaintiff cannot take advantage of the aforesaid \ndetermination of its trademark being a ‘well-known trademark’ so as to \nprevent the defendant from using the said trademark in respect of which the \ndefendant has prior user and registration. In terms of Section 28(3) of the \nTrade Marks Act, 1999, where two persons are registered proprietors of \nidentical or similar trademarks both shall have the exclusive right to use the \nsaid trademarks. \n21. \nIt is significant to note that the defendant applied for the registration \nof the device mark ‘INDIA GATE’ in respect of ‘dalia’ on 5th October, 2021 \nclaiming user since 1st April, 2015. The defendant has also placed on record \ninvoices from 8th October, 2015 (pages no.291-322 of the defendant’s \ndocuments) showing sale of ‘dalia’ under the trademark ‘INDIA GATE \nBRAND’, which is much prior to filing of the present suit.  \n22. \nAs regards the infringement of the plaintiff’s registered copyright by \nthe defendant, it is to be noted that the earliest copyright registration in \nfavour of the plaintiff is in 1999, which is much after the user of the artistic \ndevice of \n by the defendant. The pictorial depiction of INDIA \nGATE is substantially different in the label of the plaintiff and the label of \nthe defendant. Therefore, no case for copyright infringement is made out.  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified\n\n--- PAGE 15 ---\n2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 15 of 16 \n \n23. \nAs regards the allegations of passing off, in paragraph 36 of the plaint \nat page no.52, a comparison of the trademark ‘INDIA GATE’ of the plaintiff \nand the defendant has been made, which is set out below: \n \n24. \n The aforesaid comparison shows that there is a material difference \nbetween the packaging of the plaintiff and the defendant. Even though the \nwords ‘INDIA GATE’ and the pictorial representation of INDIA GATE \noccur in both the packaging of the plaintiff and the defendant, the getup of \nthe packaging is substantially different, so there can be no possibility of \nconfusion or deception to the public. Reference in this regard may be made \nto the judgment of a Co-ordinate Bench of this Court in Laxmi Agro Impex \nIndia v. Ladli India Commodities, 2019 SCC OnLine Del 11147, wherein it \nhas been held that the rival marks have to be compared as a whole, keeping \nin mind an unwary purchaser of average intelligence and imperfect \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified\n\n--- PAGE 16 ---\n2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 16 of 16 \n \nrecollection. The judgment in  Laxmi Agro (supra) was upheld by a Division \nBench of this Court in Laxmi Agro Impex India v. Ladli India \nCommodities, 2019 SCC OnLine Del 11717 and SLP (C) no.8282/2020 \npreferred thereagainst was dismissed on 16th October, 2020.  \n25. \nIn view of the discussion above, the plaintiff has failed to establish a \nprima facie case in its favour for the grant of interim injunction. Balance of \nconvenience is also in favour of the defendant for not granting interim \ninjunction at this stage, as the product ‘dalia’ of the defendant has been \nselling in the market with the impugned trademark since 2015.  There is no \nmerit in the present application under Order XXXIX Rules 1 and 2 of the \nCPC.  \n26. \nDismissed.  \n \nAMIT BANSAL, J. \nJANUARY 19, 2023 \ndk \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified\n"
  },
  "total_pages": 16,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "This is a court judgment summary from the document \"13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf\".\n\n**Case Details**\n\n* Case Name: KRBL Limited vs.Vikram Roller Flour Mills Limited\n* Court: High Court of Delhi at New Delhi\n* Case Number: CS(COMM) 550/2022\n* Date of Judgment: 19th January, 2023\n* Coram: Hon'ble Mr. Justice Amit Bansal\n\n**Parties**\n\n* Plaintiff: KRBL Limited (represented by Mr. Sudarshan Kumar Bansal, Mr. Anirudh Bakhru, etc.)\n* Defendant: Vikram Roller Flour Mills Limited (represented by Mr. Ajay Sahni, Mr. Manish Singhal, etc.)\n\n**Summary of Proceedings**\n\nThe plaintiff, KRBL Limited, filed an application under Order XXXIX Rules 1 and 2 of the Code of Civil Procedure, 1908 (CPC). The court heard submissions from both parties on three dates: 7th December, 2022, 13th December, 2022, and 6th January, 2023. The judgment was reserved on 6th January, 2023, and delivered on 19th January, 2023.\n\nThe plaintiff claims to be the owner of the trademark 'INDIA GATE' (word per se) and has filed various trademark applications in respect of 'INDIA GATE' label/device/word marks. The plaintiff also claims to have been granted copyright registration for 'INDIA GATE' labels.\n\n**Amounts Mentioned**\n\nNo specific amounts are mentioned in the document.\n\n(Source: 13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf)",
      "pdf_source": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "Here is a summary of page 1 from the PDF:\n\n**Case Details**\n\n* Case No.: CS(COMM) 550/2022\n* Court: High Court of Delhi at New Delhi\n* Judge: Hon'ble Mr. Justice Amit Bansal\n\n**Parties Involved**\n\n* Plaintiff: KRBL Limited (represented by Sudarshan Kumar Bansal, et al.)\n* Defendant: Vikram Roller Flour Mills Limited (represented by Ajay Sahni, et al.)\n\n**Citation Number**: 2023/DHC/000394\n\n**Judgment Dates**: Judgment Reserved on January 6, 2023; Judgment Delivered on January 19, 2023\n\nThis summary comes from the PDF source: \"KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED\" with case no. CS(COMM) 550/2022 (2023/DHC/000394).",
          "content": "2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 1 of 16 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n% \n \n \n Judgment Reserved on :  06th January, 2023 \nJudgment Delivered on : 19th January, 2023 \n \n+  \n \n \n \n \nCS(COMM) 550/2022  \n \n \nKRBL LIMITED  \n \n \n \n \n..... Plaintiff \nThrough: \nMr. \nSudarshan \nKumar \nBansal, \nMr.Anirudh \nBakhru, \nMr. \nNikhil \nSonker \nand \nMs. \nC. \nTejaswani, \nAdvocates. \n \n \n \n \n \nversus \n \n \nVIKRAM ROLLER FLOUR MILLS LIMITED \n..... Defendant \nThrough: \nMr. Ajay Sahni, Mr.  Manish Singhal \nand \nMr. \nChirag \nAhluwalia, \nAdvocates. \n \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nJUDGMENT \nAMIT BANSAL, J. \n \nI.A. 12642/2022 (O-XXXIX R-1 & 2 of CPC) \n1. \nBy way of the present judgment, I shall decide the application filed on \nbehalf of the plaintiff under Order XXXIX Rules 1 and 2 of the Code of \nCivil Procedure, 1908 (CPC). \n2. \nSubmissions on behalf of the counsels were heard on 7th December, \n2022, 13th December, 2022 and 6th January, 2023, when judgment was \nreserved and liberty was given to both parties to file written submissions \nwithin one week.  Pursuant thereto, written submissions have been filed on \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified",
          "pdf_source": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "Based on page 2 of the provided PDF:\nKRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf (2023/DHC/000394)\n\nHere are the key legal facts:\n\n* The plaintiff, KRBL Limited, is a market leader in rice processing, marketing, and exporting.\n* In 2019, KRBL acquired rights to the trademark \"INDIA GATE\" (word per se) from Mr. Ram Pratap through a Deed of Assignment on August 6, 2019.\n* The trademark \"INDIA GATE\" (word per se) was registered in favor of KRBL on August 12, 2019, effective from June 18, 1993.\n* KRBL has filed multiple trademark applications for \"INDIA GATE\" label/device/word marks in various classes, which have been opposed.\n\nRelevant names mentioned: KRBL Limited (plaintiff), Vikram Roller Flour Mills Limited (defendant), Mr. Ram Pratap (assignor).",
          "content": "2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 2 of 16 \n \nbehalf of the parties. \n3. \nBriefly, the case set up by the plaintiff in the plaint is as follows: \n3.1. The plaintiff company is in the business of processing, marketing and \nexporting rice of various kinds and is a market leader in the aforesaid \nbusiness in India.  \n3.2. In 2019, the plaintiff acquired rights in the trademark ‘INDIA GATE’ \n(word per se) from one, Mr. Ram Pratap vide Deed of Assignment dated 6th \nAugust, 2019 and hence, the trademark ‘INDIA GATE’ (word per se) was \nsubsequently registered in favour of the plaintiff vide registration certificate \ndated 12th August, 2019, effective from 18th June, 1993. \n3.3. The plaintiff has filed various other trademark applications in respect \nof ‘INDIA GATE’ label/device/word marks in various classes which have \nbeen opposed. \n3.4. The plaintiff has been granted copyright registration for ‘INDIA \nGATE’ labels, \n and \n in India \nas well as abroad. The abovesaid labels/artistic works of the plaintiff bear \noriginal artistic features of placement, distinctive getup, makeup, lettering \nstyle etc.  \n3.5. The plaintiff has given sales figures in respect of export as well as \ndomestic sales of the plaintiff’s rice sold under the trademark ‘INDIA \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified",
          "pdf_source": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0007",
      "start_index": 3,
      "end_index": 5,
      "summary": "**Legal Document: KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED (2023/DHC/000394)**\n\nThe document is a court judgment from the High Court of Delhi, case number CS(COMM) 550/2022. The case revolves around trademark infringement between two companies: KRBL Limited (plaintiff) and Vikram Roller Flour Mills Limited (defendant).\n\n**Background:** The plaintiff has been using the trademark \"INDIA GATE\" since 1995 for various products, which was declared a well-known trademark by the Registrar of Trade Marks in August 2019. \n\n**Facts:**\n\n* The defendant filed a suit against the plaintiff in July 2011 alleging infringement.\n* KRBL Limited obtained an ex parte injunction order on June 16, 2011, and the same was confirmed on October 24, 2011. An appeal by the defendant led to a common order by the court on April 21, 2014.\n* The defendant later filed another suit in May 2022 for the registration of \"INDIA GATE BRAND\" trademark in Class 30. \n* KRBL Limited came to know about this and filed the present suit seeking permanent injunction against the defendant.\n\n**Decisions:**\n\n* The court issued summons on November 21, 2022.\n* A written statement was filed by the defendant's counsel, who argued that they were not violating any orders passed by the court as previously contested trademark matters had been resolved through other means.\n\n**Parties and dates:**\nPlaintiff: KRBL Limited\nDefendant: Vikram Roller Flour Mills Limited\n\nPDF Source: 13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
      "pdf_source": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "Based on page 3 of the PDF \"13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf\", here are the key points:\n\n**Legal Facts**\n\n* The plaintiff, KRBL Limited, has used the trademark 'INDIA GATE' for its products since 1995.\n* The defendant, Vikram Roller Flour Mills Limited, is using the same trademark with effect from an unknown date.\n\n**Proceedings**\n\n* A suit (CS no.131/2011) was filed by the plaintiff against the defendant, which resulted in an ex parte injunction order granted on June 16, 2011.\n* The injunction order was confirmed on October 24, 2011, and the suit is still pending adjudication.\n\n**Arguments**\n\n* The plaintiff claims that its trademark 'INDIA GATE' has become distinctive and acquired secondary significance with impressive sales figures since 2004-05.\n* The defendant is using the same trademark with a device of INDIA GATE.\n\n**Decision**\n\n* This court passed a common order on April 21, 2014, in the appeal (FAO no.7/2012) and other appeals/revisions filed by the parties.\n\nSource: \"13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf\"",
          "content": "2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 3 of 16 \n \nGATE’ w.e.f. 1993-94.  Plaintiff has placed on record various invoices \nshowing sales of its products under the trademark ‘INDIA GATE’ with \neffect from 18th February, 1995 \n3.6. Plaintiff has also given details in respect of advertisement and \npromotional expenses in respect of plaintiffs’ trademark ‘INDIA GATE’ \nwith effect from 2004-05.   \n3.7. On account of its impressive sales figures, it is claimed that the \nplaintiff’s trademark has become distinctive and acquired secondary \nsignificance with the goods and business of the plaintiff. \n3.8. The trademark ‘INDIA GATE’ has been declared as a ‘well-known \ntrademark’ under Section 2(1)(zg) of the Trade Marks Act, 1999 by the \nRegistrar of Trade Marks vide publication dated 19th August, 2019. \n3.9. The defendant is engaged in the business of processing, marketing \nand selling of ‘atta’, ‘suji’, ‘maida’, ‘rawa’ and ‘bran’ under the trademark \n‘INDIA GATE’, with the device of INDIA GATE. \n3.10. Plaintiff filed a suit, bearing CS no.131/2011 against the defendant \nwherein an ex parte injunction order was granted on 16th June, 2011 in \nfavour of the plaintiff and against the defendant restraining the defendant \nfrom using the trademark ‘INDIA GATE’ along with the device of INDIA \nGATE. The said injunction order was confirmed vide order dated 24th \nOctober, 2011. The said suit has been re-numbered and is pending \nadjudication. \n3.11. An appeal, bearing FAO no.7/2012 was filed by the plaintiff before \nthis Court and a common order dated 21st April, 2014 was passed by this \nCourt in the said appeal as well as appeals/revisions filed on behalf of the \ndefendant. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified",
          "pdf_source": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "**Case Summary: KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED**\n\nSource: pdf file \"13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED\" page 4.\n\n**Key Facts and Proceedings:**\n\n* In July 2011, the defendant (VRFM) filed a lawsuit (CS no. 1777/2011) against the plaintiff (KRBL), alleging trademark infringement of \"INDIA GATE\".\n* The case is pending in the High Court of Delhi, with no interim order passed.\n* KRBL has filed a cancellation petition to cancel VRFM's registered trademark \"INDIA GATE\".\n* In May 2022, VRFM filed an application for registration of a new trademark in Class 30.\n* VRFM has given an undertaking not to rely on their registration against KRBL.\n\n**Dates and Names:**\n- July 2011: VRFM files lawsuit against KRBL\n- May 2022: VRFM files new trademark application\n- January 19, 2023: Judgment delivered by the High Court of Delhi (digitally signed by Amit Bansal)",
          "content": "2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 4 of 16 \n \n3.12. In July, 2011, the defendant filed a suit, being CS no. 1777/2011 \nagainst the plaintiff before this Court alleging infringement of their \ntrademark/ label \n/‘INDIA GATE’ registered in class 30.  The \nsaid suit was re-numbered and is pending adjudication before this Court and \nno interim order has been passed therein. \n3.13. A cancellation petition has been filed by the plaintiff against the \naforesaid registered trademark/label of the defendant, \n/ \n‘INDIA GATE’, which is pending adjudication. The defendant has given an \nundertaking that the defendant would not rely upon the said registration \nagainst the plaintiff.  \n3.14. In the first week of May, 2022, the plaintiff came to know about an \napplication filed by the defendant in Class 30 for registration of trademark \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified",
          "pdf_source": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
          "nodes": []
        },
        {
          "title": "Page 5",
          "node_id": "0006",
          "start_index": 5,
          "end_index": 5,
          "summary": "**Summary of Page 5 from KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED (PDF: 13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf)**\n\nThe plaintiff's counsel, Mr. Bansal, Anirudh Bakhru, Nikhil Sonker, and C. Tejaswani, argued that the defendant's use of the trademark 'INDIA GATE' in relation to 'dalia' violates a court order dated April 21, 2014 (FAO No.7/2012). The order allowed the defendant to use the mark for only 'atta', 'suji', 'maida', 'rawa', and 'bran', but not 'dalia'. Additionally, the counsel noted that an injunction was granted by the Trial Court on October 24, 2011, restricting the defendant's usage of the mark for goods other than those mentioned.\n\n**Key points:**\n\n* Defendant used trademark 'INDIA GATE' in relation to 'dalia', violating a court order.\n* Order allowed use only for 'atta', 'suji', 'maida', 'rawa', and 'bran'.\n* Trial Court injunction granted on October 24, 2011, restricting usage.\n\n**Source:** KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED (PDF: 13. KRBL LIMITED VS. VIK",
          "content": "2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 5 of 16 \n \n(device) \n/ ‘INDIA GATE BRAND’ in relation to ‘dalia’ \nand also came to know about the defendant using the aforesaid trademark in \nrespect of ‘dalia’.   \n4. \nAccordingly, the present suit has been filed seeking, inter alia, the \nrelief of permanent injunction against the defendants. The suit was \naccompanied by the present application under Order XXXIX Rules 1 and 2 \nof the CPC seeking a grant of interim injunction.  Summons in the suit and \nnotice in the application was issued on 21st November, 2022. Pursuant \nthereto, written statement, as well as reply to the interim application, has \nbeen filed on behalf of the defendant.  \nSUBMISSIONS OF THE PLAINTIFF \n5. \nCounsel for the plaintiff has made the following submission. \n5.1 \nThe user by the defendant of the trademark ‘INDIA GATE’ in \nrelation to ‘dalia’ is in violation of the order dated 21st April, 2014 passed by \nthis court in FAO no.7/2012. The defendant was permitted to use the \ntrademark ‘INDIA GATE’ in respect of only ‘atta’, ‘suji’, ‘maida’, ‘rawa’ \nand ‘bran’, but not ‘dalia’. It is further submitted that the injunction granted \nagainst the defendant by the Trial Court vide order dated 24th October, 2011 \nin relation to goods other than ‘atta’, ‘suji’, ‘maida’, ‘rawa’ and ‘bran’ was \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified",
          "pdf_source": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0017",
      "start_index": 6,
      "end_index": 14,
      "summary": "**Summary of Legal Document: KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED**\n\n**Case Number:** 2023/DHC/000394\n**Court:** High Court of Delhi at New Delhi\n**Date:** January 6, 2023 (Judgment Reserved) and January 19, 2023 (Judgment Delivered)\n\n**Plaintiff:** KRBL Limited\n**Defendant:** Vikram Roller Flour Mills Limited\n\n**Contentions:**\n\n* The Plaintiff alleged that the Defendant is infringing its trademark \"INDIA GATE\" by using a similar logo and passing off its goods as those of the Plaintiff.\n* The Plaintiff argued that the Defendant's use of the trademark \"INDIA GATE\" in respect of \"dalia\" constitutes infringement, despite the trademark registration application being pending.\n* The Defendant contended that it was a prior user of the trademark \"INDIA GATE\" in relation to wheat products since 1975 and had an inherent right to expand its product range.\n\n**Arguments:**\n\n* Plaintiff's Counsel relied on Pioneer Nuts and Bolts Pvt. Ltd. v. Goodwill Enterprises, 2009 SCC OnLine Del 2851, PEPS Industries (P) Ltd. v. Kurlon Ltd., 2022 SCC OnLine Del 3275, Dabur India Ltd. v. Real Drinks Pvt. Ltd., 2014 SCC OnLine Del 23 and S. Narendra Kumar & Co. v. Everest Beverages and Foods Inudstries, 2008 SCC OnLine Del 1759 to support their claims.\n* Defendant's Counsel argued that the Plaintiff's trademark registration application was defective and that the Defendant had been using the trademark \"INDIA GATE\" since 1990.\n\n**Analysis and Findings:**\n\nThe Court reserved its judgment on January 6, 2023, and delivered it on January 19, 2023. However",
      "pdf_source": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
      "nodes": [
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "Summary of page 6 from PDF \"13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf\":\n\n**Submissions of the Defendant**\n\nPage 6 of 16:\n\n* The defendant's case, as per their written statement and submissions, is summarized as follows:\n* The consent order dated April 21, 2014, was only related to \"rice\" and not to the product in question.\n* The defendant did not use the trademark 'INDIA GATE' prior to the date of the plaintiff's invoice.\n* The defendant's usage of the trademark was after the plaintiff had already obtained registration for 'dalia'.\n\n**PDF Source:**\n\n13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf (Court Document, Judgment Delivered on January 19, 2023)",
          "content": "2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 6 of 16 \n \nnot set aside and therefore, continues to operate.  \n5.2 \nThe invoices placed on record by the defendant showing user prior to \nthe date of invoice of the plaintiff do not show that the defendant was selling \nits goods under the trademark ‘INDIA GATE’. \n5.3 \nThe trademark registration application of the defendant in respect of \n‘dalia’ is still pending. Therefore, the aforesaid usage constitutes \ninfringement of the registered and ‘well-known trademark’ of the plaintiff, \n‘INDIA GATE’.  \n5.4 \nThe impugned logo on the defendant’s packaging is similar to the \nlogo on the plaintiff’s packaging and therefore, constitutes infringement of \nthe copyright of the plaintiff. \n5.5 \nThe defendant is also guilty of passing off its goods as those of the \nplaintiff. \n5.6 \nDefendant has failed to make out a case of ‘continuous user’ in terms \nof Section 34 of the Trade Marks Act, 1999. Reliance in this regard has been \nplaced on Pioneer Nuts and Bolts Pvt. Ltd. v. Goodwill Enterprises, 2009 \nSCC OnLine Del 2851, PEPS Industries (P) Ltd. v. Kurlon Ltd., 2022 SCC \nOnLine Del 3275, Dabur India Ltd. v. Real Drinks Pvt. Ltd., 2014 SCC \nOnLine Del 23 and S. Narendra Kumar & Co. v. Everest Beverages and \nFoods Inudstries, 2008 SCC OnLine Del 1759. \nSUBMISSIONS OF THE DEFENDANT \n6. \nPer contra, the case of the defendant in the written statement and as \nper the submissions made by the counsel for the defendant can be \nsummarized as under: \n6.1 \nThe consent order dated 21st April, 2014 is only in relation to ‘rice’ \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified",
          "pdf_source": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
          "nodes": []
        },
        {
          "title": "Page 7",
          "node_id": "0009",
          "start_index": 7,
          "end_index": 7,
          "summary": "Here is a summary of page 7 from the provided PDF:\n\n**Source:** 13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf (PDF file)\n\n**Page Number:** Page 7 of 16\n\nSummary (under 200 words):\n\nThe Court has heard the rival submissions and considered the evidence presented by both parties. The defendant's counsel drew attention to copies of bills/invoices and advertisements showing user of the trademark \"INDIA GATE\" by the defendant since 1990.\n\nKey points:\n\n* The plaintiff had filed various registration applications for the trademark \"INDIA GATE\" in respect of different products.\n* The Court questioned whether the plaintiff's trademark is a well-known mark, based on any proper determination.\n* The registration process of the plaintiff's application was found to be defective due to incorrect advertisement as a word mark instead of a device mark.\n\nDecision:\n\nNone mentioned on this page.",
          "content": "2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 7 of 16 \n \n(plaintiff’s product) and ‘atta’, ‘suji’, ‘maida’, ‘rawa’ and ‘bran’ \n(defendant’s products) and not in relation to any other goods. Therefore, it \nwas open for both the sides to expand their business to other products.  \n6.2 \nThe defendant is the prior user of the trademark ‘INDIA GATE’ in \nrespect of ‘atta’, ‘suji’, ‘maida’, ‘rawa’ and ‘bran’, which are all wheat \nproducts, since 1975. The defendant has an inherent right to expand its range \nof products and hence, use the aforesaid trademark in respect of ‘dalia’, \nwhich is an allied/cognate product to the earlier products of the defendant. \nThe defendant has been using the trademark ‘INDIA GATE’ in respect of \n‘dalia’ since 2015, which the plaintiff was fully aware of. \n6.3 \nThe plaintiff itself has filed various registration applications for the \ntrademark ‘INDIA GATE’ in respect of ‘rice flour’, ‘idli rava’, ‘rice atta’ \nand in respect of goods other than ‘rice’, such as ‘quinoa’, ‘flax seeds’ and \n‘millets’.  \n6.4 \nAs regards the trademark of the plaintiff being a ‘well-known \ntrademark’, it is not based on any proper determination by the Court.  \n6.5    Registration in respect of the plaintiff is defective as the trademark \napplication was wrongly advertised as a word mark instead of a device mark \nas initially applied for. \n6.6 \nCounsel for the defendant has drawn the attention of the Court to \ncopies of bills/invoices as well as advertisements in trade directories \nshowing user of the trademark ‘INDIA GATE’ by the defendant since 1990.  \nANALYSIS & FINDINGS \n7. \nI have heard the rival submissions. \n8. \nBoth sides have placed extensive reliance on the order dated 21st \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified",
          "pdf_source": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
          "nodes": []
        },
        {
          "title": "Page 8",
          "node_id": "0010",
          "start_index": 8,
          "end_index": 8,
          "summary": "Here is a summary of page 8 from the PDF document:\n\n**Source:** KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED (PDF: 13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf)\n\n**Summary:**\n\nThe court extracts relevant portions of its April 2014 order in FAO no.7/2012 to clarify the terms of the consent order. The order states that:\n\n* KRBL Ltd (the plaintiff) can use the trademark \"INDIA GATE\" for rice, but not for other products like Aata, Suji, Maida, Rawa, and Bran.\n* The respondents in FAO 7/2012 (defendants) can use the trademark \"INDIA GATE\" for their products like Aata, Maida, Rawa, Suzi, and Bran, as long as a registration under the Trade Mark Act, 1999 exists in their favor.\n\nThe consent order is deemed to be an interim order until the disposal of the suit, and it binds both parties with respect to the use of the trademark \"INDIA GATE\".",
          "content": "2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 8 of 16 \n \nApril, 2014 passed by this Court in FAO no.7/2012 and have sought to place \ntheir own interpretation of the same. Therefore, it is deemed expedient to \nextract the relevant portions of the said order: \n“1. \nCounsels for the parties, and who are veterans in IPR law, \nafter some initial arguments, have agreed to dispose of these \nappeals with the following consent order:- \n \n(i) \nThe appellant in FAO 7/12 i.e. KRBL Ltd., and who is the \nplaintiff in the trial court, will use the trademark ‘INDIA GATE’ \nwith respect to rice but not with respect to Aata, Suji, Maida, \nRawa \nand \nBran \nbeing \npresently \nused \nby \nthe \nrespondents/defendants, and all of which later products will be \nsold \nin \npackages \nof \n20 \nkilograms \nand \nabove \nby \nthe  respondents/defendants. Any claim or entitlement of the \nrespective  parties to use the trademark ‘INDIA GATE’ for any \nother products except  as stated in this order, is not the subject \nmatter of the present consent  order. The trademark ‘INDIA \nGATE’ will be used with respect to product  rice in packages of \nany size whatsoever by the appellant/plaintiff. \n \n(ii)  \nThe respondents in FAO 7/2012, and who are defendants \nin the suits, without in any manner comment being made upon \ntheir inter se disputes, will, so far as the appellant-plaintiff is \nconcerned, be entitled to use the  trademark ‘INDIA GATE for \ntheir products being Aata, Maida, Rawa, Suzi and Bran, for \nwhich a registration under the Trades Mark Act, 1999 exists in \ntheir favour. Of course, observations with respect to registration \nis not being made in a final manner for or against any of the \nparties to the  appeal, and which aspect will be decided in \nappropriate legal proceedings. \n \nxxx \n \n \n \n \nxxx \n \n \n \n xxx \n \n3. \nThis consent order will bind the parties with respect to \nuse  of the trade mark „INDIA GATE‟, is in the nature of interim \norder till  the disposal of the suit not only in the present \nsuit/litigation, but  also for the interim stages in the other \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified",
          "pdf_source": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
          "nodes": []
        },
        {
          "title": "Page 9",
          "node_id": "0011",
          "start_index": 9,
          "end_index": 9,
          "summary": "Here is a summary of page 9 from the provided PDF:\n\n**Case:** KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED\n**Court:** HIGH COURT OF DELHI AT NEW DELHI\n**Case Number:** CS(COMM) 550/2022\n**Date:** January 19, 2023 (Judgment Delivered)\n\nFrom page 9 of the PDF:\n\n* The court passed a consent order restraining the plaintiff from using the trademark 'INDIA GATE' for specific products: atta, suji, maida, rawa, and bran.\n* The defendant was restrained from using the trademark 'INDIA GATE' for rice.\n* However, the plaintiff was allowed to use the trademark 'INDIA GATE' for selling rice in packages of any size.\n* The arrangement allows the parties to sell atta, suji, maida, rawa, and bran in bags of 20 kg or more.\n* This order remains in effect until the final disposal of the suit.\n\nSource: KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED (PDF)",
          "content": "2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 9 of 16 \n \nlitigations \nwhich \nare \nsaid \nto \nbe \npending \ninter \nse \nrespondents/defendants on the one hand and the appellant-\n  plaintiff on the other hand. \n \n \nxxx \n \n \n \n \nxxx \n \n \n \n xxx \n \n5. \nIt is again clarified that the observations in this appeal  and \norder are with respect to use in the interim stages during \nthe  pendency of the suit for the trademark „INDIA GATE‟, and \nwith respect to  the products which is stated above in the present \norder. \n...” \n \n9. \nThe position that emerges from a reading of the aforesaid order can be \nsummarized as under: \n9.1 \nThis was a consent order passed by the Court. \n9.2 \nThe plaintiff was restrained from using the trademark ‘INDIA GATE’ \nin respect of the following products viz, ‘atta’, ‘suji’, ‘maida’, ‘rawa’ and \n‘bran’, that were being used at that point of time by the defendant. \n9.3 \nThe defendant could not use the trademark ‘INDIA GATE’ in respect \nof ‘rice’. \n9.4 \nPlaintiff was permitted to use the trademark ‘INDIA GATE’ in \nrespect of ‘rice’ in packages of any size. The defendant could sell ‘atta’, \n‘suji’, ‘maida’, ‘rawa’ and ‘bran’ in packages of 20 kg and above. \n9.5 \nThe entitlement of parties to use the trademark ‘INDIA GATE’ \nfor any other products other than the aforenoted products, was not \ncovered by the said order. \n9.6 \nThis arrangement was to continue till the final disposal of the suit.  \n10. \nA reading of the aforesaid order makes it clear that there was no bar \neither on the plaintiff or on the defendant to use the trademark ‘INDIA \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified",
          "pdf_source": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
          "nodes": []
        },
        {
          "title": "Page 10",
          "node_id": "0012",
          "start_index": 10,
          "end_index": 10,
          "summary": "Based on page 10 of the provided PDF (13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf), here's a summary:\n\n**Court Case:** KS(COMM) 550/2022, 2023/DHC/000394\n\n**Case Date:** January 19, 2023\n\n**Content:**\n\nThe plaintiff (KRBL Limited) argues that since the order of October 24, 2011, was not set aside by the appeal court's consent order of April 21, 2014, the restraining order against using the trademark 'INDIA GATE' for products other than 'atta', 'suji', 'maida', 'rawa', and 'bran' still applies.\n\n**Court Decision:**\n\nHowever, the court disagrees. The observations made in paragraph 14 of the original order are considered void after the consent order was passed, which defines the inter se arrangement between the parties during the pendency of the suit. Therefore, there's no merit in the plaintiff's submission that the consent order did not set aside the trial court's order.\n\n**Source:** Section 10 of PDF: 13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
          "content": "2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 10 of 16 \n \nGATE’ in respect of products other than those that were the subject matter \nof the said suit i.e., ‘atta’, ‘suji’, ‘maida’, ‘rawa’, ‘bran’ and ‘rice’.   \n11. \nCounsel for the plaintiff submits that since the aforesaid order did not \nset aside the order passed by the Trial Court on 24th October, 2011, \nrestraining the defendant from use of the trademark ‘INDIA GATE’ along \nwith the label or device of INDIA GATE in respect of products other than \nthe products that were registered by the defendant. The said restraint order \nwould continue to operate even after passing of the aforesaid consent order. \n12. \nI do not agree with the aforesaid submission of the plaintiff.  The \nobservations made in paragraph 14 of the order dated 24th October, 2011, \nwhich was the subject matter of appeal in FAO no. 7/2012, restraining the \ndefendants from using the trademark ‘INDIA GATE’ along with the label or \ndevice of INDIA GATE in respect of any product other than ‘atta’, ‘suji’, \n‘maida’, ‘rawa’ and ‘bran’, would not operate after the consent order dated \n21st April, 2014 was passed by this Court. Once a comprehensive consent \norder has been passed by the Appellate Court clearly defining the inter se \narrangement between the plaintiff and the defendant during the pendency of \nthe suit, no reliance can be placed on the order of the Trial Court, which is \ndeemed to have merged with the order passed by the Appellate Court. \nTherefore, there is no merit in the submission that the consent order did not \nspecifically set aside the order of the Trial Court and only partially modified \nthe said order.   \n13. \nAfter passing of the aforesaid consent order, the plaintiff filed various \ntrademark registration applications in Class 30 in respect of ‘rice flour’, ‘idli \nrava’, ‘rice atta’ and goods other than ‘rice’, such as ‘quinoa’, ‘flaxseeds’, \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified",
          "pdf_source": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
          "nodes": []
        },
        {
          "title": "Page 11",
          "node_id": "0013",
          "start_index": 11,
          "end_index": 11,
          "summary": "Here is a summary of page 11 from the PDF source (13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf):\n\nThe court considers whether the defendant can expand its business into \"dalia\" (a type of wheat product) using the trademark \"INDIA GATE\", which is also used by the plaintiff for rice products.\n\nThe court notes that no trademark registration application has been filed by the plaintiff for \"dalia\". The court states that if the plaintiff has the right to expand its business into other related products, then the defendant should also have the same right.\n\nThe court relies on a previous judgment (Somany Ceramics Ltd. v. Shri Ganesh Electric Co.) which held that a trademark proprietor's expansion into similar or cognate goods is recognized by law.\n\nUltimately, the court rules that the defendant was entitled to expand its product range into similar or related products and use the mark \"INDIA GATE\" for such goods, including \"dalia\".\n\nSource: 13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf (Page 11 of 16)",
          "content": "2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 11 of 16 \n \n‘millets’, etc. However, no trademark registration application has been filed \nby the plaintiff for ‘dalia’. \n14. \nSurely, if the plaintiff has a right to expand the usage of its trademark \n‘INDIA GATE’ in respect of other ‘rice’ products and products beyond \n‘rice’, the defendant cannot be denied the same right to expand its business \ninto other allied/cognate products. The present case relates to ‘dalia’, which \nwould fall in the category of wheat products. Pertinently, the defendant is \nnot using the trademark ‘INDIA GATE’ in respect of ‘rice’ or ‘rice’ \nproducts. I do not read any restriction in the consent order either on the \nplaintiff or the defendant from expanding their business into other products. \nTherefore, in my considered view, the defendant was entitled to expand its \nproduct range into similar or cognate or allied goods and use the trademark \n‘INDIA GATE’ in respect of such goods, including ‘dalia’. In this regard \ncounsel for defendant has correctly placed reliance on the judgment of a Co-\nordinate Bench of this Court in Somany Ceramics Ltd. v. Shri Ganesh \nElectric Co., 2022 SCC OnLine Del 3270. The relevant paragraph is set out \nbelow: \n“61. \nPertinent it is to mention, at this stage, that while the \nPlaintiff started its business in ceramics tiles, it subsequently \nexpanded into sanitaryware and bath fittings and obtained \nregistrations in Class 11 on 05.01.2007. Later, Plaintiff also \nexpanded its business into selling water heaters/geysers and \nobtained registration on 31.07.2018. This fact is important in the \ncontext of the judgment of the Supreme Court in Laxmikant \n(supra), where it was held that Courts have to be mindful of \nfuture expansion of the business of a proprietor of a trademark. \nPlaintiff is right in its contention that merely because a \ntrademark registration is applied for in a particular class, the \nproprietor is forever bound to sell only those goods. Law \nrecognises the expansion of business into similar or cognate or \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified",
          "pdf_source": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
          "nodes": []
        },
        {
          "title": "Page 12",
          "node_id": "0014",
          "start_index": 12,
          "end_index": 12,
          "summary": "Page 12 of the PDF \"13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf\" is not provided in your request. However, I can provide a summary of pages 15-17 of the same PDF.\n\n**Summary**\n\nOn page 15, the plaintiff argues that the defendant failed to provide invoices showing sale of products under the trademark 'INDIA GATE' prior to the registration date (March 1995).\n\nOn page 16, the court notes that despite some early invoices lacking the trademark, others from May 1990 show consistent use of the 'INDIA GATE' device mark and word mark. The defendant also provided advertisements in trade directories from May 1990.\n\nOn page 17, it is noted that:\n\n* Date: March 1995\n* Registration granted to plaintiff in respect of 'rice'\n* Defendant's registration for device mark 'INDIA GATE' dated November 3, 1993\n\n**PDF source:** \"13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf\"",
          "content": "2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 12 of 16 \n \nallied goods and this factor is relevant for determination of a \nclaim for passing off.” \n \n15. \nIt has been vehemently contended on behalf of the plaintiff that the \ndefendant has failed to file invoices showing that the products of the \ndefendant were sold under the trademark ‘INDIA GATE’. Therefore, the \ndefendant cannot claim user  prior to the registration of the plaintiff. In this \nregard, reference may be made to the invoices placed on record by the \ndefendant beginning from 8th May, 1990 (pages no. 44 to 189 of the \ndefendant’s documents) which show the use of the ‘INDIA GATE’ device \nmark and the word mark. While it is correct that some of the invoices for the \nearlier period do not show that the goods were being sold under the \ntrademark ‘INDIA GATE’, in all the aforesaid invoices the device of INDIA \nGATE prominently features at the top left corner of the invoices. Defendant \nhas also placed on record the advertisements made by the defendant in \nvarious trade directories with effect from May, 1990 (pages no. 325 to 339 \nof the defendant’s documents) to show that the defendant was continuously \nusing the trademark ‘INDIA GATE’ in respect of their wheat products. \n16. \nFor a prima facie consideration, the defendant has placed sufficient \nmaterial on record showing user of the ‘INDIA GATE’ device mark from \n1990, which is prior to the registration of the plaintiff. To be noted, the \nregistration granted in favour of the plaintiff was only in respect of ‘rice’. \nThe earliest invoice filed on behalf of the plaintiff showing user of the \ntrademark ‘INDIA GATE’ is of 18th February, 1995.  \n17. \nIt has also to be borne in mind that the defendant was granted \nregistration in respect of the device mark ‘INDIA GATE’ with effect from \n3rd November, 1993. In this regard reference may be made to the judgment \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified",
          "pdf_source": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
          "nodes": []
        },
        {
          "title": "Page 13",
          "node_id": "0015",
          "start_index": 13,
          "end_index": 13,
          "summary": "Here is a summary of page 13 from the PDF \"KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED\" (2023/DHC/000394):\n\n**Key points:**\n\n* The plaintiff's reliance on case law in support of their trademark claim is being considered.\n* The court has referred to a previous judgment in Gujarat Bottling Co. Ltd. v. Coca Cola Co., (1995) 5 SCC 545, which holds that a registered mark is protected even if not used by the party.\n* Another judgment cited was Aditya Birla Nuvo Limited v. R.S. Sales Corporation, 2018 SCC OnLine Del 9794, stating that a registered mark is protected regardless of its use.\n\n**Relevant details:**\n\n* Case citations: Gujarat Bottling Co. Ltd. v. Coca Cola Co., (1995) 5 SCC 545 and Aditya Birla Nuvo Limited v. R.S. Sales Corporation, 2018 SCC OnLine Del 9794\n* Dates mentioned: July 31, 2019, May 10, 2016\n\n**PDF source:** \"KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf\"",
          "content": "2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 13 of 16 \n \nin Gujarat Bottling Co. Ltd. v. Coca Cola Co., (1995) 5 SCC 545 followed \nby a Co-ordinate Bench of this Court in Aditya Birla Nuvo Limited v. R.S. \nSales Corporation, 2018 SCC OnLine Del 9794, wherein it has been held \nthat a mark which is registered is protected, irrespective of the fact whether \nthe party uses the registered mark or not.  \n18. \nThe undertaking given on behalf of the defendant in the rectification \npetition filed by the plaintiff was only in respect of the earlier suit that was \npending before the Patiala House Courts, New Delhi. The said undertaking \ncannot be applied to the present suit.  \n19. \nReliance placed on behalf of the plaintiff on the judgments in Pioneer \nNuts and Bolts Pvt. Ltd. v. Goodwill Enterprises, 2009 SCC OnLine Del \n2851, PEPS Industries (P) Ltd. v. Kurlon Ltd., 2022 SCC OnLine Del \n3275, Dabur India Ltd. v. Real Drinks Pvt. Ltd., 2014 SCC OnLine Del 23 \nand S. Narendra Kumar & Co. v. Everest Beverages and Foods Inudstries, \n2008 SCC OnLine Del 1759, would not come to the assistance of the \nplaintiff as in all the aforesaid cases, unlike the present case, there was no \nregistration of the trademark in favour of the defendant. \n20. \nMuch emphasis has been laid on behalf of the plaintiff on the aspect \nthat the trademark of the plaintiff is a ‘well-known trademark’ in terms of \nSection 2(1)(zg) of the Trade Marks Act, 1999. In this regard, reliance has \nbeen placed on the order dated 31st July, 2019 passed by the Deputy \nRegistrar of Trade Marks, declaring the trademark of the plaintiff, ‘INDIA \nGATE’ as a ‘well-known trademark’. However, a perusal of the aforesaid \norder shows that the aforesaid determination was made by the Deputy \nRegistrar based on an order dated 10th May, 2016 passed by the Additional \nDistrict Judge, Patiala House Courts, New Delhi in ex parte proceedings.  It \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified",
          "pdf_source": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
          "nodes": []
        },
        {
          "title": "Page 14",
          "node_id": "0016",
          "start_index": 14,
          "end_index": 14,
          "summary": "**Case:** KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED (2023/DHC/000394)\n\n**Summary:** (Page 14 of 16)\n\n1. **Trademark**: The plaintiff's trademark is considered a \"well-known trademark\" but the court notes that no issue was raised regarding it, and the defendant has prior registration and user of a similar mark.\n2. **Section 28(3) Trade Marks Act, 1999**: Both parties have exclusive rights to use the identical trademark.\n3. **Defendant's Registration**: The defendant applied for the \"INDIA GATE\" device mark in October 2021, claiming prior user since April 2015, with invoices from October 2015 showing sale of \"dalia\" under the same mark.\n4. **Copyright Infringement**: The plaintiff's earliest copyright registration was in 1999, after the defendant's alleged use of a similar artistic device. The pictorial depiction on labels differ, and no case for copyright infringement is made out.\n\n**PDF Source:** 13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
          "content": "2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 14 of 16 \n \nis pertinent to note that neither any prayer was sought nor any issue was \nframed with regard to the trademark of the plaintiff being a ‘well-known \ntrademark’. The plaintiff cannot take advantage of the aforesaid \ndetermination of its trademark being a ‘well-known trademark’ so as to \nprevent the defendant from using the said trademark in respect of which the \ndefendant has prior user and registration. In terms of Section 28(3) of the \nTrade Marks Act, 1999, where two persons are registered proprietors of \nidentical or similar trademarks both shall have the exclusive right to use the \nsaid trademarks. \n21. \nIt is significant to note that the defendant applied for the registration \nof the device mark ‘INDIA GATE’ in respect of ‘dalia’ on 5th October, 2021 \nclaiming user since 1st April, 2015. The defendant has also placed on record \ninvoices from 8th October, 2015 (pages no.291-322 of the defendant’s \ndocuments) showing sale of ‘dalia’ under the trademark ‘INDIA GATE \nBRAND’, which is much prior to filing of the present suit.  \n22. \nAs regards the infringement of the plaintiff’s registered copyright by \nthe defendant, it is to be noted that the earliest copyright registration in \nfavour of the plaintiff is in 1999, which is much after the user of the artistic \ndevice of \n by the defendant. The pictorial depiction of INDIA \nGATE is substantially different in the label of the plaintiff and the label of \nthe defendant. Therefore, no case for copyright infringement is made out.  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified",
          "pdf_source": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0020",
      "start_index": 15,
      "end_index": 16,
      "summary": "Here is a summary of the court decision section from the PDF document (13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf):\n\n**Case Details**\n\n* Court: High Court of Delhi at New Delhi\n* Case Number: 2023/DHC/000394\n* Date: January 19, 2023\n\n**Parties**\n\n* Plaintiff: KRBL Limited (through counsel Mr. Sudarshan Kumar Bansal)\n* Defendant: Vikram Roller Flour Mills Limited\n\n**Background and Judgment**\n\nThe plaintiff, KRBL Limited, had filed a plea for an interim injunction against the defendant, Vikram Roller Flour Mills Limited, alleging passing off of their trademark 'INDIA GATE'. The court examined the packaging of both parties' products and found that there was a material difference between them.\n\n**Key Findings and Decision**\n\n* The court held that the plaintiff failed to establish a prima facie case for grant of interim injunction.\n* The balance of convenience favored the defendant, as their product 'dalia' had been selling in the market with the impugned trademark since 2015.\n* The court found no merit in the application under Order XXXIX Rules 1 and 2 of the CPC.\n\n**Conclusion**\n\nThe Hon'ble Justice Amit Bansal dismissed the present application for interim injunction on January 19, 2023 (CS(COMM) 550/2022).\n\n**PDF Source**\nThe document summary is based on Section: Court Decision from PDF file '13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf'.",
      "pdf_source": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
      "nodes": [
        {
          "title": "Page 15",
          "node_id": "0018",
          "start_index": 15,
          "end_index": 15,
          "summary": "The page content from PDF (13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf) is summarized as follows:\n\nOn Page 15 of 16 (CS(COMM) 550/2022), it is stated that there is a material difference between the plaintiff's and defendant's packaging regarding the trademark 'INDIA GATE'. Although both have similar words and pictorial representations, their getup is substantially different. This suggests no possibility of confusion or deception to the public.\n\nThis conclusion is based on the comparison made in paragraph 36 of the plaint at page no. 52. A reference is also made to a previous judgment by a Coordinate Bench of this Court (Laxmi Agro Impex India v. Ladli India Commodities, SCC Online Del 11147) stating that rival marks should be compared as a whole, keeping in mind an unwary purchaser.\n\nThe case details are:\n\n* Case Number: CS(COMM) 550/2022\n* Plaintiff: KRBL LIMITED\n* Defendant: VIKRAM ROLLER FLOUR MILLS LIMITED\n* Date of Judgment Delivery: January 19, 2023 (Reference No: 2023/DHC/000394).\n\nDigitally Signed By Amit Bansal on January 19, 2023.",
          "content": "2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 15 of 16 \n \n23. \nAs regards the allegations of passing off, in paragraph 36 of the plaint \nat page no.52, a comparison of the trademark ‘INDIA GATE’ of the plaintiff \nand the defendant has been made, which is set out below: \n \n24. \n The aforesaid comparison shows that there is a material difference \nbetween the packaging of the plaintiff and the defendant. Even though the \nwords ‘INDIA GATE’ and the pictorial representation of INDIA GATE \noccur in both the packaging of the plaintiff and the defendant, the getup of \nthe packaging is substantially different, so there can be no possibility of \nconfusion or deception to the public. Reference in this regard may be made \nto the judgment of a Co-ordinate Bench of this Court in Laxmi Agro Impex \nIndia v. Ladli India Commodities, 2019 SCC OnLine Del 11147, wherein it \nhas been held that the rival marks have to be compared as a whole, keeping \nin mind an unwary purchaser of average intelligence and imperfect \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified",
          "pdf_source": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
          "nodes": []
        },
        {
          "title": "Page 16",
          "node_id": "0019",
          "start_index": 16,
          "end_index": 16,
          "summary": "Based on page 16 of PDF: 13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf (Source: 2023/DHC/000394 CS(COMM) 550/2022), here is a summary of the key legal facts, proceedings, and decisions:\n\n**Key Points:**\n\n* The plaintiff, KRBL Limited, failed to establish a prima facie case for a grant of interim injunction.\n* A Division Bench upheld a previous judgment in Laxmi Agro (supra) and dismissed an SLP preferred thereagainst on October 16, 2020.\n* No merit is seen in the present application under Order XXXIX Rules 1 and 2 of the CPC.\n\n**Decisions:**\n\n* The Court has ruled against the plaintiff's application for interim injunction.\n* The Balance of Convenience is in favour of the defendant, as their product 'dalia' with the impugned trademark has been selling in the market since 2015.\n\n**Judgment Date and Parties Involved:** \n\n* Judgment Reserved on: January 6, 2023\n* Judgment Delivered on: January 19, 2023\n* KRBL Limited (Plaintiff)\n* Vikram Roller Flour Mills Limited (Defendant)",
          "content": "2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 16 of 16 \n \nrecollection. The judgment in  Laxmi Agro (supra) was upheld by a Division \nBench of this Court in Laxmi Agro Impex India v. Ladli India \nCommodities, 2019 SCC OnLine Del 11717 and SLP (C) no.8282/2020 \npreferred thereagainst was dismissed on 16th October, 2020.  \n25. \nIn view of the discussion above, the plaintiff has failed to establish a \nprima facie case in its favour for the grant of interim injunction. Balance of \nconvenience is also in favour of the defendant for not granting interim \ninjunction at this stage, as the product ‘dalia’ of the defendant has been \nselling in the market with the impugned trademark since 2015.  There is no \nmerit in the present application under Order XXXIX Rules 1 and 2 of the \nCPC.  \n26. \nDismissed.  \n \nAMIT BANSAL, J. \nJANUARY 19, 2023 \ndk \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified",
          "pdf_source": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-16T13:07:05.688408",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}