{
  "doc_name": "14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN",
  "pdf_source": "14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf",
  "metadata": {
    "document_name": "14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN",
    "source_pdf": "14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf",
    "judges": [
      "AMIT BANSAL"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "34/2022",
      "34/2022",
      "34/2022",
      "34/2022",
      "34/2022",
      "34/2022",
      "34/2022",
      "34/2022",
      "813/2022"
    ],
    "dhc_numbers": [
      "2023/DHC/000970",
      "2023/DHC/000970",
      "2023/DHC/000970",
      "2023/DHC/000970",
      "2023/DHC/000970",
      "2023/DHC/000970"
    ],
    "ia_numbers": [],
    "decision_date": "7 February, 2023",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      {
        "name": "SNS Products Private Limited"
      }
    ],
    "defendants": [
      {
        "name": "Ijaz Uddin"
      }
    ],
    "appellants": [],
    "respondents": [],
    "plaintiff_advocates": [
      {
        "name": "Mr. Tejveer Singh Bhatia",
        "co-advocate1": "Mr. Kunal Vats",
        "co-advocate2": "Ms. Tanya Arora"
      }
    ],
    "defendant_advocates": [
      {
        "name": "Mr. Shashank Khurana"
      }
    ],
    "appellant_advocates": [],
    "respondent_advocates": [],
    "damages_claimed": null,
    "damages_awarded": null,
    "key_issues": [
      "Here are the main legal issues:",
      "• Whether the replication filed by the plaintiff can be taken on record despite being filed beyond the maximum permissible period of 45 days from the date when the written statement was supplied to the plaintiff.",
      "• Whether the Delhi High Court (OS) Rules, specifically Chapter VII Rule 5, governs the timeline for filing a replication in civil procedure cases.",
      "• What is the correct date for counting the period for filing a replication: the date of supply of the written statement or the date when the written statement was permitted to be taken on record?",
      "• Whether the judgments relied upon by the defendant in Ram Sarup Lugani and Atlanta Limited are applicable to the facts and circumstances of this case.",
      "• What is the implication of the Joint Registrar's order allowing the defendant's application for condonation of delay in filing the written statement on the timely filing of the replication.",
      "• Can a replication be filed despite being belatedly submitted under Order VIII Rule 1 of the Code of Civil Procedure, 1908?",
      "• What is the effect of the 45-day limit prescribed under Chapter VII Rule 5 for filing a replication on the plaintiff's ability to file a replication in this case?"
    ],
    "decision_summary": "**Case Summary: SNS Products Private Limited vs Ijaz Uddin**\n\n**Background:**\nThe plaintiff, SNS Products Private Limited, filed a lawsuit against the defendant, Ijaz Uddin, seeking a permanent injunction to restrain him from infringing their trademark \"SHAN E DELHI\", \"SHAN-A-DELHI\" or any other mark identical or deceptively similar. The court granted an ex parte ad interim injunction and appointed Local Commissioners to seize and inventorize the infringing goods.\n\n**Legal Issues:**\n\n1. Whether the replication filed by the plaintiff is valid given it was filed beyond the maximum permissible period of 45 days from the date when the written statement was supplied.\n2. Whether the delay in filing the replication can be condoned under Order VIII, Rule 1 of the Code of Civil Procedure, 1908 (CPC).\n3. The interpretation of Chapter VII, Rule 5 of the Delhi High Court (Original Side) Rules, 2018 regarding the maximum period for filing a replication.\n\n**Arguments:**\n\n* Defendant's counsel argued that the replication cannot be taken on record as it was filed beyond the 45-day period and relied on judgments in Ram Sarup Lugani v. Nirmal Lugani and Atlanta Limited v. National Highways & Infrastructure Development Corporation Limited.\n* Plaintiff's counsel contended that the copy of the written statement was supplied to them only on May 17, 2022, and therefore, the time for filing replication should be counted from July 11, 2022 (the date when the written statement was permitted to be taken on record).\n\n**Court Findings:**\n\n* The court noted that Chapter VII, Rule 5 of the Delhi High Court (OS) Rules states that the replication shall be filed within 30 days of receiving the written statement.\n* However, the court disagreed with the defendant's contention that the replication cannot be permitted to be taken on record after the exhaustion of the maximum prescribed period of 45 days, citing the judgment in Ram Sarup Lugani which dealt with a different issue.\n\n**Decision:**\nThe court allowed the plaintiff's replication, holding that:\n\n* The time for filing the replication starts from the date when the written statement was permitted to be taken on record (July 11, 2022).\n* The defendant's reliance on judgments in Ram Sarup Lugani and Atlanta Limited is not applicable in this case.\n* Since the plaintiff filed the replication within the permissible period from July 11, 2022, it is valid.\n\nThe court ordered that the replication be taken on record, paving the way for further proceedings in the case.",
    "legal_precedents": [
      "Ram Sarup Lugani Nirmal Lugani",
      "Atlanta Limited National Highways"
    ],
    "full_text": "\n--- PAGE 1 ---\n2023/DHC/000970\nCS(COMM) 34/2022\nPage 1 of 6\n$~10\n*\nIN THE HIGH COURT OF DELHI AT NEW DELHI\n%\nDate of decision : 7th February, 2023\n+\nCS(COMM) 34/2022\nSNS PRODUCTS PRIVATE\nLIMITED\n..... Plaintiff\nThrough:\nMr.Tejveer Singh Bhatia, Mr. Kunal\nVats and Ms. Tanya Arora,\nAdvocates.\nversus\nIJAZ UDDIN\n..... Defendant\nThrough:\nMr. Shashank Khurana, Advocate\nCORAM:\nHON'BLE MR. JUSTICE AMIT BANSAL\nAMIT BANSAL, J. (Oral)\nCS(COMM) 34/2022\n1.\nThe present suit has been filed seeking relief of permanent injunction\nrestraining the defendant from infringing the trademark of the plaintiff,\npassing off his goods as that of the plaintiff, damages and other ancillary\nreliefs.\n2.\nSummons in the suit were issued on 17th January, 2022, when this\nCourt granted ex parte ad interim injunction against the defendant\nrestraining him from using the impugned mark ‘SHAN E DELHI’, ‘SHAN-\nA-DELHI’ or any other mark identical or deceptively similar to the\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 16:52:41\nSignature Not Verified\n\n--- PAGE 2 ---\n2023/DHC/000970\nCS(COMM) 34/2022\nPage 2 of 6\nplaintiff’s trademark, ‘SHAN-E-DELHI’ /\n. A\nLocal Commissioner was also appointed by this Court to seize and\ninventorize the infringing goods. Vide order dated 2nd February, 2022 one\nmore Local Commissioner was appointed to visit another premises of the\ndefendant.\n3.\nThe counsel appearing on behalf of the defendant entered appearance\non 26th April, 2022 and the Court directed for the written statement along\nwith an affidavit of admission/denial of documents to be filed within the\nperiod permissible in law. The replication was directed to be filed within\nfifteen days of the receipt of the written statement.\n4.\nThe written statement was filed on behalf of the defendant on 26th\nApril, 2022 and copy of the same was supplied to the counsel for the\nplaintiff on the same date. The written statement was filed belatedly and\ntherefore, it was accompanied by an application under Order VIII Rule 1 of\nthe Code of Civil Procedure, 1908 (CPC) seeking condonation of delay of\n27 days in filing the written statement.\n5.\nThe aforesaid application was allowed by the Joint Registrar on 11th\nJuly, 2022 while noting that the counsel for the plaintiff does not have any\nobjection to the same. Subsequently, replication was filed on behalf of the\nplaintiff on 23rd July, 2022.\n6.\nCounsel for the defendant contends that the replication cannot be\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 16:52:41\nSignature Not Verified\n\n--- PAGE 3 ---\n2023/DHC/000970\nCS(COMM) 34/2022\nPage 3 of 6\ntaken on record as it was filed beyond the maximum permissible period of\n45 days from the date when the written statement was supplied to the\nplaintiff. He places reliance on Chapter VII Rule 5 of the Delhi High Court\n(Original Side) Rules, 2018 (hereinafter ‘Delhi High Court (OS) Rules’), the\njudgment of the Division Bench in Ram Sarup Lugani v. Nirmal Lugani,\n2020 SCC OnLine Del 1353 and the judgment of a Co-ordinate Bench in\nAtlanta Limited v. National Highways & Infrastructure Development\nCorporation Limited, 2019 SCC OnLine Del 11276.\n7.\nCounsel for the plaintiff submits that the copy of the written statement\nwas supplied to him only on 17th May, 2022. The time for counting the\nperiod for filing replication can only be counted from the date when the\nwritten statement was permitted to be taken on record. In the present case,\nthe said date would be 11th July, 2022. He further submits that the aforesaid\njudgments relied upon by the defendant are not applicable to the facts and\ncircumstances of the case.\n8.\nI have heard the counsels for the parties.\n9.\nTo appreciate the submissions of the parties, a reference may be made\nto the relevant portion of Chapter VII Rule 5 of the Delhi High Court (OS)\nRules, which is reproduced below:\n“5. Replication. – The replication, if any, shall be filed within\n30 days of receipt of the written statement. …”\n10.\nThe Division Bench in Ram Sarup Lugani (supra) while considering\nthe aforesaid Rule came to the conclusion that the Rule 5 of the Delhi High\nCourt (OS) Rules is mandatory in nature and the replication cannot be\npermitted to be taken on record after the exhaustion of the maximum\nprescribed period of 45 days. The issue before the Division Bench was not\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 16:52:41\nSignature Not Verified\n\n--- PAGE 4 ---\n2023/DHC/000970\nCS(COMM) 34/2022\nPage 4 of 6\nwith regard to the date from which the period of 45 days for filing the\nreplication would begin. The issue before the Division Bench was in the\ncontext of whether delay in filing the replication can be condoned beyond\nthe period of 45 days in terms of Rule 5 of Chapter VII of the Delhi High\nCourt (OS) Rules. Therefore, the observations of the Division Bench would\nnot be of any assistance to the defendant.\n11.\nI do not agree with the submission of the defendant that in all cases\nthe period for filing replication would commence from the date of written\nstatement being supplied by the defendant to the plaintiff in terms of Rule 5\nof the Delhi High Court (OS) Rules. Undoubtedly, the language used in\nRule 5 of the Delhi High Court (OS) Rules is that the replication has to be\nfiled within 30 days from the receipt of the written statement. This may be\nordinarily so. However, where the written statement was filed beyond the\nstatutory time limit and was taken on record only upon an application for\ncondonation of delay being allowed by the Court, the aforesaid rule has to\nbe interpreted in a manner that the period of 30 days will begin from the\ntime the written statement is permitted to be taken on record.\n12.\nThis issue may be examined from a different point of view as well.\nThere would be no requirement for the plaintiff to file a replication in the\nevent that the application seeking condonation of delay in filing written\nstatement is not allowed and the written statement is not taken on record.\nThe plaintiff would be required to file replication only once the condonation\nin delay is allowed and the written statement is taken on record. Therefore, it\nis axiomatic that the period for filing replication would only commence from\nthe date when the delay is condoned and the written statement is taken on\nrecord.\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 16:52:41\nSignature Not Verified\n\n--- PAGE 5 ---\n2023/DHC/000970\nCS(COMM) 34/2022\nPage 5 of 6\n13.\nIn the present case, the replication was filed by the plaintiff within 12\ndays after the written statement was taken on record. It was the defendant\nwho had filed the written statement in a belated manner and sought\ncondonation of delay for the same, which the counsel for the plaintiff fairly\ndid not oppose. Therefore, there is no basis for the defendant to object to the\nreplication being taken on record.\n14.\nReliance has been placed by the counsel for the defendant on the\njudgment in Atlanta Limited (supra). In the said case, the written statement\nwas already taken on record and the plaintiff had filed an application under\nthe provisions of Order VIII Rule 10 of the CPC for taking the written\nstatement off the record as the filing of the written statement was delayed\nand the said application was dismissed. The counsel for the plaintiff therein\nfiled an application contending that the maximum permissible period of 45\ndays for filing replication should be counted from the date when the\napplication of the plaintiff for taking the written statement off the record was\ndismissed. The said application was rejected by the Court. In the present\ncase the written statement though filed by the defendant earlier, was\npermitted to be taken on record only on a subsequent date and the replication\nwas filed within 12 days from the said date. Therefore, reliance placed on\nthe judgment in Atlanta Limited (supra) is misplaced.\n15.\nTherefore, I do not find any merit in the submission of the defendant\nthat the replication filed by the plaintiff along with admission/denial of\ndocuments not be taken on record. Accordingly, the replication is permitted\nbe taken on record.\n16.\nList on 2nd March, 2023.\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 16:52:41\nSignature Not Verified\n\n--- PAGE 6 ---\n2023/DHC/000970\nCS(COMM) 34/2022\nPage 6 of 6\nI.A. 813/2022 (O-XXXIX R-1 & 2 of CPC)\n17.\nList for further proceedings on 2nd March 2023.\n18.\nInterim orders to continue.\nAMIT BANSAL, J\nFEBRUARY 7, 2023\nrt/sr\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 16:52:41\nSignature Not Verified\n"
  },
  "total_pages": 6,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "**Case Summary:** SNS Products Private Limited (Plaintiff) vs. Ijaz Uddin (Defendant)\n\nSource: PDF file titled \"14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf\"\n\n**Case Details:**\n\n* Case Header and Parties:\n\t+ Plaintiff: SNS Products Private Limited\n\t+ Defendant: Ijaz Uddin\n\t+ Advocates: Mr.Tejveer Singh Bhatia, Mr. Kunal Vats, Ms. Tanya Arora (Plaintiff) and Mr. Shashank Khurana (Defendant)\n* Date of Decision: 7th February, 2023\n* Case Number: CS(COMM) 34/2022\n\n**Proceedings:**\n\n1. The suit was filed on an ex parte ad interim injunction seeking relief to restrain the defendant from infringing the plaintiff's trademark and passing off goods as its own.\n2. Summons were issued on January 17, 2022, with this Court granting ex parte ad interim injunction against the defendant.\n3. A Local Commissioner was appointed on February 2, 2022, to seize and inventorize infringing goods.\n4. The defendant's counsel entered appearance on April 26, 2022, and filed a belated written statement.\n5. The joint registrar allowed an application for condonation of delay in filing the written statement on July 11, 2022.\n6. Replication was filed by the plaintiff on July 23, 2022.\n\n**Key Dates:**\n\n* January 17, 2022: Summons issued\n* February 2, 2022: Local Commissioner appointed\n* April 26, 2022: Defendant's counsel entered appearance and filed written statement\n* July 11, 2022: Application for condonation of delay allowed\n* July 23, 2022: Replication filed\n\n**Amounts:**",
      "pdf_source": "14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "**Summary of Page 1 from PDF: 14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf**\n\nSource: Delhi High Court Case Number 2023/DHC/000970 (CS(COMM) 34/2022)\n\nThe case involves a trademark infringement claim by **SNS Products Private Limited** against **Ijaz Uddin**. The plaintiff seeks:\n\n1. Permanent injunction to prevent the defendant from using a mark identical or deceptively similar to SNS's trademark.\n2. Damages and other ancillary reliefs.\n\nOn January 17, 2022, the Court granted an ex parte ad interim injunction against Ijaz Uddin, restraining him from using the impugned mark \"SHAN E DELHI\", \"SHAN-A-DELHI\" or any similar mark.\n\nThe case was decided by **Justice Amit Bansal** on February 7, 2023. \n\nNotable details:\n\n* Date of decision: February 7, 2023\n* Advocate's names:\n\t+ For the plaintiff: Tejveer Singh Bhatia, Kunal Vats, Tanya Arora\n\t+ For the defendant: Shashank Khurana",
          "content": "2023/DHC/000970\nCS(COMM) 34/2022\nPage 1 of 6\n$~10\n*\nIN THE HIGH COURT OF DELHI AT NEW DELHI\n%\nDate of decision : 7th February, 2023\n+\nCS(COMM) 34/2022\nSNS PRODUCTS PRIVATE\nLIMITED\n..... Plaintiff\nThrough:\nMr.Tejveer Singh Bhatia, Mr. Kunal\nVats and Ms. Tanya Arora,\nAdvocates.\nversus\nIJAZ UDDIN\n..... Defendant\nThrough:\nMr. Shashank Khurana, Advocate\nCORAM:\nHON'BLE MR. JUSTICE AMIT BANSAL\nAMIT BANSAL, J. (Oral)\nCS(COMM) 34/2022\n1.\nThe present suit has been filed seeking relief of permanent injunction\nrestraining the defendant from infringing the trademark of the plaintiff,\npassing off his goods as that of the plaintiff, damages and other ancillary\nreliefs.\n2.\nSummons in the suit were issued on 17th January, 2022, when this\nCourt granted ex parte ad interim injunction against the defendant\nrestraining him from using the impugned mark ‘SHAN E DELHI’, ‘SHAN-\nA-DELHI’ or any other mark identical or deceptively similar to the\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 16:52:41\nSignature Not Verified",
          "pdf_source": "14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "Here is a summary of page 2 from the PDF:\n\nIn the case CS(COMM) 34/2022, SNS Products Private Limited v. Ijaz Uddin, the court's proceedings are summarized as follows:\n\n* A Local Commissioner was appointed to seize and inventory infringing goods on February 2, 2022.\n* The defendant's counsel entered appearance on April 26, 2022, and filed a belated written statement with an application for condonation of delay under Order VIII Rule 1 of the Code of Civil Procedure, 1908 (CPC).\n* The Joint Registrar allowed the application on July 11, 2022, noting that the plaintiff's counsel had no objection.\n* A replication was filed by the plaintiff on July 23, 2022.\n\nThe focus is on legal facts and proceedings, specifically:\n\n* Dates: February 2, 2022; April 26, 2022; July 11, 2022; July 23, 2022\n* Parties involved: SNS Products Private Limited (plaintiff), Ijaz Uddin (defendant)\n* Proceedings: Application for condonation of delay, filing of written statement and replication\n\nSource: PDF 14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf",
          "content": "2023/DHC/000970\nCS(COMM) 34/2022\nPage 2 of 6\nplaintiff’s trademark, ‘SHAN-E-DELHI’ /\n. A\nLocal Commissioner was also appointed by this Court to seize and\ninventorize the infringing goods. Vide order dated 2nd February, 2022 one\nmore Local Commissioner was appointed to visit another premises of the\ndefendant.\n3.\nThe counsel appearing on behalf of the defendant entered appearance\non 26th April, 2022 and the Court directed for the written statement along\nwith an affidavit of admission/denial of documents to be filed within the\nperiod permissible in law. The replication was directed to be filed within\nfifteen days of the receipt of the written statement.\n4.\nThe written statement was filed on behalf of the defendant on 26th\nApril, 2022 and copy of the same was supplied to the counsel for the\nplaintiff on the same date. The written statement was filed belatedly and\ntherefore, it was accompanied by an application under Order VIII Rule 1 of\nthe Code of Civil Procedure, 1908 (CPC) seeking condonation of delay of\n27 days in filing the written statement.\n5.\nThe aforesaid application was allowed by the Joint Registrar on 11th\nJuly, 2022 while noting that the counsel for the plaintiff does not have any\nobjection to the same. Subsequently, replication was filed on behalf of the\nplaintiff on 23rd July, 2022.\n6.\nCounsel for the defendant contends that the replication cannot be\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 16:52:41\nSignature Not Verified",
          "pdf_source": "14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0005",
      "start_index": 3,
      "end_index": 3,
      "summary": "**Summary of Section: Background and Facts**\n\nThis is a court document from the High Court of Delhi at New Delhi (2023/DHC/000970). The case is:\n\n**SNS Products Private Limited vs. Ijaz Uddin**\n\n**Context:** CS(COMM) 34/2022, decided on February 7, 2023.\n\n**Parties:**\n\n* Plaintiff: SNS Products Private Limited\n\t+ Represented by Advocates Mr.Tejveer Singh Bhatia, Mr. Kunal Vats, and Ms. Tanya Arora.\n* Defendant: Ijaz Uddin\n\t+ Represented by Advocate Mr. Shashank Khurana.\n\n**Background:** The plaintiff seeks a permanent injunction against the defendant. However, the case revolves around the timeliness of filing a replication (reply to defendant's written statement).\n\n**Decisions and Rulings:**\n\n* The court takes note of Chapter VII Rule 5 of the Delhi High Court (Original Side) Rules, 2018.\n* Counsel for the plaintiff argues that the copy of the written statement was supplied on May 17, 2022, and the time to file a replication should be counted from July 11, 2022, when it was permitted to be taken on record.\n* The court upholds the defendant's position and rules that the replication cannot be taken on record after the maximum prescribed period of 45 days.\n\n**Relevant Dates:**\n\n* May 17, 2022: Written statement supplied to the plaintiff\n* July 11, 2022: Date when written statement was permitted to be taken on record\n* February 7, 2023: Decision date\n\nThis document is part of a PDF file named **14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf**",
      "pdf_source": "14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "**Summary of Page 3 from PDF: 14. SNS PRODUCTS PRIVATE VS IJAZ UDDIN**\n\nThe defendant's written statement was taken on record beyond the maximum permissible period of 45 days, contrary to Chapter VII Rule 5 of the Delhi High Court (Original Side) Rules, 2018.\n\n**Key points:**\n\n* The written statement was filed beyond the 45-day limit.\n* The defendant relies on Chapter VII Rule 5 and judgments in Ram Sarup Lugani and Atlanta Limited cases.\n* The plaintiff disputes the applicability of these judgments to the present case.\n* The plaintiff argues that the time for filing replication can only be counted from the date when the written statement was permitted to be taken on record.\n\n**Court's consideration:**\n\nThe court will consider the relevant provisions of Chapter VII Rule 5 and make a decision based on the facts of the case.\n\n**Source:** PDF document provided, specifically pages 2-3 of 6. The document is from the Delhi High Court, Case No. CS(COMM) 34/2022.",
          "content": "2023/DHC/000970\nCS(COMM) 34/2022\nPage 3 of 6\ntaken on record as it was filed beyond the maximum permissible period of\n45 days from the date when the written statement was supplied to the\nplaintiff. He places reliance on Chapter VII Rule 5 of the Delhi High Court\n(Original Side) Rules, 2018 (hereinafter ‘Delhi High Court (OS) Rules’), the\njudgment of the Division Bench in Ram Sarup Lugani v. Nirmal Lugani,\n2020 SCC OnLine Del 1353 and the judgment of a Co-ordinate Bench in\nAtlanta Limited v. National Highways & Infrastructure Development\nCorporation Limited, 2019 SCC OnLine Del 11276.\n7.\nCounsel for the plaintiff submits that the copy of the written statement\nwas supplied to him only on 17th May, 2022. The time for counting the\nperiod for filing replication can only be counted from the date when the\nwritten statement was permitted to be taken on record. In the present case,\nthe said date would be 11th July, 2022. He further submits that the aforesaid\njudgments relied upon by the defendant are not applicable to the facts and\ncircumstances of the case.\n8.\nI have heard the counsels for the parties.\n9.\nTo appreciate the submissions of the parties, a reference may be made\nto the relevant portion of Chapter VII Rule 5 of the Delhi High Court (OS)\nRules, which is reproduced below:\n“5. Replication. – The replication, if any, shall be filed within\n30 days of receipt of the written statement. …”\n10.\nThe Division Bench in Ram Sarup Lugani (supra) while considering\nthe aforesaid Rule came to the conclusion that the Rule 5 of the Delhi High\nCourt (OS) Rules is mandatory in nature and the replication cannot be\npermitted to be taken on record after the exhaustion of the maximum\nprescribed period of 45 days. The issue before the Division Bench was not\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 16:52:41\nSignature Not Verified",
          "pdf_source": "14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0009",
      "start_index": 4,
      "end_index": 6,
      "summary": "**Source:** Section: Legal Arguments from the PDF document \"14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf\"\n\n**Case Details:**\n\n* Case Number: CS(COMM) 34/2022\n* Court: High Court of Delhi at New Delhi\n* Date of Decision: February 7, 2023\n\n**Parties:**\n\n* Plaintiffs: SNS Products Private Limited (represented by Mr. Tejveer Singh Bhatia, Mr. Kunal Vats, and Ms. Tanya Arora)\n* Defendant: Ijaz Uddin (represented by Mr. Shashank Khurana)\n\n**Legal Arguments and Decisions:**\n\n* The court was considering whether to accept a replication filed by the plaintiff in response to the defendant's written statement.\n* The defendant argued that the period for filing replication should begin from the date of supply of the written statement, as per Rule 5 of Chapter VII of the Delhi High Court (OS) Rules. However, the court disagreed and ruled that the period would begin only when the delay in filing the written statement is condoned.\n* The plaintiff's replication was filed within 12 days after the written statement was taken on record, which was permitted by the court.\n\n**Outcome:**\n\n* The replication filed by the plaintiff along with admission/denial of documents was permitted to be taken on record by the court.\n* The interim orders would continue until further proceedings on March 2, 2023.",
      "pdf_source": "14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf",
      "nodes": [
        {
          "title": "Page 4",
          "node_id": "0006",
          "start_index": 4,
          "end_index": 4,
          "summary": "**Summary of Page 4 from PDF**\n\nSource: 14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf (CS(COMM) 34/2022)\n\nThe page discusses a dispute over the commencement date for filing a replication in a civil case.\n\n**Key Points:**\n\n* The Division Bench's observations are not relevant to the defendant.\n* The period for filing a replication does not necessarily commence from the date of written statement supply by the defendant.\n* Where a written statement is filed beyond the statutory time limit, the 30-day period for filing a replication begins when the application for delay condonation is allowed and the written statement is taken on record.\n\n**Important Dates:**\n\n* February 7, 2023 (Date of decision)\n* February 10, 2023 (Signing date)\n\n**Names:**\n\n* IJAZ UDDIN\n* AMIT BANSAL\n\nThis summary focuses on legal facts and proceedings from page 4 of the PDF.",
          "content": "2023/DHC/000970\nCS(COMM) 34/2022\nPage 4 of 6\nwith regard to the date from which the period of 45 days for filing the\nreplication would begin. The issue before the Division Bench was in the\ncontext of whether delay in filing the replication can be condoned beyond\nthe period of 45 days in terms of Rule 5 of Chapter VII of the Delhi High\nCourt (OS) Rules. Therefore, the observations of the Division Bench would\nnot be of any assistance to the defendant.\n11.\nI do not agree with the submission of the defendant that in all cases\nthe period for filing replication would commence from the date of written\nstatement being supplied by the defendant to the plaintiff in terms of Rule 5\nof the Delhi High Court (OS) Rules. Undoubtedly, the language used in\nRule 5 of the Delhi High Court (OS) Rules is that the replication has to be\nfiled within 30 days from the receipt of the written statement. This may be\nordinarily so. However, where the written statement was filed beyond the\nstatutory time limit and was taken on record only upon an application for\ncondonation of delay being allowed by the Court, the aforesaid rule has to\nbe interpreted in a manner that the period of 30 days will begin from the\ntime the written statement is permitted to be taken on record.\n12.\nThis issue may be examined from a different point of view as well.\nThere would be no requirement for the plaintiff to file a replication in the\nevent that the application seeking condonation of delay in filing written\nstatement is not allowed and the written statement is not taken on record.\nThe plaintiff would be required to file replication only once the condonation\nin delay is allowed and the written statement is taken on record. Therefore, it\nis axiomatic that the period for filing replication would only commence from\nthe date when the delay is condoned and the written statement is taken on\nrecord.\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 16:52:41\nSignature Not Verified",
          "pdf_source": "14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf",
          "nodes": []
        },
        {
          "title": "Page 5",
          "node_id": "0007",
          "start_index": 5,
          "end_index": 5,
          "summary": "**PDF Source:** 14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf (2023/DHC/000970)\n\n**Case Details:**\n\n* Case Number: CS(COMM) 34/2022\n* Parties: SNS Products Private Limited (Plaintiff) vs. Ijaz Uddin (Defendant)\n* Judge: Hon'ble Mr. Justice Amit Bansal\n\n**Summary of Page 5:**\n\nThe defendant, Ijaz Uddin, objects to the plaintiff's replication based on a judgment in Atlanta Limited, stating that the written statement was filed belatedly and should not be recognized. However, the court holds that the written statement was allowed to be taken on record after being delayed, and the replication was filed within 12 days from that date.\n\n**Key Points:**\n\n* The written statement was permitted to be taken on record later than expected.\n* The replication was filed within 12 days of the rescheduled date.\n* Reliance on Atlanta Limited is deemed misplaced by the court.\n* No merit in the defendant's objection, and the replication is allowed to be recorded.",
          "content": "2023/DHC/000970\nCS(COMM) 34/2022\nPage 5 of 6\n13.\nIn the present case, the replication was filed by the plaintiff within 12\ndays after the written statement was taken on record. It was the defendant\nwho had filed the written statement in a belated manner and sought\ncondonation of delay for the same, which the counsel for the plaintiff fairly\ndid not oppose. Therefore, there is no basis for the defendant to object to the\nreplication being taken on record.\n14.\nReliance has been placed by the counsel for the defendant on the\njudgment in Atlanta Limited (supra). In the said case, the written statement\nwas already taken on record and the plaintiff had filed an application under\nthe provisions of Order VIII Rule 10 of the CPC for taking the written\nstatement off the record as the filing of the written statement was delayed\nand the said application was dismissed. The counsel for the plaintiff therein\nfiled an application contending that the maximum permissible period of 45\ndays for filing replication should be counted from the date when the\napplication of the plaintiff for taking the written statement off the record was\ndismissed. The said application was rejected by the Court. In the present\ncase the written statement though filed by the defendant earlier, was\npermitted to be taken on record only on a subsequent date and the replication\nwas filed within 12 days from the said date. Therefore, reliance placed on\nthe judgment in Atlanta Limited (supra) is misplaced.\n15.\nTherefore, I do not find any merit in the submission of the defendant\nthat the replication filed by the plaintiff along with admission/denial of\ndocuments not be taken on record. Accordingly, the replication is permitted\nbe taken on record.\n16.\nList on 2nd March, 2023.\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 16:52:41\nSignature Not Verified",
          "pdf_source": "14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf",
          "nodes": []
        },
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "Based on page 6 of the provided PDF file \"14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf\" (2023/DHC/000970) from CS(COMM) 34/2022, the following highlights are noted:\n\n* The case: SNS Products Private Limited vs. Ijaz Uddin\n* Date of decision: February 7, 2023\n* Judge: Hon'ble Mr. Justice Amit Bansal (Oral)\n* Order:\n\t+ List for further proceedings on March 2, 2023.\n\t+ Interim orders to continue.\n\nKey names and details mentioned:\n\n* Plaintiff: SNS Products Private Limited (represented by Mr.Tejveer Singh Bhatia, Mr. Kunal Vats, and Ms. Tanya Arora).\n* Defendant: Ijaz Uddin (represented by Mr. Shashank Khurana)\n* Judge: AMIT BANSAL\n* Case number: CS(COMM) 34/2022",
          "content": "2023/DHC/000970\nCS(COMM) 34/2022\nPage 6 of 6\nI.A. 813/2022 (O-XXXIX R-1 & 2 of CPC)\n17.\nList for further proceedings on 2nd March 2023.\n18.\nInterim orders to continue.\nAMIT BANSAL, J\nFEBRUARY 7, 2023\nrt/sr\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 16:52:41\nSignature Not Verified",
          "pdf_source": "14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0010",
      "start_index": 7,
      "end_index": 6,
      "summary": "Section 'Court Decision' from 14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf - No extractable content",
      "pdf_source": "14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf",
      "nodes": []
    }
  ],
  "created_at": "2025-07-16T15:26:25.959021",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}