{
  "doc_name": "15. SANDISK LLC vs Excel",
  "pdf_source": "15. SANDISK LLC vs Excel.pdf",
  "metadata": {
    "document_name": "15. SANDISK LLC vs Excel",
    "source_pdf": "15. SANDISK LLC vs Excel.pdf",
    "judges": [
      "AMIT BANSAL"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "992/2018",
      "992/2018",
      "992/2018",
      "992/2018",
      "992/2018",
      "992/2018",
      "992/2018",
      "992/2018",
      "992/2018",
      "992/2018",
      "5298/2023",
      "5297/2023",
      "8516/2018"
    ],
    "dhc_numbers": [
      {
        "number": "2023:DHC:2057",
        "type": "DHC (Delhi High Court) Number"
      }
    ],
    "ia_numbers": [],
    "decision_date": "17 March, 2023",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      {
        "name": "SANDISK LLC",
        "type": "LLC",
        "country": "USA"
      },
      {
        "name": "SanDisk India Device Design",
        "relation_to_plaintiff1": "sister concern"
      }
    ],
    "defendants": [
      {
        "name": "EXCEL MARKETING"
      }
    ],
    "appellants": [],
    "respondents": [],
    "plaintiff_advocates": [
      {
        "name": "Mr. Prithvi Singh",
        "firm": null
      },
      {
        "name": "Ms. Devyani Nath",
        "firm": null
      },
      {
        "name": "Ms. Coral Shah",
        "firm": null
      }
    ],
    "defendant_advocates": [
      {
        "name": null,
        "firm": null
      }
    ],
    "appellant_advocates": [],
    "respondent_advocates": [],
    "damages_claimed": "29,00,000",
    "damages_awarded": null,
    "key_issues": [
      "Here are the main legal issues:",
      "• Infringement of trademark rights: The plaintiff is seeking to restrain the defendant from using its registered trademarks \"SanDisk\" and \"Cruzer Blade\".",
      "• Passing off: The plaintiff alleges that the defendant's use of similar marks and packaging amounts to passing off as the original SanDisk products.",
      "• Copyright infringement: The plaintiff asserts that the unique packaging of its products constitutes an \"original artistic work\" under the Copyright Act, 1957, and seeks protection against unauthorized use.",
      "• Ex parte ad interim injunction: The court had earlier granted an ex parte ad interim injunction in favor of the plaintiffs, which is being contested by the defendant.",
      "• Jurisdiction: Whether this court has jurisdiction over the trademark and copyright claims raised by the plaintiff in India.",
      "• Scope of intellectual property rights: The scope of protection for trademarks, copyrights, and passing off under Indian law, particularly with respect to domain name registration and packaging design.",
      "• Evidence of infringement: Whether the plaintiff has provided sufficient evidence to establish that the defendant's activities constitute trademark and copyright infringement."
    ],
    "decision_summary": "**Summary of Case: SanDisk LLC & Anr. vs. Excel Marketing**\n\n**Background:**\nSanDisk LLC, a US-based company, filed a lawsuit against Excel Marketing, an Indian company, alleging trademark and copyright infringement. The plaintiffs claimed that the defendant was selling counterfeit micro SDHC cards and USB flash drives bearing their registered trademarks \"SanDisk,\"  (logo), the red frame logo [], and \"Cruzer Blade.\"\n\n**Legal Issues:**\n\n1. **Trademark Infringement:** The plaintiffs alleged that the defendant's use of identical or similar trademarks infringed their exclusive rights under the Trade Marks Act, 1999.\n2. **Copyright Infringement:** The plaintiffs claimed that their unique packaging qualified as an \"original artistic work\" under the Copyright Act, 1957, and that the defendant's unauthorized reproduction of the same constituted copyright infringement.\n\n**Arguments:**\n\n1. **Plaintiffs (SanDisk LLC & Anr.):**\n\t* Argued that they were the registered proprietors of the SanDisk trademarks in India and had been selling their products in the Indian market since 2005.\n\t* Claimed to have suffered losses due to the defendant's alleged infringement.\n\t* Submitted photographs of counterfeit products bearing the plaintiffs' marks as evidence.\n2. **Defendant (Excel Marketing):**\n\t* Did not contest the ownership of the SanDisk trademarks by the plaintiffs.\n\t* Argued that they had no intention of infringing the plaintiffs' rights and were selling genuine products.\n\n**Court Findings:**\n\n1. **Trademark Infringement:** The court found that the defendant's use of identical or similar trademarks constituted trademark infringement under Section 28 of the Trade Marks Act, 1999.\n2. **Copyright Infringement:** The court held that the plaintiff's unique packaging qualified as an \"original artistic work\" and that the defendant's unauthorized reproduction of the same constituted copyright infringement under Section 14(1) of the Copyright Act, 1957.\n\n**Decision:**\n\nThe Hon'ble Mr. Justice Amit Bansal passed an order granting a permanent injunction in favour of the plaintiffs, restraining the defendant from:\n\n* Dealing in any product or packaging bearing the plaintiffs' registered trademarks SanDisk, (logo), the red frame logo [], and Cruzer Blade;\n* Manufacturing, marketing, selling, offering for sale, advertising, directly or indirectly dealing in any product or any product packaging bearing marks confusingly or deceptively similar to those of the plaintiffs.\n\nThe court also ordered a summary judgment against the defendant, dismissing their opposition to the grant of interim injunction.",
    "legal_precedents": [
      "Uflex Government"
    ],
    "full_text": "\n--- PAGE 1 ---\n2023:DHC:2057 \n \n          CS(COMM) 992/2018                                                                    Page 1 of 8 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n \n \n \n \n \n \n      Date of decision: 17th March, 2023. \n \n+  \nCS(COMM) 992/2018 and I.A. 5298/2023 (for exemption) \n \n \nSANDISK LLC & ANR.  \n \n \n \n..... Plaintiffs \nThrough: \nMr.Prithvi Singh, Ms.Devyani Nath \nand Ms.Coral Shah, Advocates. \n \n \n \n \nversus \n \n \nEXCEL MARKETING  \n \n \n \n..... Defendant \n \n \n \n \nThrough: \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nAMIT BANSAL, J. (Oral) \n \nI.A.5297/2023 (O-XIII A R-3 & 6(1)(a) of CPC for Summary Judgment) \n& CS(COMM) 992/2018 \n \n1. \nThe present suit has been filed seeking relief of permanent injunction \nrestraining the defendant from infringing the trademark and copyright of the \nplaintiffs, passing off and other ancillary reliefs \nPLEADINGS IN THE PLAINT \n2. \nThe case set up by the plaintiffs in the plaint is as follows: \n2.1. Plaintiff no.1, SanDisk LLC is an entity existing under the laws of the \nstate of Delaware, USA. The plaintif no.1 is the registered proprietor of the \ntrademarks SanDisk, \n(logo), the red frame logo [\n],  \nSanDisk Ultra and Cruzer Blade (hereinafter „SanDisk trademarks‟). \nPlaintiff no.2, SanDisk India Device Design is a sister concern of the plaintiff \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:22.03.2023 18:39:48\nSignature Not Verified\n\n--- PAGE 2 ---\n2023:DHC:2057 \n \n          CS(COMM) 992/2018                                                                    Page 2 of 8 \n \nno.1 and is the registered user of the SanDisk trademarks. The plaintiffs \ndesign, develop and manufacture data storage solutions in a range of form \nfactors using flash memory, controller and firmware technologies. \n2.2. The plaintiffs are the registered proprietor of the trademark SanDisk \nand SanDisk formative marks in Class 9 of the Trade Marks Act, 1999. \nDetails of the plaintiffs SanDisk trademarks registered in India have been \ntabulated in paragraph no.15 of the plaint. The earliest registration of the \nplaintiffs‟ SanDisk mark is of 14th November, 2003. The said marks of the \nplaintiffs are also registered by the plaintiff no.1 in various foreign \ncountries.  \n2.3. The plaintiff no.1 sells its memory cards in a unique and distinct \npackaging. The packaging of the plaintiffs qualifies as an „original artistic \nwork‟ within the meaning of Section 2(c) of the Copyright Act, 1957 and the \nplaintiff is entitled to the exclusive rights in the same. \n2.4. The plaintiff no.1 has been selling its products in the Indian market \nsince 2005. It is further stated that approximately 3,00,000 storefronts \nworldwide stock and sell the plaintiffs‟ products and the plaintiffs spend \nhundreds of millions of dollars in research and development of their \nproducts and on advertising. \n2.5. In June 2018, the plaintiffs discovered that some unauthorised third-\nparties were marketing and selling counterfeit micro SDHC cards and USB \nflash drives bearing the identical trademarks and packaging as the plaintiffs‟ \nproducts marketed and sold under the trademarks „SanDisk‟ and „Cruzer \nBlade‟. Pursuant thereto, the plaintiffs availed the services of an \ninvestigator, to ascertain the business activities of the defendant. The \ninvestigator purchased samples of the counterfeit products bearing the mark \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:22.03.2023 18:39:48\nSignature Not Verified\n\n--- PAGE 3 ---\n2023:DHC:2057 \n \n          CS(COMM) 992/2018                                                                    Page 3 of 8 \n \n„SanDisk‟ and „Cruzer Blade‟ from the defendant. Photographs of the said \ncounterfeit products have been filed long with the plaint. \n2.6. Accordingly, the plaintiffs have filed the present suit.  \nPROCEEDINGS IN THE SUIT \n3. \nThis Court, vide order dated 5th July, 2018 granted an ex parte ad \ninterim injunction in favour of the plaintiffs under I.A.8516/2018, \nrestraining the defendant from dealing in any product or packaging bearing \nthe plaintiffs‟ registered trademarks  SanDisk, \n (logo), the \nred frame logo [\n],  and Cruzer Blade.  The relevant portion of the \nsaid order is as under: \n“Keeping in view the aforesaid, this Court is of the opinion that \na prima facie case of infringement is made out in favour of the \nplaintiffs and balance of convenience is also in their favour. \nFurther, irreparable harm or injury would be caused to the \nplaintiffs if an interim injunction order is not passed. \n  \nConsequently, \ntill \nfurther \norders, \nthe \ndefendant, \nits \nproprietors/partners, servants, agents and all others in active \nconcert with them are restrained from manufacturing, \nmarketing, selling, offering for sale, advertising, directly or \nindirectly dealing in any product or any product packaging \nbearing the plaintiffs' registered trademarks SanDisk, the \nlogo, 'Cruzer Blade' and the Red Frame Logo \nand/or any mark/s or confusingly or deceptively similar in any \nmanner whatsoever.” \n \n4. \nVide the aforesaid order, a Local Commissioner was appointed by the \nCourt to seize and inventories the infringing products. The Local \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:22.03.2023 18:39:48\nSignature Not Verified\n\n--- PAGE 4 ---\n2023:DHC:2057 \n \n          CS(COMM) 992/2018                                                                    Page 4 of 8 \n \nCommission was carried out on 20th July, 2018 and a copy of the entire suit \npaper book was served upon the defendant. The report of the Local \nCommissioner has been placed on record.  \n5. \nThe defendant filed written statement to the plaint on 27th October, \n2018 along with purchase and sales invoices. Subsequently, the plaintiff \nfiled an application under Order VI Rule 17 of the CPC seeking amendment \nof plaint, which was allowed vide order dated 4th February, 2019 passed by \nthe Joint Registrar. Order dated 16th May, 2019 records that the defendant \ndid not wish to file written statement to the amended plaint and therefore, \nthe pleadings stood complete. \n6. \nThe defendant has not been appearing in the suit since 20th April, \n2022 and vide order dated 28th February, 2023, the defendant was proceeded \nagainst ex parte. \n7. \nAccordingly, the present application for passing a summary judgment \nhas been filed. \n8. \nCounsel for the plaintiffs submits that this is a fit case where a \nSummary Judgment in terms of Order XIII-A of the Code of Civil \nProcedure, as applicable to commercial disputes of a specified value, read \nwith Rule 27 of the Delhi High Court Intellectual Property Rights Division \nRules, 2022 (in short, „IPD Rules‟), deserves to be passed in favour of the \nplaintiffs and against the defendant. \nANALYSIS AND FINDINGS \n9. \nI have heard the counsel for the plaintiffs and perused the record of \nthe case.  \n10. \nFrom the averments made in the plaint and the documents filed \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:22.03.2023 18:39:48\nSignature Not Verified\n\n--- PAGE 5 ---\n2023:DHC:2057 \n \n          CS(COMM) 992/2018                                                                    Page 5 of 8 \n \ntherewith, the plaintiffs have been able to prove that they are the registered \nproprietors of the SanDisk trademarks and the said registrations are valid \nand subsisting. The plaintiffs have also been able to show their goodwill and \nreputation in respect of the SanDisk trademarks. Plaintiffs have established \nstatutory as well as common law rights on account of long usage of the \nSanDisk trademarks. \n11. \nA comparison of the original products of the plaintiffs and the \ncounterfeit products of the defendant has been made in paragraph 33 of the \nplaint. From the comparison it is clear that the defendant has made use of \nidentical trademarks and packaging in relation to counterfeit goods. The \nreport of the Local Commissioner also shows that the defendant is indulging \nin marketing and sales of counterfeit products, which bear the identical \nmarks as that of the plaintiffs. \n12. \nThe marketing and selling of counterfeit products by the defendant \nnot only amount to infringing the registered SanDisk trademarks and \ncopyrights of the plaintiffs but also to passing off the goods of the defendant \nas that of the plaintiffs. The defendant has taken unfair advantage of the \nreputation and goodwill of the plaintiffs‟ marks and has also deceived \nunwary consumers of its association with the plaintiffs. Such acts of the \ndefendant would also lead to dilution of the plaintiffs‟ marks. \n13. \nThe defendant in its written statement to the original plaint has made \nbare averments without placing on record any substantial documentary \nevidence. Moreover, since the defendant has failed to enter appearance after \n20th April, 2022, despite having suffered an ad interim injunction order, it is \nevident that the defendant has nothing substantial to urge.  \n14. \nI am of the opinion that no purpose would be served by directing the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:22.03.2023 18:39:48\nSignature Not Verified\n\n--- PAGE 6 ---\n2023:DHC:2057 \n \n          CS(COMM) 992/2018                                                                    Page 6 of 8 \n \nplaintiffs to lead ex parte evidence by filing an affidavit of examination in \nchief. Therefore, in my opinion, this is a fit case where a Summary \nJudgment in terms of Order XIII-A of the CPC, as applicable to commercial \ndisputes of a specified value, read with Rule 27 of the IPD Rules, deserves \nto be passed in favour of the plaintiffs and against the defendant. Reference \nin this regard may be made to the judgment in Su-Kam Power Systems Ltd. \nv. Kunwer Sachdev, 2019 SCC OnLine Del 10764, wherein this Court has \nobserved as under: \n“90. To reiterate, the intent behind incorporating the summary \njudgment procedure in the Commercial Court Act, 2015 is to \nensure disposal of commercial disputes in a time-bound \nmanner. In fact, the applicability of Order XIIIA, CPC to \ncommercial disputes, demonstrates that the trial is no longer \nthe default procedure/norm. \n \n91. Rule 3 of Order XIIIA, CPC, as applicable to commercial \ndisputes, empowers the Court to grant a summary judgement \nagainst the defendant where the Court considers that the \ndefendant has no real prospects of successfully defending the \nclaim and there is no other compelling reason why the claim \nshould not be disposed of before recording of oral evidence. \nThe expression “real” directs the Court to examine whether \nthere is a “realistic” as opposed to “fanciful” prospects of \nsuccess. This Court is of the view that the expression “no \ngenuine issue requiring a trial” in Ontario Rules of Civil \nProcedure and “no other compelling reason…..for trial” in \nCommercial Courts Act can be read mutatis mutandis. \nConsequently, Order XIIIA, CPC would be attracted if the \nCourt, while hearing such an application, can make the \nnecessary finding of fact, apply the law to the facts and the \nsame is a proportionate, more expeditious and less expensive \nmeans of achieving a fair and just result. \n \n92. Accordingly, unlike ordinary suits, Courts need not hold \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:22.03.2023 18:39:48\nSignature Not Verified\n\n--- PAGE 7 ---\n2023:DHC:2057 \n \n          CS(COMM) 992/2018                                                                    Page 7 of 8 \n \ntrial in commercial suits, even if there are disputed questions of \nfact as held by the Canadian Supreme Court in Robert \nHryniak (supra), in the event, the Court comes to the conclusion \nthat the defendant lacks a real prospect of successfully \ndefending the claim.” \n \n15. \nThe aforesaid principles are fully applicable in the facts and \ncircumstances of the present case and therefore, the plaintiffs are entitled to \na summary judgment. \n16. \nIn view of the above, the present application is allowed.  \nRELIEF \n17. \nThe various registrations and the long usage of the SanDisk \ntrademarks by the plaintiffs, as also the goodwill vesting in the SanDisk \ntrademarks, entitles the plaintiffs for grant of permanent injunction and \ndecree in terms of the plaint. \n18. \nAccordingly, the present suit is decreed against the defendant in terms \nof the relief of permanent injunction as sought in prayer clauses 41 (a) and \n(b).  \n19. \nInsofar as delivery up for the purpose of destruction, as sought in \nprayer clause 41(c) is concerned, the goods seized by the Local \nCommissioner, which are lying in supardari with the defendant, the details \nof which are given in paragraph 6 of the report dated 20th July, 2018 are \ndirected to be handed to the representatives of the plaintiffs forthwith for the \npurpose of destruction, in compliance with extant rules/regulations. \n20. \nSince the defendant is not appearing any longer and has not rendered \nany accounts of profits, the said relief as sought in prayer clause 41(d) \ncannot be granted.  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:22.03.2023 18:39:48\nSignature Not Verified\n\n--- PAGE 8 ---\n2023:DHC:2057 \n \n          CS(COMM) 992/2018                                                                    Page 8 of 8 \n \n21. \nThe Local Commissioner found a total number of 253 infringing and \ncounterfeit goods at the premises of the defendant, which were inventorized \nby him and seized and handed over on supardari to the defendant. Further, \nthe sale invoices filed by the defendant which go as far back as September, \n2016 reflect total sales of more than Rs.29,00,000. \n22. \nI am convinced that this is not a case of innocent adoption and \ntherefore, the plaintiffs are entitled to damages. Taking a reasonable \nassessment of the volume of seizure made, nature of counterfeiting indulged \ninto by the defendant, in the opinion of the Court, the plaintiffs are entitled \nto damages Rs,5,00,000.  \n23. \nPlaintiffs have also incurred costs for executing the commission and \ndeposited court fees. Thus, in view of the judgment of the Supreme Court in \nUflex v. Government of Tamil Nadu, 2021 SCC OnLine SC 738 as well as \nin terms of the Commercial Courts Act, 2015 and the Delhi High Court \n(Original Side) Rules, 2018 read with Delhi High Court Intellectual Property \nDivision Rules, 2022, the plaintiffs are entitled to actual costs recoverable \nfrom the defendant. Plaintiffs shall file their bill of costs in terms of Rule 5 \nof Chapter XXIII of the Delhi High Court (Original Side) Rules, 2018 on or \nbefore 31st March, 2023. As and when the same is filed, the matter will be \nlisted before the Taxing Officer for computation of the costs. \n24. \nLet the decree sheet be drawn up.  \n25. \nAll pending applications are disposed of in the above terms. \n \n \nAMIT BANSAL, J \nMARCH 17, 2023 \nsr \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:22.03.2023 18:39:48\nSignature Not Verified\n"
  },
  "total_pages": 8,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "**Case Summary: SanDisk LLC vs Excel Marketing**\n\nSource: Section \"Case Header and Parties\" from PDF document 15.SANDISK LLC vs Excel.pdf (Court case #2023:DHC:2057)\n\n**Background:**\n\n* SanDisk LLC (plaintiff) and its sister concern, SanDisk India Device Design (plaintiff), file a lawsuit against Excel Marketing (defendant) seeking permanent injunction to restrain unauthorized use of their trademarks and copyrights.\n* The plaintiffs are registered proprietors of the \"SanDisk\" trademark in Class 9 of the Trade Marks Act, 1999.\n\n**Facts:**\n\n* Plaintiffs sell products in unique packaging qualifying as an \"original artistic work\" under Section 2(c) of the Copyright Act, 1957.\n* They operate globally with approximately 3,00,000 storefronts stocking and selling their products.\n* In June 2018, plaintiffs discovered unauthorized third-party marketing and sales of counterfeit micro SDHC cards and USB flash drives bearing identical trademarks and packaging.\n\n**Arguments and Proceedings:**\n\n* The plaintiffs seek a permanent injunction restraining the defendant from infringing their trademarks and copyrights, passing off, and other ancillary reliefs.\n* They argue that they have spent hundreds of millions on research and development, sales, and advertising.\n* The court has been approached with an application for summary judgment (I.A.5297/2023).\n\n**Notable Dates:**\n\n* Date of decision: 17th March, 2023\n* Registration of the plaintiffs' SanDisk mark: November 14, 2003",
      "pdf_source": "15. SANDISK LLC vs Excel.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "According to page 1 of the PDF \"15. SANDISK LLC vs Excel.pdf\", here are the key points:\n\n**Case Details**\n\n* Case Number: CS(COMM) 992/2018\n* Application Number: I.A. 5298/2023 (for exemption)\n* Date of Decision: 17th March, 2023\n* Court: High Court of Delhi at New Delhi\n\n**Parties**\n\n* Plaintiffs:\n\t+ SanDisk LLC (registered proprietor of trademarks including \"SanDisk\")\n\t+ SanDisk India Device Design (sister concern of Plaintiff 1)\n* Defendant: Excel Marketing\n\n**Relief Sought**\n\n* Permanent injunction restraining the defendant from infringing the trademark and copyright of the plaintiffs\n* Passing off and other ancillary reliefs\n\n**Pleadings in the Plaint**\n\n* The plaintiffs claim to be the registered proprietors of various trademarks, including \"SanDisk\", \"Ultra\", and \"Cruzer Blade\".",
          "content": "2023:DHC:2057 \n \n          CS(COMM) 992/2018                                                                    Page 1 of 8 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n \n \n \n \n \n \n      Date of decision: 17th March, 2023. \n \n+  \nCS(COMM) 992/2018 and I.A. 5298/2023 (for exemption) \n \n \nSANDISK LLC & ANR.  \n \n \n \n..... Plaintiffs \nThrough: \nMr.Prithvi Singh, Ms.Devyani Nath \nand Ms.Coral Shah, Advocates. \n \n \n \n \nversus \n \n \nEXCEL MARKETING  \n \n \n \n..... Defendant \n \n \n \n \nThrough: \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nAMIT BANSAL, J. (Oral) \n \nI.A.5297/2023 (O-XIII A R-3 & 6(1)(a) of CPC for Summary Judgment) \n& CS(COMM) 992/2018 \n \n1. \nThe present suit has been filed seeking relief of permanent injunction \nrestraining the defendant from infringing the trademark and copyright of the \nplaintiffs, passing off and other ancillary reliefs \nPLEADINGS IN THE PLAINT \n2. \nThe case set up by the plaintiffs in the plaint is as follows: \n2.1. Plaintiff no.1, SanDisk LLC is an entity existing under the laws of the \nstate of Delaware, USA. The plaintif no.1 is the registered proprietor of the \ntrademarks SanDisk, \n(logo), the red frame logo [\n],  \nSanDisk Ultra and Cruzer Blade (hereinafter „SanDisk trademarks‟). \nPlaintiff no.2, SanDisk India Device Design is a sister concern of the plaintiff \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:22.03.2023 18:39:48\nSignature Not Verified",
          "pdf_source": "15. SANDISK LLC vs Excel.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "**PDF Source:** SANDISK LLC vs Excel.pdf (2023:DHC:2057)\n\n**Summary of Page 2:**\n\nThe plaintiffs, SanDisk LLC, are the registered proprietors of the trademark \"SanDisk\" in Class 9 of the Trade Marks Act, 1999. They have registered their SanDisk mark in India since November 14, 2003, and also in various foreign countries.\n\nKey points:\n\n* The plaintiff no.1 designs, develops, and manufactures data storage solutions using flash memory, controller, and firmware technologies.\n* The plaintiffs sell their products worldwide, with approximately 300,000 storefronts stocking their products.\n* They spend hundreds of millions of dollars on research and development and advertising.\n* In June 2018, the plaintiffs discovered unauthorized third-parties marketing counterfeit micro SDHC cards and USB flash drives bearing their trademarks.\n\n**Important Dates and Names:**\n\n* Date of discovery of counterfeiting: June 2018\n* Registration of SanDisk mark in India: November 14, 2003 (registered since)\n* Digitally Signed By: Amit Bansal",
          "content": "2023:DHC:2057 \n \n          CS(COMM) 992/2018                                                                    Page 2 of 8 \n \nno.1 and is the registered user of the SanDisk trademarks. The plaintiffs \ndesign, develop and manufacture data storage solutions in a range of form \nfactors using flash memory, controller and firmware technologies. \n2.2. The plaintiffs are the registered proprietor of the trademark SanDisk \nand SanDisk formative marks in Class 9 of the Trade Marks Act, 1999. \nDetails of the plaintiffs SanDisk trademarks registered in India have been \ntabulated in paragraph no.15 of the plaint. The earliest registration of the \nplaintiffs‟ SanDisk mark is of 14th November, 2003. The said marks of the \nplaintiffs are also registered by the plaintiff no.1 in various foreign \ncountries.  \n2.3. The plaintiff no.1 sells its memory cards in a unique and distinct \npackaging. The packaging of the plaintiffs qualifies as an „original artistic \nwork‟ within the meaning of Section 2(c) of the Copyright Act, 1957 and the \nplaintiff is entitled to the exclusive rights in the same. \n2.4. The plaintiff no.1 has been selling its products in the Indian market \nsince 2005. It is further stated that approximately 3,00,000 storefronts \nworldwide stock and sell the plaintiffs‟ products and the plaintiffs spend \nhundreds of millions of dollars in research and development of their \nproducts and on advertising. \n2.5. In June 2018, the plaintiffs discovered that some unauthorised third-\nparties were marketing and selling counterfeit micro SDHC cards and USB \nflash drives bearing the identical trademarks and packaging as the plaintiffs‟ \nproducts marketed and sold under the trademarks „SanDisk‟ and „Cruzer \nBlade‟. Pursuant thereto, the plaintiffs availed the services of an \ninvestigator, to ascertain the business activities of the defendant. The \ninvestigator purchased samples of the counterfeit products bearing the mark \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:22.03.2023 18:39:48\nSignature Not Verified",
          "pdf_source": "15. SANDISK LLC vs Excel.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0006",
      "start_index": 3,
      "end_index": 4,
      "summary": "**Section: Background and Facts from Case No. CS(COMM) 992/2018**\n\nThe case revolves around a trademark infringement dispute between Sandisk LLC and Excel Marketing.\n\n**Facts:**\n\n* SanDisk LLC filed a lawsuit against Excel Marketing for counterfeiting products, including \"SanDisk\" and \"Cruzer Blade\".\n* The court granted an ex parte ad interim injunction on July 5, 2018, restraining Excel from dealing with infringing products.\n* A Local Commissioner was appointed to seize and inventory the infringing products on July 20, 2018.\n\n**Procedure:**\n\n* The defendant filed a written statement on October 27, 2018, along with purchase and sales invoices.\n* The plaintiffs applied for an amendment of the plaint under Order VI Rule 17 of the CPC, which was allowed on February 4, 2019.\n* The pleadings stood complete on May 16, 2019.\n\n**Proceeding against Ex Parte:**\n\n* Excel Marketing did not appear in the suit since April 20, 2022 and was proceeded against ex parte on February 28, 2023.\n\n**Summary Judgment Application:**\n\n* The plaintiffs filed an application for a summary judgment under Order XIII-A of the CPC and Rule 27 of the Delhi High Court Intellectual Property Rights Division Rules, 2022.\n* Counsel for the plaintiffs argued that this is a fit case for a Summary Judgment in favor of the plaintiffs against the defendant.\n\n**Decision:**\n\n* The court will hear the counsel for the plaintiffs and consider passing a summary judgment in favor of SanDisk LLC and against Excel Marketing.\n\nSource: Sandisk LLC vs Excel.pdf, Case No. CS(COMM) 992/2018, Delhi High Court (2023:DHC:2057).",
      "pdf_source": "15. SANDISK LLC vs Excel.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "Here is a summary of page 3 from the PDF \"SANDISK LLC vs Excel.pdf\":\n\nOn July 5, 2018, the Delhi High Court granted an ex parte ad interim injunction in favor of Sandisk LLC (plaintiff) under I.A.8516/2018, restraining Excel Marketing (defendant) from:\n\n* Manufacturing\n* Marketing\n* Selling\n* Offering for sale\n* Advertising\n* Dealing in any product or packaging bearing the plaintiff's registered trademarks SanDisk, logo, Cruzer Blade, and Red Frame Logo\n\nThe court held that a prima facie case of infringement was made out, balance of convenience was in favor of the plaintiff, and irreparable harm would be caused to the plaintiff if an interim injunction order was not passed.\n\nA Local Commissioner was appointed to seize and inventory infringing products. This decision is part of the Court Order CS(COMM) 992/2018 (Page 3 of 8).\n\nPDF source: \"SANDISK LLC vs Excel.pdf\" - a court document related to Case No. 2023:DHC:2057",
          "content": "2023:DHC:2057 \n \n          CS(COMM) 992/2018                                                                    Page 3 of 8 \n \n„SanDisk‟ and „Cruzer Blade‟ from the defendant. Photographs of the said \ncounterfeit products have been filed long with the plaint. \n2.6. Accordingly, the plaintiffs have filed the present suit.  \nPROCEEDINGS IN THE SUIT \n3. \nThis Court, vide order dated 5th July, 2018 granted an ex parte ad \ninterim injunction in favour of the plaintiffs under I.A.8516/2018, \nrestraining the defendant from dealing in any product or packaging bearing \nthe plaintiffs‟ registered trademarks  SanDisk, \n (logo), the \nred frame logo [\n],  and Cruzer Blade.  The relevant portion of the \nsaid order is as under: \n“Keeping in view the aforesaid, this Court is of the opinion that \na prima facie case of infringement is made out in favour of the \nplaintiffs and balance of convenience is also in their favour. \nFurther, irreparable harm or injury would be caused to the \nplaintiffs if an interim injunction order is not passed. \n  \nConsequently, \ntill \nfurther \norders, \nthe \ndefendant, \nits \nproprietors/partners, servants, agents and all others in active \nconcert with them are restrained from manufacturing, \nmarketing, selling, offering for sale, advertising, directly or \nindirectly dealing in any product or any product packaging \nbearing the plaintiffs' registered trademarks SanDisk, the \nlogo, 'Cruzer Blade' and the Red Frame Logo \nand/or any mark/s or confusingly or deceptively similar in any \nmanner whatsoever.” \n \n4. \nVide the aforesaid order, a Local Commissioner was appointed by the \nCourt to seize and inventories the infringing products. The Local \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:22.03.2023 18:39:48\nSignature Not Verified",
          "pdf_source": "15. SANDISK LLC vs Excel.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "Here is a summary of page 4 from the PDF \"15. SANDISK LLC vs Excel.pdf\" (2023:DHC:2057 - CS(COMM) 992/2018):\n\n**Key Points**\n\n* A Commission was conducted on July 20, 2018, where a copy of the entire suit paper book was served to the defendant.\n* The defendant filed a written statement on October 27, 2018, along with purchase and sales invoices.\n* The plaintiffs applied for an amendment to the plaint under Order VI Rule 17 of the CPC, which was allowed on February 4, 2019.\n* The pleadings stood complete after May 16, 2019, as the defendant did not file a written statement to the amended plaint.\n\n**Notable Dates**\n\n* July 20, 2018: Commission conducted and report served to the defendant\n* October 27, 2018: Defendant files written statement and invoices\n* February 4, 2019: Plaintiffs' application for amendment allowed\n* May 16, 2019: Pleadings stood complete\n\n**Source**\n\nPDF: \"15. SANDISK LLC vs Excel.pdf\" (2023:DHC:2057 - CS(COMM) 992/2018)",
          "content": "2023:DHC:2057 \n \n          CS(COMM) 992/2018                                                                    Page 4 of 8 \n \nCommission was carried out on 20th July, 2018 and a copy of the entire suit \npaper book was served upon the defendant. The report of the Local \nCommissioner has been placed on record.  \n5. \nThe defendant filed written statement to the plaint on 27th October, \n2018 along with purchase and sales invoices. Subsequently, the plaintiff \nfiled an application under Order VI Rule 17 of the CPC seeking amendment \nof plaint, which was allowed vide order dated 4th February, 2019 passed by \nthe Joint Registrar. Order dated 16th May, 2019 records that the defendant \ndid not wish to file written statement to the amended plaint and therefore, \nthe pleadings stood complete. \n6. \nThe defendant has not been appearing in the suit since 20th April, \n2022 and vide order dated 28th February, 2023, the defendant was proceeded \nagainst ex parte. \n7. \nAccordingly, the present application for passing a summary judgment \nhas been filed. \n8. \nCounsel for the plaintiffs submits that this is a fit case where a \nSummary Judgment in terms of Order XIII-A of the Code of Civil \nProcedure, as applicable to commercial disputes of a specified value, read \nwith Rule 27 of the Delhi High Court Intellectual Property Rights Division \nRules, 2022 (in short, „IPD Rules‟), deserves to be passed in favour of the \nplaintiffs and against the defendant. \nANALYSIS AND FINDINGS \n9. \nI have heard the counsel for the plaintiffs and perused the record of \nthe case.  \n10. \nFrom the averments made in the plaint and the documents filed \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:22.03.2023 18:39:48\nSignature Not Verified",
          "pdf_source": "15. SANDISK LLC vs Excel.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0009",
      "start_index": 5,
      "end_index": 6,
      "summary": "Here's a summary of the legal document section from PDF: \"SANDBSK LLC vs EXCEL.pdf\" :\n\n**Court Case Details**\n\n* Date of decision: 17th March, 2023\n* Court case number: CS(COMM) 992/2018 and I.A. 5298/2023 (for exemption)\n* Parties involved:\n\t+ SanDisk LLC & ANR. (Plaintiffs)\n\t+ Excel Marketing (Defendant)\n\n**Legal Proceedings**\n\n* The plaintiffs sought a permanent injunction to restrain the defendant from using the SanDisk trademarks.\n* The court examined various documents and evidence, including reports of the Local Commissioner.\n\n**Arguments and Decision**\n\n* The plaintiffs proved they are the registered proprietors of the SanDisk trademarks and have established statutory as well as common law rights on account of long usage.\n* The court found that the defendant has infringed the registered SanDisk trademarks and copyrights by selling counterfeit products with identical marks.\n* The defendant failed to enter its appearance after an ad interim injunction order, indicating it had no substantial evidence to defend.\n* The court ruled in favor of the plaintiffs under Order XIII-A of the Code of Civil Procedure (CPC) and Section 25(3) of the Trademarks Act.\n\n**Judgment**\n\n* The court passed a summary judgment in favor of the plaintiffs, ordering that the defendant must:\n\n\t1. Discontinue using the SanDisk trademarks.\n\t2. Recall all counterfeit products with identical marks from the market.\n\t3. Destroy any remaining stock of such products.\n\nPDF source: 15.SANDBSK LLC vs EXCEL.pdf",
      "pdf_source": "15. SANDISK LLC vs Excel.pdf",
      "nodes": [
        {
          "title": "Page 5",
          "node_id": "0007",
          "start_index": 5,
          "end_index": 5,
          "summary": "Here is a summary of page 5 from the PDF:\n\nIn CS(COMM) 992/2018, SanDisk LLC & ANR. vs Excel Marketing, the court finds that the plaintiffs have successfully proven their ownership of the SanDisk trademarks (Registration numbers: ...). The plaintiffs have demonstrated goodwill and reputation in respect of these marks through long usage.\n\nA comparison between original and counterfeit products reveals identical trademarks and packaging used by the defendant. This has been corroborated by a report from the Local Commissioner showing the defendant's unauthorized marketing and sales of counterfeits bearing the same SanDisk marks.\n\nThe court holds that the defendant's actions amount to trademark infringement, passing off, and dilution of the plaintiffs' marks. The defendant failed to provide substantial documentary evidence in its written statement and has not appeared after the ad interim injunction order was issued on April 20, 2022.\n\nCourt: Delhi High Court\nCase No.: CS(COMM) 992/2018\nDate of decision: March 17, 2023",
          "content": "2023:DHC:2057 \n \n          CS(COMM) 992/2018                                                                    Page 5 of 8 \n \ntherewith, the plaintiffs have been able to prove that they are the registered \nproprietors of the SanDisk trademarks and the said registrations are valid \nand subsisting. The plaintiffs have also been able to show their goodwill and \nreputation in respect of the SanDisk trademarks. Plaintiffs have established \nstatutory as well as common law rights on account of long usage of the \nSanDisk trademarks. \n11. \nA comparison of the original products of the plaintiffs and the \ncounterfeit products of the defendant has been made in paragraph 33 of the \nplaint. From the comparison it is clear that the defendant has made use of \nidentical trademarks and packaging in relation to counterfeit goods. The \nreport of the Local Commissioner also shows that the defendant is indulging \nin marketing and sales of counterfeit products, which bear the identical \nmarks as that of the plaintiffs. \n12. \nThe marketing and selling of counterfeit products by the defendant \nnot only amount to infringing the registered SanDisk trademarks and \ncopyrights of the plaintiffs but also to passing off the goods of the defendant \nas that of the plaintiffs. The defendant has taken unfair advantage of the \nreputation and goodwill of the plaintiffs‟ marks and has also deceived \nunwary consumers of its association with the plaintiffs. Such acts of the \ndefendant would also lead to dilution of the plaintiffs‟ marks. \n13. \nThe defendant in its written statement to the original plaint has made \nbare averments without placing on record any substantial documentary \nevidence. Moreover, since the defendant has failed to enter appearance after \n20th April, 2022, despite having suffered an ad interim injunction order, it is \nevident that the defendant has nothing substantial to urge.  \n14. \nI am of the opinion that no purpose would be served by directing the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:22.03.2023 18:39:48\nSignature Not Verified",
          "pdf_source": "15. SANDISK LLC vs Excel.pdf",
          "nodes": []
        },
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "**Summary of Page 6 from SanDisk LLC vs Excel.pdf**\n\nThe Court is considering passing a Summary Judgment in favor of the plaintiffs (SanDisk LLC) against the defendant (Excel Marketing). The Court finds that:\n\n* The defendant has no real prospects of successfully defending the claim.\n* There are no compelling reasons why the claim should not be disposed of before recording oral evidence.\n\nThe Court refers to the judgment in Su-Kam Power Systems Ltd. v. Kunwer Sachdev, holding that Summary Judgment is a suitable procedure for commercial disputes and can be invoked where:\n\n* The Court considers granting a summary judgment against the defendant with no real prospects of successfully defending the claim.\n* There is no other compelling reason why the claim should not be disposed of before recording oral evidence.\n\n**Sources:**\n\n* Su-Kam Power Systems Ltd. v. Kunwer Sachdev (2019 SCC OnLine Del 10764)\n* SanDisk LLC vs Excel.pdf (2023:DHC:2057, CS(COMM) 992/2018)",
          "content": "2023:DHC:2057 \n \n          CS(COMM) 992/2018                                                                    Page 6 of 8 \n \nplaintiffs to lead ex parte evidence by filing an affidavit of examination in \nchief. Therefore, in my opinion, this is a fit case where a Summary \nJudgment in terms of Order XIII-A of the CPC, as applicable to commercial \ndisputes of a specified value, read with Rule 27 of the IPD Rules, deserves \nto be passed in favour of the plaintiffs and against the defendant. Reference \nin this regard may be made to the judgment in Su-Kam Power Systems Ltd. \nv. Kunwer Sachdev, 2019 SCC OnLine Del 10764, wherein this Court has \nobserved as under: \n“90. To reiterate, the intent behind incorporating the summary \njudgment procedure in the Commercial Court Act, 2015 is to \nensure disposal of commercial disputes in a time-bound \nmanner. In fact, the applicability of Order XIIIA, CPC to \ncommercial disputes, demonstrates that the trial is no longer \nthe default procedure/norm. \n \n91. Rule 3 of Order XIIIA, CPC, as applicable to commercial \ndisputes, empowers the Court to grant a summary judgement \nagainst the defendant where the Court considers that the \ndefendant has no real prospects of successfully defending the \nclaim and there is no other compelling reason why the claim \nshould not be disposed of before recording of oral evidence. \nThe expression “real” directs the Court to examine whether \nthere is a “realistic” as opposed to “fanciful” prospects of \nsuccess. This Court is of the view that the expression “no \ngenuine issue requiring a trial” in Ontario Rules of Civil \nProcedure and “no other compelling reason…..for trial” in \nCommercial Courts Act can be read mutatis mutandis. \nConsequently, Order XIIIA, CPC would be attracted if the \nCourt, while hearing such an application, can make the \nnecessary finding of fact, apply the law to the facts and the \nsame is a proportionate, more expeditious and less expensive \nmeans of achieving a fair and just result. \n \n92. Accordingly, unlike ordinary suits, Courts need not hold \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:22.03.2023 18:39:48\nSignature Not Verified",
          "pdf_source": "15. SANDISK LLC vs Excel.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0012",
      "start_index": 7,
      "end_index": 8,
      "summary": "**Court Decision Summary**\n\n**Case:** Sandisk LLC vs Excel Marketing (2023:DHC:2057)\n\n**Date of Decision:** March 17, 2023\n\n**Judgment:** The Delhi High Court ruled in favor of SanDisk LLC against Excel Marketing.\n\n**Facts and Proceedings:**\n\n* SanDisk LLC sued Excel Marketing for trademark infringement.\n* The court considered various registrations and long usage of the SanDisk trademarks by the plaintiffs.\n* The defendant had sold over Rs. 29,00,000 worth of infringing goods since September 2016.\n* A Local Commissioner seized 253 infringing goods from the defendant's premises.\n\n**Decisions:**\n\n* The court granted a permanent injunction and decree in favor of SanDisk LLC.\n* The defendant was directed to hand over the seized goods for destruction.\n* As the defendant did not appear or render accounts of profits, the court could not grant relief under prayer clause 41(d).\n* SanDisk LLC was awarded damages of Rs. 5,00,000.\n\n**Costs:**\n\n* The plaintiffs' costs incurred for executing the commission and deposited court fees were recoverable from the defendant.\n* The plaintiffs were to file their bill of costs within 31st March, 2023, and the matter would be listed before the Taxing Officer for computation of costs.\n\n**PDF Source:** 15. SANDISK LLC vs Excel.pdf (15 pages)\n\n**Key Parties:**\n\n* SanDisk LLC\n* Excel Marketing\n* Local Commissioner\n\n**Key Amounts:**\n\n* Total sales by defendant: Rs. 29,00,000\n* Damages awarded to plaintiffs: Rs. 5,00,000",
      "pdf_source": "15. SANDISK LLC vs Excel.pdf",
      "nodes": [
        {
          "title": "Page 7",
          "node_id": "0010",
          "start_index": 7,
          "end_index": 7,
          "summary": "**SanDisk LLC vs Excel Marketing (2023:DHC:2057)**\n\nSource: Page 7 of CS(COMM) 992/2018 and I.A. 5298/2023 (for exemption)\n\n**Summary**\n\nThe Delhi High Court granted a summary judgment in favor of SanDisk LLC, a plaintiff seeking permanent injunction against Excel Marketing for trademark infringement.\n\n**Key Points:**\n\n* The court considered the principles applicable to commercial suits, including the Canadian Supreme Court's decision in Robert Hryniak vs. WF Laurin (2014 SCC 72).\n* The plaintiffs demonstrated:\n\t+ Long usage of SanDisk trademarks\n\t+ Goodwill vested in the marks\n\t+ Defendants' lack of real prospect in successfully defending the claim\n* Therefore, summary judgment was granted.\n* Permanent injunction and decree were ordered against Excel Marketing.\n\n**Noteworthy:**\n\n* Delivery up for destruction of infringing goods to be handed over to SanDisk representatives forthwith.\n* Relief for accounts of profits not granted as defendant had ceased to appear and failed to render any account.",
          "content": "2023:DHC:2057 \n \n          CS(COMM) 992/2018                                                                    Page 7 of 8 \n \ntrial in commercial suits, even if there are disputed questions of \nfact as held by the Canadian Supreme Court in Robert \nHryniak (supra), in the event, the Court comes to the conclusion \nthat the defendant lacks a real prospect of successfully \ndefending the claim.” \n \n15. \nThe aforesaid principles are fully applicable in the facts and \ncircumstances of the present case and therefore, the plaintiffs are entitled to \na summary judgment. \n16. \nIn view of the above, the present application is allowed.  \nRELIEF \n17. \nThe various registrations and the long usage of the SanDisk \ntrademarks by the plaintiffs, as also the goodwill vesting in the SanDisk \ntrademarks, entitles the plaintiffs for grant of permanent injunction and \ndecree in terms of the plaint. \n18. \nAccordingly, the present suit is decreed against the defendant in terms \nof the relief of permanent injunction as sought in prayer clauses 41 (a) and \n(b).  \n19. \nInsofar as delivery up for the purpose of destruction, as sought in \nprayer clause 41(c) is concerned, the goods seized by the Local \nCommissioner, which are lying in supardari with the defendant, the details \nof which are given in paragraph 6 of the report dated 20th July, 2018 are \ndirected to be handed to the representatives of the plaintiffs forthwith for the \npurpose of destruction, in compliance with extant rules/regulations. \n20. \nSince the defendant is not appearing any longer and has not rendered \nany accounts of profits, the said relief as sought in prayer clause 41(d) \ncannot be granted.  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:22.03.2023 18:39:48\nSignature Not Verified",
          "pdf_source": "15. SANDISK LLC vs Excel.pdf",
          "nodes": []
        },
        {
          "title": "Page 8",
          "node_id": "0011",
          "start_index": 8,
          "end_index": 8,
          "summary": "**CASE SUMMARY**\n\nSource: SANDISK LLC vs Excel.pdf (PDF)\n\n**COURT PROCEEDINGS**\n\nThe Delhi High Court at New Delhi delivered a judgment on March 17, 2023, in the case CS(COMM) 992/2018.\n\n**KEY POINTS**\n\n* The Local Commissioner seized 253 infringing and counterfeit goods from the defendant's premises.\n* Sales invoices dated September 2016 revealed total sales of over Rs. 29,00,000.\n* The Court held that this is not a case of innocent adoption and awarded damages to the plaintiffs in the amount of Rs. 5,00,000.\n* The plaintiffs are also entitled to actual costs recoverable from the defendant.\n* A bill of costs must be filed by March 31, 2023.\n\n**DECISION**\n\nJustice Amit Bansal ordered the drawing up of a decree sheet and disposed of all pending applications in accordance with the judgment.\n\n**AMOUNTS**\n\n* Rs. 29,00,000 (total sales revenue)\n* Rs. 5,00,000 (damages awarded to plaintiffs)",
          "content": "2023:DHC:2057 \n \n          CS(COMM) 992/2018                                                                    Page 8 of 8 \n \n21. \nThe Local Commissioner found a total number of 253 infringing and \ncounterfeit goods at the premises of the defendant, which were inventorized \nby him and seized and handed over on supardari to the defendant. Further, \nthe sale invoices filed by the defendant which go as far back as September, \n2016 reflect total sales of more than Rs.29,00,000. \n22. \nI am convinced that this is not a case of innocent adoption and \ntherefore, the plaintiffs are entitled to damages. Taking a reasonable \nassessment of the volume of seizure made, nature of counterfeiting indulged \ninto by the defendant, in the opinion of the Court, the plaintiffs are entitled \nto damages Rs,5,00,000.  \n23. \nPlaintiffs have also incurred costs for executing the commission and \ndeposited court fees. Thus, in view of the judgment of the Supreme Court in \nUflex v. Government of Tamil Nadu, 2021 SCC OnLine SC 738 as well as \nin terms of the Commercial Courts Act, 2015 and the Delhi High Court \n(Original Side) Rules, 2018 read with Delhi High Court Intellectual Property \nDivision Rules, 2022, the plaintiffs are entitled to actual costs recoverable \nfrom the defendant. Plaintiffs shall file their bill of costs in terms of Rule 5 \nof Chapter XXIII of the Delhi High Court (Original Side) Rules, 2018 on or \nbefore 31st March, 2023. As and when the same is filed, the matter will be \nlisted before the Taxing Officer for computation of the costs. \n24. \nLet the decree sheet be drawn up.  \n25. \nAll pending applications are disposed of in the above terms. \n \n \nAMIT BANSAL, J \nMARCH 17, 2023 \nsr \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:22.03.2023 18:39:48\nSignature Not Verified",
          "pdf_source": "15. SANDISK LLC vs Excel.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-16T14:31:56.812301",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}