{
  "doc_name": "16. Pandrol vs Patil Rail",
  "pdf_source": "16. Pandrol vs Patil Rail.pdf",
  "metadata": {
    "document_name": "16. Pandrol vs Patil Rail",
    "source_pdf": "16. Pandrol vs Patil Rail.pdf",
    "judges": [
      "AMIT BANSAL"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "602/2022",
      "602/2022",
      "602/2022",
      "602/2022",
      "602/2022",
      "602/2022",
      "602/2022",
      "602/2022",
      "602/2022",
      "602/2022",
      "602/2022",
      "602/2022",
      "602/2022",
      "602/2022",
      "602/2022",
      "602/2022",
      "602/2022",
      "602/2022",
      "602/2022",
      "602/2022",
      "602/2022",
      "602/2022",
      "602/2022",
      "602/2022",
      "602/2022",
      "602/2022",
      "602/2022",
      "602/2022",
      "602/2022",
      "14099/2022"
    ],
    "dhc_numbers": [
      "2023/DHC/001792",
      "2023/DHC/001792",
      "2023/DHC/001792",
      "2023/DHC/001792",
      "2023/DHC/001792",
      "2023/DHC/001792",
      "2023/DHC/001792",
      "2023/DHC/001792",
      "2023/DHC/001792",
      "2023/DHC/001792",
      "2023/DHC/001792",
      "2023/DHC/001792",
      "2023/DHC/001792",
      "2023/DHC/001792",
      "2023/DHC/001792",
      "2023/DHC/001792",
      "2023/DHC/001792",
      "2023/DHC/001792",
      "2023/DHC/001792",
      "2023/DHC/001792",
      "2023/DHC/001792",
      "2023/DHC/001792",
      "2023/DHC/001792",
      "2023/DHC/001792",
      "2023/DHC/001792",
      "2023/DHC/001792",
      "2023/DHC/001792"
    ],
    "ia_numbers": [],
    "decision_date": "21 February, 2023",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      {
        "name": "PANDROL LIMITED & ANR.",
        "representatives": [
          "Mr.Rajshekhar Rao",
          "Ms.Archana Sahadeva",
          "Ms.Anjuri Saxena",
          "Mr.Yashraj Samant"
        ]
      }
    ],
    "defendants": [
      {
        "name": "PATIL RAIL INFRASTRUCTURE PVT. LTD. & ORS.",
        "representatives": [
          "Mr.Jayant Mehta",
          "Mr.Donthi Reddy",
          "Dr. Venkat Reddy",
          "Mr.Gagan Gupta"
        ]
      }
    ],
    "appellants": [
      {
        "name": "PANDROL LIMITED & ANR."
      }
    ],
    "respondents": [
      {
        "name": "PATIL RAIL INFRASTRUCTURE PVT. LTD. & ORS."
      }
    ],
    "plaintiff_advocates": [
      "Mr.Rajshekhar Rao",
      "Ms.Archana Sahadeva",
      "Ms.Anjuri Saxena",
      "Mr.Yashraj Samant"
    ],
    "defendant_advocates": [
      "Mr.Jayant Mehta",
      "Mr.Donthi Reddy",
      "Dr. Venkat Reddy",
      "Mr.Gagan Gupta"
    ],
    "appellant_advocates": [],
    "respondent_advocates": [],
    "damages_claimed": "1,00,000",
    "damages_awarded": null,
    "key_issues": [
      "Here are the 10 key legal issues extracted from the document:",
      "* Grant of interim injunction under Order XXXIX Rules 1 and 2 of the Code of Civil Procedure, 1908.",
      "* Infringement of copyrighted works and registered trademark 'PANDROL' by defendants.",
      "* Passing off products as those of plaintiffs under the 'PANDROL' mark.",
      "* Rectification of information/data/drawings belonging to plaintiffs from defendants' premises.",
      "* Jurisdiction of the court to grant interim injunction based on territorial nexus with Delhi.",
      "* Applicability of Indian Copyright Act, 1957 and Trademarks Act, 1999 to foreign-based plaintiff company.",
      "* Whether defendant's actions constitute fair use under copyright law or dilute the distinctiveness of plaintiffs' trademark.",
      "* Validity of local commissioner's report as evidence in court proceedings.",
      "* Scope of interim injunction order to restrain defendants from infringing plaintiffs' rights."
    ],
    "decision_summary": "**Case Summary: Pandrol Limited & Anr. vs. Patil Rail Infrastructure Pvt. Ltd. & Ors.**\n\n**Background:**\nThe present case is a trademark and copyright infringement suit filed by Pandrol Limited (Plaintiffs) against Patil Rail Infrastructure Pvt. Ltd. and others (Defendants). The Plaintiffs are the owners of the registered trade mark 'PANDROL' in various classes, and they have designed and developed detailed drawings for their 'DBRAS' railway track fastening system.\n\n**Legal Issues:**\n\n1. **Trademark Infringement:** The Defendants are accused of using, applying, manufacturing, and selling unauthorized usage of the Plaintiffs' registered trade mark 'PANDROL', which has caused infringement of the registered trademark and passing off in respect of any products.\n2. **Copyright Infringement:** The Defendants are also accused of copying, reproducing, storing, using, publishing, advertising, and promoting the unauthorized usage of the Plaintiffs' copyrighted works, i.e., drawings numbers 13145 to 21166.\n\n**Arguments:**\n\n1. **Plaintiffs:** The Plaintiffs argued that they have been using the mark 'PANDROL' since 1964 and have registered it in various classes. They also stated that the Defendants are using similar marks, which causes confusion among customers.\n2. **Defendants:** The Defendants argued that they have not infringed upon the Plaintiffs' trademark or copyright and that their use of the mark is lawful.\n\n**Court Findings:**\n\n1. **Trademark Infringement:** The Court held that the Defendants had used similar marks to those owned by the Plaintiffs, which caused confusion among customers.\n2. **Copyright Infringement:** The Court found that the Defendants had copied and used the Plaintiffs' copyrighted works without permission.\n\n**Decision:**\nThe Court granted an interim injunction in favor of the Plaintiffs, restraining the Defendants from:\n\n1. Directly or indirectly copying, reproducing, storing, using, publishing, advertising Pandrol's Copyrighted Works.\n2. Using, applying, manufacturing and selling unauthorized usage of the PANDROL trade mark.\n\nThe Court also appointed a Local Commissioner to visit the premises of Defendant No. 1 in Hyderabad and take into custody any information/data/drawings belonging to the Plaintiffs in the possession of the Defendants.\n\n**Order Date:** 13th March, 2023\n\n**Case Number:** CS(COMM) 602/2022",
    "legal_precedents": [
      "Jagdamba Impex Tristar Products Pvt",
      "In Microfibres Inc Girdhar And Co"
    ],
    "full_text": "\n--- PAGE 1 ---\n2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 1 of 27 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n \n% \n \n \n \n         Judgment reserved on :  21st February, 2023 \n \n \n \n \n        Judgment delivered on : 13th March, 2023 \n \n+  \n \n \n \nCS(COMM) 602/2022  \n \n \nPANDROL LIMITED & ANR.  \n \n \n..... Plaintiffs \nThrough: \nMr.Rajshekhar Rao, Sr.Advocate with \nMs.Archana \nSahadeva, \nMs.Anjuri \nSaxena \nand \nMr.Yashraj \nSamant, \nAdvocates. \n \n \n \n \nversus \n \n \nPATIL RAIL INFRASTRUCTURE PVT.  \nLTD. & ORS. \n \n \n \n \n \n..... Defendants \nThrough: \nMr.Jayant Mehta, Mr.Donthi Reddy, \nDr. Venkat Reddy, Sr.Advocates with \nMr.Gagan Gupta, Advocate.12r4 \n \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \n \n \n \n \n \nJUDGMENT \n \n \nI.A. 14099/2022 (O-XXXIX R-1 & 2 of the CPC) \n1. \nBy way of the present judgment, I shall decide the application filed on \nbehalf of the plaintiffs under Order XXXIX Rules 1 and 2 of the Code of \nCivil Procedure, 1908 (CPC) for grant of interim injunction. \nPROCEEDINGS IN THE SUIT \n2. \nSummons in the suit was issued on 2nd September, 2022, when an ad \ninterim injunction was granted in favour of the plaintiffs, restraining the \ndefendants from infringing the copyrighted works and the registered \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified\n\n--- PAGE 2 ---\n2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 2 of 27 \n \ntrademark ‘PANDROL’ of the plaintiffs as well as passing off their products \nas those of the plaintiffs under the ‘PANDROL’ mark. The relevant portion \nof the injunction order is set out as under: \n“32. Accordingly, Defendants, their directors, executives, \npartners, proprietors, principal officers, assignees, family \nmembers and anyone acting for and on their behalf are restrained \nfrom:  \n \na. directly or indirectly copying, reproducing, storing, using, \npublishing, advertising Pandrol‟s Copyrighted Work, i.e. \ndrawing numbers 13145, 13146, 14613, 14614, 5720, 8605, \n8604, 12683, 12740, 2759, 12717, 12791, 10108, 21166, in \nany manner that may result in infringement of the Plaintiff‟s \ncopyright subsisting in the said drawings;  \n \nb. using, applying, manufacturing and selling, offering for \nsale, advertising or promoting the unauthorized usage of the \nPANDROL trade mark, or any other mark which is either \nidentical to or deceptively similar to the Plaintiff‟s registered \ntrade mark „PANDROL‟ causing infringement of the \nregistered trade mark and passing off in respect of any \nproducts whatsoever.” \n3. \nA Local Commissioner was also appointed by the Court to visit the \npremises of the defendant no.1 in Hyderabad, to, inter alia, take into custody \nany information/data/drawings belonging to the plaintiffs and in the \npossession of the defendants. Report dated 15th September, 2022 of the \nLocal Commissioner is on record. \n4. \nThereafter, pleadings in the suit and the present application have been \ncompleted. Submissions in the present application were heard on 21st \nFebruary, 2023 and judgment was reserved. Both sides have filed a brief \nnote of their submissions. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified\n\n--- PAGE 3 ---\n2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 3 of 27 \n \n \nCASE SET UP IN THE PLAINT \n5. \nThe case set up in the plaint is as under: \n5.1. Plaintiff no.1 is the industry leader in rail fastenings and track \nelasticity solutions headquartered in the United Kingdom. The \nplaintiff no.2 is a joint venture between the plaintiff no.1 and Rahee \nIndustries Ltd., a leading integrated railroad company. \n5.2. The defendant no.1 is a company in the business of dealing in railway \ntrack engineering. Defendants no.2 to 5 are employees of the \ndefendant no.1. \n5.3. The mark ‘PANDROL’ of the plaintiffs was adopted by the \npredecessor-in-interest of the plaintiff no.1 in 1964 and subsequently, \nalso adopted as the trade/corporate name of the plaintiff no.1. The \nplaintiff no.1 holds registrations dating as far back as 1964 for its \ntrademark ‘PANDROL’ in various classes, details of which are \nprovided in paragraph 40 of the plaint. The plaintiff no.1 is the \nregistered proprietor of the ‘PANDROL’ trademark in India. \n5.4. The plaintiffs have designed, developed and created detailed drawings \nfor their ‘Pandrol Double Resilient Baseplate Assembly System’ \n[hereinafter ‘DBRAS’], which is a railway track fastening system \nused in metro rails.  \n5.5. The Ministry of Railways, vide notification dated 21st May, 2010 had \nnotified the „Performance Criteria of Fastening Systems for \nBallastless Track‟ [hereinafter ‘Performance Criteria’], which \nstipulated the various parameters and standards applicable to \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified\n\n--- PAGE 4 ---\n2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 4 of 27 \n \n„fastening systems for ballastless track‟ of metro rails. On being found \ncompliant with the parameters and standards prescribed under the \nPerformance Criteria, the plaintiffs obtained approval for their \ndrawings from the Ministry of Railways vide letter dated 7th October, \n2011. \n5.6. The DBRAS drawings are the copyrighted work of the plaintiff no.1, \nbeing the original artistic work designed, developed and created by \nthe plaintiff no.1. Plaintiff no.2 is the exclusive license holder of the \ndrawings of the plaintiff no.1 and is licensed to use the said drawings \nin the course of their business in India. \n5.7. The DBRAS is manufactured and supplied in India as well as \nexported outside the country by the plaintiff no.2. \n5.8. Through their long, extensive and continuous use and extensive sales \npromotion of the products marketed under the ‘PANDROL’ mark, the \nplaintiffs have gained reputation and goodwill, which is also reflected \nthrough its sales turnover. The plaintiff no.1 has also been conferred \nwith awards for their products and services. \n5.9. The defendants have infringed the copyrighted work of the plaintiff \nno.1 by copying the drawings of the plaintiff no.1  and submitting the \nsame to the Madhya Pradesh Metro Rail Corporation Limited \n[hereinafter ‘MPMRCL’] in response to a railway tender floated by \nthem. A comparison of the drawings of the parties is reproduced in \nparagraph 53 of the plaint.  \n5.10. The defendants have also infringed the trademark ‘PANDROL’ by \nsubmitting the impugned drawings under the said mark in response to \nthe  tender floated by the MPMRCL. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified\n\n--- PAGE 5 ---\n2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 5 of 27 \n \n5.11. Accordingly, the present suit has been filed seeking a decree of \npermanent injunction along with other ancillary reliefs. \nCASE SET UP IN THE WRITTEN STATEMENT \n6. \nThe case set out in the written statement is as under: \n6.1. The defendant no.1 is in the business of manufacturing various \nrailway track components such as concrete sleepers, rail fastening \ncomponents for normal tracks, elevated and underground tracks for \nmetro railways and ballastless tracks suitable for high-speed lines, \nbridges, tunnels and the like. \n6.2. The engineering drawings for the ‘Double Resilient Base Plate \nSystem’ submitted by the defendant no.1 are as per the technical \nspecifications, dimensions and features given by the MPMRCL for \n„Design, Supply, Installation, testing and Commissioning of \nBallastless Track of Standard Gauge, including Supply of Fastening \nSystem…for Bhopal Metro Rail Project‟ and in conformity with the \nguidelines issued by the Ministry of Railways, as amended from time \nto time. Therefore, the same can be supplied by any entity including \nthe defendant no.1. \n6.3. The Railway Board, Ministry of Railways has approved a total of six \nfastening systems for ballastless tracks, any of which can be used by \nmetro railways/mass rapid transit systems [hereinafter ‘MRTS’] in \nIndia. All six fastening systems are designed by different \ncompanies/entities and exclusive rights can be claimed by such \ncompanies/entities only if registrations are obtained thereof. Mere \napproval of a fastening system by the Ministry of Railways does not \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified\n\n--- PAGE 6 ---\n2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 6 of 27 \n \nconfer any statutory right in favour of the company/entity who has \ndeveloped and designed such system. \n6.4. The DBRAS purported to have been developed and designed by the \nplaintiff no.1 is not registered under the Patents Act, 1970 or the \nCopyright Act, 1957 or the Designs Act, 2000. \n6.5. The drawings of the plaintiff no.1 are in the public domain, being \neasily available on the internet, as also on the official website of the \nMinistry of Railways. \n6.6. No copyright subsists in the drawings of the plaintiff as per Section 15 \nof the Copyright Act, 1957 read in conjunction with the Designs Act, \n2000. \n6.7. The defendant no.1 has not commercially exploited the trademark \n‘PANDROL’ of the plaintiff no.1. The trademark reflected on the \ndrawings submitted by the defendant no.1 to various contractors was \nonly an inadvertent error on part of the defendants no.2 to 4, who \nmistakenly left the said mark on the drawings while converting them \nfrom PDF files to AutoCAD files. The said inadvertent error was \nrectified as soon as it was brought to the attention of the defendants \nand the drawings were re-submitted to the contractors without the \n‘PANDROL’ mark. \n6.8. Even otherwise, no manufacturing or production of the Double \nResilient Base Plate Assembly System components has been \nundertaken by the defendant no.1. Therefore, no case for infringement \nof the trademark of the plaintiff no.1 or passing off is made out.  \n7. \nThe plaintiffs have also filed a replication, wherein, in addition to the \npleadings put forth in support of the case set up in the plaint, it has been \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified\n\n--- PAGE 7 ---\n2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 7 of 27 \n \nsubmitted that the intention of the plaintiffs was not just to safeguard its \neconomic interest by filing the present suit but also to prevent the MPMRCL \nfrom being deceived by the defendants using the copyrighted drawings and \ntrademark of the plaintiffs. \nSUBMISSIONS ON BEHALF OF THE PLAINTIFFS \n8. \nIn support of the case set up in the plaint, the senior counsel appearing \non behalf of the plaintiffs made the following submissions: \n8.1. The defendants have infringed the copyright and trademark \n‘PANDROL’ of the plaintiff by copying the drawings of the plaintiffs \nin toto. The said fact has been admitted by the defendants in \nparagraph 21 of the written statement and also affirmed in the report \ndated 22nd September, 2022 filed by the Local Commissioner. \n8.2. Clause 4.2 of the tender floated by the MPMRCL specifically \nprovides that a tenderer offering the supply of fastening systems is \nrequired to provide, inter alia, the approval letter obtained from the \nRDSO/Ministry of Railways along with the approved drawings of the \nfastening system, certificate of performance and the like. Therefore, \nthe subject matter of the tender was in respect of a generic product \nand not specifically the plaintiffs’ product. Hence, there was no \njustification for the defendants to unauthorizedly copy the drawings of \nthe plaintiffs. \n8.3. Even if it is assumed that the tender of the MPMRCL required \ncopying of the approved drawings of the plaintiffs, there was no basis \nfor the defendants to expressly provide that the drawings submitted by \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified\n\n--- PAGE 8 ---\n2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 8 of 27 \n \nthem have been drawn, checked, reviewed and approved by their \nemployees, the defendants no.2 to 5. \n8.4. The drawings of the plaintiffs are not covered under the ambit of \n‘design’ as defined in Section 2(d) of the Designs Act, 2000 for the \nfollowing reasons: \ni. \nThe drawings of the plaintiffs constitute ‘artistic work’ as \ndefined under Section 2(c) of the Copyright Act, 1957.  \nii. \nThe drawings of the plaintiffs are a mode/principle of \nconstruction of a fastening system, which is expressly excluded \nfrom the definition of the word ‘design’ as provided under \nSection 2(d) of the Designs Act. \niii. \nThere is no visual appeal to the drawings of the plaintiffs which \nwould qualify the drawings of the plaintiff to fall in the \ncategory of ‘design’. \n8.5. Since the drawings of the plaintiffs do not constitute a „design, which \nis capable of being registered under the Designs Act, 2000‟  the \nreliance placed on Section 15(2) of the Designs Act, 2000 by the \ndefendants, is misplaced. \nSUBMISSIONS ON BEHALF OF THE DEFENDANTS \n9. \nIn support of the averments made in the written statement, senior  \ncounsel appearing on behalf of the defendants made the following \nsubmissions: \n9.1. The drawings of the plaintiffs are in the public domain since 2010, \nwhen they were first published in the United Kingdom. The drawings \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified\n\n--- PAGE 9 ---\n2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 9 of 27 \n \nhave also been published on the RDSO website as attachments to the \napproval letter dated 7th October, 2011. \n9.2. The tenderer was required to match completely with the drawings and \nspecifications of the test assembly. Reliance in this regard is placed on \nClauses 2 and 4 of the approval letter dated 7th October, 2011 issued \nby the Ministry of Railways. \n9.3. The Ministry of Railways has approved six fastening systems, which \ncan be supplied by any vendor on the basis of the approved drawings. \n9.4. Plaintiffs do not have any copyright over their drawings within the \nmeaning of Section 14 of the Copyright Act, 1957. In fact, the \ndrawings of the plaintiffs constitute „design capable of being \nregistered‟ under the Designs Act, 2000. \n9.5. The plaintiffs have already supplied more than 21,00,000 fastening \nsets and 50,00,000 elastic rail clips in various projects. Reliance in \nthis regard is placed on paragraphs 14, 25 and 26 of the plaint. \nTherefore, no copyright subsists in the drawings of the plaintiffs as \nper Section 15(2) of the Copyright Act, 1957. \nANALYSIS AND FINDINGS \n10. \nI have heard the rival submissions. \n11. \nAt the outset, I will address the submissions made on behalf of the \ndefendants that the plaintiffs could not claim any copyright in the aforesaid \ndrawings in light of Section 15(2) of the Copyright Act, 1957. To consider \nthe aforesaid submissions, a reference may be made to the relevant \nprovisions of the Copyright Act as well as the Designs Act. \n12. \nRelevant provisions of the Copyright Act are as under: \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified\n\n--- PAGE 10 ---\n2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 10 of 27 \n \n“2. Interpretation.— In this Act, unless the context otherwise \nrequires,— \n(c) “artistic work” means,—  \n(i) a painting, a sculpture, a drawing (including a diagram, \nmap, chart or plan), an engraving or a photograph, whether \nor not any such work possesses artistic quality; \n(d) “author” means, — \n(iii) in relation to an artistic work other than a photograph, \nthe artist; \n(m) “infringing copy” means—  \n(i) in relation to a literary, dramatic, musical or artistic work, \na reproduction thereof otherwise than in the form of a \ncinematographic film; \n13. Works in which copyright subsists.— (1) Subject to the \nprovisions of this section and the other provisions of this Act, \ncopyright shall subsist throughout India in the following classes of \nworks, that is to say,—  \n(a) original literary, dramatic, musical and artistic works; \n14. Meaning of Copyright.— For the purposes of this Act, \n“copyright” means the exclusive right subject to the provisions of \nthis Act, to do or authorise the doing of any of the following acts \nin respect of a work or any substantial part thereof, namely:— \n(c) in the case of an artistic work,—  \n[(i) to reproduce the work in any material form \nincluding—  \n(A) the storing of it in any medium by electronic or other \nmeans; or  \n \n(B) depiction in three-dimensions of a two-dimensional \nwork; or  \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified\n\n--- PAGE 11 ---\n2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 11 of 27 \n \n(C) depiction in two-dimensions of a three-dimensional \nwork;] \n \n(ii) to communicate the work to the public; \n \n15. Special provision regarding Copyright in designs registered or \ncapable of being registered under the Designs Act, 2000.— \n \n (1) Copyright shall not subsist under this Act in any design \nwhich is registered under the Designs Act, 2000.  \n \n(2) Copyright in any design, which is capable of being \nregistered under the Designs Act, 2000 but which has not \nbeen so registered, shall cease as soon as any article to which \nthe design has been applied has been reproduced more than \nfifty times by an industrial process by the owner of the \ncopyright or, with his licence, by any other person.” \n \n13. \nRelevant provisions of the Designs Act, 2000 are as under: \n“2. Definitions.—In this Act, unless there is anything repugnant in \nthe subject or context,— \n \n(d) “design” means only the features of shape, configuration, \npattern, ornament or composition of lines or colours applied \nto any article whether in two dimensional or three \ndimensional or in both forms, by any industrial process or \nmeans, whether manual, mechanical or chemical, separate \nor combined, which in the finished article appeal to and are \njudged solely by the eye; but does not include any mode or \nprinciple of construction or anything which is in substance a \nmere mechanical device, and does not include any trade \nmark as defined in clause (v) of sub-section (1) of section 2 \nof the Trade and Merchandise Marks Act, 1958 or property \nmark as defined in section 479 of the Indian Penal Code or \nany artistic work as defined in clause (c) of section 2 of the \nCopyright Act, 1957.” \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified\n\n--- PAGE 12 ---\n2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 12 of 27 \n \n14. \nSenior counsel on behalf of the defendants has submitted that that \nsince the drawings of the plaintiffs are capable of being registered under the \nDesigns Act and based on the said drawings, products have been produced \nby the plaintiffs more than fifty times through an industrial process, no \ncopyright can be claimed by the plaintiffs in respect of the said drawings in \nterms of Section 15(2) of the Designs Act. In support of this submission, \nsenior counsel for the defendants has placed reliance on various judgments, \nwhich are discussed below. \n15. \nIn Microfibres Inc v. Girdhar And Co. and Anr., 2009 SCC OnLine \nDel 1647 a Division Bench of this Court was seized of similar issues with \nregard to the interplay of various sections of the Copyright and Designs Act \nin order to determine whether a work is capable of being registered under \nthe Designs Act, by virtue of which no copyright in respect thereof could be \nclaimed as per Section 15(2) of the Copyright Act. After comparing the \nrelevant provisions of the Designs Act and Copyright Act, the Division \nBench observed as under: \n“22. \nTherefore, it is the exclusive right of the holder of a \nCopyright in an original artistic work to reproduce the work in \nany material form. For example, a drawing of an imaginary \nfuturistic automobile, which is an original artistic work, may be \nreproduced in the three-dimensional material form using an \nelement, such as a metal sheet. When the copyright holder of an \noriginal artistic work reproduces the same in another material \nform, he may, or may not do so by employing an industrial \nprocess or means which may be manual, mechanical or \nchemical, separate or combined, on an article. If the \nreproduction of the original artistic work is done by employing \nan industrial process, as aforesaid, on an article, and the same \nresults in a finished article which appeals to the eye as \nadjudged solely by the eye, then the features of shape, \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified\n\n--- PAGE 13 ---\n2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 13 of 27 \n \nconfiguration, pattern, ornament or composition of lines or \ncolours applied to the article by the industrial process \nconstitutes a “design”, within the meaning of this expression as \ndefined under the Designs Act. \n23. \nThere is, therefore, a clear distinction between an \noriginal artistic work, and the design derived from it for \nindustrial application on an article. This position is clarified by \nthe use of the expression “only” before the words “the features \nof shape, configuration, pattern, ornament or composition of \nlines or colours” in the definition of “design” in the Designs \nAct. Therefore, the original artistic work, which may have \ninspired the creation of a design, is not merely the feature of \nshape, configuration, pattern, ornament or composition of lines \nor colours which are created to apply to an article by an \nindustrial process. The original artistic work is something \ndifferent from the design. Secondly, the definition of “design” \nexpressly excludes, inter alia, any artistic work defined in \nsection 2(c) of the Copyright act, 1957. \nXXX  \n \n \nXXX  \n \n \nXXX \n30. \nSub-section (2) of section 15 deals with the situation \nwhere the design, which is capable of being registered under the \nDesigns Act, is not so registered. It provides that copyright in \nsuch a design shall cease as soon as any article to which the \ndesign has been applied has been reproduced more than 50 times \nby an industrial process by the owner of the copyright or with his \nlicence, by any other person. It is clear to us that the Parliament \nin Section 15 of the Copyright Act was dealing with the aspect of \ncopyright in a registered/registrable design, as understood in the \nCopyright Act and not the Designs Act. Else, there was no need \nto deal with this aspect in the Copyright Act. The same would \nhave been dealt with under the Designs Act. Therefore, the law \ntolerates only a limited industrial, or shall we say commercial, \nexploitation \nof \nthe \noriginal \nartistic \nwork \nby \nthe \napplication/reproduction of the said work in any other form or \nreproduction of copies thereof in exercise of the rights under \nSection 14(c)(1) and 14(c)(iii) of the Copyright Act. Beyond the \nspecified limit, if the design derived from the original artistic \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified\n\n--- PAGE 14 ---\n2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 14 of 27 \n \nwork is exploited (i.e. if the design is applied more than 50 times \nby an industrial process on an article) the copyright in the design \nceases unless it is registered under the Designs Act. \nXXX  \n \n \nXXX  \n \n \nXXX \n35. \nHowever, there can be no quarrel with the plea of Shri \nRamachandran that the operation of Section 15(2) of the \nCopyright Act does not exclude from the ambit of Copyright \nprotection either the original “artistic work” upon which the \ndesign is based or the design which by itself is an artistic work. \nIt cannot be disputed that the original paintings/artistic works \nwhich may be used to industrially produce the designed article \nwould continue to fall within the meaning of the artistic work \ndefined under Section 2(c) of the Copyright Act, 1957 and \nwould be entitled to the full period of copyright protection. This \nis also evident from the definition of the design under Section \n2(d) of the Designs Act. This, in our view, in fact is a factor \nwhich would go against the appellants in construing the nature \nof protection to be given to the original artistic work such as a \npainting, as contrasted with the applied artistic work that is the \ndesign, which in the present case does not mean the \nintermediary \nmedium \nsuch \nas \na \nmould, \nengraving \ndevised/produced only to enable industrial application of the \npainting to produce the furnishing products of the appellant. \nThus, while the original painting would indeed be entitled to \nthe \ncopyright \nprotection, \nthe \ncommercial/industrial \nmanifestation of such paintings such as the design derived from \nand founded upon the original painting for the purpose of \nindustrial production of furnishings would only be covered by \nthe limitations placed in Section 15 of the Copyright Act and \nwould get protection if registered as a design under the Designs \nAct but would enjoy lesser period of protection in case of a \nregistered design. \n36. \nThis clearly shows that the legislature intended that \neven if the artistic work such as a painting has been used as the \nbasis for designing an industrially produced object for \ncommerce, such as the furnishing in the present case, \nnevertheless the original painting would indeed enjoy full \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified\n\n--- PAGE 15 ---\n2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 15 of 27 \n \ncopyright protection, while the result of the industrial \napplication of such painting, namely, the design used in the \nindustrial production of the ultimate product shall enjoy lesser \nperiod of protection as stipulated under the Designs Act \nprovided it is registered as a design under the Designs \nAct. Thus, we are of the view that an original artistic work \ninitially acquires protection under the Copyright Act as an \n„artistic work‟ or else the protection under the Designs Act qua \nthe product created from the artistic work when industrially \napplied.” \n16. \nThe law was summarised by the Division Bench in paragraph 46 of \nthe judgment, which is set out below: \n“46. \nWe thus summarize our findings as follows:— \na. The definition of „artistic work‟ has a very wide \nconnotation as it is not circumscribed by any limitation of \nthe work possessing any artistic quality. Even an abstract \nwork, such as a few lines or curves arbitrarily drawn \nwould qualify as an artistic work. It may be two \ndimensional or three dimensional. The artistic work may \nor may not have visual appeal. \nb. The rights to which a holder of an original artistic work \nis entitled are enumerated in Section 14(c) of the Copyright \nact. \nc. It is the exclusive right of the holder of a Copyright in an \noriginal artistic work to reproduce the work in any material \nform. For example, a drawing of an imaginary futuristic \nautomobile, which is an original artistic work, may be \nreproduced in the three-dimensional material form using an \nelement, such as a metal sheet. \nd. The design protection in case of registered works under \nthe Designs Act cannot be extended to include the copyright \nprotection to the works which were industrially produced. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified\n\n--- PAGE 16 ---\n2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 16 of 27 \n \ne. A perusal of the Copyright Act and the Designs Act and \nindeed the Preamble and the Statement of Objects and \nReasons of the Designs Act makes it clear that the \nlegislative intent was to grant a higher protection to pure \noriginal artistic works such as paintings, sculptures etc \nand lesser protection to design activity which is \ncommercial in nature. The legislative intent is, thus, clear \nthat the protection accorded to a work which is \ncommercial in nature is lesser than and not to be equated \nwith the protection granted to a work of pure art. \nf. The original paintings/artistic works which may be used \nto industrially produce the designed article would continue \nto fall within the meaning of the artistic work defined \nunder Section 2(c) of the Copyright Act, 1957 and would \nbe entitled to the full period of copyright protection as \nevident from the definition of the design under Section \n2(d) of the Designs Act. However, the intention of \nproducing the artistic work is not relevant. \ng. This is precisely why the legislature not only limited the \nprotection by mandating that the copyright shall cease \nunder the Copyright Act in a registered design but in \naddition, also deprived copyright protection to designs \ncapable of being registered under the Designs Act, but not \nso registered, as soon as the concerned design had been \napplied more than 50 times by industrial process by the \nowner of the copyright or his licensee. \nh. In the original work of art, copyright would exist and \nthe author/holder would continue enjoying the longer \nprotection granted under the Copyright Act in respect of \nthe original artistic work per se. \ni. If the design is registered under the Designs Act, the \nDesign would lose its copyright protection under the \nCopyright Act. If it is a design registrable under the Designs \nAct but has not so been registered, the Design would \ncontinue to enjoy copyright protection under the Act so long \nas the threshold limit of its application on an article by an \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified\n\n--- PAGE 17 ---\n2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 17 of 27 \n \nindustrial process for more than 50 times is reached. But \nonce that limit is crossed, it would lose its copyright \nprotection under the Copyright Act. This interpretation \nwould harmonize the Copyright and the Designs Act in \naccordance with the legislative intent.” \n17. \nWhat emerges from a reading of the judgment of the Division Bench \nis that an original ‘artistic work’ is different from a ‘design’. The original \ndrawings/ ‘artistic work’ can lead to a ‘design’. In other words, a ‘design’ \nmay be derived from the original drawings. Therefore, even if the original \ndrawings/ ‘artistic work’ is used to industrially produce an article, the \noriginal drawing/ ‘artistic work’ would continue to fall within the meaning \nof the artistic work defined under Section 2(c) of the Copyright Act, 1957 \nand would be entitled to the full period of copyright protection. \n18. \nIn Mody Pumps Inc and Anr. v. Sovereign Pumping Solutions \nProvate Limited and Anr., MANU/MH/1496/2022 a Single Bench of the \nBombay High Court was dealing with a similar issue of copyright \ninfringement in relation to engineering drawings of water pumps and the \nissues that arose were whether the aforesaid engineering drawings constitute \n‘artistic work’ and whether the plaintiffs have copyright in the same. \nRelying upon the judgment of the Division Bench in Microfibres (supra), \nthe Bombay High Court held that drawings are ‘artistic works’ within the \nmeaning of Section 13(1)(a) of the Copyrights Act and are therefore, \nexcluded from the purview of Section 2(d) of the Designs Act. It was \nobserved by the Bombay High Court that in terms of Section 2(d) of the \nDesigns Act, 2000, design relates only to shape, configuration, pattern, \nornament or composition of lines or colours applied to an article, which, in \nthe finished article, would have a visual appeal. Further, ‘design’ under \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified\n\n--- PAGE 18 ---\n2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 18 of 27 \n \nSection 2(d) does not include any mode or principle of construction or \nanything which is, in substance, a mere mechanical device. Section 2(d) also \nexcludes any ‘artistic work’ as defined in Section 2(c) of the Copyrights Act.  \n19. \nIn the present case, the plaintiffs claim copyright in respect of their \noriginal drawings. In terms of the judgment in Microfibres (supra), even if \nthe original drawings may be used to industrially produce an article, they \nwould continue to fall within the meaning of ‘artistic work’ under Section \n2(c) of the Copyright Act and also continue to enjoy full copyright \nprotection.  \n20. \nIt is also to be noted that a ‘design’ in respect of a finished product is \nyet to emerge in the present case. Therefore, no ‘design’ capable of \nregistration under the Designs Act has come out on the basis of the \nplaintiffs’ drawings. Additionally, the drawings of the plaintiffs relate to \nfastening systems, which are mere mechanical devices that have functional \nutility. By no stretch of imagination can it be said that the aforesaid \ndrawings reflect a product, which, in its finished state, would have any \nvisual appeal. Consequently, the aforesaid drawings are not be capable of \nbeing registered as a ‘design’ under the Designs Act. \n21. \nCounsel for the defendants has placed reliance on the judgments in \nHolland Company LP and Anr. v. S. P. Indusries, 2017 SCC OnLine Del \n9370 and Jagdamba Impex v. Tristar Products Pvt. Ltd., 2014 SCC Online \nDel 2872. However, the said judgments do not take into consideration the \nearlier decision of the Division Bench in Microfibres (supra), which I have \nrelied on to reach the conclusion above. Therefore, need is not felt to delve \ninto the aforesaid judgments. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified\n\n--- PAGE 19 ---\n2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 19 of 27 \n \n22. \nNow, I shall address the issue of whether any copyright for the \naforesaid drawings vests with the plaintiffs or if it has been assigned in \nfavour of the Ministry of Railways. \n23. \nThe Ministry of Railways laid down the performance criteria for \n„fastening system for ballastlass track on metro railways‟ vide its \ncommunication dated 21st May, 2010. The said communication also \nprovided that metro/MRTS were free to choose their fastening system for \nballastlass track complying with the performance criteria. In terms of the \naforesaid performance criteria laid down by the Ministry, the plaintiffs \nobtained approval from the Ministry of Railways. \n24. \nAt this stage, a reference may be made to the approval given by the \nMinistry of Railways to the plaintiffs on 7th October, 2011. The subject \nmatter of the said approval reads as follows: \n“Double Resilient Base Plate Assembly Fastening system-\ncorrigendum reg.” \n25. \nThe other relevant terms of the said approval are set out below: \n“…..Accordingly, to operationalize the approval given to the \ndouble resilient baseplate assembly system, the following is \nadvised:-  \n \n1. A copy of the Performance Certificate of the Dubai Metro \ndated 28.10.2010, based on which RDSO has considered the \nperformance of the system, is attached herewith as \nAnnexure-1. The Metro Railways/MRTS System should \nverify the authenticity of the system proposed to be used by \nthem vis-à-vis this Performance Certificate. \n \n2. The drawings and the specification of the fastening \nsystem as used in the test assembly, which has been \nexamined and cleared, are enclosed as Annexure-2. The \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified\n\n--- PAGE 20 ---\n2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 20 of 27 \n \nMetro Railways/MRTS System should make sure that the \nsystem, if used by them, matches completely with the \ndrawing and specifications of the test assembly examined \nby RDSO. The metro railway/MRTS system are at liberty \nto carry out any tests for this as considered necessary. \n \n3. Before this system is installed in the track, Metro \nRailways/MRTS System should satisfy themselves about \ntheir chosen fastening system meeting the physical \nparameters requirements of the Performance Criteria, by \nconducting fresh tests from an independent laboratory on \nsamples selected by Metro Railway/MRTS system. \n \n4. The clearance is only for the “double resilient base \nplate assembly fastening system” of M/S Pandrol Limited, \nUK., Metro Railways/MRTS Systems should verify \nthemselves about the credentials of the prospective \nsuppliers of this system.” \n \n26. \nIn view of the approval granted to the plaintiffs, the products of the \nplaintiffs became eligible for being tendered for various metro projects. \nThere is nothing in the aforesaid approval letter to suggest that the copyright \nin respect of the plaintiffs’ drawings was to vest with the Ministry of \nRailways or that the plaintiffs have waived their copyright in respect of the \naforesaid drawings. Defendants have failed to place any documents or \nmaterial in support of their contention that the copyright in respect of the \ndrawings of the plaintiffs has been waived by the plaintiffs. Even if it is \nassumed that the copyright has been transferred to the Ministry of Railways, \nit does not give any right in favour of the defendants to copy the said \ndrawings. Hence, there is no merit in the submission of the defendants that \nonce the drawings of the plaintiffs got approval from the Ministry of \nRailways and were annexed to the approval letter, they become a part of the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified\n\n--- PAGE 21 ---\n2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 21 of 27 \n \ncatalogue of the Ministry and any third party can make a bid based on the \naforesaid drawings. \n27. \nReliance placed on behalf of defendants on Clauses 2 and 4 of the \napproval letter dated 7th October, 2011 to submit that the tenderers have to \ncompletely match the drawings and specifications of the test assembly \nexamined by RDSO, is completely misplaced. The aforesaid clauses are \nonly in relation to approval granted to the plaintiffs. The reference to \n„prospective suppliers‟ in Clause 4 would only mean authorised suppliers of \nthe said products. This would not, in any manner, give a license to other \nsuppliers to use the copyrighted works of the plaintiffs. \n28. \nSenior counsel on behalf of the defendants has submitted that in terms \nof the tender document floated by the MPMRCL, for a party to bid for the \naforesaid tender, it had to bid in terms of the drawings of the plaintiffs.  \n29. \nAt this stage, reference may be made to the relevant part of the tender. \nThe scope of the tender is set out below: \n“„Design, Supply, Installation, Testing and Commissioning of \nBallastless Track of Standard Gauge, including Supply of \nFastening System for Purple Line from AIIMS to Karond and \nRed Line from Bhadhbhada Square to Ratnagiri Tiraha, \nincluding Elevated and Underground sections along with \nBallasted/Ballastless Track in Depot cum Workshop at Subhash \nNagar‟ for Bhopal Metro Rail Project.” \n30. \nThe other relevant extracts of the tender are as under: \n“4.2.1 Requirements for Fastening System for Ballastless Track \n… \niii. Fastening system for Bhopal MRTS Project: The Ballastless \ntrack fastening system already approved (vide letter No. \nCT/EF/Global EOI-2017/Ballastless Track dated 25.10.2019) \nby RDSO/MOR or installed & commissioned in any MRTS \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified\n\n--- PAGE 22 ---\n2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 22 of 27 \n \nproject in India and under observation & approval of \nRDSO/MOR as per clause 1.2 of Annexure-C2 of performance \ncriteria of fastening system for ballastless track (attached as \nAnnexure 12 of ITT), can only be proposed under this contract. \nThe proposed ballastless track fastening system shall adequately \nmeet the insulation requirement for stray current of 750V DC \nBottom 3rd Rail Traction System as per EN 50122-2 and as per \nrequirement of Tender. The proposed Ballastless Track \nFastening System should also have two layer of insulations Le \nbetween rail & fastening and between fastening & track \nplinth/slab. The evacuation of Passenger is proposed as front \nevacuation in this project as such the walkway gap should be \nensured more than 610 mm between rails and detailed drawing \nshall be submitted along with the tender. \niv. Approval Letter of RDSO/MOR: Tenderer to submit \napproval letter along with approved design/drawing of proposed \nballastless track fastening by RDSO/MOR. Tenderer to also \nsubmit all annexure and compliance of all observations of \nRDSO/MOR along with proof. For ballastless track fastening \nunder approval as mentioned above, tenderer to submit all \ntechnical details as per performance criteria and also letter of \nRDSO/MOR for use of said system and CRS sanction letter for \nopening of the line with that system. \n XXX  \n \n \nXXX  \n \n \nXXX \nvi. Tests reports of the fastening system: In terms of Paragraph \n4.7 and specification given in table 1 of Performance Criteria \nof ballastless track fastening system contained in Annexure C2, \nenclosed at Annexure 12 of ITT Vol. I of this Tender document, \nthe Tenderer should submit test report for the fastening system \nfrom reputed independent institute/laboratory. The test reports \nshould be accompanied with the drawing of the fastening \nsystem and its components to clearly establish that the fastening \nsystem including its components which have been tested and \nreported upon is exactly same as the fastening system including \nits components that has been proposed by the Tenderer in this \nTender. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified\n\n--- PAGE 23 ---\n2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 23 of 27 \n \n XXX  \n \n         XXX \n \n \n          XXX \nix. MoU with Supplier: Submit copy of the MoU entered into \nbetween the Tenderer and the Supplier for supply of complete \nballastless track fastening system as per tender specification. \nSingle Point Warrantee for the complete ballastless track \nfastening system and its individual components supplied by \nSupplier shall be with Tenderer for the defect liability period.” \n31. \nBased on the above, it was contended on behalf of the defendants that \nonce it is the requirement of the MPMRCL itself that the products to be \ntendered have to be in line with the drawings of the plaintiffs, the plaintiffs \ncannot contend that the defendants have copied the same. The defendants \nwere obligated to bid for the tender on the basis of the drawings of the \nplaintiffs. \n32. \nSenior counsel on behalf of the plaintiffs correctly points out that the \naforesaid tender of the MPMRCL was not in respect of products to be \nmanufactured specifically in terms of plaintiffs’ drawings. The tender \nfloated by the MPMRCL was in respect of „design, supply, installation, \ntesting and commissioning of ballastless track of standard gauge, including \nsupply of fastening system‟. The same is reiterated in clause 4.2.1(iii) \nextracted above. The drawings developed and designed by the plaintiffs, as \ncan be seen from the approval letter, were for the DBRAS. Therefore, it \ncannot be said that the tender was confined to products based on the \nplaintiffs’ drawings. The tender was for a generic product and the drawings \nof the plaintiffs were only one of the approved drawings. Therefore, there is \nno merit in the submission of the defendants that the tender floated was in \nrespect of a specific product to be manufactured as per the drawings of the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified\n\n--- PAGE 24 ---\n2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 24 of 27 \n \nplaintiffs and consequently, the defendants did not have any option but to \ncopy the drawings of the plaintiffs in order to manufacture the said product.  \n33. \nIn fact, any party who had obtained approvals from the Ministry of \nRailways could have supplied the products under the aforesaid tender. It is \nthe defendants’ own case that approvals have been received by six \ncompanies/entities for the aforesaid products and each one of them was free \nto bid for the tender. If the defendants failed to prepare their own drawings \nand get the same approved from the Ministry of Railways, the defendants \ncannot be permitted to copy the drawings of the plaintiffs. \n34. \nA perusal of paragraphs (ix) of clause 4.2.1 of the tender document \nextracted above would show that the tenderer could be a person other than \nthe six companies/entities with the RDSO/Ministry of Railways approvals. \nTherefore, it was open for the defendants to approach one of the \ncompanies/entities whose drawings had been approved or their supplier(s) \nand obtain a licence/enter into an agreement in respect thereof, to bid for the \ntender. \n35. \nClearly, the plaintiffs would have spent considerable time, effort and \nfinancial resources and undertaken extensive research and development to \ncreate the aforesaid drawings. If the contention of the defendants is \naccepted, then it would be open for any person to copy the work of another \nand commercially exploit the efforts of the original creator. This would \namount to permitting the defendants to unjustly enrich themselves at the \nexpense of the plaintiffs.  \n36. \nI am not persuaded by the submission of the defendants that if \nsuppliers that do not have RDSO/Ministry of Railways approvals are barred \nfrom using the drawings of the plaintiffs, a monopoly would be created in \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified\n\n--- PAGE 25 ---\n2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 25 of 27 \n \nfavour of the plaintiffs. There cannot be any question of a monopoly by the \nplaintiffs as besides the plaintiffs, five other companies/entities have \nreceived approvals from the RDSO/Ministry of Railways.  \n37. \nIt has vehemently been contended on behalf of the defendants that \nplaintiffs have not impleaded the Ministry Railways in the present suit and \nthat their presence is necessary to determine the question of whether any \ncopyright vests with the plaintiffs or if it has been assigned in favour of the \nMinistry of Railways. In my view, the aforesaid submission is completely \nunsustainable. It is the case of the defendants that plaintiffs have \nassigned/waived the copyright in favour of the Ministry of Railways or that \nthe copyright vests with the Ministry of Railways. Therefore, the onus is on \nthe defendants to prove that the copyright has been assigned/waived by the \nplaintiff in favour of the Ministry of Railways or that the same vests with the \nMinistry of Railways in any case. The stand of the Ministry of Railways, in \nthe present case, would be wholly irrelevant.  \n38. \nFurthermore, there is no merit in the submission of the defendants that \nno copyright subsists in the drawings of the plaintiffs since no registration \nhas been obtained in respect thereof. Registration is not a prerequisite to \nseeking protection from infringement under the Copyright Act.  \n39. \nSenior counsel appearing on behalf of the defendants has not disputed \nthe fact that the drawings of the plaintiffs have been copied in toto by the \ndefendants. However, he justifies the same by submitting that since the \naforesaid drawings of the plaintiffs were approved by the Ministry of \nRailways and tenderers were required to bid in terms of the said approval, \nthe defendants did not have any choice but to copy the drawings of the \nplaintiffs. Interestingly, on one hand, the defendants admit that they have \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified\n\n--- PAGE 26 ---\n2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 26 of 27 \n \ncopied the drawings of the plaintiffs,  yet in the drawings of the defendants it \nhas been noted that the said drawings have been drawn, checked, reviewed \nand approved by different personnel of the defendant no.1. Clearly, the \nattempt of the defendants in doing so was to show the drawing as their own \noriginal work. \n40. \nIf the defendants actually believed that there was no copyright in the \ndrawings of the plaintiffs and they could freely copy the same, there was no \nneed to put the name of their own personnel as the creators of the aforesaid \ndrawings. The extent of copying by the defendants is not confined just to the \ndrawings of the plaintiffs but goes on to include the unique numbering given \nto the said drawings by the plaintiffs. Reference in this regard may be made \nto pages 13 to 38 of the documents of the plaintiff.  Further, while copying \nthe aforesaid drawings, the defendants have also copied the mark \n‘PANDROL’ of the plaintiffs in some of the drawings, though the \ndefendants submit that it was on account of an inadvertent error. \n41. \nA reference to the Report of the Local Commissioners appointed by \nthe Court reveals that when the Local Commissioners visited the premises of \nthe defendants, the systems/laptops of the personnel of the defendants \ncontained the original drawings of the plaintiffs bearing the trademark of the \nplaintiffs, ‘PANDROL’. The Report also states that when the Local \nCommissioners searched for the term ‘PANDROL’ on the two laptops of the \ndefendants, various documents showed up, which included various drawings \nof the plaintiffs and other ‘PANDROL’ related data. When asked about the \nexistence of such data on their systems, no explanation was forthcoming \nfrom the defendants as to how did they obtain such data of the plaintiffs. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified\n\n--- PAGE 27 ---\n2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 27 of 27 \n \n42. \nThe discussion above leaves no doubt in my mind that the defendants \nhave dishonestly copied the drawings in respect of which the copyright vests \nsolely with the plaintiffs. Further, this has been done in a brazen manner so \nas to derive a competitive advantage. In my considered view, this can \nneither be permitted nor condoned. \n43. \nAccordingly, the present application filed on behalf of the plaintiffs \nunder Order XXXIX Rules 1 and 2 of the CPC is allowed and the order \ndated 2nd September, 2022 is confirmed till the final adjudication of the suit. \n44. \nTaking into account the conduct of the defendants in having \ncompletely copied the drawings of the plaintiffs and seeking to justify the \nsame, the defendants are burdened with costs of Rs.1,00,000/- to be paid to \nthe plaintiffs. \n45. \nNeedless to state, any observations made herein are only for the \npurposes of adjudication of the present application and would have no \nbearing on the final outcome of the suit. \nCS(COMM) 602/2022 \n46. \nList before the Joint Registrar on 26th April, 2023 for further \nproceedings. \n \n \nAMIT BANSAL, J \nMARCH 13, 2023 \nsr/rt \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified\n"
  },
  "total_pages": 27,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "Here is a summary of the legal document section from PDF: 16. Pandrol vs Patil Rail.pdf:\n\n**Case Details**\n\n* Case Number: CS(COMM) 602/2022\n* Court: High Court of Delhi at New Delhi\n* Date: Judgment reserved on February 21, 2023 and delivered on March 13, 2023\n\n**Parties**\n\n* Plaintiffs: PANDROL LIMITED & ANR.\n\t+ Represented by Mr. Rajshekhar Rao, Sr. Advocate, and others\n* Defendants: PATIL RAIL INFRASTRUCTURE PVT. LTD. & ORS.\n\t+ Represented by Mr. Jayant Mehta, Mr. Donthi Reddy, Dr. Venkat Reddy, Sr. Advocates, and others\n\n**Proceedings**\n\n* The plaintiffs filed an application (I.A. 14099/2022) under Order XXXIX Rules 1 and 2 of the CPC for grant of interim injunction.\n* A summons in the suit was issued on September 2, 2022, with an ad interim injunction restraining the defendants from infringing the plaintiffs' copyrighted works and trademark 'PANDROL'.\n* A Local Commissioner was appointed to visit the premises of defendant no. 1 in Hyderabad to take into custody information/data/drawings belonging to the plaintiffs.\n* The present application (I.A. 14099/2022) is for grant of interim injunction.\n\n**Arguments and Decision**\n\nThe judgment reserved on February 21, 2023, was delivered on March 13, 2023. However, the details of arguments and decisions are not provided in this summary.\n\n**Source**: 16. Pandrol vs Patil Rail.pdf (PDF document)",
      "pdf_source": "16. Pandrol vs Patil Rail.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "Here is a summary of page 1 from the PDF \"16. Pandrol vs Patil Rail.pdf\":\n\nThe High Court of Delhi at New Delhi delivered judgment in CS(COMM) 602/2022 on March 13, 2023 ( Judgment reserved on February 21, 2023). The case involves Pandrol Limited and another (plaintiffs) versus Patil Rail Infrastructure Pvt. Ltd. and others (defendants).\n\nThe plaintiffs are seeking an interim injunction under Order XXXIX Rules 1 and 2 of the Code of Civil Procedure, 1908. The present judgment aims to decide this application.\n\nKey points from page 1:\n\n* The summons in the suit was issued on September 2, 2022.\n* An ad interim injunction was granted in favor of the plaintiffs on that date, restraining the defendants from infringing copyrighted works and registered trademarks.\n* The court will now decide on a permanent injunction as per the application (I.A. 14099/2022).\n \n\n(PDF source: \"16. Pandrol vs Patil Rail.pdf\")",
          "content": "2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 1 of 27 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n \n% \n \n \n \n         Judgment reserved on :  21st February, 2023 \n \n \n \n \n        Judgment delivered on : 13th March, 2023 \n \n+  \n \n \n \nCS(COMM) 602/2022  \n \n \nPANDROL LIMITED & ANR.  \n \n \n..... Plaintiffs \nThrough: \nMr.Rajshekhar Rao, Sr.Advocate with \nMs.Archana \nSahadeva, \nMs.Anjuri \nSaxena \nand \nMr.Yashraj \nSamant, \nAdvocates. \n \n \n \n \nversus \n \n \nPATIL RAIL INFRASTRUCTURE PVT.  \nLTD. & ORS. \n \n \n \n \n \n..... Defendants \nThrough: \nMr.Jayant Mehta, Mr.Donthi Reddy, \nDr. Venkat Reddy, Sr.Advocates with \nMr.Gagan Gupta, Advocate.12r4 \n \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \n \n \n \n \n \nJUDGMENT \n \n \nI.A. 14099/2022 (O-XXXIX R-1 & 2 of the CPC) \n1. \nBy way of the present judgment, I shall decide the application filed on \nbehalf of the plaintiffs under Order XXXIX Rules 1 and 2 of the Code of \nCivil Procedure, 1908 (CPC) for grant of interim injunction. \nPROCEEDINGS IN THE SUIT \n2. \nSummons in the suit was issued on 2nd September, 2022, when an ad \ninterim injunction was granted in favour of the plaintiffs, restraining the \ndefendants from infringing the copyrighted works and the registered \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified",
          "pdf_source": "16. Pandrol vs Patil Rail.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "**Page 2 Summary from PDF: 16. Pandrol vs Patil Rail.pdf**\n\n**Case Details:**\n* Case: CS(COMM) 602/2022\n* Plaintiffs: PANDROL LIMITED & ANR.\n* Defendants: Not specified\n* Date of Judgment: 13th March, 2023\n* Ref. No.: 2023/DHC/001792\n\n**Proceedings:**\n\nThe court had earlier passed an injunction order restraining the defendants from copying Pandrol's copyrighted work and using/deceptively similar trademarks (see page 1). A Local Commissioner was appointed to seize information/data/drawings belonging to the plaintiffs in the defendant's possession.\n\n**Arguments/Decisions:**\nNo specific details are provided on the arguments or decisions made by the court. Submissions were heard on 21st February, 2023, and judgment was reserved. Both parties have filed brief notes of their submissions.\n\n**Focus on Legal Facts and Proceedings:** The focus remains on legal facts, proceedings, and judgments in this summary.",
          "content": "2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 2 of 27 \n \ntrademark ‘PANDROL’ of the plaintiffs as well as passing off their products \nas those of the plaintiffs under the ‘PANDROL’ mark. The relevant portion \nof the injunction order is set out as under: \n“32. Accordingly, Defendants, their directors, executives, \npartners, proprietors, principal officers, assignees, family \nmembers and anyone acting for and on their behalf are restrained \nfrom:  \n \na. directly or indirectly copying, reproducing, storing, using, \npublishing, advertising Pandrol‟s Copyrighted Work, i.e. \ndrawing numbers 13145, 13146, 14613, 14614, 5720, 8605, \n8604, 12683, 12740, 2759, 12717, 12791, 10108, 21166, in \nany manner that may result in infringement of the Plaintiff‟s \ncopyright subsisting in the said drawings;  \n \nb. using, applying, manufacturing and selling, offering for \nsale, advertising or promoting the unauthorized usage of the \nPANDROL trade mark, or any other mark which is either \nidentical to or deceptively similar to the Plaintiff‟s registered \ntrade mark „PANDROL‟ causing infringement of the \nregistered trade mark and passing off in respect of any \nproducts whatsoever.” \n3. \nA Local Commissioner was also appointed by the Court to visit the \npremises of the defendant no.1 in Hyderabad, to, inter alia, take into custody \nany information/data/drawings belonging to the plaintiffs and in the \npossession of the defendants. Report dated 15th September, 2022 of the \nLocal Commissioner is on record. \n4. \nThereafter, pleadings in the suit and the present application have been \ncompleted. Submissions in the present application were heard on 21st \nFebruary, 2023 and judgment was reserved. Both sides have filed a brief \nnote of their submissions. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified",
          "pdf_source": "16. Pandrol vs Patil Rail.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0007",
      "start_index": 3,
      "end_index": 5,
      "summary": "**Case Summary: Pandrol vs Patil Rail**\n\nSource: 16. Pandrol vs Patil Rail.pdf (CS(COMM) 602/2022)\n\n**Facts:**\n\n* Plaintiff No.1, PANDROL LIMITED, is a UK-based company and industry leader in rail fastenings.\n* Plaintiff No.2 is a joint venture between PANDROL LIMITED and Rahee Industries Ltd.\n* Defendant No.1 is PATIL RAIL in the business of railway track engineering.\n* The plaintiffs have designed and developed the \"Pandrol Double Resilient Baseplate Assembly System\" (DBRAS), a railway track fastening system used in metro rails.\n\n**Legal Proceedings:**\n\n* The Ministry of Railways notified the \"Performance Criteria of Fastening Systems for Ballastless Track\" on May 21, 2010.\n* PANDROL LIMITED obtained approval for their DBRAS drawings from the Ministry of Railways on October 7, 2011.\n* The plaintiffs alleged that PATIL RAIL infringed their copyrighted work by copying the DBRAS drawings and submitting them to a railway tender floated by Madhya Pradesh Metro Rail Corporation Limited (MPMRCL).\n* The plaintiffs also alleged trademark infringement by using the mark \"PANDROL\" under the submitted drawings.\n\n**Arguments and Decisions:**\n\n* Judgment reserved on February 21, 2023.\n* Judgment delivered on March 13, 2023.\n\n**Parties Involved:**\n\n* Plaintiffs: PANDROL LIMITED & ANR.\n* Defendants: PATIL RAIL & Anr. (employees of Defendant No.1).\n\n**Amounts/Certificate Not Mentioned:** None mentioned in the provided document summary.",
      "pdf_source": "16. Pandrol vs Patil Rail.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "Here is a summary of page 3 from PDF \"16. Pandrol vs Patil Rail.pdf\" in 200 words or less:\n\n**Case Set Up:**\n\nThe plaintiff (Pandrol Limited) is an industry leader in rail fastenings and track elasticity solutions, while the defendant (Patil Rail) is a company in railway track engineering. The plaintiffs claim to be the registered proprietors of the \"PANDROL\" trademark in India since 1964.\n\n**Key Facts:**\n\n* Pandrol was adopted as a trade/corporate name by the predecessor-in-interest of plaintiff no.1 in 1964.\n* Plaintiff no.1 holds registrations for its trademark \"PANDROL\" since 1964.\n* The plaintiffs designed and developed the \"Pandrol Double Resilient Baseplate Assembly System (DBRAS)\".\n\n**Sources:**\n\n* PDF source: \"16. Pandrol vs Patil Rail.pdf\"\n* Case number: CS(COMM) 602/2022\n* Date: Judgment delivered on 13th March, 2023",
          "content": "2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 3 of 27 \n \n \nCASE SET UP IN THE PLAINT \n5. \nThe case set up in the plaint is as under: \n5.1. Plaintiff no.1 is the industry leader in rail fastenings and track \nelasticity solutions headquartered in the United Kingdom. The \nplaintiff no.2 is a joint venture between the plaintiff no.1 and Rahee \nIndustries Ltd., a leading integrated railroad company. \n5.2. The defendant no.1 is a company in the business of dealing in railway \ntrack engineering. Defendants no.2 to 5 are employees of the \ndefendant no.1. \n5.3. The mark ‘PANDROL’ of the plaintiffs was adopted by the \npredecessor-in-interest of the plaintiff no.1 in 1964 and subsequently, \nalso adopted as the trade/corporate name of the plaintiff no.1. The \nplaintiff no.1 holds registrations dating as far back as 1964 for its \ntrademark ‘PANDROL’ in various classes, details of which are \nprovided in paragraph 40 of the plaint. The plaintiff no.1 is the \nregistered proprietor of the ‘PANDROL’ trademark in India. \n5.4. The plaintiffs have designed, developed and created detailed drawings \nfor their ‘Pandrol Double Resilient Baseplate Assembly System’ \n[hereinafter ‘DBRAS’], which is a railway track fastening system \nused in metro rails.  \n5.5. The Ministry of Railways, vide notification dated 21st May, 2010 had \nnotified the „Performance Criteria of Fastening Systems for \nBallastless Track‟ [hereinafter ‘Performance Criteria’], which \nstipulated the various parameters and standards applicable to \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified",
          "pdf_source": "16. Pandrol vs Patil Rail.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "**Based on page 4 of PDF \"16. Pandrol vs Patil Rail.pdf\"**\n\n**Case Details:**\nCS(COMM) 602/2022 in the High Court of Delhi at New Delhi\n\n**Plaintiffs:** PANDROL LIMITED & ANR.\n\n* Obtained approval for their drawings from Ministry of Railways on October 7, 2011.\n* Have exclusive rights to use and license the drawings, including exporting outside India.\n\n**Infringement Allegations:**\n\n* Defendants copied plaintiffs' copyrighted drawings (DBRAS) and submitted them to Madhya Pradesh Metro Rail Corporation Limited (MPMRCL).\n* Defendents used the trademark 'PANDROL' in their submissions to MPMRCL.\n \n**Reference:** PDF source: 16. Pandrol vs Patil Rail.pdf, Context: 2023/DHC/001792",
          "content": "2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 4 of 27 \n \n„fastening systems for ballastless track‟ of metro rails. On being found \ncompliant with the parameters and standards prescribed under the \nPerformance Criteria, the plaintiffs obtained approval for their \ndrawings from the Ministry of Railways vide letter dated 7th October, \n2011. \n5.6. The DBRAS drawings are the copyrighted work of the plaintiff no.1, \nbeing the original artistic work designed, developed and created by \nthe plaintiff no.1. Plaintiff no.2 is the exclusive license holder of the \ndrawings of the plaintiff no.1 and is licensed to use the said drawings \nin the course of their business in India. \n5.7. The DBRAS is manufactured and supplied in India as well as \nexported outside the country by the plaintiff no.2. \n5.8. Through their long, extensive and continuous use and extensive sales \npromotion of the products marketed under the ‘PANDROL’ mark, the \nplaintiffs have gained reputation and goodwill, which is also reflected \nthrough its sales turnover. The plaintiff no.1 has also been conferred \nwith awards for their products and services. \n5.9. The defendants have infringed the copyrighted work of the plaintiff \nno.1 by copying the drawings of the plaintiff no.1  and submitting the \nsame to the Madhya Pradesh Metro Rail Corporation Limited \n[hereinafter ‘MPMRCL’] in response to a railway tender floated by \nthem. A comparison of the drawings of the parties is reproduced in \nparagraph 53 of the plaint.  \n5.10. The defendants have also infringed the trademark ‘PANDROL’ by \nsubmitting the impugned drawings under the said mark in response to \nthe  tender floated by the MPMRCL. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified",
          "pdf_source": "16. Pandrol vs Patil Rail.pdf",
          "nodes": []
        },
        {
          "title": "Page 5",
          "node_id": "0006",
          "start_index": 5,
          "end_index": 5,
          "summary": "Here is a summary of page 5 from the provided PDF:\n\n**Source:** 2018/DHC/001792 - Pandrol vs Patil Rail.pdf (High Court of Delhi at New Delhi)\n\n**Summary:**\n\nThe present suit was filed by Pandrol Limited and another party seeking a decree of permanent injunction along with other ancillary reliefs. The defendant, Patil Rail, submitted written statements in response.\n\nAccording to the defendant's statement:\n\n* They are in the business of manufacturing railway track components and produced engineering drawings for the \"Double Resilient Base Plate System\" as per technical specifications given by MPMRCL (Bhopal Metro Rail Project).\n* The Railway Board, Ministry of Railways has approved six fastening systems for ballastless tracks, any of which can be used by metro railways/mass rapid transit systems in India.\n* Exclusive rights to a fastening system are claimed only if registration is obtained; mere approval by the Ministry does not grant exclusive rights.\n\nThis is from page 5 of the PDF.",
          "content": "2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 5 of 27 \n \n5.11. Accordingly, the present suit has been filed seeking a decree of \npermanent injunction along with other ancillary reliefs. \nCASE SET UP IN THE WRITTEN STATEMENT \n6. \nThe case set out in the written statement is as under: \n6.1. The defendant no.1 is in the business of manufacturing various \nrailway track components such as concrete sleepers, rail fastening \ncomponents for normal tracks, elevated and underground tracks for \nmetro railways and ballastless tracks suitable for high-speed lines, \nbridges, tunnels and the like. \n6.2. The engineering drawings for the ‘Double Resilient Base Plate \nSystem’ submitted by the defendant no.1 are as per the technical \nspecifications, dimensions and features given by the MPMRCL for \n„Design, Supply, Installation, testing and Commissioning of \nBallastless Track of Standard Gauge, including Supply of Fastening \nSystem…for Bhopal Metro Rail Project‟ and in conformity with the \nguidelines issued by the Ministry of Railways, as amended from time \nto time. Therefore, the same can be supplied by any entity including \nthe defendant no.1. \n6.3. The Railway Board, Ministry of Railways has approved a total of six \nfastening systems for ballastless tracks, any of which can be used by \nmetro railways/mass rapid transit systems [hereinafter ‘MRTS’] in \nIndia. All six fastening systems are designed by different \ncompanies/entities and exclusive rights can be claimed by such \ncompanies/entities only if registrations are obtained thereof. Mere \napproval of a fastening system by the Ministry of Railways does not \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified",
          "pdf_source": "16. Pandrol vs Patil Rail.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0028",
      "start_index": 6,
      "end_index": 25,
      "summary": "Here is a summary of the provided section from the PDF:\n\n**Case Details**\n\n* Case No.: CS(COMM) 602/2022\n* Parties: Pandrol Limited & Anr (Plaintiffs) vs Patil Rail (Defendants)\n* Court: High Court of Delhi at New Delhi\n* Judgment Date: March 13, 2023\n\n**Legal Proceedings**\n\n* The plaintiffs filed a suit against the defendants alleging copyright and trademark infringement.\n* The defendants' written statement admitted copying the plaintiffs' drawings.\n\n**Arguments**\n\n* Plaintiffs argued that the defendants infringed their copyright by copying the drawings in toto.\n* Defendants claimed that they made an inadvertent error in including the plaintiffs' trademark on the drawings, which was rectified later.\n* The court observed that the drawings were in the public domain and not registered under any intellectual property laws.\n\n**Court Decisions**\n\n* The court found that no copyright subsisted in the plaintiffs' drawings as per Section 15 of the Copyright Act, 1957 read with Designs Act, 2000.\n* The defendants were accused of making an inadvertent error, but no manufacturing or production of the Double Resilient Base Plate Assembly System components had been undertaken by them.\n\n**Amount**\n\n* No amount is specifically mentioned in this section of the PDF.\n\n**Source**\n\nThis summary is based on Section: Legal Arguments from the PDF document 16. Pandrol vs Patil Rail.pdf, which contains a court judgment reserved on February 21, 2023, and delivered on March 13, 2023 (CS(COMM) 602/2022).",
      "pdf_source": "16. Pandrol vs Patil Rail.pdf",
      "nodes": [
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "Here is a summary of page 6 from the PDF 16. Pandrol vs Patil Rail.pdf:\n\n**Court Case:** CS(COMM) 602/2022\n**Judge's Decision (March 13, 2023)**\n\nRegarding the Double Resilient Base Plate Assembly System (DBRAS):\n\n* The system is not registered under any intellectual property laws in India.\n* The drawings of DBRAS are publicly available on the internet and Ministry of Railways' website.\n* No copyright subsists in the drawings according to Section 15 of the Copyright Act, 1957.\n\nRegarding trademark infringement:\n\n* The defendant used the \"PANDROL\" mark, which was an inadvertent error and subsequently rectified.\n* No manufacturing or production of DBRAS components has been undertaken by the defendant, so no case for trademark infringement is made out.",
          "content": "2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 6 of 27 \n \nconfer any statutory right in favour of the company/entity who has \ndeveloped and designed such system. \n6.4. The DBRAS purported to have been developed and designed by the \nplaintiff no.1 is not registered under the Patents Act, 1970 or the \nCopyright Act, 1957 or the Designs Act, 2000. \n6.5. The drawings of the plaintiff no.1 are in the public domain, being \neasily available on the internet, as also on the official website of the \nMinistry of Railways. \n6.6. No copyright subsists in the drawings of the plaintiff as per Section 15 \nof the Copyright Act, 1957 read in conjunction with the Designs Act, \n2000. \n6.7. The defendant no.1 has not commercially exploited the trademark \n‘PANDROL’ of the plaintiff no.1. The trademark reflected on the \ndrawings submitted by the defendant no.1 to various contractors was \nonly an inadvertent error on part of the defendants no.2 to 4, who \nmistakenly left the said mark on the drawings while converting them \nfrom PDF files to AutoCAD files. The said inadvertent error was \nrectified as soon as it was brought to the attention of the defendants \nand the drawings were re-submitted to the contractors without the \n‘PANDROL’ mark. \n6.8. Even otherwise, no manufacturing or production of the Double \nResilient Base Plate Assembly System components has been \nundertaken by the defendant no.1. Therefore, no case for infringement \nof the trademark of the plaintiff no.1 or passing off is made out.  \n7. \nThe plaintiffs have also filed a replication, wherein, in addition to the \npleadings put forth in support of the case set up in the plaint, it has been \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified",
          "pdf_source": "16. Pandrol vs Patil Rail.pdf",
          "nodes": []
        },
        {
          "title": "Page 7",
          "node_id": "0009",
          "start_index": 7,
          "end_index": 7,
          "summary": "Here is a summary of page 7 from the PDF \"16. Pandrol vs Patil Rail.pdf\":\n\nThe plaintiff's senior counsel argued that the defendants infringed on their copyright and trademark by copying their drawings in toto. The defendants had admitted to this infringement in paragraph 21 of their written statement and also affirmed it in a report filed by the Local Commissioner.\n\nThe counsel pointed out that clause 4.2 of the tender floated by MPMRCL required approved drawings from RDSO/Ministry of Railways, making the subject matter of the tender a generic product and not specifically the plaintiff's product. Therefore, there was no justification for the defendants to copy the plaintiffs' drawings without permission.\n\nEven if copying were necessary, there was no basis for the defendants to provide the plaintiffs' approved drawings as a condition for submitting their own bids. The plaintiff is seeking to prevent MPMRCL from being deceived by the defendants using their copyrighted drawings and trademark.\n\nSource: PDF \"16. Pandrol vs Patil Rail.pdf\" (2023/DHC/001792).",
          "content": "2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 7 of 27 \n \nsubmitted that the intention of the plaintiffs was not just to safeguard its \neconomic interest by filing the present suit but also to prevent the MPMRCL \nfrom being deceived by the defendants using the copyrighted drawings and \ntrademark of the plaintiffs. \nSUBMISSIONS ON BEHALF OF THE PLAINTIFFS \n8. \nIn support of the case set up in the plaint, the senior counsel appearing \non behalf of the plaintiffs made the following submissions: \n8.1. The defendants have infringed the copyright and trademark \n‘PANDROL’ of the plaintiff by copying the drawings of the plaintiffs \nin toto. The said fact has been admitted by the defendants in \nparagraph 21 of the written statement and also affirmed in the report \ndated 22nd September, 2022 filed by the Local Commissioner. \n8.2. Clause 4.2 of the tender floated by the MPMRCL specifically \nprovides that a tenderer offering the supply of fastening systems is \nrequired to provide, inter alia, the approval letter obtained from the \nRDSO/Ministry of Railways along with the approved drawings of the \nfastening system, certificate of performance and the like. Therefore, \nthe subject matter of the tender was in respect of a generic product \nand not specifically the plaintiffs’ product. Hence, there was no \njustification for the defendants to unauthorizedly copy the drawings of \nthe plaintiffs. \n8.3. Even if it is assumed that the tender of the MPMRCL required \ncopying of the approved drawings of the plaintiffs, there was no basis \nfor the defendants to expressly provide that the drawings submitted by \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified",
          "pdf_source": "16. Pandrol vs Patil Rail.pdf",
          "nodes": []
        },
        {
          "title": "Page 8",
          "node_id": "0010",
          "start_index": 8,
          "end_index": 8,
          "summary": "**Summary of Page 8 of the PDF: 16. Pandrol vs Patil Rail.pdf**\n\nThe High Court of Delhi is hearing a case (CS(COMM) 602/2022) between Pandrol Limited & Anr. (plaintiffs) and others (defendants). On page 8, the court states that:\n\n* Pl.,ts' drawings are not considered \"designs\" under the Designs Act, 2000.\n\t+ Reason 1: The drawings constitute \"artistic work\" under Section 2(c) of the Copyright Act, 1957.\n\t+ Reason 2: They represent a mode or principle of construction for a fastening system, which is excluded from the definition of \"design\".\n\t+ Reason 3: There's no visual appeal to qualify them as a design.\n* Since Pl.,ts' drawings are not eligible for registration under the Designs Act, defendants' reliance on Section 15(2) is misplaced.\n\n**Source**: PDF file \"16. Pandrol vs Patil Rail.pdf\", specifically page 8 of 27. **Court Case Number:** CS(COMM) 602/2022.",
          "content": "2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 8 of 27 \n \nthem have been drawn, checked, reviewed and approved by their \nemployees, the defendants no.2 to 5. \n8.4. The drawings of the plaintiffs are not covered under the ambit of \n‘design’ as defined in Section 2(d) of the Designs Act, 2000 for the \nfollowing reasons: \ni. \nThe drawings of the plaintiffs constitute ‘artistic work’ as \ndefined under Section 2(c) of the Copyright Act, 1957.  \nii. \nThe drawings of the plaintiffs are a mode/principle of \nconstruction of a fastening system, which is expressly excluded \nfrom the definition of the word ‘design’ as provided under \nSection 2(d) of the Designs Act. \niii. \nThere is no visual appeal to the drawings of the plaintiffs which \nwould qualify the drawings of the plaintiff to fall in the \ncategory of ‘design’. \n8.5. Since the drawings of the plaintiffs do not constitute a „design, which \nis capable of being registered under the Designs Act, 2000‟  the \nreliance placed on Section 15(2) of the Designs Act, 2000 by the \ndefendants, is misplaced. \nSUBMISSIONS ON BEHALF OF THE DEFENDANTS \n9. \nIn support of the averments made in the written statement, senior  \ncounsel appearing on behalf of the defendants made the following \nsubmissions: \n9.1. The drawings of the plaintiffs are in the public domain since 2010, \nwhen they were first published in the United Kingdom. The drawings \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified",
          "pdf_source": "16. Pandrol vs Patil Rail.pdf",
          "nodes": []
        },
        {
          "title": "Page 9",
          "node_id": "0011",
          "start_index": 9,
          "end_index": 9,
          "summary": "Here is a summary of page 9 from the PDF:\n\nThe court discusses the technical specifications and drawings provided to tenderers for fastening systems by the Ministry of Railways. The plaintiffs, Pandrol Limited and another, had submitted their drawings and specifications to the Ministry, which were approved on October 7, 2011.\n\nKey points discussed in this section:\n\n* The tenderer was required to match completely with the drawings and specifications of the test assembly (Clause 2 of the approval letter).\n* The Ministry of Railways has approved six fastening systems that can be supplied by any vendor based on the approved drawings.\n* The plaintiffs do not have copyright over their drawings, as they constitute a design capable of being registered under the Designs Act, 2000.\n\nThis section is from PDF: 16. Pandrol vs Patil Rail.pdf, document ID: 2023/DHC/001792.",
          "content": "2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 9 of 27 \n \nhave also been published on the RDSO website as attachments to the \napproval letter dated 7th October, 2011. \n9.2. The tenderer was required to match completely with the drawings and \nspecifications of the test assembly. Reliance in this regard is placed on \nClauses 2 and 4 of the approval letter dated 7th October, 2011 issued \nby the Ministry of Railways. \n9.3. The Ministry of Railways has approved six fastening systems, which \ncan be supplied by any vendor on the basis of the approved drawings. \n9.4. Plaintiffs do not have any copyright over their drawings within the \nmeaning of Section 14 of the Copyright Act, 1957. In fact, the \ndrawings of the plaintiffs constitute „design capable of being \nregistered‟ under the Designs Act, 2000. \n9.5. The plaintiffs have already supplied more than 21,00,000 fastening \nsets and 50,00,000 elastic rail clips in various projects. Reliance in \nthis regard is placed on paragraphs 14, 25 and 26 of the plaint. \nTherefore, no copyright subsists in the drawings of the plaintiffs as \nper Section 15(2) of the Copyright Act, 1957. \nANALYSIS AND FINDINGS \n10. \nI have heard the rival submissions. \n11. \nAt the outset, I will address the submissions made on behalf of the \ndefendants that the plaintiffs could not claim any copyright in the aforesaid \ndrawings in light of Section 15(2) of the Copyright Act, 1957. To consider \nthe aforesaid submissions, a reference may be made to the relevant \nprovisions of the Copyright Act as well as the Designs Act. \n12. \nRelevant provisions of the Copyright Act are as under: \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified",
          "pdf_source": "16. Pandrol vs Patil Rail.pdf",
          "nodes": []
        },
        {
          "title": "Page 10",
          "node_id": "0012",
          "start_index": 10,
          "end_index": 10,
          "summary": "Based on page 10 of the provided PDF \"16. Pandrol vs Patil Rail.pdf\" (Source: 2023/DHC/001792 CS(COMM) 602/2022), there are no updates or new information regarding the court case between Pandrol Limited and Anr. vs Patil Rail, except that the judgment was delivered on March 13, 2023.\n\nHowever, the page appears to include extracts from Section 13 of the Copyright Act, which deals with works in which copyright subsists. Specifically, it mentions:\n\n* The definition of \"copyright\" as the exclusive right to do or authorise certain acts in respect of a work, including reproduction and depiction.\n* The classes of works in which copyright subsists, including original literary, dramatic, musical, and artistic works.\n\nThere is no focus on legal facts, proceedings, arguments, decisions, dates, names, and amounts within this limited extract. Further information from the PDF would be required to provide a complete summary.",
          "content": "2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 10 of 27 \n \n“2. Interpretation.— In this Act, unless the context otherwise \nrequires,— \n(c) “artistic work” means,—  \n(i) a painting, a sculpture, a drawing (including a diagram, \nmap, chart or plan), an engraving or a photograph, whether \nor not any such work possesses artistic quality; \n(d) “author” means, — \n(iii) in relation to an artistic work other than a photograph, \nthe artist; \n(m) “infringing copy” means—  \n(i) in relation to a literary, dramatic, musical or artistic work, \na reproduction thereof otherwise than in the form of a \ncinematographic film; \n13. Works in which copyright subsists.— (1) Subject to the \nprovisions of this section and the other provisions of this Act, \ncopyright shall subsist throughout India in the following classes of \nworks, that is to say,—  \n(a) original literary, dramatic, musical and artistic works; \n14. Meaning of Copyright.— For the purposes of this Act, \n“copyright” means the exclusive right subject to the provisions of \nthis Act, to do or authorise the doing of any of the following acts \nin respect of a work or any substantial part thereof, namely:— \n(c) in the case of an artistic work,—  \n[(i) to reproduce the work in any material form \nincluding—  \n(A) the storing of it in any medium by electronic or other \nmeans; or  \n \n(B) depiction in three-dimensions of a two-dimensional \nwork; or  \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified",
          "pdf_source": "16. Pandrol vs Patil Rail.pdf",
          "nodes": []
        },
        {
          "title": "Page 11",
          "node_id": "0013",
          "start_index": 11,
          "end_index": 11,
          "summary": "Unfortunately, there is no page content provided for page 11 of the PDF \"16. Pandrol vs Patil Rail.pdf\". However, I will extract information from the surrounding pages and provide a summary:\n\nThe document pertains to a case in the High Court of Delhi (CS(COMM) 602/2022) involving Pandrol Limited and another versus Patil Rail. The court is dealing with copyright disputes regarding designs.\n\nOn page 11, there is no text provided, but on adjacent pages, it appears that the court is discussing Section 13 of the Copyright Act, 1957, which deals with the scope of protection for industrial designs.\n\nRelevant provisions from the Designs Act, 2000 are mentioned:\n\n* A design refers to features of shape, configuration, pattern, or composition of lines or colors applied to an article by any industrial process.\n* Registration of a design under Section 15 of the Designs Act can bar copyright protection.\n* Copyright in a registered design ceases when the design is reproduced more than 50 times.\n\nThe court also mentions the definition of \"design\" as per the Designs Act, 2000 (Section 2) which includes features applied to an article by any industrial process. \n\nSource: 16. Pandrol vs Patil Rail.pdf (PDF file not shared).",
          "content": "2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 11 of 27 \n \n(C) depiction in two-dimensions of a three-dimensional \nwork;] \n \n(ii) to communicate the work to the public; \n \n15. Special provision regarding Copyright in designs registered or \ncapable of being registered under the Designs Act, 2000.— \n \n (1) Copyright shall not subsist under this Act in any design \nwhich is registered under the Designs Act, 2000.  \n \n(2) Copyright in any design, which is capable of being \nregistered under the Designs Act, 2000 but which has not \nbeen so registered, shall cease as soon as any article to which \nthe design has been applied has been reproduced more than \nfifty times by an industrial process by the owner of the \ncopyright or, with his licence, by any other person.” \n \n13. \nRelevant provisions of the Designs Act, 2000 are as under: \n“2. Definitions.—In this Act, unless there is anything repugnant in \nthe subject or context,— \n \n(d) “design” means only the features of shape, configuration, \npattern, ornament or composition of lines or colours applied \nto any article whether in two dimensional or three \ndimensional or in both forms, by any industrial process or \nmeans, whether manual, mechanical or chemical, separate \nor combined, which in the finished article appeal to and are \njudged solely by the eye; but does not include any mode or \nprinciple of construction or anything which is in substance a \nmere mechanical device, and does not include any trade \nmark as defined in clause (v) of sub-section (1) of section 2 \nof the Trade and Merchandise Marks Act, 1958 or property \nmark as defined in section 479 of the Indian Penal Code or \nany artistic work as defined in clause (c) of section 2 of the \nCopyright Act, 1957.” \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified",
          "pdf_source": "16. Pandrol vs Patil Rail.pdf",
          "nodes": []
        },
        {
          "title": "Page 12",
          "node_id": "0014",
          "start_index": 12,
          "end_index": 12,
          "summary": "**Summary of page 12 from PDF: 16. Pandrol vs Patil Rail.pdf**\n\nIn the case **CS(COMM) 602/2022**, senior counsel for the defendant, **Pandrol Limited**, argued that since the drawings in question can be registered under the Designs Act and have been produced more than fifty times through an industrial process, no copyright can be claimed by the plaintiffs (**Patil Rail**) in terms of Section 15(2) of the Designs Act.\n\nThe counsel relied on judgments including **Microfibres Inc v. Girdhar And Co. & Anr.,** (2009 SCC OnLine Del 1647). In this case, a Division Bench of the Delhi High Court observed that if an original artistic work is reproduced in another material form using an industrial process, the copyright holder may not have exclusive rights.\n\nThe court will now consider these arguments and provide its decision.\n\n**Source:** PDF: 16. Pandrol vs Patil Rail.pdf",
          "content": "2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 12 of 27 \n \n14. \nSenior counsel on behalf of the defendants has submitted that that \nsince the drawings of the plaintiffs are capable of being registered under the \nDesigns Act and based on the said drawings, products have been produced \nby the plaintiffs more than fifty times through an industrial process, no \ncopyright can be claimed by the plaintiffs in respect of the said drawings in \nterms of Section 15(2) of the Designs Act. In support of this submission, \nsenior counsel for the defendants has placed reliance on various judgments, \nwhich are discussed below. \n15. \nIn Microfibres Inc v. Girdhar And Co. and Anr., 2009 SCC OnLine \nDel 1647 a Division Bench of this Court was seized of similar issues with \nregard to the interplay of various sections of the Copyright and Designs Act \nin order to determine whether a work is capable of being registered under \nthe Designs Act, by virtue of which no copyright in respect thereof could be \nclaimed as per Section 15(2) of the Copyright Act. After comparing the \nrelevant provisions of the Designs Act and Copyright Act, the Division \nBench observed as under: \n“22. \nTherefore, it is the exclusive right of the holder of a \nCopyright in an original artistic work to reproduce the work in \nany material form. For example, a drawing of an imaginary \nfuturistic automobile, which is an original artistic work, may be \nreproduced in the three-dimensional material form using an \nelement, such as a metal sheet. When the copyright holder of an \noriginal artistic work reproduces the same in another material \nform, he may, or may not do so by employing an industrial \nprocess or means which may be manual, mechanical or \nchemical, separate or combined, on an article. If the \nreproduction of the original artistic work is done by employing \nan industrial process, as aforesaid, on an article, and the same \nresults in a finished article which appeals to the eye as \nadjudged solely by the eye, then the features of shape, \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified",
          "pdf_source": "16. Pandrol vs Patil Rail.pdf",
          "nodes": []
        },
        {
          "title": "Page 13",
          "node_id": "0015",
          "start_index": 13,
          "end_index": 13,
          "summary": "Here is a summary of page 13 from PDF source \"16. Pandrol vs Patil Rail.pdf\":\n\nThe Court discusses the concept of design as per the Designs Act and emphasizes that an original artistic work is different from a design created for industrial application on an article. The definition of \"design\" in the Designs Act excludes any artistic work defined in Section 2(c) of the Copyright act, 1957.\n\nRelevant points:\n\n* The Court clarifies that an original artistic work and the design derived from it have distinct meanings.\n* The definition of \"design\" excludes any artistic work as per the Copyright Act.\n* Section 15(2) of the Copyright Act deals with copyright in a design that is capable of registration but not registered.\n\nContext: Case No. CS(COMM) 602/2022, Pandrol Limited & Anr. vs Patil Rail (Pulman and P. L.) Pvt. Ltd., Judgment delivered on March 13, 2023. Source PDF: \"16 Pandrol vs Patil Rail.pdf\".",
          "content": "2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 13 of 27 \n \nconfiguration, pattern, ornament or composition of lines or \ncolours applied to the article by the industrial process \nconstitutes a “design”, within the meaning of this expression as \ndefined under the Designs Act. \n23. \nThere is, therefore, a clear distinction between an \noriginal artistic work, and the design derived from it for \nindustrial application on an article. This position is clarified by \nthe use of the expression “only” before the words “the features \nof shape, configuration, pattern, ornament or composition of \nlines or colours” in the definition of “design” in the Designs \nAct. Therefore, the original artistic work, which may have \ninspired the creation of a design, is not merely the feature of \nshape, configuration, pattern, ornament or composition of lines \nor colours which are created to apply to an article by an \nindustrial process. The original artistic work is something \ndifferent from the design. Secondly, the definition of “design” \nexpressly excludes, inter alia, any artistic work defined in \nsection 2(c) of the Copyright act, 1957. \nXXX  \n \n \nXXX  \n \n \nXXX \n30. \nSub-section (2) of section 15 deals with the situation \nwhere the design, which is capable of being registered under the \nDesigns Act, is not so registered. It provides that copyright in \nsuch a design shall cease as soon as any article to which the \ndesign has been applied has been reproduced more than 50 times \nby an industrial process by the owner of the copyright or with his \nlicence, by any other person. It is clear to us that the Parliament \nin Section 15 of the Copyright Act was dealing with the aspect of \ncopyright in a registered/registrable design, as understood in the \nCopyright Act and not the Designs Act. Else, there was no need \nto deal with this aspect in the Copyright Act. The same would \nhave been dealt with under the Designs Act. Therefore, the law \ntolerates only a limited industrial, or shall we say commercial, \nexploitation \nof \nthe \noriginal \nartistic \nwork \nby \nthe \napplication/reproduction of the said work in any other form or \nreproduction of copies thereof in exercise of the rights under \nSection 14(c)(1) and 14(c)(iii) of the Copyright Act. Beyond the \nspecified limit, if the design derived from the original artistic \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified",
          "pdf_source": "16. Pandrol vs Patil Rail.pdf",
          "nodes": []
        },
        {
          "title": "Page 14",
          "node_id": "0016",
          "start_index": 14,
          "end_index": 14,
          "summary": "Here is a summary of page 14 from PDF \"Pandrol vs Patil Rail.pdf\" (source: Court judgment CS(COMM) 602/2022):\n\nKey legal facts:\n\n* If an industrial process applies a design more than 50 times on an article, the copyright in the design ceases unless registered under the Designs Act.\n* The operation of Section 15(2) of the Copyright Act does not exclude the original artistic work or the design from copyright protection.\n* Original paintings/artistic works used to industrially produce designed articles are entitled to full copyright protection.\n\nImportant decisions:\n\n* The court considers that even if an artistic work is used to design industrially produced objects, it will still enjoy full copyright protection.\n* A registered design under the Designs Act will have a lesser period of protection compared to a registered design.\n\nImportant names and dates:\n\n* Mr. Rajshekhar Rao (Senior Advocate) \n* Judgment reserved on: 21st February, 2023\n* Judgment delivered on: 13th March, 2023",
          "content": "2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 14 of 27 \n \nwork is exploited (i.e. if the design is applied more than 50 times \nby an industrial process on an article) the copyright in the design \nceases unless it is registered under the Designs Act. \nXXX  \n \n \nXXX  \n \n \nXXX \n35. \nHowever, there can be no quarrel with the plea of Shri \nRamachandran that the operation of Section 15(2) of the \nCopyright Act does not exclude from the ambit of Copyright \nprotection either the original “artistic work” upon which the \ndesign is based or the design which by itself is an artistic work. \nIt cannot be disputed that the original paintings/artistic works \nwhich may be used to industrially produce the designed article \nwould continue to fall within the meaning of the artistic work \ndefined under Section 2(c) of the Copyright Act, 1957 and \nwould be entitled to the full period of copyright protection. This \nis also evident from the definition of the design under Section \n2(d) of the Designs Act. This, in our view, in fact is a factor \nwhich would go against the appellants in construing the nature \nof protection to be given to the original artistic work such as a \npainting, as contrasted with the applied artistic work that is the \ndesign, which in the present case does not mean the \nintermediary \nmedium \nsuch \nas \na \nmould, \nengraving \ndevised/produced only to enable industrial application of the \npainting to produce the furnishing products of the appellant. \nThus, while the original painting would indeed be entitled to \nthe \ncopyright \nprotection, \nthe \ncommercial/industrial \nmanifestation of such paintings such as the design derived from \nand founded upon the original painting for the purpose of \nindustrial production of furnishings would only be covered by \nthe limitations placed in Section 15 of the Copyright Act and \nwould get protection if registered as a design under the Designs \nAct but would enjoy lesser period of protection in case of a \nregistered design. \n36. \nThis clearly shows that the legislature intended that \neven if the artistic work such as a painting has been used as the \nbasis for designing an industrially produced object for \ncommerce, such as the furnishing in the present case, \nnevertheless the original painting would indeed enjoy full \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified",
          "pdf_source": "16. Pandrol vs Patil Rail.pdf",
          "nodes": []
        },
        {
          "title": "Page 15",
          "node_id": "0017",
          "start_index": 15,
          "end_index": 15,
          "summary": "**Summary of page 15 from PDF: \"Pandrol vs Patil Rail.pdf\"**\n\nOn Page 15 of PDF 16. Pandrol vs Patil Rail.pdf, in the case CS(COMM) 602/2022, a judgment reserved on February 21, 2023, was delivered on March 13, 2023.\n\nThe court summarized the law related to artistic works and copyright protection as follows:\n\n* An original artistic work can be protected under both the Copyright Act (as an artistic work) and the Designs Act (qua the product created from the artistic work when industrially applied).\n* The definition of \"artistic work\" is wide-ranging, including abstract works with no apparent visual appeal.\n* The rights to which the holder of an original artistic work is entitled include reproducing the work in any material form.\n\nThe judgment was digitally signed by Amit Bansal on March 13, 2023. \n\n**PDF source:** 16. Pandrol vs Patil Rail.pdf",
          "content": "2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 15 of 27 \n \ncopyright protection, while the result of the industrial \napplication of such painting, namely, the design used in the \nindustrial production of the ultimate product shall enjoy lesser \nperiod of protection as stipulated under the Designs Act \nprovided it is registered as a design under the Designs \nAct. Thus, we are of the view that an original artistic work \ninitially acquires protection under the Copyright Act as an \n„artistic work‟ or else the protection under the Designs Act qua \nthe product created from the artistic work when industrially \napplied.” \n16. \nThe law was summarised by the Division Bench in paragraph 46 of \nthe judgment, which is set out below: \n“46. \nWe thus summarize our findings as follows:— \na. The definition of „artistic work‟ has a very wide \nconnotation as it is not circumscribed by any limitation of \nthe work possessing any artistic quality. Even an abstract \nwork, such as a few lines or curves arbitrarily drawn \nwould qualify as an artistic work. It may be two \ndimensional or three dimensional. The artistic work may \nor may not have visual appeal. \nb. The rights to which a holder of an original artistic work \nis entitled are enumerated in Section 14(c) of the Copyright \nact. \nc. It is the exclusive right of the holder of a Copyright in an \noriginal artistic work to reproduce the work in any material \nform. For example, a drawing of an imaginary futuristic \nautomobile, which is an original artistic work, may be \nreproduced in the three-dimensional material form using an \nelement, such as a metal sheet. \nd. The design protection in case of registered works under \nthe Designs Act cannot be extended to include the copyright \nprotection to the works which were industrially produced. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified",
          "pdf_source": "16. Pandrol vs Patil Rail.pdf",
          "nodes": []
        },
        {
          "title": "Page 16",
          "node_id": "0018",
          "start_index": 16,
          "end_index": 16,
          "summary": "The provided text is not a summary of page 16 from the specified PDF \"16. Pandrol vs Patil Rail.pdf\" but rather an excerpt from a court judgment (CS(COMM) 602/2022). \n\nFrom the context, here are the relevant details:\n\n* Case: CS(COMM) 602/2022\n* Parties: PANDROL LIMITED & ANR (plaintiffs)\n* Court: High Court of Delhi at New Delhi\n* Dates: Judgment reserved on February 21, 2023; Judgement delivered on March 13, 2023\n* Relevant text is focused on the interpretation of the Copyright Act and the Designs Act, particularly in relation to the protection granted to artistic works versus design activities.\n\nSince the provided text does not specifically mention page 16 from the PDF \"Pandrol vs Patil Rail.pdf\", I will not attempt a summary.",
          "content": "2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 16 of 27 \n \ne. A perusal of the Copyright Act and the Designs Act and \nindeed the Preamble and the Statement of Objects and \nReasons of the Designs Act makes it clear that the \nlegislative intent was to grant a higher protection to pure \noriginal artistic works such as paintings, sculptures etc \nand lesser protection to design activity which is \ncommercial in nature. The legislative intent is, thus, clear \nthat the protection accorded to a work which is \ncommercial in nature is lesser than and not to be equated \nwith the protection granted to a work of pure art. \nf. The original paintings/artistic works which may be used \nto industrially produce the designed article would continue \nto fall within the meaning of the artistic work defined \nunder Section 2(c) of the Copyright Act, 1957 and would \nbe entitled to the full period of copyright protection as \nevident from the definition of the design under Section \n2(d) of the Designs Act. However, the intention of \nproducing the artistic work is not relevant. \ng. This is precisely why the legislature not only limited the \nprotection by mandating that the copyright shall cease \nunder the Copyright Act in a registered design but in \naddition, also deprived copyright protection to designs \ncapable of being registered under the Designs Act, but not \nso registered, as soon as the concerned design had been \napplied more than 50 times by industrial process by the \nowner of the copyright or his licensee. \nh. In the original work of art, copyright would exist and \nthe author/holder would continue enjoying the longer \nprotection granted under the Copyright Act in respect of \nthe original artistic work per se. \ni. If the design is registered under the Designs Act, the \nDesign would lose its copyright protection under the \nCopyright Act. If it is a design registrable under the Designs \nAct but has not so been registered, the Design would \ncontinue to enjoy copyright protection under the Act so long \nas the threshold limit of its application on an article by an \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified",
          "pdf_source": "16. Pandrol vs Patil Rail.pdf",
          "nodes": []
        },
        {
          "title": "Page 17",
          "node_id": "0019",
          "start_index": 17,
          "end_index": 17,
          "summary": "Here is a summary of page 17 from the PDF:\n\nThe text discusses the interpretation of copyright law in relation to industrial processes. The key points are:\n\n* Copyright protection expires if an industrial process for creating an article is repeated more than 50 times.\n* However, the original artistic work used to create that design will still be entitled to full copyright protection under the Copyright Act, even if it is industrially produced.\n\nThe text cites a judgment from the Division Bench in Microfibres (supra) and explains that:\n\n* An original 'artistic work' can lead to a 'design', but they are distinct concepts.\n* A design may be derived from an original artistic work, which will continue to have copyright protection under Section 2(c) of the Copyright Act.\n\nSource: Pandrol vs Patil Rail.pdf (2023/DHC/001792)",
          "content": "2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 17 of 27 \n \nindustrial process for more than 50 times is reached. But \nonce that limit is crossed, it would lose its copyright \nprotection under the Copyright Act. This interpretation \nwould harmonize the Copyright and the Designs Act in \naccordance with the legislative intent.” \n17. \nWhat emerges from a reading of the judgment of the Division Bench \nis that an original ‘artistic work’ is different from a ‘design’. The original \ndrawings/ ‘artistic work’ can lead to a ‘design’. In other words, a ‘design’ \nmay be derived from the original drawings. Therefore, even if the original \ndrawings/ ‘artistic work’ is used to industrially produce an article, the \noriginal drawing/ ‘artistic work’ would continue to fall within the meaning \nof the artistic work defined under Section 2(c) of the Copyright Act, 1957 \nand would be entitled to the full period of copyright protection. \n18. \nIn Mody Pumps Inc and Anr. v. Sovereign Pumping Solutions \nProvate Limited and Anr., MANU/MH/1496/2022 a Single Bench of the \nBombay High Court was dealing with a similar issue of copyright \ninfringement in relation to engineering drawings of water pumps and the \nissues that arose were whether the aforesaid engineering drawings constitute \n‘artistic work’ and whether the plaintiffs have copyright in the same. \nRelying upon the judgment of the Division Bench in Microfibres (supra), \nthe Bombay High Court held that drawings are ‘artistic works’ within the \nmeaning of Section 13(1)(a) of the Copyrights Act and are therefore, \nexcluded from the purview of Section 2(d) of the Designs Act. It was \nobserved by the Bombay High Court that in terms of Section 2(d) of the \nDesigns Act, 2000, design relates only to shape, configuration, pattern, \nornament or composition of lines or colours applied to an article, which, in \nthe finished article, would have a visual appeal. Further, ‘design’ under \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified",
          "pdf_source": "16. Pandrol vs Patil Rail.pdf",
          "nodes": []
        },
        {
          "title": "Page 18",
          "node_id": "0020",
          "start_index": 18,
          "end_index": 18,
          "summary": "Here is a summary of page 18 from the PDF \"16. Pandrol vs Patil Rail.pdf\":\n\n**Case:** CS(COMM) 602/2022, Pandrol Limited & Anr. vs Patil Rail\n\n**Context:** Copyright infringement case filed by Pandrol against Patil Rail\n\n**Court Proceedings:**\n\n* The court observes that Section 2(d) of the Designs Act excludes \"anything which is, in substance, a mere mechanical device\" from design protection.\n* The plaintiffs claim copyright on their original drawings, which are considered \"artistic works\" under Section 2(c) of the Copyrights Act.\n\n**Judgment:**\n\n* The court holds that even if the original drawings may be used to industrially produce an article, they continue to fall within the meaning of 'artistic work' and enjoy full copyright protection.\n* The plaintiffs' drawings do not reflect a product with visual appeal in its finished state, making them incapable of being registered as a 'design' under the Designs Act.\n\n**Judgments Cited:**\n\n* Holland Company LP and Anr. v. S. P. Indusries (2017 SCC OnLine Del 9370)\n* Jagdamba Impex v. Tristar Products Pvt. Ltd. (2014 SCC Online Del 2872)\n* Microfibres case (not specified)\n\n**Date:** Judgment reserved on February 21, 2023, and delivered on March 13, 2023",
          "content": "2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 18 of 27 \n \nSection 2(d) does not include any mode or principle of construction or \nanything which is, in substance, a mere mechanical device. Section 2(d) also \nexcludes any ‘artistic work’ as defined in Section 2(c) of the Copyrights Act.  \n19. \nIn the present case, the plaintiffs claim copyright in respect of their \noriginal drawings. In terms of the judgment in Microfibres (supra), even if \nthe original drawings may be used to industrially produce an article, they \nwould continue to fall within the meaning of ‘artistic work’ under Section \n2(c) of the Copyright Act and also continue to enjoy full copyright \nprotection.  \n20. \nIt is also to be noted that a ‘design’ in respect of a finished product is \nyet to emerge in the present case. Therefore, no ‘design’ capable of \nregistration under the Designs Act has come out on the basis of the \nplaintiffs’ drawings. Additionally, the drawings of the plaintiffs relate to \nfastening systems, which are mere mechanical devices that have functional \nutility. By no stretch of imagination can it be said that the aforesaid \ndrawings reflect a product, which, in its finished state, would have any \nvisual appeal. Consequently, the aforesaid drawings are not be capable of \nbeing registered as a ‘design’ under the Designs Act. \n21. \nCounsel for the defendants has placed reliance on the judgments in \nHolland Company LP and Anr. v. S. P. Indusries, 2017 SCC OnLine Del \n9370 and Jagdamba Impex v. Tristar Products Pvt. Ltd., 2014 SCC Online \nDel 2872. However, the said judgments do not take into consideration the \nearlier decision of the Division Bench in Microfibres (supra), which I have \nrelied on to reach the conclusion above. Therefore, need is not felt to delve \ninto the aforesaid judgments. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified",
          "pdf_source": "16. Pandrol vs Patil Rail.pdf",
          "nodes": []
        },
        {
          "title": "Page 19",
          "node_id": "0021",
          "start_index": 19,
          "end_index": 19,
          "summary": "**Summary of Page 19 from PDF: 16. Pandrol vs Patil Rail.pdf**\n\n**Case Number:** CS(COMM) 602/2022\n**Court:** High Court of Delhi at New Delhi\n**Date of Judgment:** March 13, 2023\n\nOn Page 19, the court addresses the issue of copyright for drawings related to a fastening system used in ballastless track on metro railways. The Ministry of Railways provided performance criteria for this system in 2010 and allowed metro rail companies to choose their own fastening system as long as it met these criteria. In 2011, the Ministry granted approval to Pandrol Limited's double resilient baseplate assembly fastening system. The court notes that this approval included certain conditions and attachments, including Annexure-1 (Performance Certificate of Dubai Metro) and Annexure-2 (drawings and specification of the fastening system). **Source:** 16. Pandrol vs Patil Rail.pdf",
          "content": "2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 19 of 27 \n \n22. \nNow, I shall address the issue of whether any copyright for the \naforesaid drawings vests with the plaintiffs or if it has been assigned in \nfavour of the Ministry of Railways. \n23. \nThe Ministry of Railways laid down the performance criteria for \n„fastening system for ballastlass track on metro railways‟ vide its \ncommunication dated 21st May, 2010. The said communication also \nprovided that metro/MRTS were free to choose their fastening system for \nballastlass track complying with the performance criteria. In terms of the \naforesaid performance criteria laid down by the Ministry, the plaintiffs \nobtained approval from the Ministry of Railways. \n24. \nAt this stage, a reference may be made to the approval given by the \nMinistry of Railways to the plaintiffs on 7th October, 2011. The subject \nmatter of the said approval reads as follows: \n“Double Resilient Base Plate Assembly Fastening system-\ncorrigendum reg.” \n25. \nThe other relevant terms of the said approval are set out below: \n“…..Accordingly, to operationalize the approval given to the \ndouble resilient baseplate assembly system, the following is \nadvised:-  \n \n1. A copy of the Performance Certificate of the Dubai Metro \ndated 28.10.2010, based on which RDSO has considered the \nperformance of the system, is attached herewith as \nAnnexure-1. The Metro Railways/MRTS System should \nverify the authenticity of the system proposed to be used by \nthem vis-à-vis this Performance Certificate. \n \n2. The drawings and the specification of the fastening \nsystem as used in the test assembly, which has been \nexamined and cleared, are enclosed as Annexure-2. The \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified",
          "pdf_source": "16. Pandrol vs Patil Rail.pdf",
          "nodes": []
        },
        {
          "title": "Page 20",
          "node_id": "0022",
          "start_index": 20,
          "end_index": 20,
          "summary": "Here is a summary of page 20 from the provided PDF (Source: 16. Pandrol vs Patil Rail.pdf):\n\n**Case Details:** CS(COMM) 602/2022, Judgment delivered on: 13th March, 2023\n\nThe court instructs Metro Railways/MRTS Systems to ensure that any fastening system they use matches the drawing and specifications of a test assembly examined by RDSO (Research Designs and Standards Organisation). \n\nKey points:\n\n* The systems should conduct fresh tests from an independent laboratory on samples selected by them to verify if the chosen fastening system meets physical parameters requirements.\n* Clearance is only granted for the \"double resilient base plate assembly fastening system\" of M/S Pandrol Limited, UK.\n* Metro Railways/MRTS Systems must verify the credentials of prospective suppliers of this system.\n\n**PDF Source:** 16. Pandrol vs Patil Rail.pdf",
          "content": "2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 20 of 27 \n \nMetro Railways/MRTS System should make sure that the \nsystem, if used by them, matches completely with the \ndrawing and specifications of the test assembly examined \nby RDSO. The metro railway/MRTS system are at liberty \nto carry out any tests for this as considered necessary. \n \n3. Before this system is installed in the track, Metro \nRailways/MRTS System should satisfy themselves about \ntheir chosen fastening system meeting the physical \nparameters requirements of the Performance Criteria, by \nconducting fresh tests from an independent laboratory on \nsamples selected by Metro Railway/MRTS system. \n \n4. The clearance is only for the “double resilient base \nplate assembly fastening system” of M/S Pandrol Limited, \nUK., Metro Railways/MRTS Systems should verify \nthemselves about the credentials of the prospective \nsuppliers of this system.” \n \n26. \nIn view of the approval granted to the plaintiffs, the products of the \nplaintiffs became eligible for being tendered for various metro projects. \nThere is nothing in the aforesaid approval letter to suggest that the copyright \nin respect of the plaintiffs’ drawings was to vest with the Ministry of \nRailways or that the plaintiffs have waived their copyright in respect of the \naforesaid drawings. Defendants have failed to place any documents or \nmaterial in support of their contention that the copyright in respect of the \ndrawings of the plaintiffs has been waived by the plaintiffs. Even if it is \nassumed that the copyright has been transferred to the Ministry of Railways, \nit does not give any right in favour of the defendants to copy the said \ndrawings. Hence, there is no merit in the submission of the defendants that \nonce the drawings of the plaintiffs got approval from the Ministry of \nRailways and were annexed to the approval letter, they become a part of the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified",
          "pdf_source": "16. Pandrol vs Patil Rail.pdf",
          "nodes": []
        },
        {
          "title": "Page 21",
          "node_id": "0023",
          "start_index": 21,
          "end_index": 21,
          "summary": "**Summary of Page 21 from 16. Pandrol vs Patil Rail.pdf**\n\nIn **CS(COMM) 602/2022**, the High Court of Delhi at New Delhi heard a case between Pandrol Limited & Anr. versus Patil Rail, with judgment reserved on February 21, 2023.\n\n**Key Points:**\n\n* Reliance was placed on behalf of defendants to argue that tenderers had to match drawings and specifications of the test assembly examined by RDSO.\n* Courts disagreed, stating that such clauses were only related to approval granted to plaintiffs, not authorizing other suppliers to use copyrighted works.\n* Tender document floated by MPMRCL required bidders to submit according to drawings approved by RDSO or installed/commissioned in any MRTS.\n* Reference is made to extracts of the tender, including requirements for Fastening System for Ballastless Track.\n\n**Source:** 16. Pandrol vs Patil Rail.pdf, **PDF Source ID:** 2023/DHC/001792",
          "content": "2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 21 of 27 \n \ncatalogue of the Ministry and any third party can make a bid based on the \naforesaid drawings. \n27. \nReliance placed on behalf of defendants on Clauses 2 and 4 of the \napproval letter dated 7th October, 2011 to submit that the tenderers have to \ncompletely match the drawings and specifications of the test assembly \nexamined by RDSO, is completely misplaced. The aforesaid clauses are \nonly in relation to approval granted to the plaintiffs. The reference to \n„prospective suppliers‟ in Clause 4 would only mean authorised suppliers of \nthe said products. This would not, in any manner, give a license to other \nsuppliers to use the copyrighted works of the plaintiffs. \n28. \nSenior counsel on behalf of the defendants has submitted that in terms \nof the tender document floated by the MPMRCL, for a party to bid for the \naforesaid tender, it had to bid in terms of the drawings of the plaintiffs.  \n29. \nAt this stage, reference may be made to the relevant part of the tender. \nThe scope of the tender is set out below: \n“„Design, Supply, Installation, Testing and Commissioning of \nBallastless Track of Standard Gauge, including Supply of \nFastening System for Purple Line from AIIMS to Karond and \nRed Line from Bhadhbhada Square to Ratnagiri Tiraha, \nincluding Elevated and Underground sections along with \nBallasted/Ballastless Track in Depot cum Workshop at Subhash \nNagar‟ for Bhopal Metro Rail Project.” \n30. \nThe other relevant extracts of the tender are as under: \n“4.2.1 Requirements for Fastening System for Ballastless Track \n… \niii. Fastening system for Bhopal MRTS Project: The Ballastless \ntrack fastening system already approved (vide letter No. \nCT/EF/Global EOI-2017/Ballastless Track dated 25.10.2019) \nby RDSO/MOR or installed & commissioned in any MRTS \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified",
          "pdf_source": "16. Pandrol vs Patil Rail.pdf",
          "nodes": []
        },
        {
          "title": "Page 22",
          "node_id": "0024",
          "start_index": 22,
          "end_index": 22,
          "summary": "Based on page 22 from the PDF \"16. Pandrol vs Patil Rail.pdf\", here is a summary of the relevant information:\n\n**Requirements for Ballastless Track Fastening System**\n\nThe Tenderer must submit a system that meets the following criteria:\n\n* Adequately insulates against stray current (750V DC) as per EN 50122-2 and the Tender requirements\n* Has two layers of insulation between rail & fastening, and between fastening & track plinth/slab\n* Ensures a walkway gap of more than 610 mm between rails for front evacuation\n* Submits detailed drawings with the tender\n\n**Approval Documents**\n\nThe Tenderer must submit:\n\n* Approval letter from RDSO/MOR for the proposed ballastless track fastening system\n* Annexures and compliance documents related to RDSO/MOR's observations\n* Proof of CRS sanction letter for opening the line with the system\n\n**Test Reports**\n\nThe Tenderer must submit test reports from a reputable independent institute/laboratory proving the fastening system meets the performance criteria.\n\nSource: PDF \"16. Pandrol vs Patil Rail.pdf\"",
          "content": "2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 22 of 27 \n \nproject in India and under observation & approval of \nRDSO/MOR as per clause 1.2 of Annexure-C2 of performance \ncriteria of fastening system for ballastless track (attached as \nAnnexure 12 of ITT), can only be proposed under this contract. \nThe proposed ballastless track fastening system shall adequately \nmeet the insulation requirement for stray current of 750V DC \nBottom 3rd Rail Traction System as per EN 50122-2 and as per \nrequirement of Tender. The proposed Ballastless Track \nFastening System should also have two layer of insulations Le \nbetween rail & fastening and between fastening & track \nplinth/slab. The evacuation of Passenger is proposed as front \nevacuation in this project as such the walkway gap should be \nensured more than 610 mm between rails and detailed drawing \nshall be submitted along with the tender. \niv. Approval Letter of RDSO/MOR: Tenderer to submit \napproval letter along with approved design/drawing of proposed \nballastless track fastening by RDSO/MOR. Tenderer to also \nsubmit all annexure and compliance of all observations of \nRDSO/MOR along with proof. For ballastless track fastening \nunder approval as mentioned above, tenderer to submit all \ntechnical details as per performance criteria and also letter of \nRDSO/MOR for use of said system and CRS sanction letter for \nopening of the line with that system. \n XXX  \n \n \nXXX  \n \n \nXXX \nvi. Tests reports of the fastening system: In terms of Paragraph \n4.7 and specification given in table 1 of Performance Criteria \nof ballastless track fastening system contained in Annexure C2, \nenclosed at Annexure 12 of ITT Vol. I of this Tender document, \nthe Tenderer should submit test report for the fastening system \nfrom reputed independent institute/laboratory. The test reports \nshould be accompanied with the drawing of the fastening \nsystem and its components to clearly establish that the fastening \nsystem including its components which have been tested and \nreported upon is exactly same as the fastening system including \nits components that has been proposed by the Tenderer in this \nTender. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified",
          "pdf_source": "16. Pandrol vs Patil Rail.pdf",
          "nodes": []
        },
        {
          "title": "Page 23",
          "node_id": "0025",
          "start_index": 23,
          "end_index": 23,
          "summary": "**Summary of Page 23 from PDF: 16. Pandrol vs Patil Rail.pdf**\n\nThe High Court of Delhi is hearing a case between Pandrol Limited (plaintiffs) and MPMRCL (defendants over alleged copyright infringement.\n\nOn page 23, it's argued that the tender floated by the Maharasthra Metro Rail Corporation Ltd (MMRKL) was not specific to products manufactured from the plaintiffs' drawings. The tender was for \"design, supply, installation, testing and commissioning of ballastless track\", including fastening system. The plaintiffs' drawings were just one of several approved designs.\n\nThe defendants contended that since the MPMRCL required products to be in line with the plaintiffs' drawings, they could not have copied them. However, the court finds no merit in this argument as the drawings developed by the plaintiffs were for a specific project (DBRAS) and not the generic product tendered by the MPMRCL.\n\nThis summary focuses on legal proceedings, arguments, and decisions from the case **CS(COMM) 602/2022**, heard in the High Court of Delhi on 13th March, 2023.",
          "content": "2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 23 of 27 \n \n XXX  \n \n         XXX \n \n \n          XXX \nix. MoU with Supplier: Submit copy of the MoU entered into \nbetween the Tenderer and the Supplier for supply of complete \nballastless track fastening system as per tender specification. \nSingle Point Warrantee for the complete ballastless track \nfastening system and its individual components supplied by \nSupplier shall be with Tenderer for the defect liability period.” \n31. \nBased on the above, it was contended on behalf of the defendants that \nonce it is the requirement of the MPMRCL itself that the products to be \ntendered have to be in line with the drawings of the plaintiffs, the plaintiffs \ncannot contend that the defendants have copied the same. The defendants \nwere obligated to bid for the tender on the basis of the drawings of the \nplaintiffs. \n32. \nSenior counsel on behalf of the plaintiffs correctly points out that the \naforesaid tender of the MPMRCL was not in respect of products to be \nmanufactured specifically in terms of plaintiffs’ drawings. The tender \nfloated by the MPMRCL was in respect of „design, supply, installation, \ntesting and commissioning of ballastless track of standard gauge, including \nsupply of fastening system‟. The same is reiterated in clause 4.2.1(iii) \nextracted above. The drawings developed and designed by the plaintiffs, as \ncan be seen from the approval letter, were for the DBRAS. Therefore, it \ncannot be said that the tender was confined to products based on the \nplaintiffs’ drawings. The tender was for a generic product and the drawings \nof the plaintiffs were only one of the approved drawings. Therefore, there is \nno merit in the submission of the defendants that the tender floated was in \nrespect of a specific product to be manufactured as per the drawings of the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified",
          "pdf_source": "16. Pandrol vs Patil Rail.pdf",
          "nodes": []
        },
        {
          "title": "Page 24",
          "node_id": "0026",
          "start_index": 24,
          "end_index": 24,
          "summary": "Here is a summary of page 24 from PDF: \"16. Pandrol vs Patil Rail.pdf\":\n\nThe court ruling (CS(COMM) 602/2022) considers plaintiffs PANDROL LIMITED & ANR's case against defendants PATIL RAIL & ORS. On page 24, the court states:\n\n* The defendants copied the plaintiffs' drawings to manufacture a product, as they did not have their own approved designs.\n* This would allow any entity with approval from the Ministry of Railways to supply products under the tender, despite not producing their own designs.\n\nThe court concludes that this would enable unjust enrichment and exploitation by allowing entities to commercially exploit others' work. (Paragraphs 33-36)\n\nDecision based on:\n\n* Court filing: CS(COMM) 602/2022\n* Date: Judgment delivered on 13th March, 2023\n* PDF source: \"16. Pandrol vs Patil Rail.pdf\"",
          "content": "2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 24 of 27 \n \nplaintiffs and consequently, the defendants did not have any option but to \ncopy the drawings of the plaintiffs in order to manufacture the said product.  \n33. \nIn fact, any party who had obtained approvals from the Ministry of \nRailways could have supplied the products under the aforesaid tender. It is \nthe defendants’ own case that approvals have been received by six \ncompanies/entities for the aforesaid products and each one of them was free \nto bid for the tender. If the defendants failed to prepare their own drawings \nand get the same approved from the Ministry of Railways, the defendants \ncannot be permitted to copy the drawings of the plaintiffs. \n34. \nA perusal of paragraphs (ix) of clause 4.2.1 of the tender document \nextracted above would show that the tenderer could be a person other than \nthe six companies/entities with the RDSO/Ministry of Railways approvals. \nTherefore, it was open for the defendants to approach one of the \ncompanies/entities whose drawings had been approved or their supplier(s) \nand obtain a licence/enter into an agreement in respect thereof, to bid for the \ntender. \n35. \nClearly, the plaintiffs would have spent considerable time, effort and \nfinancial resources and undertaken extensive research and development to \ncreate the aforesaid drawings. If the contention of the defendants is \naccepted, then it would be open for any person to copy the work of another \nand commercially exploit the efforts of the original creator. This would \namount to permitting the defendants to unjustly enrich themselves at the \nexpense of the plaintiffs.  \n36. \nI am not persuaded by the submission of the defendants that if \nsuppliers that do not have RDSO/Ministry of Railways approvals are barred \nfrom using the drawings of the plaintiffs, a monopoly would be created in \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified",
          "pdf_source": "16. Pandrol vs Patil Rail.pdf",
          "nodes": []
        },
        {
          "title": "Page 25",
          "node_id": "0027",
          "start_index": 25,
          "end_index": 25,
          "summary": "Here is a summary of page 25 of the provided PDF document (Pandrol vs Patil Rail.pdf):\n\n**Context:** Delhi High Court case CS(COMM) 602/2022, 2023/DHC/001792.\n\n**Summary:**\n\nThe court rejects several arguments made by the defendants:\n\n* The plaintiffs cannot be said to have a monopoly as five other companies/entities have received approvals from RDSO/Ministry of Railways.\n* The defendants' argument that the Ministry of Railways must be impleaded in the suit is unsustainable.\n* Registration under the Copyright Act is not a prerequisite for seeking protection against infringement.\n\nThe court further notes that the defendants admit copying the plaintiffs' drawings, but claim it was necessary due to Ministry of Railways approval.",
          "content": "2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 25 of 27 \n \nfavour of the plaintiffs. There cannot be any question of a monopoly by the \nplaintiffs as besides the plaintiffs, five other companies/entities have \nreceived approvals from the RDSO/Ministry of Railways.  \n37. \nIt has vehemently been contended on behalf of the defendants that \nplaintiffs have not impleaded the Ministry Railways in the present suit and \nthat their presence is necessary to determine the question of whether any \ncopyright vests with the plaintiffs or if it has been assigned in favour of the \nMinistry of Railways. In my view, the aforesaid submission is completely \nunsustainable. It is the case of the defendants that plaintiffs have \nassigned/waived the copyright in favour of the Ministry of Railways or that \nthe copyright vests with the Ministry of Railways. Therefore, the onus is on \nthe defendants to prove that the copyright has been assigned/waived by the \nplaintiff in favour of the Ministry of Railways or that the same vests with the \nMinistry of Railways in any case. The stand of the Ministry of Railways, in \nthe present case, would be wholly irrelevant.  \n38. \nFurthermore, there is no merit in the submission of the defendants that \nno copyright subsists in the drawings of the plaintiffs since no registration \nhas been obtained in respect thereof. Registration is not a prerequisite to \nseeking protection from infringement under the Copyright Act.  \n39. \nSenior counsel appearing on behalf of the defendants has not disputed \nthe fact that the drawings of the plaintiffs have been copied in toto by the \ndefendants. However, he justifies the same by submitting that since the \naforesaid drawings of the plaintiffs were approved by the Ministry of \nRailways and tenderers were required to bid in terms of the said approval, \nthe defendants did not have any choice but to copy the drawings of the \nplaintiffs. Interestingly, on one hand, the defendants admit that they have \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified",
          "pdf_source": "16. Pandrol vs Patil Rail.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0031",
      "start_index": 26,
      "end_index": 27,
      "summary": "**Case Summary**\n\n**Court:** High Court of Delhi at New Delhi\n\n**Case Number:** CS(COMM) 602/2022\n\n**Parties:**\n\n* **Pandrol Limited & Anr. (Plaintiffs)**: sued **Patil Rail (Defendants)\n* Through senior advocate Mr. Rajshekhar Rao and others\n\n**Legal Proceedings:**\n\nOn February 21, 2023, the court reserved its judgment in this case. On March 13, 2023, Justice Amit Bansal delivered his verdict. The plaintiffs' application under Order XXXIX of the CPC was allowed.\n\n**Facts & Arguments:**\n\nThe defendants had copied the drawings of the plaintiffs without permission. The court noted that the defendants attempted to hide their actions by listing different personnel as creators of the original work. However, the unique numbering and presence of the \"PANDROL\" mark on some drawings revealed their dishonest intent.\n\n**Decision:**\n\n* The court allowed the plaintiffs' application for an interim injunction.\n* Confirmed its order dated September 2, 2022, till the final adjudication of the suit.\n* Imposed costs of Rs.1,00,000/- (one lakh) on the defendants to be paid to the plaintiffs.\n\n**Dates & Amounts:**\n\n* February 21, 2023: Judgment reserved\n* March 13, 2023: Judgment delivered\n* April 26, 2023: Listed before the Joint Registrar for further proceedings.\n* Rs.1,00,000/- (one lakh) costs imposed on the defendants.\n\n**Source:** Pandrol vs Patil Rail (2023/DHC/001792), High Court of Delhi at New Delhi.",
      "pdf_source": "16. Pandrol vs Patil Rail.pdf",
      "nodes": [
        {
          "title": "Page 26",
          "node_id": "0029",
          "start_index": 26,
          "end_index": 26,
          "summary": "**Legal Fact Summary**\n\nSource: 16. Pandrol vs Patil Rail.pdf (2023/DHC/001792)\n\nThe court (CS(COMM) 602/2022) deliberated on a case between Plaintiffs PANDROL LIMITED & ANR. (February 21, 2023 to March 13, 2023).\n\n**Key Findings:**\n\n1. The defendants copied drawings from the plaintiffs' original work.\n2. The defendants attributed the creation of these drawings to their own personnel.\n3. They also copied unique numbering and the mark 'PANDROL' on several drawings (attributed to an \"inadvertent error\").\n\n**Court Observations:**\n\n* If defendants believed they had no copyright issues, they wouldn't have credited their own people as creators.\n* The copies went beyond drawings, including the plaintiffs' trademark.\n\nThis summary is based on page 26 of the provided PDF.",
          "content": "2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 26 of 27 \n \ncopied the drawings of the plaintiffs,  yet in the drawings of the defendants it \nhas been noted that the said drawings have been drawn, checked, reviewed \nand approved by different personnel of the defendant no.1. Clearly, the \nattempt of the defendants in doing so was to show the drawing as their own \noriginal work. \n40. \nIf the defendants actually believed that there was no copyright in the \ndrawings of the plaintiffs and they could freely copy the same, there was no \nneed to put the name of their own personnel as the creators of the aforesaid \ndrawings. The extent of copying by the defendants is not confined just to the \ndrawings of the plaintiffs but goes on to include the unique numbering given \nto the said drawings by the plaintiffs. Reference in this regard may be made \nto pages 13 to 38 of the documents of the plaintiff.  Further, while copying \nthe aforesaid drawings, the defendants have also copied the mark \n‘PANDROL’ of the plaintiffs in some of the drawings, though the \ndefendants submit that it was on account of an inadvertent error. \n41. \nA reference to the Report of the Local Commissioners appointed by \nthe Court reveals that when the Local Commissioners visited the premises of \nthe defendants, the systems/laptops of the personnel of the defendants \ncontained the original drawings of the plaintiffs bearing the trademark of the \nplaintiffs, ‘PANDROL’. The Report also states that when the Local \nCommissioners searched for the term ‘PANDROL’ on the two laptops of the \ndefendants, various documents showed up, which included various drawings \nof the plaintiffs and other ‘PANDROL’ related data. When asked about the \nexistence of such data on their systems, no explanation was forthcoming \nfrom the defendants as to how did they obtain such data of the plaintiffs. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified",
          "pdf_source": "16. Pandrol vs Patil Rail.pdf",
          "nodes": []
        },
        {
          "title": "Page 27",
          "node_id": "0030",
          "start_index": 27,
          "end_index": 27,
          "summary": "**Summary of Page 27 from PDF: 16. Pandrol vs Patil Rail.pdf**\n\n**Case Details:** CS(COMM) 602/2022 (2023/DHC/001792)\n\n**Judgment delivered on March 13, 2023, by Justice Amit Bansal**\n\n**Key Points:**\n\n* Defendants (Patil Rail) have been held guilty of dishonestly copying plaintiffs' (Pandrol Ltd.) drawings for which the copyright vests solely with Pandrol.\n* The defendants sought to justify this act in their application, but the court has confirmed its order dated September 2, 2022.\n* Defendants are burdened with costs of Rs.1,00,000/- (One lakh) to be paid to plaintiffs.\n* Any observations made will not affect the final outcome of the suit.\n* Next date of hearing: April 26, 2023, before Joint Registrar.\n\n**Legal Facts:** Order XXXIX Rules 1 and 2 of the Civil Procedure Code (CPC).\n\n**Amounts mentioned:** Rs.1,00,000/- (One lakh) as costs to be paid by Patil Rail to Pandrol Ltd.",
          "content": "2023/DHC/001792 \n \nCS(COMM) 602/2022                                                                                                       Page 27 of 27 \n \n42. \nThe discussion above leaves no doubt in my mind that the defendants \nhave dishonestly copied the drawings in respect of which the copyright vests \nsolely with the plaintiffs. Further, this has been done in a brazen manner so \nas to derive a competitive advantage. In my considered view, this can \nneither be permitted nor condoned. \n43. \nAccordingly, the present application filed on behalf of the plaintiffs \nunder Order XXXIX Rules 1 and 2 of the CPC is allowed and the order \ndated 2nd September, 2022 is confirmed till the final adjudication of the suit. \n44. \nTaking into account the conduct of the defendants in having \ncompletely copied the drawings of the plaintiffs and seeking to justify the \nsame, the defendants are burdened with costs of Rs.1,00,000/- to be paid to \nthe plaintiffs. \n45. \nNeedless to state, any observations made herein are only for the \npurposes of adjudication of the present application and would have no \nbearing on the final outcome of the suit. \nCS(COMM) 602/2022 \n46. \nList before the Joint Registrar on 26th April, 2023 for further \nproceedings. \n \n \nAMIT BANSAL, J \nMARCH 13, 2023 \nsr/rt \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:13.03.2023 16:57:01\nSignature Not Verified",
          "pdf_source": "16. Pandrol vs Patil Rail.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-16T14:20:16.912669",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}