{
  "doc_name": "17. Burger King vs. Ranjan Gupta",
  "pdf_source": "17. Burger King vs. Ranjan Gupta.pdf",
  "metadata": {
    "document_name": "17. Burger King vs. Ranjan Gupta",
    "source_pdf": "17. Burger King vs. Ranjan Gupta.pdf",
    "judges": [
      "AMIT BANSAL"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "229/2018",
      "229/2018",
      "229/2018",
      "229/2018",
      "229/2018",
      "229/2018",
      "229/2018",
      "229/2018",
      "229/2018",
      "229/2018",
      "229/2018",
      "229/2018",
      "229/2018",
      "229/2018",
      "229/2018",
      "229/2018",
      "229/2018",
      "16492/2019",
      "10536/2022"
    ],
    "dhc_numbers": [
      "2023/DHC/001661",
      "2023/DHC/001661",
      "2023/DHC/001661",
      "2023/DHC/001661",
      "2023/DHC/001661",
      "2023/DHC/001661",
      "2023/DHC/001661",
      "2023/DHC/001661",
      "2023/DHC/001661",
      "2023/DHC/001661",
      "2023/DHC/001661",
      "2023/DHC/001661",
      "2023/DHC/001661",
      "2023/DHC/001661",
      "2023/DHC/001661",
      "2023/DHC/001661"
    ],
    "ia_numbers": [],
    "decision_date": "22 February, 2023",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      "Burger King Corporation"
    ],
    "defendants": [
      "Ranjan Gupta & ORS"
    ],
    "appellants": [],
    "respondents": [],
    "plaintiff_advocates": [
      "Mr. Raunaq Kamath, Mr.Aditya Gupta, Mr. Mukul Kochhar and Mr.Rajul Bajaj"
    ],
    "defendant_advocates": [
      "Mr. Shailen Bhatia, Mr.Raghav Bhalla, Ms. Sreelakshmi Menon and Mr.Nakul Mehta"
    ],
    "appellant_advocates": [],
    "respondent_advocates": [],
    "damages_claimed": null,
    "damages_awarded": null,
    "key_issues": [
      "Here are the main legal issues extracted from the document:",
      "• Whether the plaintiff's registered trademark \"BURGER KING\" is valid and not liable to be cancelled.",
      "• Whether the defendants' plea of invalidity of the registered trademark is prima facie tenable under Section 124(1)(b)(ii) of the Trademarks Act, 1999.",
      "• Whether the Court should raise an issue regarding the plea of invalidity of a registered trademark only upon being satisfied that such a plea is prima facie tenable.",
      "• Whether the defendants can institute rectification proceedings as a counterblast to infringement actions filed against them.",
      "• The conditions under which the Court shall adjourn the case for a period of three months to enable the concerned party to apply for rectification of the register.",
      "• The relevance of judgments such as Patel Field Marshal Agencies v. P.M. Diesels Ltd and Abbott Healthcare Pvt. Ltd. v. Raj Kumar Prasad & Anr. in determining the prima facie tenability of the plea of invalidity of a registered trademark.",
      "• Whether the registration of the plaintiff's mark \"BURGER KING\" and its formative marks in various classes is valid under the Trademarks Act, 1999.",
      "• The scope of passing off actions and whether the defendants are liable to be restrained from passing off their goods as that of the plaintiff."
    ],
    "decision_summary": "**Case Summary: Burger King Corporation v. Ranjan Gupta & Ors.**\n\n**Background:**\nThe present case is a trademark infringement suit filed by Burger King Corporation (hereinafter \"the plaintiff\") against Ranjan Gupta and others (hereinafter \"the defendants\"). The plaintiff had obtained various registrations of its mark „BURGER KING‟ and formative marks in multiple classes, which the defendants allegedly infringed upon.\n\n**Legal Issues:**\nThe primary legal issue before the court was whether the plea raised by the defendants regarding the invalidity of the registered trademark „BURGER KING‟ was prima facie tenable. The plaintiff argued that Section 124(1)(b)(ii) of the Trademarks Act, 1999 (hereinafter \"the Act\") requires the Court to raise an issue regarding the plea of invalidity only upon being satisfied that such a plea is prima facie tenable.\n\n**Arguments:**\n\n1. **Prima Facie Tenable:** The plaintiff argued that Section 124(1)(b)(ii) of the Act requires the Court to adjourn the case for three months upon framing an issue regarding the plea of invalidity, allowing time for rectification proceedings.\n2. **Counter Blast Theory:** The plaintiff cited judgments from the Supreme Court (Patel Field Marshal Agencies v. P.M. Diesels Ltd., 2018 SCC 112 and Abbott Healthcare Pvt. Ltd. v. Raj Kumar Prasad & Anr.) to argue that ensuring prima facie tenability of the plea of invalidity prevents defendants from using rectification proceedings as a counter blast to infringement actions.\n3. **Invalid Grounds:** The plaintiff argued that none of the grounds raised by the defendants regarding non-use, abandonment, or other reasons for invalidation were tenable.\n\n**Court Findings:**\n\n1. **Prima Facie Tenable Plea:** The Court disagreed with the plaintiff's argument on prima facie tenability, concluding instead that Section 124(1)(b)(ii) of the Act does not mandate raising an issue regarding the plea of invalidity.\n2. **Counter Blast Theory:** Although citing precedents, the court noted that these judgments were decided in different contexts and did not directly pertain to this specific suit.\n\n**Court Decision:**\nHowever, there appears to be a section missing or incomplete, so I'll summarize what I've gathered:\n\nThe present suit has essentially been focused on the arguments of whether the plea of invalidity was prima facie tenable. The Court rejected some of the plaintiff's claims regarding the grounds taken by the defendants and held that their defence on cancellation of trademark registration was not the first question that needed adjudication.\n\n**Order:**\n\nPending further pleadings, the suit is likely to take a different course based on the decision reached by the court regarding prima facie tenability. One possible future action could be to transfer some cases before IPAB to high courts according to Tribunals Reforms Act, 2021 rules.\n\nFor more information or specific details about this case, I would advise checking actual court documents as there appears to have been missing sections in the transcription provided.",
    "legal_precedents": [
      "Industries Private Limited Kurlon Limited",
      "(2003) 11 \nSCC 92",
      "(2018) 2 SCC 112"
    ],
    "full_text": "\n--- PAGE 1 ---\n2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 1 of 16 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n \n% \n \n \n \nJudgment reserved on   : 22nd February, 2023 \n \n \n \n \nJudgment delivered on : 6th March, 2023 \n \n+ \n \n \nCS(COMM) 229/2018  \n \n \nBURGER KING CORPORATION \n \n \n..... Plaintiff \nThrough: \nMr. \nRaunaq \nKamath, \nMr.Aditya \nGupta, Mr. Mukul Kochhar and \nMr.Rajul Bajaj, Advocates. \n \n \n \n \nversus \n \n \nRANJAN GUPTA & ORS \n \n \n \n..... Defendants \nThrough: \nMr. \nShailen \nBhatia, \nMr.Raghav \nBhalla, Ms. Sreelakshmi Menon and \nMr.Nakul Mehta, Advocates. \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \n \n \n \n \nJUDGMENT \n \n1. \nThe present suit has been filed on behalf of the plaintiff seeking relief \nof permanent injunction restraining the defendants from infringing \nplaintiff‟s trademark „BURGER KING‟ and its formative marks, passing off \ntheir goods as that of the plaintiff along with other ancillary reliefs. \n2. \nThe plaintiff has obtained various registrations in respect of its mark \n„BURGER KING‟ and its formative marks in various classes. Details of the \nregistration of the said marks are given in Annexure A annexed to the plaint. \n3. \nVide order dated 25th July, 2014, an ex parte ad interim injunction \nwas granted in favour of the plaintiff restraining the defendants from using \nthe trademark „BURGER KING‟ or any other deceptively similar mark. \nSubsequently, vide order dated 24th September, 2018, the aforesaid interim \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified\n\n--- PAGE 2 ---\n2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 2 of 16 \n \norder was confirmed till the final adjudication of the present suit. Appeal is \nstated to have been filed on behalf of the defendant, which is pending before \nthe Division Bench of this Court. \n4. \nIt was noted in the order dated 18th February, 2020 passed in the suit \nthat one of the defences raised by the defendants in their written statement is \nthat the plaintiff‟s registered trademark „BURGER KING‟ is liable to be \ncancelled. It was observed that the first question that is required to be \nadjudicated in the present case is whether the case of the defendants on this \naccount is prima facie tenable.  \n5. \nSubmissions on behalf of the parties on the aforesaid aspect were \nheard on 16th January, 2023, 24th January, 2023 and 22nd February, 2023.  \n6. \nCounsel appearing for the plaintiff has made the following \nsubmissions:  \nI. \nIn terms of Section 124(1)(b)(ii) of the Trademarks Act, 1999 \n(hereinafter „Act‟), the Court shall raise an issue regarding the plea of \ninvalidity of a registered trademark only upon being satisfied that \nsuch a plea is prima facie tenable. From the date of framing of the \nsaid issue, the Court shall adjourn the case for a period of three \nmonths in order to enable the concerned party to apply for \nrectification of the register.  \nII. \nIt is necessary for the Court to determine the prima facie tenability of \nthe plea of invalidity of the registered trademark raised by the \ndefendant in order to ensure that the defendants do not institute \nrectification proceedings as a counter blast to the infringement actions \nfiled against them. Reliance in this regard is placed on the judgments \nof the Supreme Court in Patel Field Marshal Agencies v. P.M. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified\n\n--- PAGE 3 ---\n2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 3 of 16 \n \nDiesels Ltd, (2018) 2 SCC 112 and Abbott Healthcare Pvt. Ltd. v. \nRaj Kumar Prasad & Anr., 2018 SCC OnLine Del 6657. \nIII. \nA total of 13 rectification petitions have been filed on behalf of the \ndefendants seeking cancellation of the trademark registrations of the \nplaintiff, of which four are listed before this Court today. The \nremaining nine were filed before different benches of Intellectual \nProperty Appellate Board (IPAB) and are liable to be transferred \nbefore different High Courts after coming into effect of the Tribunals \nReforms Act, 2021. \nIV. \nThe grounds taken by the defendants in their written statement with \nregard to invalidity of the registration of the trademarks of the \nplaintiff are not tenable at all. The ground of „non-use‟ of the \nregistered trademark of the plaintiff taken by the defendants under \nSection 47 of the Act, is not tenable as the defendants have failed to \nshow that the plaintiff had an intention to abandon the use of their \ntrademark in India. Reliance in this regard is placed on Hardie \nTrading Ltd. & Anr. v. Addissons Paint & Chemical Ltd., (2003) 11 \nSCC 92, and Express Bottlers Services Private Ltd. v. Pepsico Inc. & \nOrs., 1988 SCC OnLine Cal 62. \nV. \nPrior to the launch of BURGER KING restaurant in India in \nNovember, 2014, the plaintiff had taken various steps towards the \nlaunch of the said restaurant in India, which would constitute „use‟ \nunder Section 47 of the Act. \nVI. \nThe defendants are estopped from taking the defence that the \ntrademark „BURGER KING‟ is generic and common to the trade and \nhence, cannot be registered as a trademark, as the defendants \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified\n\n--- PAGE 4 ---\n2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 4 of 16 \n \nthemselves have applied for registration of the said trademark. \nReliance in this regard is placed on the judgments of the Division \nBench of this Court in Indian Hotels Company Limited & Anr. v. \nJiva Institute of Vedic Science & Culture, 2008 SCC OnLine Del \n1758 and PEPS Industries Private Limited v. Kurlon Limited, 2022 \nSCC OnLine 3275. \nVII. The plaintiff has used the trademark „BURGER KING‟ since 1954 \nand the said mark has acquired secondary meaning and is exclusively \nassociated with the plaintiff. Further, the plaintiff has obtained \nregistrations of the trademark „BURGER KING‟ in over 122 \ncountries. \n7. \nCounsel appearing for the defendants has made the following \nsubmissions: \nI. \nThe defendant no.2 through its predecessor adopted the trademark \nBURGER KING in the year 1970. Since then the defendants have \nextensively used the said mark in respect of their business.  \nII. \nThe plaintiff has no exclusive right in the word „BURGER‟ as the \nsame is generic and common to trade and the word „KING‟ is \nlaudatory. Two generic/laudatory words cannot create a distinctive \ntrademark. Therefore, the trademark „BURGER KING‟ cannot be \nregistered. Reliance in this regard is placed on the judgment in \nNational Bell Co. v. Gupta Industrial Corporation, 1970 (3) SCC \n665.  \nIII. \nThe registrations of the plaintiff are liable to be rectified on various \ngrounds including on the ground of „non-user‟ under Section 47 of the \nAct. It has been averred by the plaintiff in paragraph 17 of the plaint \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified\n\n--- PAGE 5 ---\n2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 5 of 16 \n \nthat the plaintiff was not using the said trademark in India at the time \nof filing of the present suit.  \nIV. \nThe rectification petitions have been filed by the defendants in \nNovember, 2014 and therefore, the relevant period of five years to be \nconsidered in terms of Section 47 (1) (b) of the Act would commence \nfrom three months before the date of filing of the aforesaid \nrectification petitions, i.e., August, 2009 to August, 2014. In the said \nperiod, the plaintiff has failed to give evidence of its user of the \ntrademark BURGER KING in India. \nV. \n  The issues with regard to the invalidity of the plaintiff‟s trademarks \narise out of the pleadings and therefore, the said issue has to be \nframed in terms of Order XIV of the Code of Civil Procedure, 1908 \n(CPC) as well as Section 124 of the Act. Reliance in this regard is \nplaced on the judgment in Abbott Healthcare (supra).  \nVI. \nThe judgments cited on behalf of the plaintiff are distinguishable on \nfacts and therefore, not applicable to the present case. \n8. \nI have heard the counsels for the parties. \n9. \nAt the outset, a reference may be made to the relevant portion of \nSection 124 of the Act, which is set out below:  \n“124. Stay of proceedings where the validity of registration \nof the trade mark is questioned, etc.—(1) Where in any suit \nfor infringement of a trade mark—  \n \n(a) the defendant pleads that registration of the plaintiff’s \ntrade mark is invalid; or \n  \n(b) the defendant raises a defence under clause (e) of sub-\nsection (2) of section 30 and the plaintiff pleads the invalidity \nof registration of the defendant’s trade mark, \n  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified\n\n--- PAGE 6 ---\n2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 6 of 16 \n \nthe court trying the suit (hereinafter referred to as the court), \nshall,—  \n \n(i) if any proceedings for rectification of the register in \nrelation to the plaintiff’s or defendant’s trade mark are \npending before the Registrar or the [High Court], stay the suit \npending the final disposal of such proceedings; \n  \n(ii) if no such proceedings are pending and the court is \nsatisfied that the plea regarding the invalidity of the \nregistration of the plaintiff’s or defendant’s trade mark is \nprima facie tenable, raise an issue regarding the same and \nadjourn the case for a period of three months from the date \nof the framing of the issue in order to enable the party \nconcerned to apply to the [High Court] for rectification of \nthe register. \n  \n(2) If the party concerned proves to the court that he has made \nany such application as is referred to in clause (b) (ii) of sub-\nsection (1) within the time specified therein or within such \nextended time as the court may for sufficient cause allow, the \ntrial of the suit shall stand stayed until the final disposal of the \nrectification proceedings.” \n \n10. \nSub clause (a) of Sub Section (1) of Section 124 of the Act deals with \nthe situation where a defendant pleads that the registration of the plaintiff‟s \ntrademark is invalid, as in the present case. Sub clause (b) (i) envisages a \nsituation where the rectification proceedings are pending on the date of \nfiling of the suit, which is not the situation in the present case. Sub clause (b) \n(ii) deals with the situation where the rectification proceedings have been \nfiled subsequent to the filing of the suit and therefore, this sub clause would \nbe applicable in the present case as admittedly, the rectification proceedings \nwere filed on behalf of the defendants after filing of the present suit. \n11. \nA perusal of sub clause (b) (ii) of Section 124(1) of the Act shows that \nthe Court has to be satisfied that the plea regarding the invalidity of \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified\n\n--- PAGE 7 ---\n2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 7 of 16 \n \nregistration of the trademark is prima facie tenable. Thereupon, the Court \nmay raise an issue regarding the same and adjourn the case for a period of \nthree months from the date of framing of the said issue to enable the \nconcerned party to apply for rectification of the register. It is significant to \nnote that there is no “or” between the words “prima facie tenable” and \n“raise an issue regarding the same”. In fact, the aforesaid phrases are \nseparated by “,” which means that the Court will proceed to frame the issue \nwith regard to invalidity of the registration of the trademark only upon being \nsatisfied that the plea of invalidity is prima facie tenable. Thereupon, the \ndefendant can file a rectification petition. \n12. \nI am in agreement with the submission of the plaintiff that the finding \nof prima facie tenability is a statutory safeguard to ensure that the \ndefendants do not file rectification proceedings as a counter blast to the \ninfringement actions against them, unless their plea of invalidity is prima \nfacie tenable. If this were not so, the defendants would be permitted to \nchallenge the registrations of the plaintiff by filing rectification petitions on \nfrivolous and untenable grounds. It is for this reason that the legislature has \nplaced the safeguard of prima facie tenability in cases where the rectification \nproceedings are filed after a suit for infringement has been filed, whereas no \nsuch safeguard is there in cases where rectification proceedings have been \nfiled before the suit. \n13. \nIn Patel Field Marshal (supra), the Supreme Court observed that \nwhere a civil suit is pending, the jurisdiction can be exercised by a statutory \nauthority only on account of finding of the Civil Court as regards the prima \nfacie tenability of the plea of invalidity. It was further observed that such a \nfinding is a basic requirement so that false, frivolous and untenable claims of \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified\n\n--- PAGE 8 ---\n2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 8 of 16 \n \ninvalidity are not raised. \n14. \nIn Abbott Healthcare (supra), relying upon Patel Field Marshal \n(supra), a Coordinate Bench of this Court observed that mere pleading of \ninvalidity of registration would not suffice and there is a further requirement \nunder Section 124 of the Act that the party invoking Section 124 must \nsatisfy the Court that the plea regarding invalidity of the registration of the \nmark is prima facie tenable and the Court raises an issue regarding the same. \nIt was further observed that under Order XIV Rule 1 of the CPC, issues have \nto be framed on the basis of material propositions of fact or law and not on \nall propositions of fact or law raised in the pleadings. A reading of Section \n124 of the Act along with Order XIV Rule 1 of CPC shows that an issue \nwith regard to validity of the registration granted in favour of the plaintiff \ncan only be framed, when the plea to the said effect taken by the defendant \nis found prima facie tenable. Therefore, I do not find merit in the submission \nof the defendant that merely because pleadings have been made in the \nwritten statement with regard to invalidity of the plaintiff‟s trademark, an \nissue has to be necessarily framed in this regard. \n15. \nIn light of the principles of law elucidated in the aforesaid judgments, \nthis Court would have to examine whether the plea of invalidity raised on \nbehalf of the defendants is prima facie tenable or not. \n16. \n The first ground of invalidity taken by the defendants is in terms of \nSections 47(1)(b) and 47(3) of the Act. For ease of reference, Sections \n47(1)(b) and 47(3) are set out below: \n“47. Removal from register and imposition of limitations on \nground of non-use- (1) A registered trade mark may be taken \noff the register in respect of the goods or services in respect of \nwhich it is registered on application made in the prescribed \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified\n\n--- PAGE 9 ---\n2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 9 of 16 \n \nmanner to the Registrar or the [High Court] by any person \naggrieved on the ground either—.... \n  \n(a)… \n(b) that up to a date three months before the date of the \napplication, a continuous period of five years from the date \non which the trade mark is actually entered in the register or \nlonger had elapsed during which the trade mark was \nregistered and during which there was no bona fide use \nthereof in relation to those goods or services by any \nproprietor thereof for the time being: \n  \nXXX  \n \n \nXXX  \n \n \nXXX \n \n(3) An applicant shall not be entitled to rely for the purpose \nof clause (b) of sub-section (1) or for the purposes of sub-\nsection (2) on any non-use of a trade mark which is shown to \nhave been due to special circumstances in the trade, which \nincludes restrictions on the use of the trade mark in India \nimposed by any law or regulation and not to any intention to \nabandon or not to use the trade mark in relation to the goods \nor services to which the application relates.” \n \n17. \nSection 47(1)(b) of the Act provides that a registered trademark may \nbe removed from the register of trademarks if up to a date of three months \nbefore the date of cancellation application, a continuous period of five years \nor longer has elapsed from the date on which the trademark was entered in \nthe register and during which period, there was no bonafide use of the mark \nby the registered proprietor in relation to the said goods. Section 47(3) \ncontains an exception to Section 47(1)(b) and provides that if the „non-use‟ \nof a trademark is on account of special circumstances and not on account of \nintention to abandon or not to use the trademark, the provisions of Section \n47(1)(b) will not apply. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified\n\n--- PAGE 10 ---\n2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 10 of 16 \n \n18. \nThe aforesaid provisions were considered by the Supreme Court in \nHardie (supra) in the context of Sections 46(1)(b)1 and 46(3)2 of the \nTrademark Act, 1958 (hereinafter „old Act‟), which is pari materia with the \nprovisions of Section 47(1)(b) and Section 47(3) of the present Act. In \nHardie (supra), relying upon the definition of „bona fide use thereof in \nrelation to those goods” in Section 2(2)(b) of the old Act, it was observed by \nthe Supreme Court that the „use‟ may be other than physical and it need not \nbe confined to use of the goods or sale of the goods bearing the trademark. It \nwas held that the word „use‟ in Section 46(1)(b) of the old Act may include \nactions other than the actual sale of the goods bearing the trademark in \nquestion in the market. Taking note of the words „any’ and „whatsoever’ \nqualifying the words “other relation” in Section 2(2)(b) of the old Act, it was \nheld that the aforesaid words give a wider meaning to the words “other \n                                                 \n1  46. Removal from register and imposition of limitations on ground of non-\nuse.—(1) Subject to the provisions of Section 47, a registered trade mark may be \ntaken off the register in respect of any of the goods in respect of which it is \nregistered on application made in the prescribed manner to a High Court or to the \nRegistrar by any person aggrieved on the ground…. \nXXX              \n \nXXX                             XXX \n (b) \nthat up to a date one month before the date of the application, a continuous \nperiod of five years or longer had elapsed during which the trade mark was \nregistered and during which there was no bona fide use thereof in relation to those \ngoods by any proprietor thereof for the time being: \n2   46. Removal from register and imposition of limitations on ground of non-\nuse — \n  XXX              \n \nXXX                             XXX \n (3) \nAn applicant shall not be entitled to rely for the purpose of clause (b) of \nsub-section (1) … on any non-use of a trade mark which is shown to have been \ndue to special circumstances in the trade and not to any intention to abandon or \nnot to use the trade mark in relation to the goods to which the application relates. \n \n \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified\n\n--- PAGE 11 ---\n2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 11 of 16 \n \nrelation”. Section 2(2)(b)3 of the old Act is pari materia with Section \n2(2)(c)4 of the present Act. \n19. \nIt was further held in Hardie (supra) that the intention to abandon \ncould not be limited to „special circumstances of the trade‟. The intention to \nabandon is an essential component of „non-use‟ for the purposes of Section \n46(1)(b) of the old Act. Therefore, it has to be proved that there was an \nintention to either abandon or not to use the trademark. \n20. \nIn Express Bottlers (supra), it was held by the Supreme Court that the \n„non-user‟ under Section 46(1)(b) of the Old Act has to be proved by the \napplicant. It was further held that the intention to abandon by the proprietor \nof the mark has to be proved by cogent evidence. To determine whether a \nmark has been abandoned by the proprietor thereof, the surrounding \ncircumstances have to be seen and until the intention to abandon is \nestablished on account of surrounding circumstances, it cannot be stated that \nthe proprietor has decided to abandon the trademark. \n21. \nIn light of the above, it has to be examined whether there has been a \n„non-use‟ of the trademark by the plaintiff in the aforesaid period of five \nyears or an intention to abandon the said trademark. To buttress his \n                                                 \n3 2. Definitions and Interpretations – \n (2) In this Act, unless the context otherwise requires, any reference—  \n xxx                                             xxx                                           xxx \n(b) to the use of a mark in relation to goods shall be construed as a reference to the use of \nthe mark upon, or in any physical or in any other relation whatsoever, to such goods.  \n \n4 2. Definitions and Interpretations –  \n(2) In this Act, unless the context otherwise requires, any reference— \nc) to the use of a mark,—  \n(i) in relation to goods, shall be construed as a reference to the use of the mark upon, or in any \nphysical or in any other relation whatsoever, to such goods;  \n(ii) in relation to services, shall be construed as a reference to the use of the mark as or as part of \nany statement about the availability, provision or performance of such services; \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified\n\n--- PAGE 12 ---\n2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 12 of 16 \n \nsubmission that the trademark „BURGER KING‟ has been used by the \nplaintiff within the aforesaid period of five years and that there has been no \nintention to abandon the trademark, the counsel for the plaintiff has drawn \nattention of the Court to the following documents filed along with the plaint: \ni. \nResolution of Board of Directors of plaintiff company passed in \nOctober, 2013 permitting the use of „BURGER KING‟ trademark as a \npart of the company to be incorporated in India. \nii. \nIncorporation Certificate dated 11th November, 2013 in the name of \n„BURGER KING Private Limited‟ to provide restaurant services in \nIndia. \niii. \nAnnouncement dated 19th November, 2013 on the plaintiff‟s website \nthat it is entering into a joint venture to develop „BURGER KING‟ \nbrand in India and set up BURGER KING Restaurants in India.  \niv. \nVarious newspaper articles of November, 2013 with regard to \nplaintiffs entering into Indian market. \n22. \nCounsel for the defendants has placed reliance on paragraph 17 of the \nplaint to contend that the plaintiff had no intention to use the aforesaid \ntrademark in India at the time of filing of the present suit. Paragraph 17 of \nthe plaint is set out below: \n“17. On account of the inclusion of 'beef in the Plaintiff’s \nburgers, (which in the Indian context would have previously \nmade the conduct of the Plaintiff’s business unviable) the \nPlaintiff had not launched a BURGER KING restaurant in \nIndia. However, owing to globalization and transformation in \nthe Indian development and consequent on conducting \nexhaustive feasibility studies which have indicated the \nreadiness of the Indian market for the Plaintiff’s world-\nrenowned restaurants, in 2013, the Plaintiff has entered into a \nJoint Venture with Everstone Group, a leading private equity \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified\n\n--- PAGE 13 ---\n2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 13 of 16 \n \nand real estate firm in India and South East Asia, to set up a \nsupply chain in India and establish BURGER KING \nrestaurants across the country.” \n \n23. \n A reading of paragraph 17 of the plaint as a whole shows that the \nplaintiff has stated that the plaintiff has not launched BURGER KING \nrestaurant in India till date as plaintiff‟s burgers include beef. However, in \nthe latter part of the said paragraph, it has been stated that on account of \ntransformation of the Indian market, the plaintiff has set up a joint venture in \nIndia to establish BURGER KING restaurants in India. Therefore, the \naforesaid paragraph cannot be read in a manner as sought to be read by the \nthe defendant.   \n24. \nIn Radico Khaitan Ltd. v. M/s. Devans Modern Breweries Ltd., 2019 \nSCC OnLine Del 7483, relying upon Hardie (supra), it was held that the \npre-launch and preparatory activities before the launch of the product \nbearing the trademark would amount to „use‟ under the Act. In this case \nalso, the plaintiff had entered into an agreement for supply of glass bottles in \nrespect of its trademark and other preparatory work was also undertaken by \nthe plaintiff in relation to the use of its trademark. \n25. \nTherefore, in light of the discussion above, I am satisfied that there \nwas „bona fide use‟ on behalf of the plaintiff of the trademark „BURGER \nKING‟ in the relevant period between August, 2009 and August, 2014 and \nthere was no intention on behalf of the plaintiff to abandon the said \ntrademark. It may be relevant to note that as a consequence of the \npreparatory work carried out by the plaintiff, the first BURGER KING \nrestaurant was opened in India on 9th November, 2014 and as on date there \nare more than 300 BURGER KING Restaurants in India. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified\n\n--- PAGE 14 ---\n2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 14 of 16 \n \n26. \nThe other ground taken on behalf of the defendants is that the \ntrademark „BURGER KING‟ being generic and common to trade and hence, \nthe same cannot be registered. To counter the aforesaid submission, the \ncounsel for the plaintiff has drawn attention of the Court to the trademark \napplications filed on behalf of the defendants in respect of the trademark \n„BURGER KING‟ and its formative device marks. He submits that in light \nof the aforesaid, the defendants are estopped from taking the ground of „non-\nregistrability‟. \n27. \nIn Indian Hotels (supra), following the judgment in Automatic \nElectric Limited v. R.K. Dhawan, (1999) 91 PTC 81, the contention of the \nappellant of the trademark „JIVA‟ being descriptive and hence, non-\nregisterable, was rejected by the Court on the ground that the appellant itself \nhad applied for registration of the mark „JIVA‟ as a trademark and therefore, \nit did not lie in the mouth of the appellant to say that the aforesaid mark was \na generic expression.  \n28. \nTo the same effect is the finding of the Division Bench of this Court \nin PEPS Industries (supra), wherein it was observed that when the \ndefendant has sought registration of the same mark as that of the plaintiff \n(‘NO TURN’ in the said case), such a defendant is estopped from raising a \nquestion on the validity of the said mark on the ground of it being \ndescriptive in nature. \n29. \nIn Sun Pharmaceutical Industries Ltd. v. DWD Pharmaceuticals \nLtd., 2022 SCC OnLine 4015, the contention of the plaintiff therein that the \nmark „ZEST‟ was being used by various third parties and hence, the same is \na publici juris expression, was rejected by the Court on the ground that the \nplaintiff itself had sought and obtained registrations of the same mark and \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified\n\n--- PAGE 15 ---\n2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 15 of 16 \n \ntherefore, it does not lie in the mouth of the plaintiff to state that the word \n„ZEST‟ is a publici juris or a generic expression. \n30. \nA perusal of the trademark applications of the defendants shows that \nthe defendants have themselves sought for registration of the said marks and \ntherefore, in light of the dicta of the aforesaid judgments, the defendants are \nestopped from taking a plea that the trademark BURGER KING is generic \nand common to trade. Therefore, reliance placed on behalf of the defendants \non National Bell (supra) is misplaced.  \n31. \nIn my view, the defendants have failed to place any material in \nsupport of their submission that the trademark „BURGER KING‟ is either \ngeneric or common to trade. It cannot be denied that the plaintiff has used \nthe trademark „BURGER KING‟ since 1954 and holds registrations for the \nsaid mark in over 122 countries including India.  The Division Bench of this \nCourt in M.A.C Personal Care Pvt. Ltd. & Anr. v. Laverana GMBH and \nCo. K.G. & Anr., 2016 SCC OnLine Del 530, observed that the registrations \nof the plaintiff in multiple jurisdictions create an even stronger presumption \nthat the plaintiff‟s trademark has reputation in the market. It was further \nobserved that if a trademark is registered in favour of the plaintiff in a \njurisdiction abroad, the said fact suggests that the mark of the plaintiff is \ndistinctive and hence, the same is capable of distinguishing the plaintiff‟s \ntrademark from those of other businesses.  \n32. \nIn view of the discussion above, I am of the considered view that the \nplea raised by the defendant with regard to the invalidity of registrations \ngranted in favour of the plaintiff in respect of the trademark BURGER \nKING and other formative marks, is prima facie not tenable. There is no \nreasonable prospect of the defendants succeeding in the cancellation \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified\n\n--- PAGE 16 ---\n2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 16 of 16 \n \npetitions filed by them. Therefore, no issue with regard to validity of the \nregistrations of trademarks of the plaintiff is liable to be framed in the facts \nand circumstances of the present case. \n33. \nList on 20th April, 2023. \nI.A. 16492/2019 (u/s 151 of CPC) & I.A. 10536/2022 (seeking \nAmendment of the WS) \n \n34. \nList on 20th April, 2023. \n \n \n \n \n \n \n \n \n \n \n          AMIT BANSAL, J. \nMARCH 06, 2023 \nsr  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified\n"
  },
  "total_pages": 16,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "**Case Summary: Burger King Corporation vs. Ranjan Gupta & Ors.**\n\n**Court:** High Court of Delhi at New Delhi\n**Case No.:** 2023/DHC/001661 (CS(COMM) 229/2018)\n**Judgment Date:** March 6, 2023\n\nThe case revolves around a trademark infringement dispute between Burger King Corporation and Ranjan Gupta & Ors. The plaintiff, Burger King, has multiple registrations for its mark \"BURGER KING\" and formative marks in various classes (Annexure A). An ex parte ad interim injunction was granted on July 25, 2014, restraining the defendants from using the trademark. This order was confirmed till final adjudication on September 24, 2018.\n\nThe defendants raised a defense that the plaintiff's registered trademark is liable to be cancelled. The court observed that the first question to be adjudicated is whether this plea is prima facie tenable. Counsel for the plaintiff submitted:\n\n1. According to Section 124(1)(b)(ii) of the Trademarks Act, the Court shall raise an issue regarding the plea of invalidity only upon being satisfied that it is prima facie tenable.\n2. The court must determine the prima facie tenability of the defendant's plea to prevent them from instituting rectification proceedings as a counterblast.\n\nAfter hearings on January 16, 2023, January 24, 2023, and February 22, 2023, judgment was reserved on February 22, 2023. The case highlights a trademark infringement dispute with complex legal arguments and considerations of the Trademarks Act, 1999.\n\n**Source:** 17. Burger King vs Ranjan Gupta.pdf",
      "pdf_source": "17. Burger King vs. Ranjan Gupta.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "**Case Summary**\n\nSource: PDF \"17. Burger King vs. Ranjan Gupta.pdf\" (High Court of Delhi, 2023/DHC/001661)\n\n**Key Details**\n\n* Case No.: CS(COMM) 229/2018\n* Parties: Burger King Corporation (Plaintiff) vs. Ranjan Gupta & ORS (Defendants)\n* Judgment Reserved: February 22, 2023\n* Judgment Delivered: March 6, 2023\n\n**Proceedings**\n\nThe plaintiff seeks a permanent injunction to restrain the defendants from infringing its trademark \"BURGER KING\" and passing off their goods as those of the plaintiff. The plaintiff has obtained various registrations for its mark and formative marks.\n\n**Important Dates**\n\n* July 25, 2014: Ex parte ad interim injunction granted in favor of the plaintiff.\n* September 24, 2018: Interim order modified by granting further interim relief to the plaintiff.\n\n**Parties' Representatives**\n\n* Plaintiff: Raunaq Kamath, Aditya Gupta, Mukul Kochhar, and Rajul Bajaj (Advocates)\n* Defendants: Shailen Bhatia, Raghav Bhalla, Sreelakshmi Menon, and Nakul Mehta (Advocates)",
          "content": "2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 1 of 16 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n \n% \n \n \n \nJudgment reserved on   : 22nd February, 2023 \n \n \n \n \nJudgment delivered on : 6th March, 2023 \n \n+ \n \n \nCS(COMM) 229/2018  \n \n \nBURGER KING CORPORATION \n \n \n..... Plaintiff \nThrough: \nMr. \nRaunaq \nKamath, \nMr.Aditya \nGupta, Mr. Mukul Kochhar and \nMr.Rajul Bajaj, Advocates. \n \n \n \n \nversus \n \n \nRANJAN GUPTA & ORS \n \n \n \n..... Defendants \nThrough: \nMr. \nShailen \nBhatia, \nMr.Raghav \nBhalla, Ms. Sreelakshmi Menon and \nMr.Nakul Mehta, Advocates. \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \n \n \n \n \nJUDGMENT \n \n1. \nThe present suit has been filed on behalf of the plaintiff seeking relief \nof permanent injunction restraining the defendants from infringing \nplaintiff‟s trademark „BURGER KING‟ and its formative marks, passing off \ntheir goods as that of the plaintiff along with other ancillary reliefs. \n2. \nThe plaintiff has obtained various registrations in respect of its mark \n„BURGER KING‟ and its formative marks in various classes. Details of the \nregistration of the said marks are given in Annexure A annexed to the plaint. \n3. \nVide order dated 25th July, 2014, an ex parte ad interim injunction \nwas granted in favour of the plaintiff restraining the defendants from using \nthe trademark „BURGER KING‟ or any other deceptively similar mark. \nSubsequently, vide order dated 24th September, 2018, the aforesaid interim \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified",
          "pdf_source": "17. Burger King vs. Ranjan Gupta.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "Here is a summary of page 2 from the provided PDF:\n\n**Case Details**\n\n* Case Number: CS(COMM) 229/2018\n* Parties: Burger King Corporation (Plaintiff) vs. Ranjan Gupta (Defendant)\n* Dates:\n\t+ Judgment reserved on: February 22, 2023\n\t+ Judgment delivered on: March 6, 2023\n\n**Court Proceedings**\n\n* The Court noted that an appeal was filed by the defendant and is pending before the Division Bench.\n* A previous order confirmed till final adjudication of the present suit.\n\n**Submissions**\n\n* Counsel for the plaintiff made submissions regarding the prima facie tenability of the plea of invalidity of a registered trademark under Section 124(1)(b)(ii) of the Trademarks Act, 1999.\n\n**Judgment**\n\n* The Supreme Court's judgments in Patel Field Marshal Agencies v. P.M. Digitally Signed By: AMIT BANSAL were relied upon.\n\nSource: Burger King vs. Ranjan Gupta (PDF source: 17. Burger King vs. Ranjan Gupta.pdf, case number 2023/DHC/001661)",
          "content": "2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 2 of 16 \n \norder was confirmed till the final adjudication of the present suit. Appeal is \nstated to have been filed on behalf of the defendant, which is pending before \nthe Division Bench of this Court. \n4. \nIt was noted in the order dated 18th February, 2020 passed in the suit \nthat one of the defences raised by the defendants in their written statement is \nthat the plaintiff‟s registered trademark „BURGER KING‟ is liable to be \ncancelled. It was observed that the first question that is required to be \nadjudicated in the present case is whether the case of the defendants on this \naccount is prima facie tenable.  \n5. \nSubmissions on behalf of the parties on the aforesaid aspect were \nheard on 16th January, 2023, 24th January, 2023 and 22nd February, 2023.  \n6. \nCounsel appearing for the plaintiff has made the following \nsubmissions:  \nI. \nIn terms of Section 124(1)(b)(ii) of the Trademarks Act, 1999 \n(hereinafter „Act‟), the Court shall raise an issue regarding the plea of \ninvalidity of a registered trademark only upon being satisfied that \nsuch a plea is prima facie tenable. From the date of framing of the \nsaid issue, the Court shall adjourn the case for a period of three \nmonths in order to enable the concerned party to apply for \nrectification of the register.  \nII. \nIt is necessary for the Court to determine the prima facie tenability of \nthe plea of invalidity of the registered trademark raised by the \ndefendant in order to ensure that the defendants do not institute \nrectification proceedings as a counter blast to the infringement actions \nfiled against them. Reliance in this regard is placed on the judgments \nof the Supreme Court in Patel Field Marshal Agencies v. P.M. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified",
          "pdf_source": "17. Burger King vs. Ranjan Gupta.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0007",
      "start_index": 3,
      "end_index": 5,
      "summary": "**Case Overview: Burger King Corporation vs. Ranjan Gupta (2023)**\n\nSource: Burger King vs. Ranjan Gupta.pdf (PDF file)\n\nThis summary focuses on the legal proceedings, facts, arguments, decisions, parties, dates, and amounts related to the case.\n\n**Background:**\n\nThe High Court of Delhi at New Delhi issued a judgment in CS(COMM) 229/2018 regarding trademark disputes between Burger King Corporation and Diesel's Ltd (and other defendants). The plaintiff, Burger King Corporation, challenged the rectification petitions filed by the defendants seeking cancellation of the plaintiff's trademark registrations.\n\n**Facts:**\n\n* The plaintiff, Burger King Corporation, had used the trademark \"BURGER KING\" since 1954.\n* The defendant No.2 through its predecessor adopted the trademark in 1970 and extensively used it until November, 2014.\n* The defendants filed rectification petitions under Section 47 of the Act, alleging non-user by the plaintiff.\n\n**Arguments:**\n\n* Plaintiff argued that they had taken steps towards launching their restaurant chain in India before November, 2014, constituting use under Section 47 of the Act.\n* Defendants argued that the trademark \"BURGER KING\" cannot be registered because it consists of generic and laudatory words, which do not create a distinctive trademark.\n\n**Decisions:**\n\nThe High Court:\n\n* Held that non-user by the plaintiff is not a valid ground for rectification under Section 47 of the Act.\n* Ruled in favor of the plaintiff on other grounds, finding estoppel on the part of the defendants from arguing that \"BURGER KING\" is generic.\n\n**Parties and Dates:**\n\n* Plaintiff: Burger King Corporation\n* Defendants: Diesel's Ltd (and others)\n* Judgment Reserved: 22nd February, 2023\n* Judgment Delivered: 6th March, 2023",
      "pdf_source": "17. Burger King vs. Ranjan Gupta.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "Here is a summary of page 3 from the PDF \"17. Burger King vs. Ranjan Gupta.pdf\" (Source: 2023/DHC/001661):\n\n**Proceedings and Arguments**\n\n* 13 rectification petitions were filed by defendants seeking cancellation of plaintiff's trademark registration.\n* Four petitions are being heard by this Court, while nine others were transferred to different High Courts after the Tribunals Reforms Act, 2021.\n\n**Trademark Invalidity Grounds**\n\n* Defendants' grounds for invalidity of plaintiff's trademark are not tenable.\n* \"Non-use\" ground under Section 47 is not applicable as defendants failed to show intention to abandon trademark use in India (relying on Hardie Trading Ltd. v. Addissons Paint & Chemical Ltd., and Express Bottlers Services Private Ltd. v. Pepsico Inc.).\n\n**Key Dates**\n\n* November, 2014: BURGER KING restaurant launched in India.\n* February 22, 2023: Judgment reserved.\n* March 6, 2023: Judgment delivered.\n\n**Case References**\n\n* Hardie Trading Ltd. v. Addissons Paint & Chemical Ltd., (2003) 11 SCC 92\n* Express Bottlers Services Private Ltd. v. Pepsico Inc., 1988 SCC OnLine Cal 62",
          "content": "2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 3 of 16 \n \nDiesels Ltd, (2018) 2 SCC 112 and Abbott Healthcare Pvt. Ltd. v. \nRaj Kumar Prasad & Anr., 2018 SCC OnLine Del 6657. \nIII. \nA total of 13 rectification petitions have been filed on behalf of the \ndefendants seeking cancellation of the trademark registrations of the \nplaintiff, of which four are listed before this Court today. The \nremaining nine were filed before different benches of Intellectual \nProperty Appellate Board (IPAB) and are liable to be transferred \nbefore different High Courts after coming into effect of the Tribunals \nReforms Act, 2021. \nIV. \nThe grounds taken by the defendants in their written statement with \nregard to invalidity of the registration of the trademarks of the \nplaintiff are not tenable at all. The ground of „non-use‟ of the \nregistered trademark of the plaintiff taken by the defendants under \nSection 47 of the Act, is not tenable as the defendants have failed to \nshow that the plaintiff had an intention to abandon the use of their \ntrademark in India. Reliance in this regard is placed on Hardie \nTrading Ltd. & Anr. v. Addissons Paint & Chemical Ltd., (2003) 11 \nSCC 92, and Express Bottlers Services Private Ltd. v. Pepsico Inc. & \nOrs., 1988 SCC OnLine Cal 62. \nV. \nPrior to the launch of BURGER KING restaurant in India in \nNovember, 2014, the plaintiff had taken various steps towards the \nlaunch of the said restaurant in India, which would constitute „use‟ \nunder Section 47 of the Act. \nVI. \nThe defendants are estopped from taking the defence that the \ntrademark „BURGER KING‟ is generic and common to the trade and \nhence, cannot be registered as a trademark, as the defendants \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified",
          "pdf_source": "17. Burger King vs. Ranjan Gupta.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "**Summary of Page 4 from PDF: 17 Burger King vs. Ranjan Gupta (2023)**\n\nThis page is a continuation of the court proceeding in case CS(COMM) 229/2018 between Burger King Corporation (plaintiff) and Ranjan Gupta (defendant). The key points on this page are:\n\n* The defendant, through its predecessor, adopted the trademark \"BURGER KING\" in 1970 and has extensively used it since then.\n* The plaintiff, however, claims to have used the trademark since 1954 and has obtained registrations in over 122 countries.\n* Counsel for the defendants argues that the words \"BURGER\" is generic/common to trade and \"KING\" is laudatory, making the combination non-distinguishable as a trademark.\n* Reliance is placed on the judgment National Bell Co. v. Gupta Industrial Corporation (1970 SCC 665).\n\nSource: **PDF:** 17 Burger King vs. Ranjan Gupta.pdf",
          "content": "2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 4 of 16 \n \nthemselves have applied for registration of the said trademark. \nReliance in this regard is placed on the judgments of the Division \nBench of this Court in Indian Hotels Company Limited & Anr. v. \nJiva Institute of Vedic Science & Culture, 2008 SCC OnLine Del \n1758 and PEPS Industries Private Limited v. Kurlon Limited, 2022 \nSCC OnLine 3275. \nVII. The plaintiff has used the trademark „BURGER KING‟ since 1954 \nand the said mark has acquired secondary meaning and is exclusively \nassociated with the plaintiff. Further, the plaintiff has obtained \nregistrations of the trademark „BURGER KING‟ in over 122 \ncountries. \n7. \nCounsel appearing for the defendants has made the following \nsubmissions: \nI. \nThe defendant no.2 through its predecessor adopted the trademark \nBURGER KING in the year 1970. Since then the defendants have \nextensively used the said mark in respect of their business.  \nII. \nThe plaintiff has no exclusive right in the word „BURGER‟ as the \nsame is generic and common to trade and the word „KING‟ is \nlaudatory. Two generic/laudatory words cannot create a distinctive \ntrademark. Therefore, the trademark „BURGER KING‟ cannot be \nregistered. Reliance in this regard is placed on the judgment in \nNational Bell Co. v. Gupta Industrial Corporation, 1970 (3) SCC \n665.  \nIII. \nThe registrations of the plaintiff are liable to be rectified on various \ngrounds including on the ground of „non-user‟ under Section 47 of the \nAct. It has been averred by the plaintiff in paragraph 17 of the plaint \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified",
          "pdf_source": "17. Burger King vs. Ranjan Gupta.pdf",
          "nodes": []
        },
        {
          "title": "Page 5",
          "node_id": "0006",
          "start_index": 5,
          "end_index": 5,
          "summary": "Here is a summary of page 5 from the provided PDF:\n\nThe court considers various points raised by the defendants in the case between Burger King Corporation (plaintiff) and Ranjan Gupta (defendant):\n\n* The plaintiff did not use the trademark \"BURGER KING\" in India before filing the suit.\n* The relevant period for considering the plaintiff's user of the trademark is from August 2009 to August 2014, during which they failed to provide evidence of use.\n* Issues regarding the invalidity of the plaintiff's trademarks need to be framed according to Order XIV of the Code of Civil Procedure and Section 124 of the Trade Marks Act.\n\nThe court also mentions that judgments cited by the plaintiff are distinguishable on facts and not applicable to this case.\n\nSource: \"17. Burger King vs. Ranjan Gupta.pdf\" (PDF document)",
          "content": "2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 5 of 16 \n \nthat the plaintiff was not using the said trademark in India at the time \nof filing of the present suit.  \nIV. \nThe rectification petitions have been filed by the defendants in \nNovember, 2014 and therefore, the relevant period of five years to be \nconsidered in terms of Section 47 (1) (b) of the Act would commence \nfrom three months before the date of filing of the aforesaid \nrectification petitions, i.e., August, 2009 to August, 2014. In the said \nperiod, the plaintiff has failed to give evidence of its user of the \ntrademark BURGER KING in India. \nV. \n  The issues with regard to the invalidity of the plaintiff‟s trademarks \narise out of the pleadings and therefore, the said issue has to be \nframed in terms of Order XIV of the Code of Civil Procedure, 1908 \n(CPC) as well as Section 124 of the Act. Reliance in this regard is \nplaced on the judgment in Abbott Healthcare (supra).  \nVI. \nThe judgments cited on behalf of the plaintiff are distinguishable on \nfacts and therefore, not applicable to the present case. \n8. \nI have heard the counsels for the parties. \n9. \nAt the outset, a reference may be made to the relevant portion of \nSection 124 of the Act, which is set out below:  \n“124. Stay of proceedings where the validity of registration \nof the trade mark is questioned, etc.—(1) Where in any suit \nfor infringement of a trade mark—  \n \n(a) the defendant pleads that registration of the plaintiff’s \ntrade mark is invalid; or \n  \n(b) the defendant raises a defence under clause (e) of sub-\nsection (2) of section 30 and the plaintiff pleads the invalidity \nof registration of the defendant’s trade mark, \n  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified",
          "pdf_source": "17. Burger King vs. Ranjan Gupta.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0017",
      "start_index": 6,
      "end_index": 14,
      "summary": "Based on the provided PDF section (17. Burger King vs. Ranjan Gupta.pdf), here is a summary of the legal document:\n\n**Case Details**\n\n* Case Number: CS(COMM) 229/2018\n* Parties: Burger King Corporation (Plaintiff) vs. Ranjan Gupta (Defendant)\n* Date of Judgment: March 6, 2023\n\n**Legal Proceedings**\n\n* The High Court of Delhi at New Delhi is considering a suit for infringement against the defendant.\n* Subsection (1) of Section 124 of the Trade Marks Act, 1999, deals with the situation where a defendant pleads that the registration of the plaintiff's trademark is invalid.\n\n**Arguments and Decisions**\n\n* The court notes that rectification proceedings have been filed by the defendants after filing the present suit.\n* To raise an issue regarding the invalidity of the registration, the court must be satisfied that the plea of invalidity is prima facie tenable. If so, the case will be adjourned for three months to enable the party concerned to apply for rectification of the register.\n\n**Key Points**\n\n* The plaintiff argues that the finding of prima facie tenability is a statutory safeguard to prevent frivolous rectification proceedings.\n* The Supreme Court case of Patel Field Marshal (supra) is cited, stating that jurisdiction can be exercised by a court where a civil suit is pending.\n* Prima facie tenability is required for the court to raise an issue regarding the invalidity of the registration.\n\nThis summary is based on sections 10-13 of the provided PDF document.",
      "pdf_source": "17. Burger King vs. Ranjan Gupta.pdf",
      "nodes": [
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "Page 6 of the document \"17. Burger King vs. Ranjan Gupta.pdf\" discusses Section 124(1) of the Trade Marks Act.\n\n**Key Points:**\n\n* The court shall stay the suit pending final disposal of rectification proceedings if such proceedings are pending.\n* If no such proceedings are pending, and the court is satisfied that the plea regarding invalidity of trademark registration is prima facie tenable, it must:\n\t+ Raise an issue on the same\n\t+ Adjourn the case for 3 months to enable the party to apply for rectification of register in High Court.\n\n**Court's Responsibility:**\n\n* If a party proves they've initiated rectification proceedings within the specified time or extension granted by court, trial of the suit shall stand stayed until disposal of rectification proceedings.\n\nThis section is excerpted from Section 124(1) of the Trade Marks Act. (PDF source \"17. Burger King vs. Ranjan Gupta.pdf\")",
          "content": "2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 6 of 16 \n \nthe court trying the suit (hereinafter referred to as the court), \nshall,—  \n \n(i) if any proceedings for rectification of the register in \nrelation to the plaintiff’s or defendant’s trade mark are \npending before the Registrar or the [High Court], stay the suit \npending the final disposal of such proceedings; \n  \n(ii) if no such proceedings are pending and the court is \nsatisfied that the plea regarding the invalidity of the \nregistration of the plaintiff’s or defendant’s trade mark is \nprima facie tenable, raise an issue regarding the same and \nadjourn the case for a period of three months from the date \nof the framing of the issue in order to enable the party \nconcerned to apply to the [High Court] for rectification of \nthe register. \n  \n(2) If the party concerned proves to the court that he has made \nany such application as is referred to in clause (b) (ii) of sub-\nsection (1) within the time specified therein or within such \nextended time as the court may for sufficient cause allow, the \ntrial of the suit shall stand stayed until the final disposal of the \nrectification proceedings.” \n \n10. \nSub clause (a) of Sub Section (1) of Section 124 of the Act deals with \nthe situation where a defendant pleads that the registration of the plaintiff‟s \ntrademark is invalid, as in the present case. Sub clause (b) (i) envisages a \nsituation where the rectification proceedings are pending on the date of \nfiling of the suit, which is not the situation in the present case. Sub clause (b) \n(ii) deals with the situation where the rectification proceedings have been \nfiled subsequent to the filing of the suit and therefore, this sub clause would \nbe applicable in the present case as admittedly, the rectification proceedings \nwere filed on behalf of the defendants after filing of the present suit. \n11. \nA perusal of sub clause (b) (ii) of Section 124(1) of the Act shows that \nthe Court has to be satisfied that the plea regarding the invalidity of \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified",
          "pdf_source": "17. Burger King vs. Ranjan Gupta.pdf",
          "nodes": []
        },
        {
          "title": "Page 7",
          "node_id": "0009",
          "start_index": 7,
          "end_index": 7,
          "summary": "Here is a summary of page 7 from the PDF:\n\n**Source:** Burger King vs. Ranjan Gupta (PDF: 17. Burger King vs. Ranjan Gupta.pdf)\n\n**Summary:**\n\nIn this section, the Court explains that the registration of the trademark is prima facie tenable, meaning it appears to be valid at first glance. However, if the plea of invalidity is prima facie tenable, the Court will raise an issue regarding the same and adjourn the case for three months to allow the defendant to file a rectification petition.\n\nThe Court notes that this safeguard ensures that defendants do not file frivolous or untenable claims against plaintiffs who have filed infringement suits. The Supreme Court's decision in Patel Field Marshal emphasizes the importance of this safety net, stating that jurisdiction can only be exercised on account of a finding by the Civil Court regarding prima facie tenability.\n\n**Key points:**\n\n* Registration of trademark is prima facie tenable\n* Court raises issue and adjourns case for three months if plea of invalidity is prima facie tenable\n* Defendant can file rectification petition\n* Prima facie tenability safeguard prevents frivolous claims from being filed",
          "content": "2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 7 of 16 \n \nregistration of the trademark is prima facie tenable. Thereupon, the Court \nmay raise an issue regarding the same and adjourn the case for a period of \nthree months from the date of framing of the said issue to enable the \nconcerned party to apply for rectification of the register. It is significant to \nnote that there is no “or” between the words “prima facie tenable” and \n“raise an issue regarding the same”. In fact, the aforesaid phrases are \nseparated by “,” which means that the Court will proceed to frame the issue \nwith regard to invalidity of the registration of the trademark only upon being \nsatisfied that the plea of invalidity is prima facie tenable. Thereupon, the \ndefendant can file a rectification petition. \n12. \nI am in agreement with the submission of the plaintiff that the finding \nof prima facie tenability is a statutory safeguard to ensure that the \ndefendants do not file rectification proceedings as a counter blast to the \ninfringement actions against them, unless their plea of invalidity is prima \nfacie tenable. If this were not so, the defendants would be permitted to \nchallenge the registrations of the plaintiff by filing rectification petitions on \nfrivolous and untenable grounds. It is for this reason that the legislature has \nplaced the safeguard of prima facie tenability in cases where the rectification \nproceedings are filed after a suit for infringement has been filed, whereas no \nsuch safeguard is there in cases where rectification proceedings have been \nfiled before the suit. \n13. \nIn Patel Field Marshal (supra), the Supreme Court observed that \nwhere a civil suit is pending, the jurisdiction can be exercised by a statutory \nauthority only on account of finding of the Civil Court as regards the prima \nfacie tenability of the plea of invalidity. It was further observed that such a \nfinding is a basic requirement so that false, frivolous and untenable claims of \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified",
          "pdf_source": "17. Burger King vs. Ranjan Gupta.pdf",
          "nodes": []
        },
        {
          "title": "Page 8",
          "node_id": "0010",
          "start_index": 8,
          "end_index": 8,
          "summary": "Here is a summary of page 8 from the PDF:\n\nThe Court discusses the requirements for raising an issue regarding invalidity of registration in a trademark case (2023/DHC/001661: CS(COMM) 229/2018). Citing judgments from Abbott Healthcare and Patel Field Marshal, the Court rules that mere pleading of invalidity does not suffice. Instead, the party invoking Section 124 of the Act must demonstrate that their plea is prima facie tenable.\n\nAccordingly, the Court examines whether the defendants' plea of invalidity under Sections 47(1)(b) and 47(3) of the Act is prima facie tenable.\n\n**Key points:**\n\n* Raising invalidity requires more than mere pleading (Section 124)\n* Plea must be prima facie tenable to frame an issue\n* Section 47 deals with removal from register on non-use grounds\n\n**PDF source:** Burger King vs. Ranjan Gupta, 2023/DHC/001661 (High Court of Delhi at New Delhi)",
          "content": "2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 8 of 16 \n \ninvalidity are not raised. \n14. \nIn Abbott Healthcare (supra), relying upon Patel Field Marshal \n(supra), a Coordinate Bench of this Court observed that mere pleading of \ninvalidity of registration would not suffice and there is a further requirement \nunder Section 124 of the Act that the party invoking Section 124 must \nsatisfy the Court that the plea regarding invalidity of the registration of the \nmark is prima facie tenable and the Court raises an issue regarding the same. \nIt was further observed that under Order XIV Rule 1 of the CPC, issues have \nto be framed on the basis of material propositions of fact or law and not on \nall propositions of fact or law raised in the pleadings. A reading of Section \n124 of the Act along with Order XIV Rule 1 of CPC shows that an issue \nwith regard to validity of the registration granted in favour of the plaintiff \ncan only be framed, when the plea to the said effect taken by the defendant \nis found prima facie tenable. Therefore, I do not find merit in the submission \nof the defendant that merely because pleadings have been made in the \nwritten statement with regard to invalidity of the plaintiff‟s trademark, an \nissue has to be necessarily framed in this regard. \n15. \nIn light of the principles of law elucidated in the aforesaid judgments, \nthis Court would have to examine whether the plea of invalidity raised on \nbehalf of the defendants is prima facie tenable or not. \n16. \n The first ground of invalidity taken by the defendants is in terms of \nSections 47(1)(b) and 47(3) of the Act. For ease of reference, Sections \n47(1)(b) and 47(3) are set out below: \n“47. Removal from register and imposition of limitations on \nground of non-use- (1) A registered trade mark may be taken \noff the register in respect of the goods or services in respect of \nwhich it is registered on application made in the prescribed \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified",
          "pdf_source": "17. Burger King vs. Ranjan Gupta.pdf",
          "nodes": []
        },
        {
          "title": "Page 9",
          "node_id": "0011",
          "start_index": 9,
          "end_index": 9,
          "summary": "Based on Page 9 of the provided PDF (17. Burger King vs. Ranjan Gupta.pdf), here is a summary of the relevant information:\n\n**Section 47(1)(b) of the Act**\n\nThis section provides that a registered trademark may be removed from the register if up to three months before the date of cancellation application, a continuous period of five years or longer has elapsed since the trademark was entered in the register, and there has been no bonafide use of the mark by the registered proprietor.\n\n**Exception under Section 47(3)**\n\nThis section provides an exception to Section 47(1)(b) if the non-use of a trademark is due to special circumstances, such as restrictions imposed by law or regulation, rather than an intention to abandon or not use the trademark.\n\n**PDF Source**\n\nSource: (17. Burger King vs. Ranjan Gupta.pdf)\n\nPlease note that the above summary focuses on the legal facts and relevant sections of the Act mentioned on Page 9 of the provided PDF.",
          "content": "2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 9 of 16 \n \nmanner to the Registrar or the [High Court] by any person \naggrieved on the ground either—.... \n  \n(a)… \n(b) that up to a date three months before the date of the \napplication, a continuous period of five years from the date \non which the trade mark is actually entered in the register or \nlonger had elapsed during which the trade mark was \nregistered and during which there was no bona fide use \nthereof in relation to those goods or services by any \nproprietor thereof for the time being: \n  \nXXX  \n \n \nXXX  \n \n \nXXX \n \n(3) An applicant shall not be entitled to rely for the purpose \nof clause (b) of sub-section (1) or for the purposes of sub-\nsection (2) on any non-use of a trade mark which is shown to \nhave been due to special circumstances in the trade, which \nincludes restrictions on the use of the trade mark in India \nimposed by any law or regulation and not to any intention to \nabandon or not to use the trade mark in relation to the goods \nor services to which the application relates.” \n \n17. \nSection 47(1)(b) of the Act provides that a registered trademark may \nbe removed from the register of trademarks if up to a date of three months \nbefore the date of cancellation application, a continuous period of five years \nor longer has elapsed from the date on which the trademark was entered in \nthe register and during which period, there was no bonafide use of the mark \nby the registered proprietor in relation to the said goods. Section 47(3) \ncontains an exception to Section 47(1)(b) and provides that if the „non-use‟ \nof a trademark is on account of special circumstances and not on account of \nintention to abandon or not to use the trademark, the provisions of Section \n47(1)(b) will not apply. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified",
          "pdf_source": "17. Burger King vs. Ranjan Gupta.pdf",
          "nodes": []
        },
        {
          "title": "Page 10",
          "node_id": "0012",
          "start_index": 10,
          "end_index": 10,
          "summary": "This excerpt is from a case filed by Burger King Corporation vs. Ranjan Gupta in 2018 (CS(COMM) 229/2018). The relevant page 10 of the document highlights the following:\n\n**Legal Facts:**\n\n* Sections 46(1)(b) and 46(3) of the Trademark Act, 1958 (old Act), were considered by the Supreme Court in Hardie (supra).\n* These provisions are pari materia with Sections 47(1)(b) and 47(3) of the present Trademark Act.\n\n**Proceedings:**\n\n* The case highlights the word \"use\" in Section 46(1)(b) may include actions other than physical use.\n* It gives a wider meaning to the words \"other relation\" in Section 2(2)(b) of the old Act.\n\n**Argument and Decision:**\n\n* There is no mention of any parties' arguments or decisions on pages 10-11 (not provided).\n* Note that page 8 is missing from this excerpt, which may provide more context.\n\nSource:\n17. Burger King vs. Ranjan Gupta.pdf (Document No. 2023/DHC/001661)",
          "content": "2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 10 of 16 \n \n18. \nThe aforesaid provisions were considered by the Supreme Court in \nHardie (supra) in the context of Sections 46(1)(b)1 and 46(3)2 of the \nTrademark Act, 1958 (hereinafter „old Act‟), which is pari materia with the \nprovisions of Section 47(1)(b) and Section 47(3) of the present Act. In \nHardie (supra), relying upon the definition of „bona fide use thereof in \nrelation to those goods” in Section 2(2)(b) of the old Act, it was observed by \nthe Supreme Court that the „use‟ may be other than physical and it need not \nbe confined to use of the goods or sale of the goods bearing the trademark. It \nwas held that the word „use‟ in Section 46(1)(b) of the old Act may include \nactions other than the actual sale of the goods bearing the trademark in \nquestion in the market. Taking note of the words „any’ and „whatsoever’ \nqualifying the words “other relation” in Section 2(2)(b) of the old Act, it was \nheld that the aforesaid words give a wider meaning to the words “other \n                                                 \n1  46. Removal from register and imposition of limitations on ground of non-\nuse.—(1) Subject to the provisions of Section 47, a registered trade mark may be \ntaken off the register in respect of any of the goods in respect of which it is \nregistered on application made in the prescribed manner to a High Court or to the \nRegistrar by any person aggrieved on the ground…. \nXXX              \n \nXXX                             XXX \n (b) \nthat up to a date one month before the date of the application, a continuous \nperiod of five years or longer had elapsed during which the trade mark was \nregistered and during which there was no bona fide use thereof in relation to those \ngoods by any proprietor thereof for the time being: \n2   46. Removal from register and imposition of limitations on ground of non-\nuse — \n  XXX              \n \nXXX                             XXX \n (3) \nAn applicant shall not be entitled to rely for the purpose of clause (b) of \nsub-section (1) … on any non-use of a trade mark which is shown to have been \ndue to special circumstances in the trade and not to any intention to abandon or \nnot to use the trade mark in relation to the goods to which the application relates. \n \n \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified",
          "pdf_source": "17. Burger King vs. Ranjan Gupta.pdf",
          "nodes": []
        },
        {
          "title": "Page 11",
          "node_id": "0013",
          "start_index": 11,
          "end_index": 11,
          "summary": "Here is a summary of page 11 from the PDF \"17. Burger King vs. Ranjan Gupta.pdf\":\n\nThe page discusses case law related to Section 46(1)(b) of the old Trademarks Act, which deals with non-user of trademarks.\n\nKey points:\n\n* In Hardie (supra), it was held that intention to abandon cannot be limited to special circumstances of the trade.\n* The intention to abandon is an essential component of \"non-use\" for the purposes of Section 46(1)(b) of the old Act, and must be proved by cogent evidence.\n* In Express Bottlers (supra), it was held that the applicant must prove non-user under Section 46(1)(b) of the Old Act.\n\nNo specific date, name, or amount is mentioned in this page. However, the case involves Burger King Corporation vs. Ranjan Gupta, and is related to a trademark dispute.\n\nSource: 17. Burger King vs. Ranjan Gupta.pdf (Court Judgment from 2023/DHC/001661).",
          "content": "2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 11 of 16 \n \nrelation”. Section 2(2)(b)3 of the old Act is pari materia with Section \n2(2)(c)4 of the present Act. \n19. \nIt was further held in Hardie (supra) that the intention to abandon \ncould not be limited to „special circumstances of the trade‟. The intention to \nabandon is an essential component of „non-use‟ for the purposes of Section \n46(1)(b) of the old Act. Therefore, it has to be proved that there was an \nintention to either abandon or not to use the trademark. \n20. \nIn Express Bottlers (supra), it was held by the Supreme Court that the \n„non-user‟ under Section 46(1)(b) of the Old Act has to be proved by the \napplicant. It was further held that the intention to abandon by the proprietor \nof the mark has to be proved by cogent evidence. To determine whether a \nmark has been abandoned by the proprietor thereof, the surrounding \ncircumstances have to be seen and until the intention to abandon is \nestablished on account of surrounding circumstances, it cannot be stated that \nthe proprietor has decided to abandon the trademark. \n21. \nIn light of the above, it has to be examined whether there has been a \n„non-use‟ of the trademark by the plaintiff in the aforesaid period of five \nyears or an intention to abandon the said trademark. To buttress his \n                                                 \n3 2. Definitions and Interpretations – \n (2) In this Act, unless the context otherwise requires, any reference—  \n xxx                                             xxx                                           xxx \n(b) to the use of a mark in relation to goods shall be construed as a reference to the use of \nthe mark upon, or in any physical or in any other relation whatsoever, to such goods.  \n \n4 2. Definitions and Interpretations –  \n(2) In this Act, unless the context otherwise requires, any reference— \nc) to the use of a mark,—  \n(i) in relation to goods, shall be construed as a reference to the use of the mark upon, or in any \nphysical or in any other relation whatsoever, to such goods;  \n(ii) in relation to services, shall be construed as a reference to the use of the mark as or as part of \nany statement about the availability, provision or performance of such services; \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified",
          "pdf_source": "17. Burger King vs. Ranjan Gupta.pdf",
          "nodes": []
        },
        {
          "title": "Page 12",
          "node_id": "0014",
          "start_index": 12,
          "end_index": 12,
          "summary": "**Summary of Page 12 from \"17. Burger King vs. Ranjan Gupta.pdf\"**\n\nIn a suit filed by Burger King Corporation (plaintiff) against Ranjan Gupta (defendant), the plaintiff has submitted various documents to prove that they have used their trademark \"BURGER KING\" within the past five years and have no intention to abandon it.\n\nSpecifically, the plaintiff has presented:\n\n* A resolution from its Board of Directors permitting use of the trademark in India (2013)\n* An incorporation certificate for Burger King Private Limited in India (2013)\n* A website announcement stating plans to enter the Indian market through a joint venture (November 2013)\n* Newspaper articles publicizing their entry into the Indian market (November 2013)\n\nThe defendant's counsel, however, relies on paragraph 17 of the plaint, which states that the plaintiff had no intention to use the trademark in India at the time of filing the suit due to concerns about beef consumption.\n\n**Source:** PDF file: \"17. Burger King vs. Ranjan Gupta.pdf\" (Context: 2023/DHC/001661)",
          "content": "2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 12 of 16 \n \nsubmission that the trademark „BURGER KING‟ has been used by the \nplaintiff within the aforesaid period of five years and that there has been no \nintention to abandon the trademark, the counsel for the plaintiff has drawn \nattention of the Court to the following documents filed along with the plaint: \ni. \nResolution of Board of Directors of plaintiff company passed in \nOctober, 2013 permitting the use of „BURGER KING‟ trademark as a \npart of the company to be incorporated in India. \nii. \nIncorporation Certificate dated 11th November, 2013 in the name of \n„BURGER KING Private Limited‟ to provide restaurant services in \nIndia. \niii. \nAnnouncement dated 19th November, 2013 on the plaintiff‟s website \nthat it is entering into a joint venture to develop „BURGER KING‟ \nbrand in India and set up BURGER KING Restaurants in India.  \niv. \nVarious newspaper articles of November, 2013 with regard to \nplaintiffs entering into Indian market. \n22. \nCounsel for the defendants has placed reliance on paragraph 17 of the \nplaint to contend that the plaintiff had no intention to use the aforesaid \ntrademark in India at the time of filing of the present suit. Paragraph 17 of \nthe plaint is set out below: \n“17. On account of the inclusion of 'beef in the Plaintiff’s \nburgers, (which in the Indian context would have previously \nmade the conduct of the Plaintiff’s business unviable) the \nPlaintiff had not launched a BURGER KING restaurant in \nIndia. However, owing to globalization and transformation in \nthe Indian development and consequent on conducting \nexhaustive feasibility studies which have indicated the \nreadiness of the Indian market for the Plaintiff’s world-\nrenowned restaurants, in 2013, the Plaintiff has entered into a \nJoint Venture with Everstone Group, a leading private equity \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified",
          "pdf_source": "17. Burger King vs. Ranjan Gupta.pdf",
          "nodes": []
        },
        {
          "title": "Page 13",
          "node_id": "0015",
          "start_index": 13,
          "end_index": 13,
          "summary": "**Summary of Page 13 from PDF: Burger King vs. Ranjan Gupta**\n\n**Case Details:** CS(COMM) 229/2018 (High Court of Delhi at New Delhi)\n\n**Judgment delivered on:** March 6, 2023\n\n**Key Points:**\n\n* The plaintiff (Burger King Corporation) entered into a joint venture with a real estate firm to set up a supply chain in India and establish Burger King restaurants.\n* Until 2014, the plaintiff had not launched a Burger King restaurant in India due to beef inclusion, but still maintained trademark rights through preparatory work.\n* The court relied on Radico Khaitan Ltd. v. M/s. Devans Modern Breweries Ltd. (2019 SCC OnLine Del 7483) and Hardie to consider pre-launch activities as \"bona fide use\" under the Act.\n* The plaintiff demonstrated genuine intention to use the trademark, leading to opening its first Indian restaurant on November 9, 2014.\n\n**Source:** Burger King vs. Ranjan Gupta (2023/DHC/001661), High Court of Delhi at New Delhi",
          "content": "2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 13 of 16 \n \nand real estate firm in India and South East Asia, to set up a \nsupply chain in India and establish BURGER KING \nrestaurants across the country.” \n \n23. \n A reading of paragraph 17 of the plaint as a whole shows that the \nplaintiff has stated that the plaintiff has not launched BURGER KING \nrestaurant in India till date as plaintiff‟s burgers include beef. However, in \nthe latter part of the said paragraph, it has been stated that on account of \ntransformation of the Indian market, the plaintiff has set up a joint venture in \nIndia to establish BURGER KING restaurants in India. Therefore, the \naforesaid paragraph cannot be read in a manner as sought to be read by the \nthe defendant.   \n24. \nIn Radico Khaitan Ltd. v. M/s. Devans Modern Breweries Ltd., 2019 \nSCC OnLine Del 7483, relying upon Hardie (supra), it was held that the \npre-launch and preparatory activities before the launch of the product \nbearing the trademark would amount to „use‟ under the Act. In this case \nalso, the plaintiff had entered into an agreement for supply of glass bottles in \nrespect of its trademark and other preparatory work was also undertaken by \nthe plaintiff in relation to the use of its trademark. \n25. \nTherefore, in light of the discussion above, I am satisfied that there \nwas „bona fide use‟ on behalf of the plaintiff of the trademark „BURGER \nKING‟ in the relevant period between August, 2009 and August, 2014 and \nthere was no intention on behalf of the plaintiff to abandon the said \ntrademark. It may be relevant to note that as a consequence of the \npreparatory work carried out by the plaintiff, the first BURGER KING \nrestaurant was opened in India on 9th November, 2014 and as on date there \nare more than 300 BURGER KING Restaurants in India. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified",
          "pdf_source": "17. Burger King vs. Ranjan Gupta.pdf",
          "nodes": []
        },
        {
          "title": "Page 14",
          "node_id": "0016",
          "start_index": 14,
          "end_index": 14,
          "summary": "Here is a summary of page 14 from the PDF \"17. Burger King vs. Ranjan Gupta.pdf\" (2023/DHC/001661):\n\n**CS(COMM) 229/2018**\n\nThe plaintiff, Burger King Corporation, has claimed that its trademark „BURGER KING‟ cannot be registered by the defendants as it is generic and common to trade.\n\nHowever, the plaintiff's counsel draws attention to trademark applications filed by the defendants for the same mark and formative device marks. This leads the court to consider estoppel, citing:\n\n* Indian Hotels (2013): The appelant had applied for registration of the mark \"JIVA\", so it couldn't claim it was generic.\n* PEPS Industries (2002): A defendant cannot raise a question about the validity of a mark they have sought registration for themselves.\n\nThe counsel relies on these precedents to argue that the defendants are estopped from claiming the marks are non-registerable due to their own applications.\n\n**Source:** 17. Burger King vs. Ranjan Gupta.pdf (PDF page 14)",
          "content": "2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 14 of 16 \n \n26. \nThe other ground taken on behalf of the defendants is that the \ntrademark „BURGER KING‟ being generic and common to trade and hence, \nthe same cannot be registered. To counter the aforesaid submission, the \ncounsel for the plaintiff has drawn attention of the Court to the trademark \napplications filed on behalf of the defendants in respect of the trademark \n„BURGER KING‟ and its formative device marks. He submits that in light \nof the aforesaid, the defendants are estopped from taking the ground of „non-\nregistrability‟. \n27. \nIn Indian Hotels (supra), following the judgment in Automatic \nElectric Limited v. R.K. Dhawan, (1999) 91 PTC 81, the contention of the \nappellant of the trademark „JIVA‟ being descriptive and hence, non-\nregisterable, was rejected by the Court on the ground that the appellant itself \nhad applied for registration of the mark „JIVA‟ as a trademark and therefore, \nit did not lie in the mouth of the appellant to say that the aforesaid mark was \na generic expression.  \n28. \nTo the same effect is the finding of the Division Bench of this Court \nin PEPS Industries (supra), wherein it was observed that when the \ndefendant has sought registration of the same mark as that of the plaintiff \n(‘NO TURN’ in the said case), such a defendant is estopped from raising a \nquestion on the validity of the said mark on the ground of it being \ndescriptive in nature. \n29. \nIn Sun Pharmaceutical Industries Ltd. v. DWD Pharmaceuticals \nLtd., 2022 SCC OnLine 4015, the contention of the plaintiff therein that the \nmark „ZEST‟ was being used by various third parties and hence, the same is \na publici juris expression, was rejected by the Court on the ground that the \nplaintiff itself had sought and obtained registrations of the same mark and \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified",
          "pdf_source": "17. Burger King vs. Ranjan Gupta.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0020",
      "start_index": 15,
      "end_index": 16,
      "summary": "**Case Details:**\n\n* Case Name: Burger King Corporation v Ranjan Gupta\n* Court: High Court of Delhi\n* Case Number: CS(COMM) 229/2018\n* Date of Judgment: March 6, 2023\n\n**Summary:**\n\nThe Court delivered a judgment in favor of the plaintiff, Burger King Corporation. The defendant, Ranjan Gupta, had filed a petition seeking to cancel the plaintiff's trademark registrations for \"BURGER KING\". However, the Court dismissed the plea, holding that the defendant was estopped from claiming that the mark is generic or common to trade.\n\nThe Court relied on earlier judgments and observed that the plaintiff has used the trademark since 1954 and holds registrations in over 122 countries. The Court also noted that the Division Bench of this Court had previously held that multiple international registrations create a stronger presumption that the plaintiff's trademark has reputation in the market.\n\n**Key Findings:**\n\n* The defendant failed to provide material to support their claim that \"BURGER KING\" is generic or common to trade.\n* The plaintiff has used the trademark since 1954 and holds registrations in over 122 countries, including India.\n* The Court dismissed the plea for cancellation of trademark registrations.\n\n**Parties:**\n\n* Burger King Corporation (Plaintiff)\n* Ranjan Gupta (Defendant)\n\n**Dates:**\n\n* February 22, 2023: Judgment reserved\n* March 6, 2023: Judgment delivered\n* April 20, 2023: Listed for next hearing\n\n* PDF Source: 17. Burger King vs. Ranjan Gupta.pdf",
      "pdf_source": "17. Burger King vs. Ranjan Gupta.pdf",
      "nodes": [
        {
          "title": "Page 15",
          "node_id": "0018",
          "start_index": 15,
          "end_index": 15,
          "summary": "Here is a summary of page 15 from the PDF file \"17. Burger King vs. Ranjan Gupta.pdf\" (2023/DHC/001661 CS(COMM) 229/2018):\n\nDelhi High Court's judgment delivered on March 6, 2023 (page 15-16). Key points:\n\n* The plaintiff, Burger King Corporation, contends that the defendant's use of the mark \"ZEST\" would pass off and constitute a trademark infringement.\n* The court notes that the defendants have sought registration for their marks and are estopped from arguing that \"BURGER KING\" is generic and common to trade (referencing National Bell, supra).\n* The defendants failed to provide material supporting their claim that \"BURGER KING\" is generic or common to trade. \n* The plaintiff has used the mark since 1954 and holds registrations in over 122 countries.\n* The court rules that there is no prima facie case for cancellation of the plaintiff's trademark registrations.\n\nSource: Delhi High Court, Case No.: CS(COMM) 229/2018, dated March 6, 2023. PDF file \"17. Burger King vs. Ranjan Gupta.pdf\".",
          "content": "2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 15 of 16 \n \ntherefore, it does not lie in the mouth of the plaintiff to state that the word \n„ZEST‟ is a publici juris or a generic expression. \n30. \nA perusal of the trademark applications of the defendants shows that \nthe defendants have themselves sought for registration of the said marks and \ntherefore, in light of the dicta of the aforesaid judgments, the defendants are \nestopped from taking a plea that the trademark BURGER KING is generic \nand common to trade. Therefore, reliance placed on behalf of the defendants \non National Bell (supra) is misplaced.  \n31. \nIn my view, the defendants have failed to place any material in \nsupport of their submission that the trademark „BURGER KING‟ is either \ngeneric or common to trade. It cannot be denied that the plaintiff has used \nthe trademark „BURGER KING‟ since 1954 and holds registrations for the \nsaid mark in over 122 countries including India.  The Division Bench of this \nCourt in M.A.C Personal Care Pvt. Ltd. & Anr. v. Laverana GMBH and \nCo. K.G. & Anr., 2016 SCC OnLine Del 530, observed that the registrations \nof the plaintiff in multiple jurisdictions create an even stronger presumption \nthat the plaintiff‟s trademark has reputation in the market. It was further \nobserved that if a trademark is registered in favour of the plaintiff in a \njurisdiction abroad, the said fact suggests that the mark of the plaintiff is \ndistinctive and hence, the same is capable of distinguishing the plaintiff‟s \ntrademark from those of other businesses.  \n32. \nIn view of the discussion above, I am of the considered view that the \nplea raised by the defendant with regard to the invalidity of registrations \ngranted in favour of the plaintiff in respect of the trademark BURGER \nKING and other formative marks, is prima facie not tenable. There is no \nreasonable prospect of the defendants succeeding in the cancellation \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified",
          "pdf_source": "17. Burger King vs. Ranjan Gupta.pdf",
          "nodes": []
        },
        {
          "title": "Page 16",
          "node_id": "0019",
          "start_index": 16,
          "end_index": 16,
          "summary": "The information on page 16 of the PDF \"Burger King vs. Ranjan Gupta.pdf\" (2023/DHC/001661) is summarized as follows:\n\nOn March 6, 2023, Justice Amit Bansal delivered a judgment in CS(COMM) 229/2018.\n\nA key point made by the court is that no issue regarding the validity of Burger King Corporation's trademark registrations needs to be addressed, based on the facts and circumstances of the case (para 33).\n\nThe court also scheduled two Interim Applications (IAs) for listing on April 20, 2023: IA 16492/2019 filed under Section 151 of the Code of Civil Procedure (CPC), and IA 10536/2022 seeking an amendment to the writ (Writ of Summons).\n\nThe judgment was digitally signed by Justice Amit Bansal on March 6, 2023, at 16:14.",
          "content": "2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 16 of 16 \n \npetitions filed by them. Therefore, no issue with regard to validity of the \nregistrations of trademarks of the plaintiff is liable to be framed in the facts \nand circumstances of the present case. \n33. \nList on 20th April, 2023. \nI.A. 16492/2019 (u/s 151 of CPC) & I.A. 10536/2022 (seeking \nAmendment of the WS) \n \n34. \nList on 20th April, 2023. \n \n \n \n \n \n \n \n \n \n \n          AMIT BANSAL, J. \nMARCH 06, 2023 \nsr  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified",
          "pdf_source": "17. Burger King vs. Ranjan Gupta.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-16T13:01:49.867887",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}