{
  "doc_name": "2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI",
  "pdf_source": "2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf",
  "metadata": {
    "document_name": "2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI",
    "source_pdf": "2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf",
    "judges": [
      "AMIT BANSAL"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "813/2016",
      "813/2016",
      "813/2016",
      "813/2016",
      "813/2016",
      "813/2016",
      "813/2016",
      "813/2016",
      "813/2016",
      "813/2016",
      "813/2016",
      "813/2016",
      "16968/2022",
      "311/2017",
      "311/2017",
      "311/2017",
      "311/2017",
      "311/2017"
    ],
    "dhc_numbers": [
      "2022/DHC/005678",
      "2022/DHC/005678",
      "2022/DHC/005678",
      "2022/DHC/005678",
      "2022/DHC/005678",
      "2022/DHC/005678",
      "2022/DHC/005678",
      "2022/DHC/005678",
      "2022/DHC/005678",
      "2022/DHC/005678"
    ],
    "ia_numbers": [],
    "decision_date": "12 December, 2022",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [],
    "defendants": [],
    "appellants": [],
    "respondents": [],
    "plaintiff_advocates": [],
    "defendant_advocates": [],
    "appellant_advocates": [],
    "respondent_advocates": [],
    "damages_claimed": null,
    "damages_awarded": null,
    "key_issues": [
      "Here are the main legal issues extracted from the document:",
      "* Validity of trademark registrations in favor of the plaintiff",
      "* Cancellation or removal of trademarks due to alleged false user and invalid registration",
      "* Effectiveness of an Assignment Deed dated 19th September, 1999 between the parties",
      "* Grounds for revocation/cancellation of trademarks before the Intellectual Property Appellate Board (IPAB)",
      "* Whether the registrations granted in favor of the trademark \"DEHLVI\" should be cancelled or removed",
      "* Legality and enforceability of the alleged Assignment Deed dated 19th September, 1999",
      "* Defendability of trademark infringement claims under the Trade Marks Act, 1999",
      "* Jurisdictional issues regarding revocation/cancellation proceedings before IPAB and stay of the present suit."
    ],
    "decision_summary": "**Background:**\n\nThe present case is a commercial suit filed by Sana Herbals Pvt Ltd (Plaintiff) against Mohsin Dehli (Defendant) in the High Court of Delhi at New Delhi. The Plaintiff alleged infringement of trade marks, copyright, and passing off of the trademark/label \"DEHLVI\". The Defendant has filed a written statement opposing the reliefs sought by the Plaintiff.\n\n**Legal Issues:**\n\n1. **Validity of Trademark Registrations:** The Defendant has pleaded that the various registrations of the mark/label \"DEHLVI\" in favour of the Plaintiff are invalid and liable to be cancelled.\n2. **Invalidity of Assignment Deed:** The Defendant has contended that the alleged Assignment Deed dated 19th September, 1999 is a void instrument.\n\n**Arguments:**\n\nThe Defendant's counsel argued that necessary averments have been made with regard to the invalidity of registrations of the Plaintiff's trademarks and invalidity of the Assignment Deed granted in favour of the Plaintiff. He submitted that the withdrawal of the application under Section 124 of the Trade Marks Act was on account of the fact that the Defendant did not want the present suit to be stayed. The counsel further argued that with the coming into effect of the Tribunals Reforms Act, 2021, the IPAB stands abolished and even the rectification applications have to be heard by this Court.\n\n**Court Findings:**\n\nThe Court observed that since no issue with regard to validity of the marks of the Plaintiff was framed, the application (I.A. 311/2017) for revocation/cancellation of the Plaintiff's trademarks before the Intellectual Property Appellate Board (IPAB) and stay of the present suit was dismissed.\n\n**Decision:**\n\nThe Court allowed the Defendant's application under Order XIV Rule 5 of the Code of Civil Procedure, 1908 (CPC) for framing of additional issues as follows:\n\n\"(x) Whether the registration of the trademarks with the name and style of „Dehlvi‟, either independently or as supporting word, as mentioned in Para 12 of the plaint, in favour of the Plaintiff, are invalid and based on false user and thus, liable to be cancelled / removed? OPD\n(xi) Whether the alleged Assignment Deed dated 19.09.1999 is a legally valid instrument? OPD\"\n\nThe Court directed that these issues be tried along with the suit.\n\n**Rationale:**\n\nThe Court allowed the application as it found that the Defendant had made necessary averments regarding the invalidity of registrations of the Plaintiff's trademarks and invalidity of the Assignment Deed. The Court also considered the fact that the IPAB has been abolished, and the rectification petitions filed by the Defendant can be clubbed and tried in the present suit.\n\n**Significance:**\n\nThe decision highlights the importance of carefully drafting pleadings to ensure that all essential issues are raised before the court. It also emphasizes the need for parties to consider new developments in law and seek judicial guidance when necessary.",
    "legal_precedents": [
      "Krishna Saini Chameli Devi",
      "(1997) \n65 DLT 670",
      "Surjit Singh Sahni Brij Mohan Kaur",
      "(2018) 2 SCC \n112",
      "Shiv Prasad Durga Prasad",
      "(1975) 1 SCC 405",
      "(2014) \n210 DLT 591"
    ],
    "full_text": "\n--- PAGE 1 ---\n2022/DHC/005678 \n \nCS(COMM) 813/2016 \n \n \n \n \n \n                       Page 1 of 10 \n \n * \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n \n% \n \n \nJudgment Reserved on   :  12th December, 2022  \nJudgment Delivered on :  20th December, 2022        \n \n+  \n \n \n \nCS(COMM) 813/2016   \n \n \nSANA HERBALS PVT LTD  \n \n..... Plaintiff \n \n \n \n \nThrough: \nMr. M.K. Miglani, Advocate \n \n \n \n \n \nversus \n \n \nMOHSIN DEHLVI \n \n \n \n \n..... Defendant \nThrough: \nDr. Farrukh Khan, Ms. Ridhima \nGoyal and Ms. Ishita, Advocates \n \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nJUDGMENT \n \nI.A. 16968/2022 (O-XIV R-5 of the CPC) \n1. \nThe present application has been filed on behalf of the defendant \nunder Order XIV Rule 5 of the Code of Civil Procedure, 1908 (CPC) for \nframing of the following additional issues: \n“(x) Whether the registration of the trademarks with the name and \nstyle of „Dehlvi‟, either independently or as supporting word, as \nmentioned in Para 12 of the plaint, in favour of the Plaintiff, are \ninvalid and based on false user and thus, liable to be cancelled / \nremoved? OPD \n(xi) Whether the alleged Assignment Deed dated 19.09.1999 is a \nlegally valid instrument? OPD” \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.12.2022 12:03:26\nSignature Not Verified\n\n--- PAGE 2 ---\n2022/DHC/005678 \n \nCS(COMM) 813/2016 \n \n \n \n \n \n                       Page 2 of 10 \n \n2. \nOn 29th November, 2022, the statement of counsel for the plaintiff \nwas recorded that he does not wish to file reply and the application may be \nheard on the basis of oral submissions.   \n3. \nThe brief facts relevant for deciding the present application are set out \nbelow: \n3.1 \nThe present suit has been filed alleging infringement of trade marks, \ncopyright and passing off of the trademark/label “DEHLVI”.   \n3.2 \nThe plaintiff claims to be the proprietor of the mark “DEHLVI”. \n3.3 \nThe defendant has filed written statement opposing the reliefs sought \nin the plaint, inter alia, pleading that the various registrations of the \nmark/label “DEHLVI” in favour of the plaintiff are invalid and liable \nto be cancelled. It has further been pleaded in the written statement \nthat the alleged Assignment Deed dated 19th September, 1999 is a \nvoid instrument. \n3.4 \nAn application under Section 124 of the Trade Marks Act, 1999, \nbeing I.A. 311/2017, was filed on behalf of the defendant, whereby \npermission was sought from the Court to institute appropriate \nproceedings for revocation/cancellation of the plaintiff’s trademarks \nbefore the Intellectual Property Appellate Board (IPAB) and for stay \nof the present suit. \n3.5 \nIssues were framed in the suit on 29th April, 2019 and an observation \nwas made by the Court that since no issue with regard to validity of \nthe marks of the plaintiff was framed, I.A. 311/2017 was liable to be \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.12.2022 12:03:26\nSignature Not Verified\n\n--- PAGE 3 ---\n2022/DHC/005678 \n \nCS(COMM) 813/2016 \n \n \n \n \n \n                       Page 3 of 10 \n \ndismissed. However, the matter was listed on 26th November, 2019 \nfor arguments on I.A. 311/2017. \n3.6 \nIn the order dated 26th November, 2019 passed by this Court, it was \nnoted that the defendant was not pressing I.A. 311/2017 and \nconsequently, the said application was dismissed as not pressed.  \n3.7 \nIn the year 2022, various rectification petitions, including C.O. \n(COMM.IPD-TM) 100/2022, were filed on behalf of the defendant \nseeking cancellation of the registrations granted in favour of the \ntrademark “DEHLVI”.  \n3.8 \nOn 19th September, 2022, another rectification petition filed by the \npetitioner in respect of the trademark “DEHLVI”, being C.O. \n(COMM.IPD-TM) \n100/2022, \nwas \nwithdrawn \nby \nthe \npetitioner/defendant with liberty to file the petition afresh, after taking \nappropriate steps in the present suit. \n3.9 \nAccordingly, the defendant has filed the present application on 8th \nOctober, 2022 for framing additional issues as aforesaid.   \n4. \nCounsel for the defendant has drawn attention of the Court to the \npleadings in the written statement to contend that necessary averments have \nbeen made with regard to the invalidity of registrations of the plaintiff’s \ntrademarks and invalidity of the Assignment Deed granted in favour of the \nplaintiff. Therefore, issues in this regard are required to be framed. He \nsubmits that the withdrawal of the application under Section 124 of Trade \nMarks Act was on account of the fact that the defendant did not want the \npresent suit to be stayed. He further submits that with the coming into effect \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.12.2022 12:03:26\nSignature Not Verified\n\n--- PAGE 4 ---\n2022/DHC/005678 \n \nCS(COMM) 813/2016 \n \n \n \n \n \n                       Page 4 of 10 \n \nof the Tribunals Reforms Act, 2021, the IPAB stands abolished and even the \nrectification applications have to be heard by this Court. Therefore, the \nrectification petitions filed by the defendant can be clubbed and tried along \nwith the present suit and no prejudice would be caused to the plaintiff. \n5. \nPer contra, counsel for the plaintiff submits that the defendant was \nconscious that permission was required from the Court before filing a \nrectification petition and accordingly filed I.A 311/2017 seeking permission \nof the Court. No issue with regard to the invalidity of the trademarks of the \nplaintiff was framed by this Court and I.A. 311/2017 was dismissed as not \npressed. Therefore, the defendant has consciously chosen not to press the \nissue regarding the invalidity of plaintiff’s trademarks and under the garb of \nthe present application, the defendant cannot raise the aforesaid issue again. \nReliance is placed on the judgments in Shiv Prasad v. Durga Prasad & \nAnr., (1975) 1 SCC 405; Anil Dinmani Shanker Joshi & Anr. v. Chief \nOfficer, (2003) SCC OnLine BOM 24; Jaswant Rai & Ors. v. Municipality, \nBadthinda, (2014) SCC OnLine P&H 25276; and, Krishna Saini v. \nChameli Devi &Ors., (2011) SCC OnLine Del 2258 (DB). \n6. \nI have heard the rival submissions and examined the record of the \ncase. \n7. \nIn Patel Field Marshal Agencies v. P.M. Diesels Ltd., (2018) 2 SCC \n112, the Supreme Court observed that where, during the pendency of a suit, \na rectification application is filed, the application can be pursued only upon \na finding by the Civil Court on the prima facie tenability of the plea of \ninvalidity. If the Civil Court does not find a triable issue on the plea of \ninvalidity, then the said application cannot be pursued. The Supreme Court \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.12.2022 12:03:26\nSignature Not Verified\n\n--- PAGE 5 ---\n2022/DHC/005678 \n \nCS(COMM) 813/2016 \n \n \n \n \n \n                       Page 5 of 10 \n \nnoted that this was necessary so as to avoid multiple proceedings on the \nsame issue and the possibility of conflicting decisions. However, there have \nbeen subsequent developments since the passing of judgment in Patel Field \nMarshal Agencies (supra). In terms of the Tribunals Reforms Act, 2021, the \nIPAB has been abolished and the jurisdiction to decide rectification petitions \nnow vests with the High Court under Section 21 of the Act. Therefore, now \nthe suit as well as the rectification applications have to be decided by one \nauthority alone i.e. the High Court and resultantly, there cannot be any \npossibility of conflicting decisions. Hence, the rectification petitions can be \nclubbed with the civil suits and there is no requirement of staying the civil \nsuit. \n8. \nIn Abbott Healthcare Pvt. Ltd. v. Raj Kumar Prasad & Anr., 2018 \nSCC OnLine Del 6657, a Co-ordinate Bench of this Court was seized of a \nsimilar application filed on behalf of the plaintiff seeking framing of an \nadditional issue with regard to validity of the registration of the defendant’s \ntrademark. In the said suit, issues were framed prior to the filing of the \nSection 124 application and no issue with regard to invalidity of the \ndefendant’s trademark had been urged or framed. Noting that no issue with \nregard to validity of the impugned trademark was framed in the suit, the \napplication filed on behalf of the plaintiff under Section 124 of the Trade \nMarks Act, 1999 was subsequently dismissed by the Court with the liberty \nto apply afresh in the event additional issues were framed in the suit. \nRelying on the dicta of S. Surjit Singh Sahni v. Brij Mohan Kaur, (1997) \n65 DLT 670, the Co-ordinate Bench of this Court observed that framing of \nissues is the duty of the Court and rejection of an earlier prayer does not \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.12.2022 12:03:26\nSignature Not Verified\n\n--- PAGE 6 ---\n2022/DHC/005678 \n \nCS(COMM) 813/2016 \n \n \n \n \n \n                       Page 6 of 10 \n \ndebar a fresh prayer for framing an issue if it arises from the pleadings and \nought to have been framed but has inadvertently not been framed. The \nrelevant observations of the Court in Abbott Healthcare Pvt. Ltd. (supra) are \nset out below: \n“12. The counsel for the plaintiff, in rejoinder, refers to S. \nSurjit Singh Sahni v. Brij Mohan Kaur 65 (1997) DLT 670 and \non order dated 30th April, 2013 in CS(OS) No. 1457/2009 titled \nRanbaxy Laboratories Ltd. v. Intas Pharmaceuticals Ltd. and \nagainst which no appeal is stated to have been preferred, holding \nthat framing of issues is the duty of the Court and rejection of an \nearlier prayer does not debar a fresh prayer for framing an issue \nif it arises from the pleadings and ought to have been framed \nand has mistakenly not been framed. It is argued that the Court, \nat the time of framing of issues on 21st March, 2016, has not \napplied its mind and not refused to frame the issue about \ninvalidity. It is thus contended that the plaintiff can apply for \nframing of additional issue. \n13. \nI tend to agree with the counsel for plaintiff. The Code of \nCivil Procedure, 1908 (CPC), vide Order XIV Rule 5 empowers \nthe Court to, at any time before passing a decree, amend the \nissues or frame additional issues and provides that all such \namendments or additional issues as may be necessary for \ndetermining the maters in controversy between the parties shall \nbe so made or framed. Thus, merely because at the time of \nframing of issues, an issue though arising from pleadings, has \nnot been pressed and/or framed would not stop a subsequent \napplication. The position may be different where an issue is \npressed and not framed by a speaking order. In such case, the \nbar of res judicata, also applicable at successive stages of same \nproceeding, may come in way of an application under Order XIV \nRule 5 CPC. However, in the present case, a perusal of order \ndated 21st March, 2016, when issues were framed, does not show \nany such thing.”  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.12.2022 12:03:26\nSignature Not Verified\n\n--- PAGE 7 ---\n2022/DHC/005678 \n \nCS(COMM) 813/2016 \n \n \n \n \n \n                       Page 7 of 10 \n \n9. \nThe facts in Abbott Healthcare (supra) are similar to that of the \npresent case. In the said case, the Court dismissed the Section 124 \napplication as no issue had been framed with regard to invalidity of the \ntrademark. In the present case also, no issue was framed by the Court with \nregard to invalidity of the registrations of the plaintiff’s marks and the \ndefendant withdrew the application filed under Section 124 of the Trade \nMarks Act, 1999. However, like in Abbott Healthcare (supra), as per the \norder dated 19th September, 2022 in C.O. (COMM.IPD-TM) 100/2022, \nliberty was given to the defendant herein to apply for framing of additional \nissues.  \n10. \nTherefore, what has to be examined is whether the defendant has \nmade the necessary averments in the written statement with regard to the \ninvalidity of the plaintiff’s trademarks so as to frame an issue in this regard. \n11. \nA perusal of the written statement filed on behalf of the defendant \nshows that defendant has pleaded that; (i) the plaintiff company came into \nexistence only on 21st October, 1997, whereas the defendant has been using \nthe trademark “DEHLVI” since 1995 (page 17 of the written statement); (ii) \nthe plaintiff claims rights in the trademark “DEHLVI” only on the basis of \nthe Assignment Deed dated 19th September, 1999, which is invalid and void \nab initio (pages 12 and 17 of the written statement); and, (iii) the registration \nobtained by the plaintiff is on the basis of false user and therefore, the \nregistered trademarks of the plaintiff are liable to be cancelled and pending \nregistration applications liable to be refused (paragraph 24, page 22 of the \nwritten statement). \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.12.2022 12:03:26\nSignature Not Verified\n\n--- PAGE 8 ---\n2022/DHC/005678 \n \nCS(COMM) 813/2016 \n \n \n \n \n \n                       Page 8 of 10 \n \n12. \nA holistic reading of the written statement leads me to conclude that \nthe defendant has made necessary pleadings with regard to (i) invalidity of \nthe Assignment Deed dated 19th September, 1999; and (ii) the invalidity of \nthe trademark registrations granted in favour of the plaintiff. These are \nmaterial propositions of fact in terms of Order XIV Rule 1 of the CPC and \ntherefore, an issue ought to have been framed with regard to the same. \n13. \nIt is the settled position of law that it is the obligation of the Court to \nframe issues. In this regard reference may be made to paragraph 7 of the S. \nSurjit Singh Sahni (supra): \n“7. \nA perusal of the several provisions contained in Order 14 \nof the CPC would be apposite. An issue arises when a material \nproposition of fact or law is affirmed by one party and denied by \nthe other. Every such proposition shall form the subject of a \ndistinct issue. Primarily it is the obligation of the Court to frame \nthe issues. Failure on the part of the Court may be remedied by \neither party inviting attention of the Court to the need of framing \nsuch an issue either by participating in the process of settlement \nof issues or by moving an application under Order 14 Rule 5 of \nthe CPC. It is obligatory on the part of the Court to frame an \nissue once it is satisfied that an issue which should have been \nframed was not framed. If the trial court fails in framing an \nissue or fails to remedy its earlier failure then even an appellate \ncourt is vested with power of framing an issue under Rule 25 of \nOrder 41 of the CPC.” \n[emphasis supplied] \n14. \nIn light of the dicta above, even if the counsel for the defendant did \nnot press for framing of the issues sought to be framed now, it would not \nmean that the Court cannot, at a subsequent stage, frame such issues if they \nemerge from the pleadings in the suit. The language of Order XIV Rule 5 of \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.12.2022 12:03:26\nSignature Not Verified\n\n--- PAGE 9 ---\n2022/DHC/005678 \n \nCS(COMM) 813/2016 \n \n \n \n \n \n                       Page 9 of 10 \n \nthe CPC is very wide and empowers the Court to amend the issues so \nframed or frame additional issues at any time before passing of the final \ndecree. \n15. \nIn any event, if the counsel for the defendant did not press for framing \nof additional issues that are subject matter of the present application and also \ndid not press the application under Section 124 of the Trade Marks Act, the \ndefendant cannot be made to suffer. It has been held in Teva \nPharmaceutical Industries Ltd. & Ors. v. Natco Pharma Limited, (2014) \n210 DLT 591 (DB), which has been followed in Abbott Healthcare (supra) \nthat a litigant ought not to suffer on account of acts of his advocate. \n16. \nThe judgments relied upon by counsel for the plaintiff was in an \nentirely different factual context and therefore, would not be applicable to \nthe facts and circumstances of the present case. \n17. \nThere is another aspect of the matter. In the earlier regime, upon an \nissue being framed with regard to invalidity of a trademark, proceedings in \nthe civil suit were stayed in order that for the statutory authority i.e. IPAB to \ndecide. With the coming into effect of the Tribunals Reforms Act, 2021, and \nthe consequent abolition of the IPAB, this situation does not exist anymore. \nTherefore, even if an issue with regard to invalidity of a trademark is framed \nby the civil court and rectification applications are filed by a litigant, the \ncivil suit is not liable to be stayed. The rectification petitions/applications \ncan be clubbed and tried along with the civil suit. Therefore, no prejudice \nwould be caused to the plaintiff if the additional issues, as sought to be \nframed by way of the present application, are framed. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.12.2022 12:03:26\nSignature Not Verified\n\n--- PAGE 10 ---\n2022/DHC/005678 \n \nCS(COMM) 813/2016 \n \n \n \n \n \n                       Page 10 of 10 \n \n18. \nAccordingly, the present application is allowed and the following \nadditional issues are framed: \nI. \nWhether the registration of the trademarks with the name and style of \n\"Dehlvi\", either independently or as supporting word, as mentioned in \nparagraph 12 of the plaint, in favour of the Plaintiff, are invalid and \nbased on false user and thus, liable to be cancelled / removed? OPD \nII. \nWhether the alleged Assignment Deed dated 19th September, 1999 is \na legally valid instrument? OPD \nCS(COMM) 813/2016 \n19. \nList before the Joint Registrar on 6th February, 2023. \n \n \n \n \n \n \n \n \n \nAMIT BANSAL, J. \nDECEMBER 20, 2022 \ndk/sr \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.12.2022 12:03:26\nSignature Not Verified\n"
  },
  "total_pages": 10,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "Here is a summary of the document:\n\n**Case Details**\n\n* Case name: SANA HERBALS PVT LTD VS. MOHSIN DEHLVI\n* Court: High Court of Delhi at New Delhi\n* File number: 2022/DHC/005678\n* Suit number: CS(COMM) 813/2016\n\n**Parties**\n\n* Plaintiff: Sana Herbals Pvt Ltd, represented by Mr. M.K. Miglani\n* Defendant: Mohsin Dehlvi, represented by Dr. Farrukh Khan and Ms. Ridhima Goyal\n\n**Judgment Details**\n\n* Judgment reserved on: 12th December, 2022\n* Judgment delivered on: 20th December, 2022\n\n**Application I.A. 16968/2022**\n\n* The defendant filed an application under Order XIV Rule 5 of the Code of Civil Procedure (CPC) for framing additional issues.\n* The defendant sought to add two new issues:\n\t+ Whether the registration of trademarks with the name and style \"Dehlvi\" are invalid and based on false user, and thus liable to be cancelled/removed?\n\t+ Whether the alleged Assignment Deed dated 19.09.1999 is a legally valid instrument?\n\n**Previous Proceedings**\n\n* The defendant filed an application (I.A. 311/2017) under Section 124 of the Trade Marks Act, 1999 for revocation/cancellation of the plaintiff's trademarks and stay of the present suit.\n* Issues were framed in the suit on 29th April, 2019.\n\n**Source**\n\nPDF: 2. SANA HERBALS PVT LTD VS. MOHSIN DEHLVI (2022/DHC/005678)",
      "pdf_source": "2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "Here is a summary of page 1 from PDF \"SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf\" (2022/DHC/005678):\n\n**Case Details**\n\n* Case Number: CS(COMM) 813/2016\n* Parties:\n\t+ Plaintiff: SANA HERBALS PVT LTD\n\t+ Defendant: MOHSIN DEHLVI\n* Advocate for Plaintiff: Mr. M.K. Miglani, Advocate\n* Advocate for Defendant: Dr. Farrukh Khan, Ms. Ridhima Goyal, and Ms. Ishita, Advocates\n\n**Proceedings**\n\n* The present application (I.A. 16968/2022) has been filed by the defendant under Order XIV Rule 5 of the CPC to frame additional issues.\n* The sought additional issues are:\n\t1. Whether the Plaintiff's trademarks with the name \"Dehlvi\" are invalid and based on false user?\n\t2. Whether the alleged Assignment Deed dated 19.09.1999 is legally valid?\n\n**Judgment Details**\n\n* Judgement Reserved: 12th December, 2022\n* Judgement Delivered: 20th December, 2022\n* Digitally Signed By: Honourable Mr. Justice Amit Bansal (Signing Date: 20.12.2022 12:03:26)\n\nSource: PDF \"SANA HERBALS PVT LTD VS. MO",
          "content": "2022/DHC/005678 \n \nCS(COMM) 813/2016 \n \n \n \n \n \n                       Page 1 of 10 \n \n * \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n \n% \n \n \nJudgment Reserved on   :  12th December, 2022  \nJudgment Delivered on :  20th December, 2022        \n \n+  \n \n \n \nCS(COMM) 813/2016   \n \n \nSANA HERBALS PVT LTD  \n \n..... Plaintiff \n \n \n \n \nThrough: \nMr. M.K. Miglani, Advocate \n \n \n \n \n \nversus \n \n \nMOHSIN DEHLVI \n \n \n \n \n..... Defendant \nThrough: \nDr. Farrukh Khan, Ms. Ridhima \nGoyal and Ms. Ishita, Advocates \n \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nJUDGMENT \n \nI.A. 16968/2022 (O-XIV R-5 of the CPC) \n1. \nThe present application has been filed on behalf of the defendant \nunder Order XIV Rule 5 of the Code of Civil Procedure, 1908 (CPC) for \nframing of the following additional issues: \n“(x) Whether the registration of the trademarks with the name and \nstyle of „Dehlvi‟, either independently or as supporting word, as \nmentioned in Para 12 of the plaint, in favour of the Plaintiff, are \ninvalid and based on false user and thus, liable to be cancelled / \nremoved? OPD \n(xi) Whether the alleged Assignment Deed dated 19.09.1999 is a \nlegally valid instrument? OPD” \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.12.2022 12:03:26\nSignature Not Verified",
          "pdf_source": "2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "Here is a summary of page 2 from the PDF \"SANA HERBALS PVT LTD VS. MOHSIN DEHLVI\" (CS(COMM) 813/2016):\n\nOn November 29, 2022, the plaintiff's counsel stated that they do not wish to file a reply and requested that the application be heard based on oral submissions.\n\nThe relevant facts for this case are outlined as follows:\n\n* The plaintiff claims infringement of trademarks, copyrights, and passing off of the trademark/label \"DEHLVI\".\n* The defendant has filed a written statement opposing the reliefs sought by the plaintiff, including claiming that the plaintiff's registrations of the mark/label \"DEHLVI\" are invalid.\n* The defendant also pleaded that an alleged Assignment Deed dated September 19, 1999 is void.\n\nThese facts relate to an application under Section 124 of the Trade Marks Act, 1999 (I.A. 311/2017), which sought permission for the defendant to institute proceedings for revocation/cancellation of the plaintiff's trademarks and stay the present suit.\n\nSource: SANA HERBALS PVT LTD VS. MOHSIN DEHLVI (CS(COMM) 813/2016) [2022/DHC/005678]",
          "content": "2022/DHC/005678 \n \nCS(COMM) 813/2016 \n \n \n \n \n \n                       Page 2 of 10 \n \n2. \nOn 29th November, 2022, the statement of counsel for the plaintiff \nwas recorded that he does not wish to file reply and the application may be \nheard on the basis of oral submissions.   \n3. \nThe brief facts relevant for deciding the present application are set out \nbelow: \n3.1 \nThe present suit has been filed alleging infringement of trade marks, \ncopyright and passing off of the trademark/label “DEHLVI”.   \n3.2 \nThe plaintiff claims to be the proprietor of the mark “DEHLVI”. \n3.3 \nThe defendant has filed written statement opposing the reliefs sought \nin the plaint, inter alia, pleading that the various registrations of the \nmark/label “DEHLVI” in favour of the plaintiff are invalid and liable \nto be cancelled. It has further been pleaded in the written statement \nthat the alleged Assignment Deed dated 19th September, 1999 is a \nvoid instrument. \n3.4 \nAn application under Section 124 of the Trade Marks Act, 1999, \nbeing I.A. 311/2017, was filed on behalf of the defendant, whereby \npermission was sought from the Court to institute appropriate \nproceedings for revocation/cancellation of the plaintiff’s trademarks \nbefore the Intellectual Property Appellate Board (IPAB) and for stay \nof the present suit. \n3.5 \nIssues were framed in the suit on 29th April, 2019 and an observation \nwas made by the Court that since no issue with regard to validity of \nthe marks of the plaintiff was framed, I.A. 311/2017 was liable to be \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.12.2022 12:03:26\nSignature Not Verified",
          "pdf_source": "2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0007",
      "start_index": 3,
      "end_index": 5,
      "summary": "**Case Summary: SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf (2022/DHC/005678)**\n\nIn this civil suit (CS(COMM) 813/2016), Sana Herbals PVT Ltd is the plaintiff, and Mohsin Dehlvi is the defendant. The case involves trademark disputes.\n\n**Background:**\n\n* The suit was filed on November 26, 2019.\n* The defendant had filed an application (I.A. 311/2017) to seek permission to file a rectification petition, but it was dismissed as not pressed.\n* In 2022, the defendant filed various rectification petitions seeking cancellation of trademark registrations.\n\n**Key Facts and Arguments:**\n\n* On September 19, 2022, the defendant withdrew one of the rectification petitions with liberty to file again after taking appropriate steps in the suit.\n* The defendant argued that necessary averments were made in the written statement regarding invalidity of plaintiff's trademarks, and issues should be framed accordingly.\n* Counsel for the plaintiff contended that the defendant was conscious of requiring permission from the court before filing a rectification petition but chose not to press the issue.\n\n**Decisions:**\n\n* The High Court of Delhi reserved judgment on December 12, 2022, and delivered it on December 20, 2022.\n* After examining the record and considering rival submissions, the court will decide whether issues related to invalidity of plaintiff's trademarks should be framed.\n\n**Parties Involved:**\n\n* Sana Herbals PVT Ltd (plaintiff)\n* Mohsin Dehlvi (defendant)\n\n**Dates and Deadlines:**\n\n* November 26, 2019: Suit filed\n* September 19, 2022: Rectification petition withdrawn\n* October 8, 2022: Defendant's new application for framing additional issues\n* December 12, 2022: Judgment reserved\n*",
      "pdf_source": "2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "Here is a summary of page 3 from the provided PDF (Source: 2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf):\n\n**Proceedings**\n\n* The court listed the matter on November 26, 2019, for arguments on IA 311/2017.\n* However, the defendant did not press this application, and it was consequently dismissed.\n\n**Rectification Petitions**\n\n* In 2022, various rectification petitions were filed by the defendant to cancel the registrations granted in favor of the trademark \"DEHLVI\".\n* On September 19, 2022, one such petition (C.O. (COMM.IPD-TM) 100/2022) was withdrawn due to inadequate preparation and with liberty to file fresh.\n\n**Present Application**\n\n* The defendant filed a new application on October 8, 2022, seeking framing of additional issues regarding invalidity of registrations of the plaintiff's trademarks and Assignment Deed.\n* Counsel for the defendant argued that these issues need to be framed in light of the averments made in the written statement.\n\n**Important Dates**\n\n* November 26, 2019: Court listed matter for arguments on IA 311/2017.\n* September 19, 2022: Rectification petition C.O. (COMM.IPD-TM) 100/2022 withdrawn.\n* October 8, 2022: Defendant filed present application.\n\n**Important Names**\n\n*",
          "content": "2022/DHC/005678 \n \nCS(COMM) 813/2016 \n \n \n \n \n \n                       Page 3 of 10 \n \ndismissed. However, the matter was listed on 26th November, 2019 \nfor arguments on I.A. 311/2017. \n3.6 \nIn the order dated 26th November, 2019 passed by this Court, it was \nnoted that the defendant was not pressing I.A. 311/2017 and \nconsequently, the said application was dismissed as not pressed.  \n3.7 \nIn the year 2022, various rectification petitions, including C.O. \n(COMM.IPD-TM) 100/2022, were filed on behalf of the defendant \nseeking cancellation of the registrations granted in favour of the \ntrademark “DEHLVI”.  \n3.8 \nOn 19th September, 2022, another rectification petition filed by the \npetitioner in respect of the trademark “DEHLVI”, being C.O. \n(COMM.IPD-TM) \n100/2022, \nwas \nwithdrawn \nby \nthe \npetitioner/defendant with liberty to file the petition afresh, after taking \nappropriate steps in the present suit. \n3.9 \nAccordingly, the defendant has filed the present application on 8th \nOctober, 2022 for framing additional issues as aforesaid.   \n4. \nCounsel for the defendant has drawn attention of the Court to the \npleadings in the written statement to contend that necessary averments have \nbeen made with regard to the invalidity of registrations of the plaintiff’s \ntrademarks and invalidity of the Assignment Deed granted in favour of the \nplaintiff. Therefore, issues in this regard are required to be framed. He \nsubmits that the withdrawal of the application under Section 124 of Trade \nMarks Act was on account of the fact that the defendant did not want the \npresent suit to be stayed. He further submits that with the coming into effect \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.12.2022 12:03:26\nSignature Not Verified",
          "pdf_source": "2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "Here is a summary of page 4 from the provided PDF:\n\n**Case Details**\n\n* Case number: CS(COMM) 813/2016\n* Court: High Court of Delhi\n* Parties:\n\t+ Plaintiff: SANA HERBALS PVT LTD (represented by Mr. M.K. Miglani, Advocate)\n\t+ Defendant: MOHSIN DEHLVI (represented by Dr. Farrukh Khan, Ms. Ridhima Goyal, and Ms. Ishita)\n\n**Arguments**\n\n* Counsel for the defendant argues that the rectification petitions can be clubbed with the present suit without causing prejudice to the plaintiff.\n* Counsel for the plaintiff argues that the defendant was previously aware of the need for court permission to file a rectification petition and chose not to press the issue regarding the invalidity of the plaintiff's trademarks.\n\n**References**\n\nThe judgment relies on several precedents, including:\n\n* Patel Field Marshal Agencies v. P.M. Diesels Ltd., (2018) 2 SCC 112\n* Shiv Prasad v. Durga Prasad & Anr., (1975) 1 SCC 405",
          "content": "2022/DHC/005678 \n \nCS(COMM) 813/2016 \n \n \n \n \n \n                       Page 4 of 10 \n \nof the Tribunals Reforms Act, 2021, the IPAB stands abolished and even the \nrectification applications have to be heard by this Court. Therefore, the \nrectification petitions filed by the defendant can be clubbed and tried along \nwith the present suit and no prejudice would be caused to the plaintiff. \n5. \nPer contra, counsel for the plaintiff submits that the defendant was \nconscious that permission was required from the Court before filing a \nrectification petition and accordingly filed I.A 311/2017 seeking permission \nof the Court. No issue with regard to the invalidity of the trademarks of the \nplaintiff was framed by this Court and I.A. 311/2017 was dismissed as not \npressed. Therefore, the defendant has consciously chosen not to press the \nissue regarding the invalidity of plaintiff’s trademarks and under the garb of \nthe present application, the defendant cannot raise the aforesaid issue again. \nReliance is placed on the judgments in Shiv Prasad v. Durga Prasad & \nAnr., (1975) 1 SCC 405; Anil Dinmani Shanker Joshi & Anr. v. Chief \nOfficer, (2003) SCC OnLine BOM 24; Jaswant Rai & Ors. v. Municipality, \nBadthinda, (2014) SCC OnLine P&H 25276; and, Krishna Saini v. \nChameli Devi &Ors., (2011) SCC OnLine Del 2258 (DB). \n6. \nI have heard the rival submissions and examined the record of the \ncase. \n7. \nIn Patel Field Marshal Agencies v. P.M. Diesels Ltd., (2018) 2 SCC \n112, the Supreme Court observed that where, during the pendency of a suit, \na rectification application is filed, the application can be pursued only upon \na finding by the Civil Court on the prima facie tenability of the plea of \ninvalidity. If the Civil Court does not find a triable issue on the plea of \ninvalidity, then the said application cannot be pursued. The Supreme Court \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.12.2022 12:03:26\nSignature Not Verified",
          "pdf_source": "2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf",
          "nodes": []
        },
        {
          "title": "Page 5",
          "node_id": "0006",
          "start_index": 5,
          "end_index": 5,
          "summary": "**Summary of Page 5 from PDF**\n\n`Source: SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf (2022/DHC/005678)`\n\n**Background:** The court has reevaluated its earlier judgment in Patel Field Marshal Agencies, considering the abolition of the Intellectual Property Appellate Board (IPAB) and the transfer of jurisdiction to decide rectification petitions under the Tribunals Reforms Act, 2021.\n\nThe court notes that:\n\n* Since the High Court now decides both civil suits and rectification applications, there's no risk of conflicting decisions.\n* Rectification petitions can be clubbed with civil suits without requiring a stay on the civil suit.\n\n**Reference to Previous Case:**\n\n* The court cites Abbott Healthcare Pvt. Ltd. v. Raj Kumar Prasad & Anr., 2018 SCC Online Del 6657, where a similar application under Section 124 of the Trade Marks Act, 1999 was dismissed after issues were framed in the suit without addressing the trademark's validity.\n\n**Legal Principle:**\n\n* The court relies on S. Surjit Singh Sahni v. Brij Mohan Kaur (1997) 65 DLT 670, which establishes that framing of issues is a duty of the Court, and rejection of an earlier prayer does not prevent re-evaluation.",
          "content": "2022/DHC/005678 \n \nCS(COMM) 813/2016 \n \n \n \n \n \n                       Page 5 of 10 \n \nnoted that this was necessary so as to avoid multiple proceedings on the \nsame issue and the possibility of conflicting decisions. However, there have \nbeen subsequent developments since the passing of judgment in Patel Field \nMarshal Agencies (supra). In terms of the Tribunals Reforms Act, 2021, the \nIPAB has been abolished and the jurisdiction to decide rectification petitions \nnow vests with the High Court under Section 21 of the Act. Therefore, now \nthe suit as well as the rectification applications have to be decided by one \nauthority alone i.e. the High Court and resultantly, there cannot be any \npossibility of conflicting decisions. Hence, the rectification petitions can be \nclubbed with the civil suits and there is no requirement of staying the civil \nsuit. \n8. \nIn Abbott Healthcare Pvt. Ltd. v. Raj Kumar Prasad & Anr., 2018 \nSCC OnLine Del 6657, a Co-ordinate Bench of this Court was seized of a \nsimilar application filed on behalf of the plaintiff seeking framing of an \nadditional issue with regard to validity of the registration of the defendant’s \ntrademark. In the said suit, issues were framed prior to the filing of the \nSection 124 application and no issue with regard to invalidity of the \ndefendant’s trademark had been urged or framed. Noting that no issue with \nregard to validity of the impugned trademark was framed in the suit, the \napplication filed on behalf of the plaintiff under Section 124 of the Trade \nMarks Act, 1999 was subsequently dismissed by the Court with the liberty \nto apply afresh in the event additional issues were framed in the suit. \nRelying on the dicta of S. Surjit Singh Sahni v. Brij Mohan Kaur, (1997) \n65 DLT 670, the Co-ordinate Bench of this Court observed that framing of \nissues is the duty of the Court and rejection of an earlier prayer does not \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.12.2022 12:03:26\nSignature Not Verified",
          "pdf_source": "2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0011",
      "start_index": 6,
      "end_index": 8,
      "summary": "**Section: Legal Arguments**\n\nThe document \"2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf\" pertains to a consumer dispute case (CS(COMM) 813/2016) in the High Court of Delhi at New Delhi.\n\n**Case Background:** The plaintiff, Sana Herbals Pvt Ltd, filed a suit against Mohsin Dehlvi under the Trademarks Act, 1999. Despite withdrawing an application under Section 124, the defendant was granted liberty to apply for framing additional issues.\n\n**Legal Arguments:**\n\n* The court agreed with the plaintiff's argument that despite the earlier order not framing an issue on invalidity, the court can still do so if it arises from the pleadings.\n* The court quoted the Code of Civil Procedure, 1908 (CPC) Order XIV Rule 5, which empowers the court to amend or frame additional issues before passing a decree.\n\n**Facts:**\n\n* The defendant has pleaded that the plaintiff's trademark assignment deed is invalid and void ab initio (invalid from the start).\n* The registration obtained by the plaintiff is based on false user.\n\n**Decisions:**\n\n* The court held that it can examine whether the defendant made necessary averments in the written statement regarding the invalidity of the plaintiff's trademarks.\n* The court granted liberty to frame additional issues if required.\n\n**Parties:** Sana Herbals Pvt Ltd (plaintiff) vs. Mohsin Dehlvi (defendant)\n\n**Dates:** 21st March, 2016 (issues framed); 19th September, 2022 (liberty granted to defendant); 20th December, 2022 (judgment delivered).\n\n(PDF source: 2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf)",
      "pdf_source": "2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf",
      "nodes": [
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "**Court Decision: SANA HERBALS PVT LTD VS. MOHSIN DELHI VI (2022/DHC/005678)**\n\n**PDF Source:** 2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf\n\n**Relevant Pages:** 6 of 10\n\nThe High Court of Delhi at New Delhi delivered its judgment on December 20, 2022 (CS(COMM) 813/2016). The court considered whether a fresh prayer for framing an issue could be made if it arose from the pleadings and had inadvertently not been framed.\n\n**Key Points:**\n\n* A plaintiff can apply to frame additional issues under Order XIV Rule 5 of the Code of Civil Procedure, 1908 (CPC).\n* The court must determine whether the application is necessary for determining the matters in controversy between the parties.\n* The bar of res judicata does not apply where an issue is pressed and not framed by a speaking order.\n\n**Decisions:**\n\n* The court agreed with the plaintiff's counsel, holding that merely because an issue was not pressed and/or framed at the time of framing issues would not stop a subsequent application to frame additional issues.\n* The court found no bar to an application under Order XIV Rule 5 CPC in this case.",
          "content": "2022/DHC/005678 \n \nCS(COMM) 813/2016 \n \n \n \n \n \n                       Page 6 of 10 \n \ndebar a fresh prayer for framing an issue if it arises from the pleadings and \nought to have been framed but has inadvertently not been framed. The \nrelevant observations of the Court in Abbott Healthcare Pvt. Ltd. (supra) are \nset out below: \n“12. The counsel for the plaintiff, in rejoinder, refers to S. \nSurjit Singh Sahni v. Brij Mohan Kaur 65 (1997) DLT 670 and \non order dated 30th April, 2013 in CS(OS) No. 1457/2009 titled \nRanbaxy Laboratories Ltd. v. Intas Pharmaceuticals Ltd. and \nagainst which no appeal is stated to have been preferred, holding \nthat framing of issues is the duty of the Court and rejection of an \nearlier prayer does not debar a fresh prayer for framing an issue \nif it arises from the pleadings and ought to have been framed \nand has mistakenly not been framed. It is argued that the Court, \nat the time of framing of issues on 21st March, 2016, has not \napplied its mind and not refused to frame the issue about \ninvalidity. It is thus contended that the plaintiff can apply for \nframing of additional issue. \n13. \nI tend to agree with the counsel for plaintiff. The Code of \nCivil Procedure, 1908 (CPC), vide Order XIV Rule 5 empowers \nthe Court to, at any time before passing a decree, amend the \nissues or frame additional issues and provides that all such \namendments or additional issues as may be necessary for \ndetermining the maters in controversy between the parties shall \nbe so made or framed. Thus, merely because at the time of \nframing of issues, an issue though arising from pleadings, has \nnot been pressed and/or framed would not stop a subsequent \napplication. The position may be different where an issue is \npressed and not framed by a speaking order. In such case, the \nbar of res judicata, also applicable at successive stages of same \nproceeding, may come in way of an application under Order XIV \nRule 5 CPC. However, in the present case, a perusal of order \ndated 21st March, 2016, when issues were framed, does not show \nany such thing.”  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.12.2022 12:03:26\nSignature Not Verified",
          "pdf_source": "2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf",
          "nodes": []
        },
        {
          "title": "Page 7",
          "node_id": "0009",
          "start_index": 7,
          "end_index": 7,
          "summary": "**Case Summary: SANA HERBALS PVT LTD VS. MOHSIN DEHLVI**\n\nSource: **2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf**, 2022/DHC/005678\n\n**Key Points:**\n\n* The defendant (MOHSIN DEHLVI) withdrew an application under Section 124 of the Trade Marks Act, 1999.\n* The court gave liberty to the defendant to apply for framing additional issues regarding invalidity of the plaintiff's trademarks.\n* The defendant raised three main contentions in their written statement:\n\t+ The plaintiff company's existence dates back to 21st October, 1997, whereas the defendant has been using the trademark \"DEHLVI\" since 1995.\n\t+ The Assignment Deed dated 19th September, 1999 is invalid and void ab initio.\n\t+ The plaintiff's registered trademarks are liable to be cancelled due to false user.\n\n**Proceedings:**\n\n* CS(COMM) 813/2016 was heard on December 12, 2022, and judgment delivered on December 20, 2022.\n* The court is now examining whether the defendant has made necessary averments regarding invalidity of the plaintiff's trademarks.",
          "content": "2022/DHC/005678 \n \nCS(COMM) 813/2016 \n \n \n \n \n \n                       Page 7 of 10 \n \n9. \nThe facts in Abbott Healthcare (supra) are similar to that of the \npresent case. In the said case, the Court dismissed the Section 124 \napplication as no issue had been framed with regard to invalidity of the \ntrademark. In the present case also, no issue was framed by the Court with \nregard to invalidity of the registrations of the plaintiff’s marks and the \ndefendant withdrew the application filed under Section 124 of the Trade \nMarks Act, 1999. However, like in Abbott Healthcare (supra), as per the \norder dated 19th September, 2022 in C.O. (COMM.IPD-TM) 100/2022, \nliberty was given to the defendant herein to apply for framing of additional \nissues.  \n10. \nTherefore, what has to be examined is whether the defendant has \nmade the necessary averments in the written statement with regard to the \ninvalidity of the plaintiff’s trademarks so as to frame an issue in this regard. \n11. \nA perusal of the written statement filed on behalf of the defendant \nshows that defendant has pleaded that; (i) the plaintiff company came into \nexistence only on 21st October, 1997, whereas the defendant has been using \nthe trademark “DEHLVI” since 1995 (page 17 of the written statement); (ii) \nthe plaintiff claims rights in the trademark “DEHLVI” only on the basis of \nthe Assignment Deed dated 19th September, 1999, which is invalid and void \nab initio (pages 12 and 17 of the written statement); and, (iii) the registration \nobtained by the plaintiff is on the basis of false user and therefore, the \nregistered trademarks of the plaintiff are liable to be cancelled and pending \nregistration applications liable to be refused (paragraph 24, page 22 of the \nwritten statement). \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.12.2022 12:03:26\nSignature Not Verified",
          "pdf_source": "2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf",
          "nodes": []
        },
        {
          "title": "Page 8",
          "node_id": "0010",
          "start_index": 8,
          "end_index": 8,
          "summary": "Here is a summary of page 8 from the PDF:\n\n**Case Information**\n\n* Case Number: CS(COMM) 813/2016\n* Year of Judgment: 2022\n* Court: High Court of Delhi at New Delhi\n\n**Judgment Date**: 20th December, 2022\n\n**Key Points**\n\n* The court notes that the defendant has made necessary pleadings regarding:\n\t+ Invalidity of the Assignment Deed dated 19th September, 1999\n\t+ Invalidity of the trademark registrations granted in favour of the plaintiff\n* These are material propositions of fact and the court concludes that an issue should have been framed regarding these points.\n* The court references Order XIV Rule 1 of the CPC, which requires framing of issues when a material proposition of fact or law is affirmed by one party and denied by the other.\n\n**PDF Source**: SANA HERBALS PVT LTD VS. MOHSIN DEHLVI (2022/DHC/005678), PDF file: 2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf",
          "content": "2022/DHC/005678 \n \nCS(COMM) 813/2016 \n \n \n \n \n \n                       Page 8 of 10 \n \n12. \nA holistic reading of the written statement leads me to conclude that \nthe defendant has made necessary pleadings with regard to (i) invalidity of \nthe Assignment Deed dated 19th September, 1999; and (ii) the invalidity of \nthe trademark registrations granted in favour of the plaintiff. These are \nmaterial propositions of fact in terms of Order XIV Rule 1 of the CPC and \ntherefore, an issue ought to have been framed with regard to the same. \n13. \nIt is the settled position of law that it is the obligation of the Court to \nframe issues. In this regard reference may be made to paragraph 7 of the S. \nSurjit Singh Sahni (supra): \n“7. \nA perusal of the several provisions contained in Order 14 \nof the CPC would be apposite. An issue arises when a material \nproposition of fact or law is affirmed by one party and denied by \nthe other. Every such proposition shall form the subject of a \ndistinct issue. Primarily it is the obligation of the Court to frame \nthe issues. Failure on the part of the Court may be remedied by \neither party inviting attention of the Court to the need of framing \nsuch an issue either by participating in the process of settlement \nof issues or by moving an application under Order 14 Rule 5 of \nthe CPC. It is obligatory on the part of the Court to frame an \nissue once it is satisfied that an issue which should have been \nframed was not framed. If the trial court fails in framing an \nissue or fails to remedy its earlier failure then even an appellate \ncourt is vested with power of framing an issue under Rule 25 of \nOrder 41 of the CPC.” \n[emphasis supplied] \n14. \nIn light of the dicta above, even if the counsel for the defendant did \nnot press for framing of the issues sought to be framed now, it would not \nmean that the Court cannot, at a subsequent stage, frame such issues if they \nemerge from the pleadings in the suit. The language of Order XIV Rule 5 of \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.12.2022 12:03:26\nSignature Not Verified",
          "pdf_source": "2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0014",
      "start_index": 9,
      "end_index": 10,
      "summary": "**Source:** SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf (PDF)\n\n**High Court of Delhi: Case No. CS(COMM) 813/2016**\n\n**Judgment Delivered on:** December 20, 2022\n\n**Parties:**\n\n1. **Sana Herbals Pvt Ltd (Plaintiff)** - represented by Mr. M.K. Miglani\n2. **Mohsin Dehlvi (Defendant)** - represented by Dr. Farrukh Khan and others\n\n**Case Summary:**\n\nThe High Court of Delhi allowed an application to frame additional issues in a trademark infringement case. The defendant had sought to add two new issues to the suit: (i) whether the plaintiff's trademarks were invalid, and (ii) whether an assignment deed was legally valid.\n\n**Arguments and Decisions:**\n\n* The court noted that the Civil Procedure Code (CPC) allows for amendments or framing of additional issues at any time before the final decree.\n* Citing Teva Pharmaceutical Industries Ltd. v. Natco Pharma Limited, the court held that a litigant should not suffer due to acts of their advocate.\n* The court also considered that with the abolition of the Intellectual Property Appellate Board (IPAB), civil suits are no longer stayed for rectification applications.\n\n**Additional Issues Framed:**\n\n1. Whether the registration of trademarks \"Dehlvi\" is invalid and liable to be cancelled?\n2. Whether the alleged Assignment Deed dated September 19, 1999 is a legally valid instrument?\n\n**Next Hearing:** The matter will be listed before the Joint Registrar on February 6, 2023.\n\nThis summary provides an overview of the legal proceedings, facts, arguments, decisions, parties, dates, and amounts relevant to the case.",
      "pdf_source": "2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf",
      "nodes": [
        {
          "title": "Page 9",
          "node_id": "0012",
          "start_index": 9,
          "end_index": 9,
          "summary": "Here is a summary of page 9 from the PDF \"SANA HERBALS PVT LTD VS. MOHSIN DELHI VI\" (2022/DHC/005678):\n\nThe Court notes that Section 151 of the Civil Procedure Code (CPC) empowers it to amend the issues framed or frame additional issues at any time before passing a final decree.\n\nRegarding the defendant's failure to press for framing additional issues, the Court cites Teva Pharmaceutical Industries Ltd. v. Natco Pharma Limited (2014) and Abbott Healthcare (supra), stating that a litigant should not suffer due to their counsel's actions.\n\nThe Court also distinguishes the present case from cases relied upon by the plaintiff, finding them to be in different factual contexts.\n\nMoreover, with the abolition of the Intellectual Property Appellate Board (IPAB) under the Tribunals Reforms Act, 2021, the civil suit is not liable to be stayed if an issue related to trademark invalidity is framed. Instead, rectification applications can be clubbed and tried along with the civil suit.\n\nSource: PDF \"SANA HERBALS PVT LTD VS. MOHSIN DELHI VI\" (2022/DHC/005678), specifically page 9 of 10.",
          "content": "2022/DHC/005678 \n \nCS(COMM) 813/2016 \n \n \n \n \n \n                       Page 9 of 10 \n \nthe CPC is very wide and empowers the Court to amend the issues so \nframed or frame additional issues at any time before passing of the final \ndecree. \n15. \nIn any event, if the counsel for the defendant did not press for framing \nof additional issues that are subject matter of the present application and also \ndid not press the application under Section 124 of the Trade Marks Act, the \ndefendant cannot be made to suffer. It has been held in Teva \nPharmaceutical Industries Ltd. & Ors. v. Natco Pharma Limited, (2014) \n210 DLT 591 (DB), which has been followed in Abbott Healthcare (supra) \nthat a litigant ought not to suffer on account of acts of his advocate. \n16. \nThe judgments relied upon by counsel for the plaintiff was in an \nentirely different factual context and therefore, would not be applicable to \nthe facts and circumstances of the present case. \n17. \nThere is another aspect of the matter. In the earlier regime, upon an \nissue being framed with regard to invalidity of a trademark, proceedings in \nthe civil suit were stayed in order that for the statutory authority i.e. IPAB to \ndecide. With the coming into effect of the Tribunals Reforms Act, 2021, and \nthe consequent abolition of the IPAB, this situation does not exist anymore. \nTherefore, even if an issue with regard to invalidity of a trademark is framed \nby the civil court and rectification applications are filed by a litigant, the \ncivil suit is not liable to be stayed. The rectification petitions/applications \ncan be clubbed and tried along with the civil suit. Therefore, no prejudice \nwould be caused to the plaintiff if the additional issues, as sought to be \nframed by way of the present application, are framed. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.12.2022 12:03:26\nSignature Not Verified",
          "pdf_source": "2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf",
          "nodes": []
        },
        {
          "title": "Page 10",
          "node_id": "0013",
          "start_index": 10,
          "end_index": 10,
          "summary": "Here are the key points from page 10 of the provided PDF (Source: SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf):\n\n**Judgment on Additional Issues**\n\n* The court allows the present application and frames two additional issues:\n\t1. Whether the registration of trademarks with the name \"Dehlvi\" in favor of the plaintiff is invalid and based on false user?\n\t2. Whether the alleged Assignment Deed dated 19th September, 1999 is a legally valid instrument?\n\n**Proceedings**\n\n* The matter is listed before the Joint Registrar on 6th February, 2023.\n* Judgment reserved on 12th December, 2022 and delivered on 20th December, 2022.\n\n**Parties and Counsel**\n\n* Plaintiff: SANA HERBALS PVT LTD represented by Mr. M.K. Miglani, Advocate\n* Defendant: MOHSIN DEHLVI represented by Dr. Farrukh Khan, Ms. Ridhima Goyal, and Ms. Ishita.\n\nNote: These are the key points and do not constitute a detailed account of the entire case.",
          "content": "2022/DHC/005678 \n \nCS(COMM) 813/2016 \n \n \n \n \n \n                       Page 10 of 10 \n \n18. \nAccordingly, the present application is allowed and the following \nadditional issues are framed: \nI. \nWhether the registration of the trademarks with the name and style of \n\"Dehlvi\", either independently or as supporting word, as mentioned in \nparagraph 12 of the plaint, in favour of the Plaintiff, are invalid and \nbased on false user and thus, liable to be cancelled / removed? OPD \nII. \nWhether the alleged Assignment Deed dated 19th September, 1999 is \na legally valid instrument? OPD \nCS(COMM) 813/2016 \n19. \nList before the Joint Registrar on 6th February, 2023. \n \n \n \n \n \n \n \n \n \nAMIT BANSAL, J. \nDECEMBER 20, 2022 \ndk/sr \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.12.2022 12:03:26\nSignature Not Verified",
          "pdf_source": "2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-16T12:20:51.669367",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}