{
  "doc_name": "20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT",
  "pdf_source": "20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf",
  "metadata": {
    "document_name": "20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT",
    "source_pdf": "20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf",
    "judges": [
      "AMIT BANSAL"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "864/2022",
      "864/2022",
      "864/2022",
      "864/2022",
      "864/2022",
      "864/2022",
      "864/2022",
      "864/2022",
      "864/2022",
      "864/2022",
      "864/2022",
      "864/2022",
      "864/2022",
      "20992/2022",
      "1139/2023",
      "2624/2023"
    ],
    "dhc_numbers": [
      "2023/DHC/001280",
      "2023/DHC/001280",
      "2023/DHC/001280",
      "2023/DHC/001280",
      "2023/DHC/001280",
      "2023/DHC/001280",
      "2023/DHC/001280",
      "2023/DHC/001280",
      "2023/DHC/001280",
      "2023/DHC/001280",
      "2023/DHC/001280"
    ],
    "ia_numbers": [],
    "decision_date": "20 February, 2023",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [],
    "defendants": [],
    "appellants": [],
    "respondents": [],
    "plaintiff_advocates": [],
    "defendant_advocates": [],
    "appellant_advocates": [],
    "respondent_advocates": [],
    "damages_claimed": "339,00,00,000",
    "damages_awarded": null,
    "key_issues": [
      "Here are the main legal issues extracted from the document:",
      "* The plaintiff's trademark registration is valid and subsistent.",
      "* The plaintiff has established goodwill in its brand/trade mark \"PRESTIGE\" over the years.",
      "* The defendant's use of the word \"Prestige\" for their products may be considered as passing off.",
      "* Whether the defendant's trademark application dated 2nd November, 2018 is bona fide or not.",
      "* Whether the defendant has any rights to use the word \"Prestige\" given its similarity with the plaintiff's registered mark.",
      "* The plaintiff's sales turnover and advertising expenses are relevant evidence of its rights in the trade mark.",
      "* The defendant's intention behind filing the trademark application, whether to deceive or ride on the plaintiff's goodwill.",
      "* Whether there is any confusion among customers due to similar trade marks being used by different parties.",
      "* Jurisdiction under Order XXXIX Rules 1 and 2 of the Code of Civil Procedure, 1908 (CPC) in applying for interim relief."
    ],
    "decision_summary": "**Background:**\n\nThe case centers around a trademark dispute between TTK Prestige Ltd. (the plaintiff) and K K and Company Delhi Pvt. Ltd. (defendant no. 1), along with its sister concerns defendants no. 2 and 3.\n\n**Legal Issues:**\n\nThe plaintiff has filed a lawsuit against the defendants, seeking a decree of permanent injunction and passing off under Order XXXIX Rules 1 and 2 of the Code of Civil Procedure, 1908 (CPC). The primary legal issue revolves around protecting the trademark \"PRESTIGE\" registered in various classes for house marks since 1955 and preventing the defendant no. 1 from using a similar impugned trademark.\n\n**Arguments:**\n\nThe plaintiff's arguments highlight the following points:\n\n*   TTK Prestige Ltd. has been using the trademark \"PRESTIGE\" since 1955, with extensive registration in various classes.\n*   The company has invested heavily in promoting its products under this brand name.\n*   Defendant no. 1 filed a trademark application on November 2, 2018, for a device mark similar to the plaintiff's trademark. This act led to an opposition from TTK Prestige Ltd., which revealed that defendant no. 1 had been selling \"gas stoves\" under this logo in collaboration with defendants no. 2 and 3.\n*   The impugned trademark was registered on January 1, 1981, but the company failed to use it continuously and without interruption until the filing of the suit.\n\n**Court Findings:**\n\nThe High Court of Delhi at New Delhi (Amit Bansal, J) considered the following findings:\n\n*   TTK Prestige Ltd.'s trademark \"PRESTIGE\" has been validly registered in various classes.\n*   The company's sales turnover and advertising expenses demonstrate its genuine use of this brand name over time.\n*   Defendant no. 1's trademark application was filed on November 2, 2018, which is considered bad faith due to the non-user of the mark.",
    "legal_precedents": [
      "Veerumal Praveen \nKumar Needle Industries",
      "Amaravathi Enterprises Karaikudi \nChettinadu",
      "United Brothers Navin Kumar"
    ],
    "full_text": "\n--- PAGE 1 ---\n \n2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 1 of 11 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n \n% \n \n \n \n \nDate of Decision : 20th February, 2023 \n \n+  \n \n \n \nCS(COMM) 864/2022 \n \n \nTTK PRESTIGE LTD \n \n \n \n \n..... Plaintiff \nThrough: \nMr.Hemant Singh, Ms.Mamta Rani \nJha, \nMr.Manish \nKumar \nMishra, \nMs.Akansha \nSingh, \nMr.Srinivas \nVenkat \nRangan \nand \nMs.Tarushi \nAgarwal, Advocates. \n \n \n \n \nversus \n \n \nK K AND COMPANY DELHI PVT  \nLTD & ORS. \n \n \n \n \n \n..... Defendants \nThrough: \nMr.Sanjay Kumar, Advocate for D-1 \nand D-2. \nMr.Mukesh Thakur and Mr.Dhirendra \nSingh, Advocates for D-3. \n \nCORAM: \n \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nAMIT BANSAL, J. (Oral) \n \n \n \n \n \nI.A. 20992/2022 (O-XXXIX R-1 & 2 of CPC) \n1. \nBy way of the present judgment, I shall decide the application filed on \nbehalf of the plaintiff under Order XXXIX Rules 1 and 2 of the Code of \nCivil Procedure, 1908 (CPC). \n2. \nBriefly, the case set up in the plaint is that the plaintiff is engaged in \nthe business of manufacturing, marketing and sale of kitchen home \nappliances, including „pressure cookers‟ and „gas stoves‟, both electric and \nnon-electric, non-stick cookware, induction cook-tops, mixer grinders, \nchimneys etc., under the brand/trade mark „PRESTIGE‟ since 1955, which \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified\n\n--- PAGE 2 ---\n \n2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 2 of 11 \n \nis a house mark of the plaintiff. All the plaintiff‟s products are sold under its \nhouse mark „PRESTIGE‟. \n3. \nPlaintiff also has several registrations of the trademark „PRESTIGE‟ \nin various Classes, details of which are given in paragraph 7 of the plaint. \nThe earliest registration of the trademark „PRESTIGE‟ (word per se) in \nClasses 8 and 21 dates back to 14th December, 1949. The trademark \n„PRESTIGE‟ (word per se) was registered in favour of the plaintiff in Class \n11 on 16th June, 1981 in respect of „installations for cooking‟ on a „proposed \nto be used basis‟. Subsequently, the trademark „PRESTIGE‟ (word per se) \nwas registered in favour of the plaintiff on 23rd September, 1999 specifically \nin respect of „gas stoves‟ on a „proposed to be used basis‟. All the aforesaid \ntrademark registrations are valid and subsistent.  \n4. \nThe plaintiff has also filed its sales turnover in respect of its products \nunder the trademark „PRESTIGE‟ from the financial year 2007-08 to 2020-\n21. The turnover of the plaintiff in the year 2007-08 was around \nRs.339,00,00,000/-, whereas the turnover in the financial year 2020-21 was \naround Rs. 2,033,00,00,000. The plaintiff has also provided the advertising \nand promotional expenses incurred by plaintiff in respect of its trademark \n„PRESTIGE'. \nIn \nthe \nyear \n2007-08, \nthe \nplaintiff \nspent \naround \nRs.24,00,00,000/- towards promotional expenses and in the year 2020-21 the \nplaintiff spent around Rs.98,00,00,000.  \n5. \nThe \nplaintiff \noperates \nwebsites, \n„http://www.ttkprestige.com/‟, \n„https://shop.ttkprestige.com/‟ and „http://www.prestigexclusive.in‟, which \nshowcases the plaintiff‟s goods under the said mark. The plaintiff also has \nits presence on various e-commerce platforms. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified\n\n--- PAGE 3 ---\n \n2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 3 of 11 \n \n6. \nThe defendant no.1 is engaged in the business of manufacturing and \nsale of „gas stoves‟ and its component parts. It is averred in the plaint that \nthe defendant no.2 and 3 are sister concerns of the defendant no.1.  \n7. \nIn the third week of August 2022, the plaintiff came across the \ntrademark application dated 2nd November, 2018 filed on behalf of the \ndefendant no.1 for the registration of the device mark \n \n(hereinafter referred to as 'impugned trademark'). The plaintiff opposed the \nregistration of the aforesaid mark by filing opposition on 18th August, 2022. \nThe plaintiff‟s trademark „PRESTIGE‟ in Class 11 was cited as a conflicting \nmark in the examination report of the Trade Marks Registry. Thereafter, the \nplaintiff carried out an investigation in which it was revealed that the \ndefendant no.1 has been selling „gas stoves‟ in collusion with the defendants \nno.2 and 3 under the impugned trademark in bulk and on order basis only. \n8. \nAccordingly, the present suit was filed seeking a decree of permanent \ninjunction, passing off along with other ancillary reliefs.  \n9. \nThe defence set up by the defendant no.1 in its written statement is \nthat the said defendant no.1 has been using the impugned trademark since 1st \nJanuary, 1981. The aforesaid date finds mention in the trademark \nregistration application filed on behalf of the defendant no.1 on 1st \nNovember 2018. Therefore, it is claimed that the defendant no.1 is a prior \nuser of the impugned trademark in respect of „gas stoves‟. The plaintiff filed \nits trademark application for the word mark „PRESTIGE‟ on 16th June, 1981 \non a „proposed to be used basis‟. The plaintiff was aware of the user of the \ntrademark „PRESTIGE‟ by the defendant no.1 since 1981.  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified\n\n--- PAGE 4 ---\n \n2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 4 of 11 \n \n10. \nIn order to show its prior user counsel for the defendant no.1 has \nplaced reliance on: \ni. \nThe certificate of registration granted in favour of the defendant no.1 \nas a Small Scale Industries unit on 21st December, 1982. The \napplication was filed on 16th August, 1980.  \nii. \nThe classification list of excisable goods dated 8th May, 1985 granted \nin favour of the defendant no.1 wherein the trademark „PRESTIGE‟ \nhas been mentioned.  \niii. \nThe Bureau of Indian Standards (BIS) license granted in favour of the \ndefendant no.1 on 22nd April, 1982 in respect of the brand name \n„PRESTIGE‟.  \n11. \nCounsel appearing on behalf of the plaintiff makes the following \nsubmissions: \ni. \nEven though, the defendant no.1 claims to be the user of the \nimpugned trademark from 1st January 1981, the earliest invoice filed \nby the defendant no.1 is of 29th March, 1982. The registration of the \nplaintiff‟s mark „PRESTIGE‟ (word per se) under Class 11 in respect \nof „installations for cooking‟ on a “proposed to be used basis” is of \n16th June, 1981, which is prior to the user of the impugned trademark \nin respect of „gas stoves‟ by the defendant no.1. Therefore, the \ndefence under Section 34 of the Trade Marks Act, 1999 (hereinafter \nreferred to as „the Act‟) is not available to the defendant no.1.  \nii. \nWithout prejudice to the aforesaid, the defendant no.1 has failed to \nmake out a case of „continuous user‟ as envisaged under Section 34 of \nthe Act. The defendant no.1 has placed on record only three invoices \nshowing sales of goods bearing the impugned trademark, which are of \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified\n\n--- PAGE 5 ---\n \n2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 5 of 11 \n \nthe year 1982. Reliance in this regard is placed on the judgment of a \nDivision Bench of this Court in Pioneer Nuts and Bolts Pvt. Ltd. v. \nGoodwill Enterprises, 2009 SCC OnLine Del 2851. \niii. \nCounsel for the plaintiff has placed reliance on the various invoices \nshowing sale of „gas stoves‟ by the plaintiff with effect from 20th \nSeptember, 2007 (page no.260-300 of the plaintiff‟s document). \nAttention of the Court has been drawn to the advertisements taken out \nby the plaintiff in respect of gas stoves being sold under the trademark \n„PRESTIGE‟.  \niv. \nIn view of the tremendous goodwill and reputation attained by the \nusage of the trademark „PRESTIGE‟ in respect of „pressure cookers‟ \nas is evidenced by the sales turnover and promotional expenses, a case \nof passing off is also made out by the plaintiff. Reliance in this regard \nis placed on the judgment of United Brothers v. Navin Kumar, 2006 \nSCC OnLine Del 185. \n12. \nI have heard the counsel for the parties.  \n13. \nThough the defendant no.1 vehemently contends that it is a prior user \nof the trademark „PRESTIGE‟ and has been continuously using the said \ntrademark since the year 1981, the defendant no.1 has placed on record only \nthree invoices, all of the year 1982 in support of his contention.  \n14. \nA query was put to the counsel for the defendant no.1 that if the \ndefendant no.1 has been continuously using the aforesaid trademark since \n1981, why has the defendant no.1 placed on record only three invoices. It \nwas further put to the counsel for the defendant no.1 that whether any sales \nin respect of the trademark „PRESTIGE‟ had been made in the last ten years.  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified\n\n--- PAGE 6 ---\n \n2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 6 of 11 \n \n15. \nCounsel for the defendant no.1 submits that he may be given further \ntime so as to file documents to show the use of the trademark „PRESTIGE‟ \nbetween the year 1981 till the current date.  \n16. \nUnder Sub-Rule 7 of Order XI Rule 1 of the Code of Civil Procedure, \n1908 as applicable to commercial suits under the Commercial Courts Act, \n2015, a defendant has to file a list of all documents and photocopies of all \ndocuments, in its power, possession, control or custody, pertaining to the \nsuit, along with the written statement. Sub-Rule 10 of Order XI Rule 1 of the \nCPC further provides that the defendant cannot be allowed to rely on \ndocuments, which were in the defendant‟s power, possession, control or \ncustody and not disclosed along with the written statement, except with the \nleave of Court.  \n17. \nWhat emerges form a reading of the aforesaid provisions is that along \nwith the written statement the defendant has to file all documents in his \npower and possession and in support of his case. Additional documents can \nbe filed only with a leave of the Court and upon the defendant giving a \nreasonable explanation for not filing the same with the written statement. \nAdmittedly, no such application has been filed on behalf of the defendant \nno.1 seeking leave to file additional documents.  Therefore, no further time \ncan be granted to the defendant no.1 to place additional documents on \nrecord. As the defendant no.1 claims to be „continuous user‟ of the \ntrademark „PRESTIGE‟ from 1981, it should have filed documents \nevidencing such „continuous user‟. In the absence of any documents, the \nCourt shall presume that there was no „continuous user‟ by the defendant \nno.1. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified\n\n--- PAGE 7 ---\n \n2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 7 of 11 \n \n18. \nIn this regard reference may be made to the judgment of a Division \nBench of this Court in Pioneer Nuts (supra). In Pioneer Nuts (supra) relying \nupon the earlier judgments in Amaravathi Enterprises v. Karaikudi \nChettinadu, 2008 (36) PTC 688 (Madras)(DB) and in Veerumal Praveen \nKumar v. Needle Industries (India) Pvt. Ltd., 2001 (21) PTC 668 (Delhi), \nthe Division Bench has observed that a trader has to show that in relation to \nparticular goods, there is a goodwill connecting the trader with the goods on \naccount of the use of trademark. Holding that the defendant in the said case \nhad failed to place evidence on record to show that it had actually sold its \ngoods using the impugned marks other than two newspaper advertisements \nand a few trade enquiries, the Division Bench was pleased to grant interim \ninjunction in favour of the plaintiff. It was further observed that mere filing \nof a trademark application and giving an arbitrary date of user would not in \nitself constitute evidence of use from the said date.  \n19. \nThe aforesaid dicta is fully applicable to the facts of the present case. \nIn the present case, the trademark application has been filed on behalf of the \ndefendant no.1 only on 2nd November, 2018 claiming user from 1st January, \n1981. Other than three invoices of the year 1982 and few statutory \nregistrations in favour of the defendant no.1, no credible evidence in the \nform of invoices or advertisements or other material has been filed to show \nthat the defendant no.1 has been continuously using the impugned trademark \nso as to constitute any goodwill or reputation in its favour. Accordingly, I \nam of the view that the defendant no.1 has at best shown sporadic use of the \nimpugned trademark, which would not qualify it as a „continuous user‟ in \nterms of section 34 of the Act.  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified\n\n--- PAGE 8 ---\n \n2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 8 of 11 \n \n20. \nCounsel for the defendant no.1 vehemently contends that the \ntrademark application filed on behalf of the plaintiff is on a „proposed to be \nused‟ basis and the plaintiff has not filed any documents to show their user. \nTo claim the defence of section 34 of the Act, defendant no.1 has to show its \ncontinuous user prior to (a) user of the plaintiff or (b) date of registration in \nfavour of the plaintiff in respect of the said goods, whichever is earlier.  \n21. \nIn the present case, the date of registration in favour of the plaintiff in \nrespect of „installations for cooking‟ is of 16th June, 1981, which is the \nearlier date. The phrase „installations for cooking‟ would cover within its \nscope 'gas stoves‟. Three invoices filed on behalf of the defendant no.1 are \nadmittedly of a subsequent date. Defendant no.1 has also placed reliance on \nthe Small Scale Industries (SSI) certificate dated 21st December, 1982, BIS \nlicense dated 24th April, 1982 as well as excise documents dated 8th May, \n1985 in support of his submission that the defendant no.1 is a prior user of \nthe trademark „PRESTIGE‟. The SSI certificate in favour of the defendant \nno.1 does not mention the trademark „PRESTIGE‟. Both the BIS license as \nwell as excise documents are after the trademark „PRESTIGE‟ of the \nplaintiff was registered in Class 11. Therefore, the defendant no.1 has failed \nto establish use of the impugned trademark prior to the registration granted \nin favour of the plaintiff. Admittedly, no defence has been taken in the \nwritten statement with regard to validity of the registration granted in favour \nof the plaintiff.  \n22. \nOn the basis of the sales turnover as well as the promotional expenses \nplaced on record by the plaintiff, the plaintiff has also established, at a prima \nfacie stage, immense goodwill and reputation of its trademark „PRESTIGE‟, \nalbeit in respect of „pressure cookers‟. The plaintiff has been selling its \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified\n\n--- PAGE 9 ---\n \n2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 9 of 11 \n \nproducts under the trademark „PRESTIGE‟ since 1955 and the earliest \nregistration of the plaintiff‟s mark is of 14th December, 1949. Further, the \nplaintiff has placed on record various invoices from the year 2007 to show \nsales of „gas stoves‟ and advertisements of the year 2019 to show that it was \nin the business of selling „gas stoves‟ under the trademark „PRESTIGE‟. \nEven the defendant no.1 does not dispute the position that the plaintiff has \nbeen selling „pressure cookers‟ under the trademark „PRESTIGE‟ much \nbefore the defendant no.1. The only defence put forth by the defendant no.1 \nis that „pressure cookers‟ and „gas stoves‟ are different products and \ntherefore, there would be no confusion in the market.  \n23. \nIn this regard, counsel for the plaintiff has correctly placed reliance on \nthe judgment of a Co-ordinate Bench of this Court in United Brothers \n(supra), which dealt with the passing off claim in respect of the same \nproducts that are subject matter of the present suit viz. „LPG stoves‟ and \n„pressure cookers‟ being sold under the same trademark, „United‟. While \ngranting injunction in favour of the plaintiff, the Co-ordinate Bench \nobserved that the goods of the plaintiff as well as the defendants are both \nused as kitchen appliances and therefore, there would be confusion for the \nconsumer using both the products. Further, in view of the sales turnover as \nwell as advertising expenses filed by the plaintiff, the plaintiff was able to \nestablish that its trademark had acquired distinctiveness and goodwill in the \nmarket. Accordingly, it was observed that confusion is likely to be caused in \nthe mind of public and hence,  the interim injunction granted in favour of the \nplaintiff was confirmed.  \n24. \nThe aforesaid judgment is clearly applicable to the facts and \ncircumstances of the present case as the two goods in question in the said \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified\n\n--- PAGE 10 ---\n \n2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 10 of 11 \n \ncase and case at hand are identical. The use of the trademark „PRESTIGE‟ \nby the defendant no.1 in respect of „gas stoves‟ is likely to cause confusion \nin the market as the public at large would associate the said products of the \ndefendant no.1 with the plaintiff.  \n25. \nIn view of the discussion above, a prima facie case of infringement as \nwell as passing off is made out on behalf of the plaintiff. Balance of \nconvenience is also in favour of plaintiff and against the defendant no.1. The \nplaintiff shall continue to suffer irreparable injury to its goodwill and \nreputation if the defendant no.1 is permitted to manufacture and sell goods \nbearing the impugned trademark. \n26. \nAccordingly, the present application is allowed and the defendant \nno.1, its directors, sister concerns, assigns in business, distributors, stockists, \ndealers and agents are injuncted from manufacturing, selling, offering for \nsale, exporting, advertising in any manner including on the internet and \nwebsites, directly or indirectly dealing in gas stoves or in any kitchenware, \ncookware and/or cognate/allied/related goods under the mark \n \nor any other mark which is identical or deceptively similar to the plaintiff‟s \n„PRESTIGE‟ trademarks. \nCS(COMM) 864/2022 \n27. \nCounsels for the defendants no.2 and 3 submit that they are not the \nsister concerns of the defendant no.1 and do not manufacture or sell any \nproduct using the impugned trademark. \n28. \nHence, without going into the merits, the defendants no.2 and 3 have \nno objection if a decree of permanent injunction is passed against them \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified\n\n--- PAGE 11 ---\n \n2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 11 of 11 \n \nrestraining them from using the trademark „PRESTIGE‟ or any other mark \nwhich is identical or deceptively similar to that of the plaintiff. \n29. \nAccordingly, the suit is decreed against the defendants no.2 and 3 in \nterms of prayer clauses (i) and (ii) of the plaint.  \n30. \nCounsel for the plaintiff does not press for reliefs sought in prayer \nclauses (iii), (iv), (v), (vi) and (vii) against the defendants no.2 and 3.  \n31. \nLet the decree sheet be drawn up. \n32. \nThe suit shall continue to proceed against the defendant no.1. \n33. \nList before the Joint Registrar on 3rd May, 2023 for further \nproceedings. \nI.A. 1139/2023 (O-I R-10 of CPC) and I.A. 2624/2023 (O-I R-10 of CPC) \n34. \n In view of the above, the present applications have become \ninfructuous and are disposed of as such. \n \n \nAMIT BANSAL, J \nFEBRUARY 20, 2023 \nsr \n \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified\n"
  },
  "total_pages": 11,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "The document is a court judgment from the High Court of Delhi at New Delhi in the case of TTK Prestige Ltd vs K K And Company Delhi Pvt. Ltd & Ors (2023/DHC/001280).\n\n**Case Details:**\n\n* Case number: CS(COMM) 864/2022\n* Date of decision: 20th February, 2023\n* Presiding judge: HON'BLE MR. JUSTICE AMIT BANSAL\n\n**Parties:**\n\n* Plaintiff: TTK Prestige Ltd\n\t+ Represented by: Mr. Hemant Singh, Ms. Mamta Rani Jha, Mr. Manish Kumar Mishra, Ms. Akansha Singh, Mr. Srinivas Venkat Rangan, and Ms. Tarushi Agarwal, Advocates\n* Defendants:\n\t+ K K And Company Delhi Pvt. Ltd (D-1)\n\t\t- Represented by: Mr. Sanjay Kumar, Advocate\n\t+ Ors. (Defendants 2 and 3)\n\n**Facts and Arguments:**\n\n* TTK Prestige Ltd has been manufacturing kitchen home appliances under the brand/trade mark \"PRESTIGE\" since 1955.\n* The plaintiff has several trademark registrations for \"PRESTIGE\" in various classes, with the earliest registration dating back to 1949.\n* The plaintiff claims that it operates websites and e-commerce platforms showcasing its goods under the said mark.\n\n**Decision:**\n\n* The court will decide on an application filed by the plaintiff under Order XXXIX Rules 1 and 2 of the Code of Civil Procedure, 1908 (CPC).\n\n**Amounts MENTIONED:**\n\n* Plaintiff's sales turnover:\n\t+ Rs.339,00,00,000/- in financial year 2007-08\n\t+ Rs. 2,033,00,00,000/- in financial year 2020-21",
      "pdf_source": "20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "Here is a summary of page 1 from the provided PDF:\n\n**Case Details**\n\n* Case Number: CS(COMM) 864/2022\n* Date of Decision: 20th February, 2023\n* Court: High Court of Delhi at New Delhi\n\n**Parties Involved**\n\n* Plaintiff: TTK Prestige Ltd. (Represented by Mr. Hemant Singh, Ms. Mamta Rani Jha, and others)\n* Defendants:\n\t+ K K And Company Delhi Pvt Ltd (D-1) (represented by Mr. Sanjay Kumar)\n\t+ D-2 (represented by Mr. Sanjay Kumar)\n\t+ D-3 (represented by Mr. Mukesh Thakur and Mr. Dhirendra Singh)\n\n**Application**\n\n* The plaintiff has filed an application under Order XXXIX Rules 1 and 2 of the Code of Civil Procedure, 1908 (CPC) to decide on an interim application (I.A. 20992/2022).\n\n**Coram**\n\n* HON'BLE MR. JUSTICE AMIT BANSAL\n\n**Source**\n\nThe PDF is sourced from: \"20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT\" (Case Number: 2023/DHC/001280).",
          "content": "2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 1 of 11 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n \n% \n \n \n \n \nDate of Decision : 20th February, 2023 \n \n+  \n \n \n \nCS(COMM) 864/2022 \n \n \nTTK PRESTIGE LTD \n \n \n \n \n..... Plaintiff \nThrough: \nMr.Hemant Singh, Ms.Mamta Rani \nJha, \nMr.Manish \nKumar \nMishra, \nMs.Akansha \nSingh, \nMr.Srinivas \nVenkat \nRangan \nand \nMs.Tarushi \nAgarwal, Advocates. \n \n \n \n \nversus \n \n \nK K AND COMPANY DELHI PVT  \nLTD & ORS. \n \n \n \n \n \n..... Defendants \nThrough: \nMr.Sanjay Kumar, Advocate for D-1 \nand D-2. \nMr.Mukesh Thakur and Mr.Dhirendra \nSingh, Advocates for D-3. \n \nCORAM: \n \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nAMIT BANSAL, J. (Oral) \n \n \n \n \n \nI.A. 20992/2022 (O-XXXIX R-1 & 2 of CPC) \n1. \nBy way of the present judgment, I shall decide the application filed on \nbehalf of the plaintiff under Order XXXIX Rules 1 and 2 of the Code of \nCivil Procedure, 1908 (CPC). \n2. \nBriefly, the case set up in the plaint is that the plaintiff is engaged in \nthe business of manufacturing, marketing and sale of kitchen home \nappliances, including „pressure cookers‟ and „gas stoves‟, both electric and \nnon-electric, non-stick cookware, induction cook-tops, mixer grinders, \nchimneys etc., under the brand/trade mark „PRESTIGE‟ since 1955, which \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified",
          "pdf_source": "20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "Here is a summary of page 2 from PDF: \"20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf\"\n\n**Background**\n\nThe plaintiff, TTK Prestige Ltd., has a long-standing trademark registration for \"PRESTIGE\" in various classes.\n\n**Trademark Registration**\n\n* The trademark \"PRESTIGE\" was registered on 14th December, 1949, in Classes 8 and 21.\n* It was later registered in Class 11 on 16th June, 1981, specifically for \"installations for cooking\".\n* Another registration was made on 23rd September, 1999, in respect of \"gas stoves\".\n\n**Sales Turnover**\n\n* The plaintiff's sales turnover under the trademark \"PRESTIGE\" increased from Rs.339,00,00,000/- (2007-08) to Rs.2,033,00,00,000/- (2020-21).\n* Advertising and promotional expenses also increased from Rs.24,00,00,000/- (2007-08) to Rs.98,00,00,000/- (2020-21).\n\nSource: PDF \"20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf\"",
          "content": "2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 2 of 11 \n \nis a house mark of the plaintiff. All the plaintiff‟s products are sold under its \nhouse mark „PRESTIGE‟. \n3. \nPlaintiff also has several registrations of the trademark „PRESTIGE‟ \nin various Classes, details of which are given in paragraph 7 of the plaint. \nThe earliest registration of the trademark „PRESTIGE‟ (word per se) in \nClasses 8 and 21 dates back to 14th December, 1949. The trademark \n„PRESTIGE‟ (word per se) was registered in favour of the plaintiff in Class \n11 on 16th June, 1981 in respect of „installations for cooking‟ on a „proposed \nto be used basis‟. Subsequently, the trademark „PRESTIGE‟ (word per se) \nwas registered in favour of the plaintiff on 23rd September, 1999 specifically \nin respect of „gas stoves‟ on a „proposed to be used basis‟. All the aforesaid \ntrademark registrations are valid and subsistent.  \n4. \nThe plaintiff has also filed its sales turnover in respect of its products \nunder the trademark „PRESTIGE‟ from the financial year 2007-08 to 2020-\n21. The turnover of the plaintiff in the year 2007-08 was around \nRs.339,00,00,000/-, whereas the turnover in the financial year 2020-21 was \naround Rs. 2,033,00,00,000. The plaintiff has also provided the advertising \nand promotional expenses incurred by plaintiff in respect of its trademark \n„PRESTIGE'. \nIn \nthe \nyear \n2007-08, \nthe \nplaintiff \nspent \naround \nRs.24,00,00,000/- towards promotional expenses and in the year 2020-21 the \nplaintiff spent around Rs.98,00,00,000.  \n5. \nThe \nplaintiff \noperates \nwebsites, \n„http://www.ttkprestige.com/‟, \n„https://shop.ttkprestige.com/‟ and „http://www.prestigexclusive.in‟, which \nshowcases the plaintiff‟s goods under the said mark. The plaintiff also has \nits presence on various e-commerce platforms. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified",
          "pdf_source": "20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0007",
      "start_index": 3,
      "end_index": 5,
      "summary": "**Case Summary: TTK Prestige Ltd vs K K And Company Delhi Pvt (2023/DHC/001280)**\n\n* **Citation:** CS(COMM) 864/2022\n* **Date of Decision:** February 20, 2023\n* **Court:** High Court of Delhi at New Delhi\n\n**Background and Facts:**\n\nTTK Prestige Ltd. filed a lawsuit against K K And Company Delhi Pvt. over trademark infringement.\n\n* The plaintiff's trademark \"PRESTIGE\" was opposed by the defendant due to alleged similarity with their trademark application for the device mark (impugned trademark).\n* The plaintiff alleged that the defendants were using the impugned trademark in collusion, selling gas stoves under this mark.\n* The defendants claimed prior user of the impugned trademark since January 1, 1981.\n\n**Arguments and Submissions:**\n\n* Defendant No. 1 relied on:\n\t+ Registration as a Small Scale Industries unit (December 21, 1982)\n\t+ Classification list of excisable goods (May 8, 1985)\n\t+ Bureau of Indian Standards license (April 22, 1982)\n* Plaintiff argued that the defendant's earliest invoice is dated March 29, 1982, and their trademark registration was filed on June 16, 1981.\n* The plaintiff also claimed that the defendant failed to establish continuous user under Section 34 of the Trade Marks Act.\n\n**Decision Not Mentioned in Details**\n\n(No specific details about the decision are mentioned. The content seems truncated.)\n\n**PDF Source:** 20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf",
      "pdf_source": "20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "Here is a summary of page 3 from the provided PDF:\n\n**Case Details:** TTK Prestige Ltd vs. K K And Company Delhi Pvt. (2022)\n\n**Legal Facts:**\n\n* Defendant no.1 manufactures and sells gas stoves.\n* Defendants nos. 2 & 3 are sister concerns to defendant no.1.\n\n**Proceedings:**\n\n* Plaintiff opposed the registration of \"gas stove\" trademark by defendant no.1 due to conflict with their existing trademark \"PRESTIGE\".\n* Plaintiff conducted an investigation revealing that defendant no.1 sold gas stoves under the impugned trademark in bulk and on order basis.\n* Suit filed seeking permanent injunction, passing off alongside other reliefs.\n\n**Defense:**\n\n* Defendant no.1 claims usage of the impugned trademark since January 1981, prior to plaintiff's application.\n* Plaintiff's trademark \"PRESTIGE\" was applied for in June 1981 on a proposed-to-be-used basis.\n\n**Note:** This is based on information from page 3 of the PDF source: \"20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf\".",
          "content": "2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 3 of 11 \n \n6. \nThe defendant no.1 is engaged in the business of manufacturing and \nsale of „gas stoves‟ and its component parts. It is averred in the plaint that \nthe defendant no.2 and 3 are sister concerns of the defendant no.1.  \n7. \nIn the third week of August 2022, the plaintiff came across the \ntrademark application dated 2nd November, 2018 filed on behalf of the \ndefendant no.1 for the registration of the device mark \n \n(hereinafter referred to as 'impugned trademark'). The plaintiff opposed the \nregistration of the aforesaid mark by filing opposition on 18th August, 2022. \nThe plaintiff‟s trademark „PRESTIGE‟ in Class 11 was cited as a conflicting \nmark in the examination report of the Trade Marks Registry. Thereafter, the \nplaintiff carried out an investigation in which it was revealed that the \ndefendant no.1 has been selling „gas stoves‟ in collusion with the defendants \nno.2 and 3 under the impugned trademark in bulk and on order basis only. \n8. \nAccordingly, the present suit was filed seeking a decree of permanent \ninjunction, passing off along with other ancillary reliefs.  \n9. \nThe defence set up by the defendant no.1 in its written statement is \nthat the said defendant no.1 has been using the impugned trademark since 1st \nJanuary, 1981. The aforesaid date finds mention in the trademark \nregistration application filed on behalf of the defendant no.1 on 1st \nNovember 2018. Therefore, it is claimed that the defendant no.1 is a prior \nuser of the impugned trademark in respect of „gas stoves‟. The plaintiff filed \nits trademark application for the word mark „PRESTIGE‟ on 16th June, 1981 \non a „proposed to be used basis‟. The plaintiff was aware of the user of the \ntrademark „PRESTIGE‟ by the defendant no.1 since 1981.  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified",
          "pdf_source": "20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "**Summary of Page 4 from PDF: TTK Prestige Ltd vs K K And Company Delhi Pvt**\n\nThe plaintiff's counsel argues that defendant no.1 (K K And Company) cannot claim prior user status despite being registered as a Small Scale Industries unit in 1982 and obtaining a Bureau of Indian Standards (BIS) license in 1982.\n\nHowever, the plaintiff submits:\n\n* The earliest invoice by defendant no.1 is dated March 29, 1982, while the plaintiff's trademark registration for \"PRESTIGE\" under Class 11 for cooking installations was proposed on June 16, 1981.\n* Defendant no.1 has failed to make a case of continuous user as required under Section 34 of the Trade Marks Act, 1999, citing only three invoices.\n\nSource:  Page 4 from PDF: **20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT**\n\n**Case Details**: CS(COMM) 864/2022; High Court of Delhi at New Delhi; Date of Decision: February 20, 2023",
          "content": "2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 4 of 11 \n \n10. \nIn order to show its prior user counsel for the defendant no.1 has \nplaced reliance on: \ni. \nThe certificate of registration granted in favour of the defendant no.1 \nas a Small Scale Industries unit on 21st December, 1982. The \napplication was filed on 16th August, 1980.  \nii. \nThe classification list of excisable goods dated 8th May, 1985 granted \nin favour of the defendant no.1 wherein the trademark „PRESTIGE‟ \nhas been mentioned.  \niii. \nThe Bureau of Indian Standards (BIS) license granted in favour of the \ndefendant no.1 on 22nd April, 1982 in respect of the brand name \n„PRESTIGE‟.  \n11. \nCounsel appearing on behalf of the plaintiff makes the following \nsubmissions: \ni. \nEven though, the defendant no.1 claims to be the user of the \nimpugned trademark from 1st January 1981, the earliest invoice filed \nby the defendant no.1 is of 29th March, 1982. The registration of the \nplaintiff‟s mark „PRESTIGE‟ (word per se) under Class 11 in respect \nof „installations for cooking‟ on a “proposed to be used basis” is of \n16th June, 1981, which is prior to the user of the impugned trademark \nin respect of „gas stoves‟ by the defendant no.1. Therefore, the \ndefence under Section 34 of the Trade Marks Act, 1999 (hereinafter \nreferred to as „the Act‟) is not available to the defendant no.1.  \nii. \nWithout prejudice to the aforesaid, the defendant no.1 has failed to \nmake out a case of „continuous user‟ as envisaged under Section 34 of \nthe Act. The defendant no.1 has placed on record only three invoices \nshowing sales of goods bearing the impugned trademark, which are of \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified",
          "pdf_source": "20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf",
          "nodes": []
        },
        {
          "title": "Page 5",
          "node_id": "0006",
          "start_index": 5,
          "end_index": 5,
          "summary": "Here's a summary of page 5 from the PDF:\n\nThe court discusses the plaintiff's case against the defendant for trademark infringement. The counsel for the plaintiff relies on the following points:\n\n* A Division Bench judgment in Pioneer Nuts and Bolts Pvt. Ltd v. Goodwill Enterprises (2009) to establish that the plaintiff has a prior trademark right in \"Prestige\".\n* Invoices showing sale of gas stoves by the plaintiff with effect from September 20, 2007.\n* Advertisements taken out by the plaintiff for selling gas stoves under the trademark \"Prestige\".\n\nThe court also notes that:\n\n* The defendant's counsel claims that the defendant is a prior user of the trademark \"PRESTIGE\" since 1981 but only provides three invoices from 1982 to support this claim.\n* A query was put to the defendant's counsel why only three invoices were provided and whether any sales were made with the \"Prestige\" trademark in the last ten years.\n\nDocument source: [case number] CS(COMM) 864/2022, TTK Prestige Ltd v. K K And Company Delhi Pvt. (PDF hosted online).",
          "content": "2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 5 of 11 \n \nthe year 1982. Reliance in this regard is placed on the judgment of a \nDivision Bench of this Court in Pioneer Nuts and Bolts Pvt. Ltd. v. \nGoodwill Enterprises, 2009 SCC OnLine Del 2851. \niii. \nCounsel for the plaintiff has placed reliance on the various invoices \nshowing sale of „gas stoves‟ by the plaintiff with effect from 20th \nSeptember, 2007 (page no.260-300 of the plaintiff‟s document). \nAttention of the Court has been drawn to the advertisements taken out \nby the plaintiff in respect of gas stoves being sold under the trademark \n„PRESTIGE‟.  \niv. \nIn view of the tremendous goodwill and reputation attained by the \nusage of the trademark „PRESTIGE‟ in respect of „pressure cookers‟ \nas is evidenced by the sales turnover and promotional expenses, a case \nof passing off is also made out by the plaintiff. Reliance in this regard \nis placed on the judgment of United Brothers v. Navin Kumar, 2006 \nSCC OnLine Del 185. \n12. \nI have heard the counsel for the parties.  \n13. \nThough the defendant no.1 vehemently contends that it is a prior user \nof the trademark „PRESTIGE‟ and has been continuously using the said \ntrademark since the year 1981, the defendant no.1 has placed on record only \nthree invoices, all of the year 1982 in support of his contention.  \n14. \nA query was put to the counsel for the defendant no.1 that if the \ndefendant no.1 has been continuously using the aforesaid trademark since \n1981, why has the defendant no.1 placed on record only three invoices. It \nwas further put to the counsel for the defendant no.1 that whether any sales \nin respect of the trademark „PRESTIGE‟ had been made in the last ten years.  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified",
          "pdf_source": "20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0012",
      "start_index": 6,
      "end_index": 9,
      "summary": "**Case:** TTK Prestige Ltd vs. K K And Company Delhi Pvt\n\n**Court:** High Court of Delhi at New Delhi\n\n**Citation:** CS(COMM) 864/2022\n\nThe document outlines a legal dispute between TTK Prestige Ltd (plaintiff) and K K And Company Delhi Pvt (defendant) over trademark rights.\n\n**Key Facts:**\n\n* Defendant seeks additional time to submit documents showing continuous use of the mark \"PRESTIGE\" from 1981.\n* Plaintiff's counsel argue that defendant failed to provide all required documents with their written statement, as per Order XI Rule 1 of the Code of Civil Procedure (CPC).\n* Defendant claims continuous user since 1981 but lacks credible evidence, such as invoices or advertisements.\n\n**Arguments and Decisions:**\n\n* Court refuses to grant additional time for defendant to submit more documentation.\n* Plaintiff's arguments rely on Section 34 of the Trademarks Act, which requires proof of goodwill and reputation through continuous use.\n* Court cites earlier judgments (Pioneer Nuts and Amaravathi Enterprises) emphasizing the need for credible evidence to establish trademark rights.\n\n**Result:**\n\n* Defendant's claim to \"continuous user\" is deemed baseless without sufficient evidence.\n* Interim order likely in favor of plaintiff (TTK Prestige Ltd).\n\nSource: Section from PDF: 20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf",
      "pdf_source": "20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf",
      "nodes": [
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "**Summary of Page 6 from PDF:**\n\nSource: 20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf (CS(COMM) 864/2022)\n\n**Key Points:**\n\n* Defendant No.1's counsel seeks additional time to file documents showing use of trademark \"PRESTIGE\" between 1981 and the current date.\n* Sub-Rule 7 of Order XI Rule 1 of the Code of Civil Procedure, 1908 (CPC) requires defendants to file a list of all relevant documents with their written statement.\n* Sub-Rule 10 of Order XI Rule 1 CPC prohibits defendants from relying on undisclosed documents without Court permission.\n* No application was filed by Defendant No.1 to seek leave to file additional documents.\n* As no supporting documents were filed, the court will presume there was no \"continuous user\" by Defendant No.1.\n\n**Dates and Names:**\n\n* February 20th, 2023 (Date of Decision)\n* Amit Bansal (DHF Signature)\n\n**PDF Source:** 20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf",
          "content": "2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 6 of 11 \n \n15. \nCounsel for the defendant no.1 submits that he may be given further \ntime so as to file documents to show the use of the trademark „PRESTIGE‟ \nbetween the year 1981 till the current date.  \n16. \nUnder Sub-Rule 7 of Order XI Rule 1 of the Code of Civil Procedure, \n1908 as applicable to commercial suits under the Commercial Courts Act, \n2015, a defendant has to file a list of all documents and photocopies of all \ndocuments, in its power, possession, control or custody, pertaining to the \nsuit, along with the written statement. Sub-Rule 10 of Order XI Rule 1 of the \nCPC further provides that the defendant cannot be allowed to rely on \ndocuments, which were in the defendant‟s power, possession, control or \ncustody and not disclosed along with the written statement, except with the \nleave of Court.  \n17. \nWhat emerges form a reading of the aforesaid provisions is that along \nwith the written statement the defendant has to file all documents in his \npower and possession and in support of his case. Additional documents can \nbe filed only with a leave of the Court and upon the defendant giving a \nreasonable explanation for not filing the same with the written statement. \nAdmittedly, no such application has been filed on behalf of the defendant \nno.1 seeking leave to file additional documents.  Therefore, no further time \ncan be granted to the defendant no.1 to place additional documents on \nrecord. As the defendant no.1 claims to be „continuous user‟ of the \ntrademark „PRESTIGE‟ from 1981, it should have filed documents \nevidencing such „continuous user‟. In the absence of any documents, the \nCourt shall presume that there was no „continuous user‟ by the defendant \nno.1. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified",
          "pdf_source": "20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf",
          "nodes": []
        },
        {
          "title": "Page 7",
          "node_id": "0009",
          "start_index": 7,
          "end_index": 7,
          "summary": "Here is a summary of page 7 from the PDF document:\n\n**Case Details:**\n\n* Case No.: CS(COMM) 864/2022\n* Plaintiff: TTK Prestige Ltd., represented by Mr. Hemant Singh, Ms. Mamta Rani Jha, etc.\n* Defendant: K K And Company Delhi Pvt. Ltd.\n\n**Judgment Summary:**\n\nThe court refers to a Division Bench judgment in Pioneer Nuts (supra) and holds that the defendant has failed to provide credible evidence of continuous use of the trademark. The defendant had filed a trademark application claiming user from 1981, but only presented three invoices from 1982 and few statutory registrations. This is considered sporadic use, not qualifying as a \"continuous user\" under Section 34 of the Act.\n\n**Key Dates:**\n\n* 2nd November, 2018: Defendant No. 1 filed trademark application\n* 20th February, 2023: Judgment Date\n\n**Source:** PDF document titled \"20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT\"",
          "content": "2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 7 of 11 \n \n18. \nIn this regard reference may be made to the judgment of a Division \nBench of this Court in Pioneer Nuts (supra). In Pioneer Nuts (supra) relying \nupon the earlier judgments in Amaravathi Enterprises v. Karaikudi \nChettinadu, 2008 (36) PTC 688 (Madras)(DB) and in Veerumal Praveen \nKumar v. Needle Industries (India) Pvt. Ltd., 2001 (21) PTC 668 (Delhi), \nthe Division Bench has observed that a trader has to show that in relation to \nparticular goods, there is a goodwill connecting the trader with the goods on \naccount of the use of trademark. Holding that the defendant in the said case \nhad failed to place evidence on record to show that it had actually sold its \ngoods using the impugned marks other than two newspaper advertisements \nand a few trade enquiries, the Division Bench was pleased to grant interim \ninjunction in favour of the plaintiff. It was further observed that mere filing \nof a trademark application and giving an arbitrary date of user would not in \nitself constitute evidence of use from the said date.  \n19. \nThe aforesaid dicta is fully applicable to the facts of the present case. \nIn the present case, the trademark application has been filed on behalf of the \ndefendant no.1 only on 2nd November, 2018 claiming user from 1st January, \n1981. Other than three invoices of the year 1982 and few statutory \nregistrations in favour of the defendant no.1, no credible evidence in the \nform of invoices or advertisements or other material has been filed to show \nthat the defendant no.1 has been continuously using the impugned trademark \nso as to constitute any goodwill or reputation in its favour. Accordingly, I \nam of the view that the defendant no.1 has at best shown sporadic use of the \nimpugned trademark, which would not qualify it as a „continuous user‟ in \nterms of section 34 of the Act.  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified",
          "pdf_source": "20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf",
          "nodes": []
        },
        {
          "title": "Page 8",
          "node_id": "0010",
          "start_index": 8,
          "end_index": 8,
          "summary": "Here is a summary of page 8 from PDF: \"20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf\":\n\n**Key Points**\n\n1. Defendant no.1's counsel argues that plaintiff's trademark application is on a \"proposed to be used\" basis and lacks documents showing user.\n2. To claim section 34 defense, defendant must show continuous user prior to (a) plaintiff's user or (b) registration date in favor of the plaintiff.\n3. Plaintiff's trademark was registered on June 16, 1981, making it the earlier date.\n4. Defendant presented invoices, SSI certificate, BIS license, and excise documents dated after the plaintiff's trademark was registered.\n5. These documents do not establish prior use of the impugned trademark \"PRESTIGE\".\n6. Plaintiff has established prima facie goodwill and reputation for its trademark \"PRESTIGE\" through sales turnover and promotional expenses.\n\n**Important Dates**\n\n* June 16, 1981: Plaintiff's trademark registration date\n* December 21, 1982: Defendant's SSI certificate (without mention of the trademark)\n* April 24, 1982: BIS license for defendant (after plaintiff's registration)\n* May 8, 1985: Excise documents for defendant (after plaintiff's registration)\n\n**Important Names**\n\n* Plaintiff: TTK PRESTIGE LTD\n* Defendant no.1:",
          "content": "2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 8 of 11 \n \n20. \nCounsel for the defendant no.1 vehemently contends that the \ntrademark application filed on behalf of the plaintiff is on a „proposed to be \nused‟ basis and the plaintiff has not filed any documents to show their user. \nTo claim the defence of section 34 of the Act, defendant no.1 has to show its \ncontinuous user prior to (a) user of the plaintiff or (b) date of registration in \nfavour of the plaintiff in respect of the said goods, whichever is earlier.  \n21. \nIn the present case, the date of registration in favour of the plaintiff in \nrespect of „installations for cooking‟ is of 16th June, 1981, which is the \nearlier date. The phrase „installations for cooking‟ would cover within its \nscope 'gas stoves‟. Three invoices filed on behalf of the defendant no.1 are \nadmittedly of a subsequent date. Defendant no.1 has also placed reliance on \nthe Small Scale Industries (SSI) certificate dated 21st December, 1982, BIS \nlicense dated 24th April, 1982 as well as excise documents dated 8th May, \n1985 in support of his submission that the defendant no.1 is a prior user of \nthe trademark „PRESTIGE‟. The SSI certificate in favour of the defendant \nno.1 does not mention the trademark „PRESTIGE‟. Both the BIS license as \nwell as excise documents are after the trademark „PRESTIGE‟ of the \nplaintiff was registered in Class 11. Therefore, the defendant no.1 has failed \nto establish use of the impugned trademark prior to the registration granted \nin favour of the plaintiff. Admittedly, no defence has been taken in the \nwritten statement with regard to validity of the registration granted in favour \nof the plaintiff.  \n22. \nOn the basis of the sales turnover as well as the promotional expenses \nplaced on record by the plaintiff, the plaintiff has also established, at a prima \nfacie stage, immense goodwill and reputation of its trademark „PRESTIGE‟, \nalbeit in respect of „pressure cookers‟. The plaintiff has been selling its \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified",
          "pdf_source": "20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf",
          "nodes": []
        },
        {
          "title": "Page 9",
          "node_id": "0011",
          "start_index": 9,
          "end_index": 9,
          "summary": "Here is a summary of page 9 from PDF 20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT (2023/DHC/001280):\n\nThe plaintiff, TTK Prestige Ltd, has been selling products under the trademark \"PRESTIGE\" since 1955, with an earliest registration date of December 14, 1949. The plaintiff has submitted invoices from 2007 to show sales of \"gas stoves\" and advertisements from 2019 to demonstrate its business in selling \"gas stoves\" under the trademark \"PRESTIGE\". The defendant no.1 does not dispute that the plaintiff was selling \"pressure cookers\" under the same trademark before them.\n\nThe defense argued by defendant no.1 is that \"pressure cookers\" and \"gas stoves\" are different products, making confusion unlikely in the market. However, the plaintiff's counsel relies on a Co-ordinate Bench judgment (United Brothers) where the court granted an injunction in favor of the plaintiff due to customer confusion between similar kitchen appliances sold under the same trademark \"United\".\n\nThe Co-ordinate Bench observation is applicable to this case, as both goods are used as kitchen appliances, likely causing confusion among customers. The judgment supports granting an interim injunction in favor of the plaintiff.\n\nSource: PDF 20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT (2023/DHC/001280) - CS",
          "content": "2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 9 of 11 \n \nproducts under the trademark „PRESTIGE‟ since 1955 and the earliest \nregistration of the plaintiff‟s mark is of 14th December, 1949. Further, the \nplaintiff has placed on record various invoices from the year 2007 to show \nsales of „gas stoves‟ and advertisements of the year 2019 to show that it was \nin the business of selling „gas stoves‟ under the trademark „PRESTIGE‟. \nEven the defendant no.1 does not dispute the position that the plaintiff has \nbeen selling „pressure cookers‟ under the trademark „PRESTIGE‟ much \nbefore the defendant no.1. The only defence put forth by the defendant no.1 \nis that „pressure cookers‟ and „gas stoves‟ are different products and \ntherefore, there would be no confusion in the market.  \n23. \nIn this regard, counsel for the plaintiff has correctly placed reliance on \nthe judgment of a Co-ordinate Bench of this Court in United Brothers \n(supra), which dealt with the passing off claim in respect of the same \nproducts that are subject matter of the present suit viz. „LPG stoves‟ and \n„pressure cookers‟ being sold under the same trademark, „United‟. While \ngranting injunction in favour of the plaintiff, the Co-ordinate Bench \nobserved that the goods of the plaintiff as well as the defendants are both \nused as kitchen appliances and therefore, there would be confusion for the \nconsumer using both the products. Further, in view of the sales turnover as \nwell as advertising expenses filed by the plaintiff, the plaintiff was able to \nestablish that its trademark had acquired distinctiveness and goodwill in the \nmarket. Accordingly, it was observed that confusion is likely to be caused in \nthe mind of public and hence,  the interim injunction granted in favour of the \nplaintiff was confirmed.  \n24. \nThe aforesaid judgment is clearly applicable to the facts and \ncircumstances of the present case as the two goods in question in the said \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified",
          "pdf_source": "20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0015",
      "start_index": 10,
      "end_index": 11,
      "summary": "**Case Summary**\n\n**PDF Source:** TTK PRESTIGE LTD Vs K K AND COMPANY DELHI PVT (2023/DHC/001280)\n\n**Court Decision:**\n\nOn February 20, 2023, the Delhi High Court delivered a judgment in the case of TTK Prestige Ltd. vs. K K and Company Delhi Pvt.\n\n**Facts and Arguments:**\n\n* The plaintiff, TTK Prestige Ltd., alleged that the defendant no.1 (K K and Company Delhi Pvt.) was using its trademark \"PRESTIGE\" for gas stoves, causing confusion among consumers.\n* The plaintiff claimed a prima facie case of infringement and passing off, and argued that they would suffer irreparable injury to their goodwill and reputation if the defendant continued to use the impugned trademark.\n\n**Decision:**\n\n* The Court held that the defendant no.1's use of the trademark \"PRESTIGE\" for gas stoves was likely to cause confusion among consumers.\n* The plaintiff was granted a permanent injunction against the defendant no.1, restraining them from manufacturing, selling, or advertising goods bearing the impugned trademark.\n* The Court also decreed the suit in favor of the plaintiff against defendants no.2 and 3, who were not found to be sister concerns of defendant no.1.\n\n**Parties:**\n\n* Plaintiff: TTK Prestige Ltd.\n* Defendants:\n\t+ No.1: K K and Company Delhi Pvt.\n\t+ No.2: unknown\n\t+ No.3: unknown\n\n**Dates:**\n\n* Date of decision: February 20, 2023\n* Date for further proceedings: May 3, 2023",
      "pdf_source": "20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf",
      "nodes": [
        {
          "title": "Page 10",
          "node_id": "0013",
          "start_index": 10,
          "end_index": 10,
          "summary": "**Summary of Page 10 from PDF: 20. TTK Prestige Ltd Vs. K K And Company Delhi Pvt**\n\n**Case No:** CS(COMM) 864/2022\n**Order Date:** February 20, 2023\n**Court:** High Court of Delhi at New Delhi\n\nThe court finds that the case and case at hand are identical (Page 10). **Arguments in favour of plaintiff:**\n\n* The defendant no.1's use of the trademark \"PRESTIGE\" for gas stoves can cause market confusion.\n* Public would associate defendant's products with the plaintiff.\n\n**Decision:**\n\n* Plaintiff has made out a prima facie case of infringement and passing off.\n* Balance of convenience is in favour of the plaintiff.\n* Defendant no.1, its directors, sister concerns, assigns, distributors, stockists, dealers, and agents are **injuncted from using or dealing with similar marks**(Page 11).\n\nSources:\n Page 10 of CS(COMM) 864/2022 | PDF: 20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf",
          "content": "2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 10 of 11 \n \ncase and case at hand are identical. The use of the trademark „PRESTIGE‟ \nby the defendant no.1 in respect of „gas stoves‟ is likely to cause confusion \nin the market as the public at large would associate the said products of the \ndefendant no.1 with the plaintiff.  \n25. \nIn view of the discussion above, a prima facie case of infringement as \nwell as passing off is made out on behalf of the plaintiff. Balance of \nconvenience is also in favour of plaintiff and against the defendant no.1. The \nplaintiff shall continue to suffer irreparable injury to its goodwill and \nreputation if the defendant no.1 is permitted to manufacture and sell goods \nbearing the impugned trademark. \n26. \nAccordingly, the present application is allowed and the defendant \nno.1, its directors, sister concerns, assigns in business, distributors, stockists, \ndealers and agents are injuncted from manufacturing, selling, offering for \nsale, exporting, advertising in any manner including on the internet and \nwebsites, directly or indirectly dealing in gas stoves or in any kitchenware, \ncookware and/or cognate/allied/related goods under the mark \n \nor any other mark which is identical or deceptively similar to the plaintiff‟s \n„PRESTIGE‟ trademarks. \nCS(COMM) 864/2022 \n27. \nCounsels for the defendants no.2 and 3 submit that they are not the \nsister concerns of the defendant no.1 and do not manufacture or sell any \nproduct using the impugned trademark. \n28. \nHence, without going into the merits, the defendants no.2 and 3 have \nno objection if a decree of permanent injunction is passed against them \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified",
          "pdf_source": "20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf",
          "nodes": []
        },
        {
          "title": "Page 11",
          "node_id": "0014",
          "start_index": 11,
          "end_index": 11,
          "summary": "Here's a summary of page 11 from the provided PDF:\n\n**Case Details:**\n\n* Case Number: CS(COMM) 864/2022\n* Court: High Court of Delhi at New Delhi\n* Date of Decision: February 20, 2023\n* DHC File No.: 2023/DHC/001280\n\n**Decree:**\n\n* The court decrees the suit against defendants no. 2 and 3 in terms of prayer clauses (i) and (ii) of the plaint.\n* The plaintiff is restrained from using the trademark \"PRESTIGE\" or any other mark identical or deceptively similar to that of the plaintiff.\n\n**Further Proceedings:**\n\n* Counsel for the plaintiff does not press for reliefs sought in prayer clauses (iii) to (vii).\n* The suit shall continue to proceed against defendant no. 1.\n* List before the Joint Registrar on May 3, 2023, for further proceedings.\n\n**Source:** TTK Prestige Ltd vs K K and Company Delhi Pvt: IN THE HIGH COURT OF DELHI AT NEW DELHI. (PDF sourced from online database)",
          "content": "2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 11 of 11 \n \nrestraining them from using the trademark „PRESTIGE‟ or any other mark \nwhich is identical or deceptively similar to that of the plaintiff. \n29. \nAccordingly, the suit is decreed against the defendants no.2 and 3 in \nterms of prayer clauses (i) and (ii) of the plaint.  \n30. \nCounsel for the plaintiff does not press for reliefs sought in prayer \nclauses (iii), (iv), (v), (vi) and (vii) against the defendants no.2 and 3.  \n31. \nLet the decree sheet be drawn up. \n32. \nThe suit shall continue to proceed against the defendant no.1. \n33. \nList before the Joint Registrar on 3rd May, 2023 for further \nproceedings. \nI.A. 1139/2023 (O-I R-10 of CPC) and I.A. 2624/2023 (O-I R-10 of CPC) \n34. \n In view of the above, the present applications have become \ninfructuous and are disposed of as such. \n \n \nAMIT BANSAL, J \nFEBRUARY 20, 2023 \nsr \n \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified",
          "pdf_source": "20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-16T14:46:40.571522",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}