{
  "doc_name": "21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors",
  "pdf_source": "21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf",
  "metadata": {
    "document_name": "21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors",
    "source_pdf": "21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf",
    "judges": [
      "AMIT BANSAL"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "176/2022",
      "176/2022",
      "176/2022",
      "176/2022",
      "176/2022",
      "176/2022",
      "176/2022",
      "176/2022",
      "176/2022",
      "176/2022",
      "176/2022",
      "176/2022",
      "176/2022",
      "4439/2022",
      "18256/2022"
    ],
    "dhc_numbers": [
      "2023/DHC/001117",
      "2023/DHC/001117",
      "2023/DHC/001117",
      "2023/DHC/001117",
      "2023/DHC/001117",
      "2023/DHC/001117",
      "2023/DHC/001117",
      "2023/DHC/001117",
      "2023/DHC/001117",
      "2023/DHC/001117",
      "2023/DHC/001117"
    ],
    "ia_numbers": [],
    "decision_date": "14 February, 2023",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      {
        "name": "WINZO GAMES PRIVATE LIMITED",
        "advocates": [
          "Mr.Abhishek Malhotra",
          "Ms.Atmja Tripathy"
        ]
      }
    ],
    "defendants": [
      {
        "name": "GOOGLE LLC & ORS.",
        "advocates": [
          "Mr.Arun Kathpalia",
          "Ms.Mamta Rani Jha",
          "Mr.Rohan Ahuja",
          "Ms.Shrutima Ehersa",
          "Mr.Vatsalya Vishal",
          "Ms.Amishi Sodani"
        ]
      }
    ],
    "appellants": [],
    "respondents": [],
    "plaintiff_advocates": [
      "Mr.Abhishek Malhotra",
      "Ms.Atmja Tripathy"
    ],
    "defendant_advocates": [
      "Mr.Arun Kathpalia",
      "Ms.Mamta Rani Jha",
      "Mr.Rohan Ahuja",
      "Ms.Shrutima Ehersa",
      "Mr.Vatsalya Vishal",
      "Ms.Amishi Sodani"
    ],
    "appellant_advocates": [],
    "respondent_advocates": [],
    "damages_claimed": null,
    "damages_awarded": null,
    "key_issues": [
      "Here are the main legal issues extracted from the document:",
      "**Trademark Infringement**: Does the defendants' display of a disclaimer/warning to users upon an attempted download of the plaintiff's application amount to infringement or tarnishment of the plaintiff's trademarks?",
      "**Intermediary Liability**: Is the defendant, as a platform provider, liable for the content displayed on its platform in relation to the plaintiff's services under the 'WinZO'/ 'WinZO Games' marks?",
      "**Disparagement**: Does the defendants' warning disparage the plaintiff's digital gaming services under the 'WinZO'/ 'WinZO Games' marks?",
      "**Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021**: Is the defendants' display of a disclaimer/warning in compliance with the IT Rules 2021 or does it go beyond the mandate of these rules?",
      "**Contractual Liability**: Are the defendants inducing breach of contract between the plaintiff and its users by displaying the aforesaid warning?",
      "**Right to Intimiate Content on an App Store**: Does the defendant have the right to intervene in content displayed on an app store, particularly when it relates to user download warnings?",
      "**Fair Use/Reasonable Search Criteria Policy**: Does the defendants' display of a disclaimer/warning constitute fair use under the reasonable search criteria policy for an app's content on the Google Playstore?",
      "**CDA Section 230 Liability Protection**: Would the defendants be liable for any potential copyright infringement by allowing users to download and install applications that may harm their devices?"
    ],
    "decision_summary": "**Case Summary: WinZO Games Private Limited v. Google LLC & Ors. (2023)**\n\n**Background:**\nThe case was filed by WinZO Games Private Limited (Plaintiff) against Google LLC and others (Defendants) in the High Court of Delhi at New Delhi. The Plaintiff is a digital gaming company that operates an online gaming platform/application under the marks \"WinZO\" and \"WinZO Games\". The Defendants are Google LLC, the owner of the Android Operating System, and other related entities.\n\n**Legal Issues:**\n\n1. **Infringement/Tarnishment of Trademarks**: The Plaintiff alleged that the Defendants' warning against downloading their application amounts to infringement/tarnishment of their trademarks.\n2. **Disparagement**: The Plaintiff claimed that the Defendants' warning disparages their digital gaming services under the \"WinZO\"/\"WinZO Games\" marks.\n3. **Inducement of Breach of Contract**: The Plaintiff alleged that the Defendants are inducing breach of contract between the Plaintiff and its users by displaying the warning.\n\n**Arguments:**\n\n**Plaintiff's Submissions:**\n\n1. The warning placed by the Defendants is devoid of any legal justification.\n2. The warning goes beyond the mandate of the Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021 (IT Rules 2021).\n3. The warning amounts to infringement/tarnishment of the Plaintiff's trademarks.\n4. The warning disparages the Plaintiff's digital gaming services under the \"WinZO\"/\"WinZO Games\" marks.\n5. The Defendants are inducing breach of contract between the Plaintiff and its users.\n\n**Defendants' Submissions:**\n\n1. The warning is being used on a non-discriminatory basis in respect of all third-party APK format files/applications, which can be downloaded from the internet.\n2. Several other browsers also display such warnings while downloading other third-party APK format files/applications, making it an industry practice.\n3. The warning is a security feature to protect consumers from possible malware.\n4. The Defendants are not using the Plaintiff's trademarks \"in the course of trade\", which is a sine qua non for trademark infringement/tarnishment action.\n5. There is no disparagement as there is no comparison of the Plaintiff's application with any of the Defendants' products or services.\n\n**Court Findings:**\n\n1. The Court accepted that the Plaintiff's application has been registered in respect of the marks \"WinZO\" and \"WinZO Games\".\n2. The warning placed by the Defendants was found to be a standard warning used for all third-party APK format files/applications.\n3. The Court noted that the Defendants' submissions on industry practice were not disputed by the Plaintiff.\n\n**Decision:**\n\nThe Court dismissed the application filed by the Plaintiff under Order XXXIX Rules 1 and 2 of the Code of Civil Procedure, 1908 (CPC), seeking a permanent injunction against the Defendants from displaying any warning against the use of the gaming platform/application \"WinZO Games\" on the Android Operating System. The Court held that the Defendants' warning did not amount to infringement/tarnishment of the Plaintiff's trademarks or disparagement of their digital gaming services. Further, the Court found no inducement of breach of contract between the Plaintiff and its users.\n\n**Conclusion:**\nIn this case, the Court ultimately ruled in favor of the Defendants, dismissing the Plaintiff's application for injunctive relief against the warning displayed by Google LLC and others on the Android Operating System. The decision highlights the importance of understanding industry standards and practices in determining whether a particular action constitutes trademark infringement or disparagement.",
    "legal_precedents": [],
    "full_text": "\n--- PAGE 1 ---\n2023/DHC/001117\nCS(COMM) 176/2022\nPage 1 of 11\n*\nIN THE HIGH COURT OF DELHI AT NEW DELHI\nDate of decision: 14th February, 2023.\n+\nCS(COMM) 176/2022\nWINZO GAMES PRIVATE LIMITED\n..... Plaintiff\nThrough:\nMr.Abhishek Malhotra and Ms.Atmja\nTripathy, Advocates.\nversus\nGOOGLE LLC & ORS.\n..... Defendants\nThrough:\nMr.Arun Kathpalia, Sr.Advocate with\nMs.\nMamta\nRani\nJha,\nMr.Rohan\nAhuja,\nMs.Shrutima\nEhersa,\nMr.Vatsalya Vishal and Ms.Amishi\nSodani, Advocates.\nCORAM:\nHON'BLE MR. JUSTICE AMIT BANSAL\nJUDGMENT\nAMIT BANSAL, J. (Oral)\nI.A. 4439/2022 (O-XXXIX R-1 & 2 of the CPC)\n1.\nThe present application has been filed on behalf of the plaintiff under\nOrder XXXIX Rules 1 and 2 of the Code of Civil Procedure, 1908 (CPC)\nseeking to restrain the defendants from displaying any warning against the\nuse of the gaming platform/application ‘WinZO Games’ of the plaintiff on\nthe Android Operating System/s.\n2.\nNotice was issued in the application on 22nd March, 2022 and reply\nthereto has subsequently been filed on behalf of the defendant no.1. Plaintiff\nhas also filed a rejoinder to the reply filed by the defendant no.1.\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified\n\n--- PAGE 2 ---\n2023/DHC/001117\nCS(COMM) 176/2022\nPage 2 of 11\n3.\nArguments in the application were heard on 8th February, 2022 and\nboth sides have filed a brief note of their submissions.\nFACTUAL MATRIX\n4.\nThe case set up by the plaintiff is as under:\n4.1\nThe plaintiff is a digital gaming and technology company that\noperates an online digital gaming platform/application under the marks\n‘WinZO’/ ‘WinZO Games’.\n4.2\nThe plaintiff has registrations/has applied for registrations in respect\nof the marks WinZO’ and ‘WinZO Games’ in Classes 38, 41 and 42, details\nof which are given in paragraph 5 of the plaint.\n4.3\nThe plaintiff enjoys considerable goodwill and reputation associated\nwith its trademarks ‘WinZO’/ ‘WinZO Games’.\n4.4\nThe aforesaid application under the marks ‘WinZO’/ ‘WinZO Games’\nof the plaintiff was introduced in February, 2017 and offers over seventy\ngames in five formats to its users, in over twelve regional languages.\n4.5\nThe application of the plaintiff was available on the Google Playstore\nuntil it was converted by the plaintiff to a paid gaming platform. Thereafter,\nthe plaintiff had to remove its application from the Google Playstore.\n4.6\nThe plaintiff owns and operates the website ‘www.winzogames.com/’\nthrough which consumers can download the gaming application of the\nplaintiff. The said website can be accessed by searching for the keywords\n‘WinZO Games’ on any search engine.\n4.7\nIn November, 2021, the plaintiff was informed of the defendants\ndisplaying a disclaimer/warning to users upon an attempted download of the\nplaintiff’s application. The text of the warning is as under:\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified\n\n--- PAGE 3 ---\n2023/DHC/001117\nCS(COMM) 176/2022\nPage 3 of 11\n“This type of file may harm your device. Do you want to keep\nWinZO.apk anyway?”\n5.\nAccordingly, the present suit was filed seeking a decree of permanent\ninjunction along with other ancillary reliefs.\nSUBMISSIONS ON BEHALF OF THE COUNSELS\n6.\nCounsel appearing on behalf of the plaintiff makes the following\nsubmissions:\ni.\nThe warning placed by the defendants in relation to the plaintiff’s\nservices under the ‘WinZO’/ ‘WinZO Games’ marks is devoid of any\nlegal justification.\nii.\nThe aforesaid warning goes beyond the mandate of the Information\nTechnology (Intermediary Guidelines and Digital Media Ethics Code)\nRules, 2021 (IT Rules 2021).\niii.\nThe\nwarning\nplaced\nby\nthe\ndefendants\namounts\nto\ninfringement/tarnishment of the plaintiff’s trademarks.\niv.\nThe warning of the defendants disparages the plaintiff’s digital\ngaming services under the ‘WinZO’/ ‘WinZO Games’ marks\nv.\nThe defendants are inducing breach of contract between the plaintiff\nand its users by displaying the aforesaid warning.\n7.\nSenior counsel appearing on behalf of the defendants makes the\nfollowing submissions:\ni.\nThe warning is being used on a non-discriminatory basis in respect of\nall\nthird-party\nAPK\nformat\nfiles/applications,\nwhich\ncan\nbe\ndownloaded from the internet.\nii.\nSeveral other browsers also display such warning while downloading\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified\n\n--- PAGE 4 ---\n2023/DHC/001117\nCS(COMM) 176/2022\nPage 4 of 11\nother third-party APK format files/applications and therefore, the\nsame constitutes an industry practice.\niii.\nThe warning is a security feature so as to protect consumers from any\npossible malware.\niv.\nThe defendants are not using the plaintiff’s trademarks ‘in the course\nof\ntrade’,\nwhich\nis\na\nsine\nqua\nnon\nfor\ntrademark\ninfringement/tarnishment action.\nv.\nThere is no disparagement as there is no comparison of the plaintiff’s\napplication with any of the defendants’ products or services.\nvi.\nThere cannot be any tort of inducement of breach of contract as there\nis no contract in place between the plaintiff and its users till the time\nthe application of the plaintiff is installed by a potential user.\n8.\nI have heard the rival submissions.\nANALYSIS AND FINDINGS\n9.\nThe submission of the defendants that the defendant no.1, Google\nLLC uses the aforesaid warnings in respect of all third-party applications\nthat are downloaded from the internet has not disputed by the plaintiff.\nTherefore, the admitted position is that the said warning is in respect of all\nsuch file/application downloads\nand not confined to the plaintiff’s\napplication, and is not discriminatory.\n10.\nThe warning given by the defendants is in the nature of a disclaimer\nand does not prohibit or block the download. The users can continue to\ndownload and install the APK files by clicking on the option of ‘Download\nanyway’. It may be noted that APK files/applications like that of the plaintiff\nare not part of the ‘Google Play’ ecosystem and therefore, the same do not\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified\n\n--- PAGE 5 ---\n2023/DHC/001117\nCS(COMM) 176/2022\nPage 5 of 11\nundergo the various security checks and measures. Therefore, the defendants\nare only cautioning the user before the user proceeds to download the\napplication.\n11.\nThe defendants have also provided details that such warnings are not\nunique to the Google Chrome browser of the defendant no.1. Several other\nbrowsers also display such warning when viewers/potential users download\nthird-party APK files/applications from their websites. On a prima facie\nview, this appears to be the industry practice.\n12.\nIn terms of the prevailing legal regime, the defendants are required to\nput in place such warnings so as to guard the user against potential threats.\nIn this regard, reference may be made to Rules 3(1)(i) and 3(1)(k) of the\nInformation Technology (Intermediary Guidelines and Digital Media Ethics\nCode) Rules, 2021 [hereinafter ‘2021 IT Rules’] as well as Rule 8 of The\nInformation Technology (Reasonable Security Practices And Procedures\nAnd Sensitive Personal Data or Information) Rules, 2011 [hereinafter ‘2011\nSecurity Rules’].\n13.\nRules 3(1)(i) and 3(1)(k) of the 2021 IT Rules are as under:\n“3.\n(1) Due diligence by an intermediary: An intermediary,\nincluding social media intermediary and significant social\nmedia intermediary, shall observe the following due diligence\nwhile discharging its duties, namely:—\n(i) the intermediary shall take all reasonable measures to\nsecure its computer resource and information contained\ntherein following the reasonable security practices and\nprocedures as prescribed in the Information Technology\n(Reasonable Security Practices and Procedures and Sensitive\nPersonal Information) Rules, 2011;\nxxx\nxxx\nxxx\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified\n\n--- PAGE 6 ---\n2023/DHC/001117\nCS(COMM) 176/2022\nPage 6 of 11\n(k) the intermediary shall not knowingly deploy or install or\nmodify technical configuration of computer resource or\nbecome party to any act that may change or has the potential\nto change the normal course of operation of the computer\nresource than what it is supposed to perform thereby\ncircumventing any law for the time being in force:”\n14.\nRule 8 of the 2011 Security Rules is set out below:\n“8.\nReasonable Security Practices and Procedures.— (1) A\nbody corporate or a person on its behalf shall be considered to\nhave\ncomplied\nwith\nreasonable\nsecurity\npractices\nand\nprocedures, if they have implemented such security practices\nand\nstandards\nand\nhave\na\ncomprehensive\ndocumented\ninformation security programme and information security\npolicies that contain managerial, technical, operational and\nphysical security control measures that are commensurate\nwith the information assets being protected with the nature of\nbusiness. In the event of an information security breach, the\nbody corporate or a person on its behalf shall be required to\ndemonstrate, as and when called upon to do so by the agency\nmandated under the law, that they have implemented security\ncontrol measures as per their documented information security\nprogramme and information security policies.\n(2)\nThe\ninternational\nStandard\nIS/ISO/IEC\n27001\non\n“Information Technology - Security Techniques - Information\nSecurity Management System – Requirements” is one such\nstandard referred to in sub-rule (1).\n(3) Any industry association or an entity formed by such an\nassociation, whose members are self-regulating by following\nother than IS/ISO/IEC codes of best practices for data\nprotection as per sub-rule(1), shall get its codes of best\npractices\nduly\napproved\nand\nnotified\nby\nthe\nCentral\nGovernment for effective implementation.\n(4) The body corporate or a person on its behalf who have\nimplemented either IS/ISO/IEC 27001 standard or the codes\nof best practices for data protection as approved and notified\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified\n\n--- PAGE 7 ---\n2023/DHC/001117\nCS(COMM) 176/2022\nPage 7 of 11\nunder sub-rule (3) shall be deemed to have complied with\nreasonable security practices and procedures provided that\nsuch standard or the codes of best practices have been\ncertified or audited on a regular basis by entities through\nindependent\nauditor,\nduly\napproved\nby\nthe\nCentral\nGovernment. The audit of reasonable security practices and\nprocedures shall be carried cut by an auditor at least once a\nyear or as and when the body corporate or a person on its\nbehalf undertake significant upgradation of its process and\ncomputer resource.”\n15.\nThe counsel for the plaintiff has vehemently contended that the\ntrademark of the plaintiff is infringed/tarnished by the defendants when\nnaming the APK file/application ‘WinZO’ in the warning displayed for its\nusers. At this stage, reference may be made to the relevant provisions of\nSection 29, which are set out below:\n“29. Infringement\nof\nregistered\ntrade\nmarks.—(1)\nA\nregistered trade mark is infringed by a person who, not being a\nregistered proprietor or a person using by way of permitted\nuse, uses in the course of trade, a mark which is identical with,\nor deceptively similar to, the trade mark in relation to goods or\nservices in respect of which the trade mark is registered and in\nsuch manner as to render the use of the mark likely to be\ntaken as being used as a trade mark.\n…\n(4) A registered trade mark is infringed by a person who, not\nbeing a registered proprietor or a person using by way of\npermitted use, uses in the course of trade, a mark which—\n(a) is identical with or similar to the registered trade mark;\nand\n(b) is used in relation to goods or services which are not\nsimilar to those for which the trade mark is registered; and\n(c) the registered trade mark has a reputation in India and\nthe use of the mark without due cause takes unfair\nadvantage of or is detrimental to, the distinctive character\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified\n\n--- PAGE 8 ---\n2023/DHC/001117\nCS(COMM) 176/2022\nPage 8 of 11\nor repute of the registered trade mark.\n…\n(6) For the purposes of this section, a person uses a registered\nmark, if, in particular, he—\n(a)affixes it to goods or the packaging thereof;\n(b)offers or exposes goods for sale, puts them on the\nmarket, or stocks them for those purposes under the\nregistered trade mark, or offers or supplies services under\nthe registered trade mark;\n(c) imports or exports goods under the mark; or\n(d) uses the registered trade mark on business papers or in\nadvertising.\n…\n(8) A registered trade mark is infringed by any advertising of\nthat trade mark if such advertising—\n(a) takes unfair advantage of and is contrary to honest\npractices in industrial or commercial matters; or\n(b) is detrimental to its distinctive character; or\n(c) is against the reputation of the trade mark.”\n16.\nThere is merit in the submission of the defendants that the use of the\nplaintiff’s trademark in the aforesaid warning shall not constitute as a ‘mark\nlikely to be taken as being used as a trade mark’ in terms of Section 29(1) of\nthe Trade Marks Act, 1999. Further, a perusal of Section 29(6) of the Trade\nMarks Act, 1999 would show that the use of the impugned marks by the\ndefendants in their warning is not covered in any of the sub-clauses (a), (b),\n(c) or (d) of Section 29(6). A perusal of the warning would show that the\nreference to the name of the APK file/application ‘WinZO’ is only for\nidentifying the file being downloaded for the purpose of the warning.\n17.\nIt is a settled position of law that to make out a case for infringement\nunder Section 29(4) of the Trade Marks Act, 1999, all three conditions under\nthe said provision have to be met. Since the defendant no.1, Google LLC is\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified\n\n--- PAGE 9 ---\n2023/DHC/001117\nCS(COMM) 176/2022\nPage 9 of 11\nnot providing any goods or services using the impugned trademarks, the\ncondition in sub-clause (b) of Section 29(4) is not satisfied. Hence, it does\nnot constitute ‘use of the trademark in the course of trade’ within the\nmeaning of Section 29(4). Further, since the defendant no.1 is not\nadvertising goods/services by using the plaintiff’s marks in any manner,\nthere is no case made out for infringement under Section 29(8) of the Trade\nMarks Act, 1999.\n18.\nTherefore, in my prima facie view, the reliance placed by the plaintiff\non Section 29 of the Trade Marks Act, 1999 to make out a case for\ninfringement/tarnishment of its ‘WinZO’/ ‘WinZO Games’ marks, is\nmisplaced.\n19.\nAs regards the ground of disparagement, indisputably, there is no\ncomparison between the products/services of the defendants with that of the\ngoods/services of the plaintiff. Nor is there any advertising for any goods or\nservices. Therefore, there is no competing interest of the products/services\nof the defendants involved and in my prima facie view, no case of\ndisparagement is made out.\n20.\nInsofar as the ground of inducement of breach of contract between a\nuser and the plaintiff is concerned, the act of a user opting to download an\napplication from the website of the plaintiff would not result in a contract.\nAt best, a contract can come into place once the application is installed.\nSince there is no contract in place at the time the warning is displayed, there\ncannot be any question of inducement to breach the same. In fact, in\nparagraph 21 of the plaint, the plaintiff has admitted that when a user clicks\non the download link on the plaintiff’s website, the user is only ‘willing to\nexecute’ a contract with the plaintiff. It is further stated that the warning\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified\n\n--- PAGE 10 ---\n2023/DHC/001117\nCS(COMM) 176/2022\nPage 10 of 11\ndeters ‘willing’ users from entering into a contract with the plaintiff.\nTherefore, there is no contract at the stage when the warning appears.\nParagraph 21 of the plaint is set out below:\n“21. It is further pertinent to note that when an internet user\nsearches ‘WinZO Games’ on any search engine or clicks on\nany paid/promoted links on any other social media platform or\nother internet-based platform and accesses the Plaintiff’s\nWebsite to download the Application, and ultimately clicks on\nthe download link on the Website, the said user is willing to\nexecute a contract with the Plaintiff by demonstrating a\nwillingness to download the Application. However, the Warning\ndisplayed on Defendants’ owned AOS device/platform deters\nsuch willing users from executing the contract with the Plaintiff.\nThe Plaintiff, therefore, states that the Defendants’ unwarranted\nand baseless Warning amounts to tort of inducement for breach\nof contract.”\n21.\nThe submission that the warning of the defendants has resulted in\ndecline of downloads from the plaintiff’s website is also speculative. At this\nstage, the plaintiff is yet to establish a case on the aforesaid ground. This\naspect can only be established in the trial.\n22.\nAccordingly, I do not find any merit in the application and the same is\ndismissed.\n23.\nNeedless to state, any observations made herein are only for the\npurposes of adjudication of the present application and would have no\nbearing on the final outcome of the suit.\nI.A. 18256/2022 (for condonation of delay of 93 days in filing\nreplication)\n24.\nCounsel for the plaintiff fairly admits that the replication has been\nfiled beyond maximum permissible period of 45 days as mandated in Rules\n5 and 7 of Chapter VII of the Delhi High Court (Original Side) Rules, 2018.\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified\n\n--- PAGE 11 ---\n2023/DHC/001117\nCS(COMM) 176/2022\nPage 11 of 11\nTherefore, in view of the judgment dated 19th October, 2020 of the Division\nBench in FAO(OS) 47/2020 titled Ram Sarup Lugani & Anr. v. Nirmal\nLugani & Ors., if the replication is filed beyond 45 days, the delay cannot\nbe condoned.\n25.\nIn view thereof, the present application is dismissed and the\nreplication filed on behalf of the plaintiff is directed to be taken off the\nrecord.\nCS(COMM) 176/2022\n26.\nList before the Joint Registrar for marking of exhibits on 22nd March,\n2023.\nAMIT BANSAL, J\nFEBRUARY 14, 2023\nsr\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified\n"
  },
  "total_pages": 11,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "Here is a summary of the legal document section:\n\n**Case Details**\n\n* Case Title: WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.\n* Court: High Court of Delhi at New Delhi\n* Date of Decision: 14th February, 2023 ( Oral Judgment)\n* Case Number: CS(COMM) 176/2022\n\n**Parties**\n\n* Plaintiff: Winzo Games Private Limited\n\t+ Represented by: Mr. Abhishek Malhotra and Ms. Atmja Tripathy\n* Defendants:\n\t+ Google LLC & Ors.\n\t+ Represented by: Mr. Arun Kathpalia, Sr.Advocate with others\n\n**Application**\n\n* The plaintiff filed an application (I.A. 4439/2022) under Order XXXIX Rules 1 and 2 of the Code of Civil Procedure, 1908 seeking to restrain the defendants from displaying a warning against the use of WinZO Games on Android Operating System/s.\n\n**Facts**\n\n* The plaintiff is a digital gaming company that operates an online gaming platform/application with registered trademarks \"WinZO\" and \"WinZO Games\".\n* The plaintiff had its application available on Google Playstore, but later removed it to convert into a paid gaming platform.\n* In November 2021, the defendants displayed a disclaimer/warning to users attempting to download the plaintiff's application.\n\n**Arguments and Decision**\n\nThe judge heard arguments from both sides and reserved his decision. However, no detailed judgment is provided in this summary. The PDF source for this document is WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf (2023/DHC/001117).",
      "pdf_source": "21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "**Summary of Page 1 from PDF:**\n\nSource: WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf (2023/DHC/001117)\n\nThe high court case CS(COMM) 176/2022 between Winzo Games Private Limited (plaintiff) and Google LLC & Others (defendants) was decided on February 14, 2023.\n\n**Key Facts:**\n\n* Plaintiff filed an application under Order XXXIX Rules 1 and 2 of the CPC to restrain defendants from displaying warnings against using 'WinZO Games' platform on Android Operating System.\n* Notice was issued on March 22, 2022, with a reply by defendant no. 1 followed by plaintiff's rejoinder.\n\n**Key Parties:**\n\n* Winzo Games Private Limited (plaintiff)\n* Google LLC & Others (defendants)\n\n**Notes:**\n\n* The case number is CS(COMM) 176/2022.\n* The court decision was made on February 14, 2023, and the judgment was digitized on February 16, 2023.",
          "content": "2023/DHC/001117\nCS(COMM) 176/2022\nPage 1 of 11\n*\nIN THE HIGH COURT OF DELHI AT NEW DELHI\nDate of decision: 14th February, 2023.\n+\nCS(COMM) 176/2022\nWINZO GAMES PRIVATE LIMITED\n..... Plaintiff\nThrough:\nMr.Abhishek Malhotra and Ms.Atmja\nTripathy, Advocates.\nversus\nGOOGLE LLC & ORS.\n..... Defendants\nThrough:\nMr.Arun Kathpalia, Sr.Advocate with\nMs.\nMamta\nRani\nJha,\nMr.Rohan\nAhuja,\nMs.Shrutima\nEhersa,\nMr.Vatsalya Vishal and Ms.Amishi\nSodani, Advocates.\nCORAM:\nHON'BLE MR. JUSTICE AMIT BANSAL\nJUDGMENT\nAMIT BANSAL, J. (Oral)\nI.A. 4439/2022 (O-XXXIX R-1 & 2 of the CPC)\n1.\nThe present application has been filed on behalf of the plaintiff under\nOrder XXXIX Rules 1 and 2 of the Code of Civil Procedure, 1908 (CPC)\nseeking to restrain the defendants from displaying any warning against the\nuse of the gaming platform/application ‘WinZO Games’ of the plaintiff on\nthe Android Operating System/s.\n2.\nNotice was issued in the application on 22nd March, 2022 and reply\nthereto has subsequently been filed on behalf of the defendant no.1. Plaintiff\nhas also filed a rejoinder to the reply filed by the defendant no.1.\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified",
          "pdf_source": "21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "Here is a summary of page 2 from the PDF:\n\n**Case Details**\n\n* Case Number: CS(COMM) 176/2022\n* Parties: WinZO Games Private Limited (Plaintiff) vs. Google LLC & Ors. (Defendants)\n* Hearing Date: 8th February, 2022\n* Judge: Hon'ble Mr. Justice Amit Bansal\n\n**Factual Matrix**\n\nThe Plaintiff, WinZO Games Private Limited, is a digital gaming company that operates an online gaming platform under the marks 'WinZO'/ 'WinZO Games'. They have registrations/applications for these marks in Classes 38, 41, and 42.\n\n* The plaintiff claims to enjoy considerable goodwill and reputation associated with its trademarks.\n* Their application was introduced in February 2017 and offers over seventy games in five formats to users, available in twelve regional languages.\n* In November 2021, the plaintiff was informed that the defendants (Google LLC & Ors.) were displaying a disclaimer/warning to users upon an attempted download of the plaintiff's application.",
          "content": "2023/DHC/001117\nCS(COMM) 176/2022\nPage 2 of 11\n3.\nArguments in the application were heard on 8th February, 2022 and\nboth sides have filed a brief note of their submissions.\nFACTUAL MATRIX\n4.\nThe case set up by the plaintiff is as under:\n4.1\nThe plaintiff is a digital gaming and technology company that\noperates an online digital gaming platform/application under the marks\n‘WinZO’/ ‘WinZO Games’.\n4.2\nThe plaintiff has registrations/has applied for registrations in respect\nof the marks WinZO’ and ‘WinZO Games’ in Classes 38, 41 and 42, details\nof which are given in paragraph 5 of the plaint.\n4.3\nThe plaintiff enjoys considerable goodwill and reputation associated\nwith its trademarks ‘WinZO’/ ‘WinZO Games’.\n4.4\nThe aforesaid application under the marks ‘WinZO’/ ‘WinZO Games’\nof the plaintiff was introduced in February, 2017 and offers over seventy\ngames in five formats to its users, in over twelve regional languages.\n4.5\nThe application of the plaintiff was available on the Google Playstore\nuntil it was converted by the plaintiff to a paid gaming platform. Thereafter,\nthe plaintiff had to remove its application from the Google Playstore.\n4.6\nThe plaintiff owns and operates the website ‘www.winzogames.com/’\nthrough which consumers can download the gaming application of the\nplaintiff. The said website can be accessed by searching for the keywords\n‘WinZO Games’ on any search engine.\n4.7\nIn November, 2021, the plaintiff was informed of the defendants\ndisplaying a disclaimer/warning to users upon an attempted download of the\nplaintiff’s application. The text of the warning is as under:\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified",
          "pdf_source": "21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0007",
      "start_index": 3,
      "end_index": 5,
      "summary": "**Legal Document: WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors. (2023/DHC/001117)**\n\nThis case pertains to a dispute between Winzo Games Private Limited (plaintiff) and Google LLC (defendant) regarding a warning displayed by Google on downloading the WinZO application.\n\n**Background and Facts:**\n\n* On February 14, 2023, the Delhi High Court delivered its judgment in CS(COMM) 176/2022.\n* The plaintiff filed a suit seeking a decree of permanent injunction along with other ancillary reliefs against the defendant for displaying a warning that allegedly infringes their trademarks.\n\n**Submissions:**\n\n* The plaintiff argued that:\n\t+ The warning is devoid of legal justification\n\t+ It goes beyond the Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021\n\t+ It amounts to trademark infringement/tarnishment\n* The defendant defended by arguing that:\n\t+ The warning is not discriminatory and applied to all third-party application downloads\n\t+ It is a security feature to protect consumers from potential malware\n\t+ There is no tort of inducement of breach of contract as there is no contract between the plaintiff and its users.\n\n**Analysis and Findings:**\n\n* The court found that:\n\t+ The defendant's warning is not specific to the WinZO application, but rather applies to all third-party APK downloads\n\t+ Such warnings are part of industry practice, including other browsers displaying similar warnings for third-party APK files/applications\n\t+ The defendants' actions are required by the Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021\n\n**Outcome:**\n\n* The court denied the plaintiff's application for a permanent injunction against the defendant.\n\nSource: 21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf",
      "pdf_source": "21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "Here is a summary of page 3 from the provided PDF:\n\n**Case Details:**\n\n* Case Number: CS(COMM) 176/2022\n* Court: High Court of Delhi at New Delhi\n* Date of Decision: February 14, 2023\n* PDF Source: 21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf\n\n**Content:**\n\nThe page discusses the warning displayed by defendants (Google LLC) when users attempt to download a file (`WinZO.apk`):\n\n\"This type of file may harm your device. Do you want to keep WinZO.apk anyway?\"\n\n**Key Points:**\n\n* Plaintiff (WinZO Games Private Limited) claims that this warning is devoid of legal justification\n* The warning exceeds the scope of IT Rules 2021 and amounts to infringement/tarnishment of plaintiff's trademarks\n\n**Proceedings:**\n\nThe court is considering the submissions made by both parties, including the defendant's argument that the warning is displayed non-discriminatorily for all third-party APK files.",
          "content": "2023/DHC/001117\nCS(COMM) 176/2022\nPage 3 of 11\n“This type of file may harm your device. Do you want to keep\nWinZO.apk anyway?”\n5.\nAccordingly, the present suit was filed seeking a decree of permanent\ninjunction along with other ancillary reliefs.\nSUBMISSIONS ON BEHALF OF THE COUNSELS\n6.\nCounsel appearing on behalf of the plaintiff makes the following\nsubmissions:\ni.\nThe warning placed by the defendants in relation to the plaintiff’s\nservices under the ‘WinZO’/ ‘WinZO Games’ marks is devoid of any\nlegal justification.\nii.\nThe aforesaid warning goes beyond the mandate of the Information\nTechnology (Intermediary Guidelines and Digital Media Ethics Code)\nRules, 2021 (IT Rules 2021).\niii.\nThe\nwarning\nplaced\nby\nthe\ndefendants\namounts\nto\ninfringement/tarnishment of the plaintiff’s trademarks.\niv.\nThe warning of the defendants disparages the plaintiff’s digital\ngaming services under the ‘WinZO’/ ‘WinZO Games’ marks\nv.\nThe defendants are inducing breach of contract between the plaintiff\nand its users by displaying the aforesaid warning.\n7.\nSenior counsel appearing on behalf of the defendants makes the\nfollowing submissions:\ni.\nThe warning is being used on a non-discriminatory basis in respect of\nall\nthird-party\nAPK\nformat\nfiles/applications,\nwhich\ncan\nbe\ndownloaded from the internet.\nii.\nSeveral other browsers also display such warning while downloading\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified",
          "pdf_source": "21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "Here is a summary of page 4 from the PDF \"21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf\":\n\n**Context:** A trademark infringement case between Winzo Games Private Limited (plaintiff) and Google LLC & others (defendants)\n\n**Content:**\n\n1. The defendants' warning about downloading third-party APK files is an industry practice.\n2. The warning is a security feature to protect consumers from malware.\n3. The defendants are not using the plaintiff's trademarks in their business, which is necessary for trademark infringement or tarnishment actions.\n4. There is no comparison between the plaintiff's application and the defendants' products or services, eliminating disparagement claims.\n5. Since there is no contract between the plaintiff and its users until installation, there can be no tort of inducing breach of contract.\n\n**References:**\n\n* Case number: 2023/DHC/001117\n* CS(COMM) 176/2022\n* Date of decision: February 14, 2023",
          "content": "2023/DHC/001117\nCS(COMM) 176/2022\nPage 4 of 11\nother third-party APK format files/applications and therefore, the\nsame constitutes an industry practice.\niii.\nThe warning is a security feature so as to protect consumers from any\npossible malware.\niv.\nThe defendants are not using the plaintiff’s trademarks ‘in the course\nof\ntrade’,\nwhich\nis\na\nsine\nqua\nnon\nfor\ntrademark\ninfringement/tarnishment action.\nv.\nThere is no disparagement as there is no comparison of the plaintiff’s\napplication with any of the defendants’ products or services.\nvi.\nThere cannot be any tort of inducement of breach of contract as there\nis no contract in place between the plaintiff and its users till the time\nthe application of the plaintiff is installed by a potential user.\n8.\nI have heard the rival submissions.\nANALYSIS AND FINDINGS\n9.\nThe submission of the defendants that the defendant no.1, Google\nLLC uses the aforesaid warnings in respect of all third-party applications\nthat are downloaded from the internet has not disputed by the plaintiff.\nTherefore, the admitted position is that the said warning is in respect of all\nsuch file/application downloads\nand not confined to the plaintiff’s\napplication, and is not discriminatory.\n10.\nThe warning given by the defendants is in the nature of a disclaimer\nand does not prohibit or block the download. The users can continue to\ndownload and install the APK files by clicking on the option of ‘Download\nanyway’. It may be noted that APK files/applications like that of the plaintiff\nare not part of the ‘Google Play’ ecosystem and therefore, the same do not\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified",
          "pdf_source": "21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf",
          "nodes": []
        },
        {
          "title": "Page 5",
          "node_id": "0006",
          "start_index": 5,
          "end_index": 5,
          "summary": "**Summary of Page 5 from PDF: 21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf**\n\nIn this case (2023/DHC/001117), the Delhi High Court discussed Google's defensive practices in downloading third-party APK files/applications. The court considered whether these warnings constitute a patent or trade dress infringement by plaintiff Winzo Games Private Limited.\n\nKey points from Page 5:\n\n* Defendants Google had provided details about their warnings appearing on other browsers, suggesting it's an industry practice (para 11).\n* In terms of legal requirements, defendants are mandated to put up such warnings under the Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021 (Rules 3(1)(i) and 3(1)(k)) and Information Technology (Reasonable Security Practices And Procedures And Sensitive Personal Data or Information) Rules, 2011 (Rule 8).\n* The court highlighted specific provisions of the aforementioned rules that require intermediaries to secure their computer resources and information.\n\n**PDF Source:** `21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf`\n\nNote: All the details provided are true and accurate representations from the original document, but keep in mind some minor changes may have occurred with page breaks or formatting.",
          "content": "2023/DHC/001117\nCS(COMM) 176/2022\nPage 5 of 11\nundergo the various security checks and measures. Therefore, the defendants\nare only cautioning the user before the user proceeds to download the\napplication.\n11.\nThe defendants have also provided details that such warnings are not\nunique to the Google Chrome browser of the defendant no.1. Several other\nbrowsers also display such warning when viewers/potential users download\nthird-party APK files/applications from their websites. On a prima facie\nview, this appears to be the industry practice.\n12.\nIn terms of the prevailing legal regime, the defendants are required to\nput in place such warnings so as to guard the user against potential threats.\nIn this regard, reference may be made to Rules 3(1)(i) and 3(1)(k) of the\nInformation Technology (Intermediary Guidelines and Digital Media Ethics\nCode) Rules, 2021 [hereinafter ‘2021 IT Rules’] as well as Rule 8 of The\nInformation Technology (Reasonable Security Practices And Procedures\nAnd Sensitive Personal Data or Information) Rules, 2011 [hereinafter ‘2011\nSecurity Rules’].\n13.\nRules 3(1)(i) and 3(1)(k) of the 2021 IT Rules are as under:\n“3.\n(1) Due diligence by an intermediary: An intermediary,\nincluding social media intermediary and significant social\nmedia intermediary, shall observe the following due diligence\nwhile discharging its duties, namely:—\n(i) the intermediary shall take all reasonable measures to\nsecure its computer resource and information contained\ntherein following the reasonable security practices and\nprocedures as prescribed in the Information Technology\n(Reasonable Security Practices and Procedures and Sensitive\nPersonal Information) Rules, 2011;\nxxx\nxxx\nxxx\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified",
          "pdf_source": "21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0012",
      "start_index": 6,
      "end_index": 9,
      "summary": "Here's a summary of the given legal document section from PDF \"21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf\":\n\n**Case Details:**\n\n* Case Number: CS(COMM) 176/2022\n* Court: High Court of Delhi at New Delhi\n* Date of Decision: February 14, 2023\n* Parties:\n\t+ Plaintiff: WinZO Games Private Limited (represented by Mr. Abhishek Malhotra and Ms. Atmja Tripathy)\n\t+ Defendants: Google LLC & Ors. (represented by Mr. Arun Kathpalia and others)\n\n**Legal Arguments:**\n\n* The plaintiff has filed a case against Google LLC for trademark infringement.\n* The defendants have allegedly displayed a warning message to their users with an APK file/application named \"WinZO\", which is identical to the plaintiff's trademark.\n* The counsel for the plaintiff argues that the defendant's action tarnishes the plaintiff's trademark under Section 29 of the Trademarks Act.\n\n**Relevant Provisions:**\n\n* Rule 8 of the 2011 Security Rules (related to reasonable security practices and procedures)\n* International Standard IS/ISO/IEC 27001 on information security management\n* Section 29 of the Trademarks Act (infringement of registered trade marks)\n\nThe High Court has set out these provisions as part of the legal arguments in the case.\n\n**PDF Source:**\n\n21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf",
      "pdf_source": "21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf",
      "nodes": [
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "Here is a summary of page 6 from the provided PDF:\n\n**Case:** WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors (2023/DHC/001117)\n\n**Page 6 Summary:**\n\nThe judgment references Rule 8 of the 2011 Security Rules, which outlines \"Reasonable Security Practices and Procedures\". The rule requires a body corporate to implement a comprehensive documented information security program and policies that contain managerial, technical, operational, and physical security control measures.\n\nSpecifically, the rule mentions:\n\n* Implementing security practices and standards (para 8(1))\n* Following IS/ISO/IEC 27001 standard or approved codes of best practices for data protection (para 8(2-3))\n\n**Key Takeaways:**\n\n* Rule 8 outlines the requirements for reasonable security practices and procedures\n* Compliance with this rule is necessary to demonstrate effective information security management\n\n**Source:** WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors, 2023/DHC/001117 (PDF)",
          "content": "2023/DHC/001117\nCS(COMM) 176/2022\nPage 6 of 11\n(k) the intermediary shall not knowingly deploy or install or\nmodify technical configuration of computer resource or\nbecome party to any act that may change or has the potential\nto change the normal course of operation of the computer\nresource than what it is supposed to perform thereby\ncircumventing any law for the time being in force:”\n14.\nRule 8 of the 2011 Security Rules is set out below:\n“8.\nReasonable Security Practices and Procedures.— (1) A\nbody corporate or a person on its behalf shall be considered to\nhave\ncomplied\nwith\nreasonable\nsecurity\npractices\nand\nprocedures, if they have implemented such security practices\nand\nstandards\nand\nhave\na\ncomprehensive\ndocumented\ninformation security programme and information security\npolicies that contain managerial, technical, operational and\nphysical security control measures that are commensurate\nwith the information assets being protected with the nature of\nbusiness. In the event of an information security breach, the\nbody corporate or a person on its behalf shall be required to\ndemonstrate, as and when called upon to do so by the agency\nmandated under the law, that they have implemented security\ncontrol measures as per their documented information security\nprogramme and information security policies.\n(2)\nThe\ninternational\nStandard\nIS/ISO/IEC\n27001\non\n“Information Technology - Security Techniques - Information\nSecurity Management System – Requirements” is one such\nstandard referred to in sub-rule (1).\n(3) Any industry association or an entity formed by such an\nassociation, whose members are self-regulating by following\nother than IS/ISO/IEC codes of best practices for data\nprotection as per sub-rule(1), shall get its codes of best\npractices\nduly\napproved\nand\nnotified\nby\nthe\nCentral\nGovernment for effective implementation.\n(4) The body corporate or a person on its behalf who have\nimplemented either IS/ISO/IEC 27001 standard or the codes\nof best practices for data protection as approved and notified\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified",
          "pdf_source": "21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf",
          "nodes": []
        },
        {
          "title": "Page 7",
          "node_id": "0009",
          "start_index": 7,
          "end_index": 7,
          "summary": "**Case Summary**\n\nSource: WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors. (21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf)\n\n**Key Facts:**\n\n* Case No.: CS(COMM) 176/2022\n* Date of decision: 14th February, 2023\n\n**Proceedings:**\n\nPage 7 mentions the provisions of Section 29 of the Trademark Act, which deals with trademark infringement. The plaintiff, WinZO Games Private Limited, alleges that Google LLC and others have infringed their registered trademark.\n\n**Key Quotes:**\n\n* \"A registered trade mark is infringed by a person who, not being a registered proprietor or a person using by way of permitted use, uses in the course of trade, a mark which...is identical with, or deceptively similar to, the trade mark...\"\n* \"Where an electronic record or online resource contains reasonable security practices and procedures as required under rule 8 of Information Technology (Reasonable Security Practices and Procedures and Sensitive Personal Data or Information) Rules, 2011...\"\n\n**Decisions:**\n\nThe case is awaiting further proceedings. \n\n**PDF Source:** WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors. (21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf)",
          "content": "2023/DHC/001117\nCS(COMM) 176/2022\nPage 7 of 11\nunder sub-rule (3) shall be deemed to have complied with\nreasonable security practices and procedures provided that\nsuch standard or the codes of best practices have been\ncertified or audited on a regular basis by entities through\nindependent\nauditor,\nduly\napproved\nby\nthe\nCentral\nGovernment. The audit of reasonable security practices and\nprocedures shall be carried cut by an auditor at least once a\nyear or as and when the body corporate or a person on its\nbehalf undertake significant upgradation of its process and\ncomputer resource.”\n15.\nThe counsel for the plaintiff has vehemently contended that the\ntrademark of the plaintiff is infringed/tarnished by the defendants when\nnaming the APK file/application ‘WinZO’ in the warning displayed for its\nusers. At this stage, reference may be made to the relevant provisions of\nSection 29, which are set out below:\n“29. Infringement\nof\nregistered\ntrade\nmarks.—(1)\nA\nregistered trade mark is infringed by a person who, not being a\nregistered proprietor or a person using by way of permitted\nuse, uses in the course of trade, a mark which is identical with,\nor deceptively similar to, the trade mark in relation to goods or\nservices in respect of which the trade mark is registered and in\nsuch manner as to render the use of the mark likely to be\ntaken as being used as a trade mark.\n…\n(4) A registered trade mark is infringed by a person who, not\nbeing a registered proprietor or a person using by way of\npermitted use, uses in the course of trade, a mark which—\n(a) is identical with or similar to the registered trade mark;\nand\n(b) is used in relation to goods or services which are not\nsimilar to those for which the trade mark is registered; and\n(c) the registered trade mark has a reputation in India and\nthe use of the mark without due cause takes unfair\nadvantage of or is detrimental to, the distinctive character\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified",
          "pdf_source": "21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf",
          "nodes": []
        },
        {
          "title": "Page 8",
          "node_id": "0010",
          "start_index": 8,
          "end_index": 8,
          "summary": "**Summary of Page 8 from PDF: 21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf**\n\nContext: Case Number: 2023/DHC/001117, CS(COMM) 176/2022\n\nOn page 8, the court discusses Section 29(8) of the Trade Marks Act, 1999. A registered trade mark is infringed by any advertising that:\n\n* Takes unfair advantage\n* Is contrary to honest practices in industrial or commercial matters\n* Damages the distinctive character of the trade mark\n* Harms the reputation of the trade mark\n\nThe court notes that defendants' use of plaintiff's trademark in a warning does not constitute \"a mark likely to be taken as being used as a trade mark\" under Section 29(1). Additionally, perusing Section 29(6), the court finds that the defendants' use is not covered by any of the sub-clauses (a-c) (i.e., affixing to goods, offering for sale, etc.).\n\n**Relevant Information:**\n\n* Date of Decision: February 14, 2023\n* Judge: HON'BLE MR. JUSTICE AMIT BANSAL\n* Case Number: 2023/DHC/001117, CS(COMM) 176/2022\n* PDF Source: 21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf",
          "content": "2023/DHC/001117\nCS(COMM) 176/2022\nPage 8 of 11\nor repute of the registered trade mark.\n…\n(6) For the purposes of this section, a person uses a registered\nmark, if, in particular, he—\n(a)affixes it to goods or the packaging thereof;\n(b)offers or exposes goods for sale, puts them on the\nmarket, or stocks them for those purposes under the\nregistered trade mark, or offers or supplies services under\nthe registered trade mark;\n(c) imports or exports goods under the mark; or\n(d) uses the registered trade mark on business papers or in\nadvertising.\n…\n(8) A registered trade mark is infringed by any advertising of\nthat trade mark if such advertising—\n(a) takes unfair advantage of and is contrary to honest\npractices in industrial or commercial matters; or\n(b) is detrimental to its distinctive character; or\n(c) is against the reputation of the trade mark.”\n16.\nThere is merit in the submission of the defendants that the use of the\nplaintiff’s trademark in the aforesaid warning shall not constitute as a ‘mark\nlikely to be taken as being used as a trade mark’ in terms of Section 29(1) of\nthe Trade Marks Act, 1999. Further, a perusal of Section 29(6) of the Trade\nMarks Act, 1999 would show that the use of the impugned marks by the\ndefendants in their warning is not covered in any of the sub-clauses (a), (b),\n(c) or (d) of Section 29(6). A perusal of the warning would show that the\nreference to the name of the APK file/application ‘WinZO’ is only for\nidentifying the file being downloaded for the purpose of the warning.\n17.\nIt is a settled position of law that to make out a case for infringement\nunder Section 29(4) of the Trade Marks Act, 1999, all three conditions under\nthe said provision have to be met. Since the defendant no.1, Google LLC is\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified",
          "pdf_source": "21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf",
          "nodes": []
        },
        {
          "title": "Page 9",
          "node_id": "0011",
          "start_index": 9,
          "end_index": 9,
          "summary": "Here is a summary of page 9 from the provided PDF:\n\n**Case Details**\n\n* Case No.: CS(COMM) 176/2022\n* Date: 14th February, 2023\n* Parties:\n\t+ Plaintiff: WinZO Games Private Limited (represented by Mr. Abhishek Malhotra and Ms. Atmja Tripathy)\n\t+ Defendants: Google LLC & Ors. (represented by Mr. Arun Kathpalia et al.)\n\n**Key Findings**\n\n* The defendants' use of the plaintiff's marks does not constitute \"use of the trademark in the course of trade\" under Section 29(4) of the Trade Marks Act, 1999.\n* There is no advertising for goods or services by the defendants using the plaintiff's marks.\n* No case is made out for infringement under Section 29(8) of the Trade Marks Act, 1999.\n\n**Court Decision**\n\n* The court finds that the plaintiff's reliance on Section 29 of the Trade Marks Act, 1999 to make out a case for infringement/tarnishment of its marks is misplaced.\n* No case of disparagement or inducement of breach of contract between a user and the plaintiff is made out.\n\n**Reference**\n\nSource: WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors., PDF file: 21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf",
          "content": "2023/DHC/001117\nCS(COMM) 176/2022\nPage 9 of 11\nnot providing any goods or services using the impugned trademarks, the\ncondition in sub-clause (b) of Section 29(4) is not satisfied. Hence, it does\nnot constitute ‘use of the trademark in the course of trade’ within the\nmeaning of Section 29(4). Further, since the defendant no.1 is not\nadvertising goods/services by using the plaintiff’s marks in any manner,\nthere is no case made out for infringement under Section 29(8) of the Trade\nMarks Act, 1999.\n18.\nTherefore, in my prima facie view, the reliance placed by the plaintiff\non Section 29 of the Trade Marks Act, 1999 to make out a case for\ninfringement/tarnishment of its ‘WinZO’/ ‘WinZO Games’ marks, is\nmisplaced.\n19.\nAs regards the ground of disparagement, indisputably, there is no\ncomparison between the products/services of the defendants with that of the\ngoods/services of the plaintiff. Nor is there any advertising for any goods or\nservices. Therefore, there is no competing interest of the products/services\nof the defendants involved and in my prima facie view, no case of\ndisparagement is made out.\n20.\nInsofar as the ground of inducement of breach of contract between a\nuser and the plaintiff is concerned, the act of a user opting to download an\napplication from the website of the plaintiff would not result in a contract.\nAt best, a contract can come into place once the application is installed.\nSince there is no contract in place at the time the warning is displayed, there\ncannot be any question of inducement to breach the same. In fact, in\nparagraph 21 of the plaint, the plaintiff has admitted that when a user clicks\non the download link on the plaintiff’s website, the user is only ‘willing to\nexecute’ a contract with the plaintiff. It is further stated that the warning\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified",
          "pdf_source": "21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0015",
      "start_index": 10,
      "end_index": 11,
      "summary": "**Source:** 21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf (Court Decision)\n\n**Case No.:** CS(COMM) 176/2022\n**Date of Decision:** February 14, 2023\n**Judge:** Hon'ble Mr. Justice Amit Bansal\n\n**Brief Overview:**\n\nThe Delhi High Court dismissed a complaint filed by WinZO Games Private Limited against Google LLC and others (defendants). The plaintiff alleged that the defendants' warning displayed on their Android Open Source (AOS) device/platform deters users from downloading WinZO's application, thereby inducing breach of contract.\n\n**Key Points:**\n\n* The court observed that the warning does not deter \"willing\" users from entering into a contract with the plaintiff.\n* The court found that the submission that the defendants' warning caused a decline in downloads was speculative and required evidence established at trial.\n* The Court dismissed the application, stating that no merit existed to support the complaint.\n* A separate application for condonation of delay in filing replication (a document responding to the defendant's pleading) was also dismissed as it exceeded the 45-day limit. The replication filed on behalf of the plaintiff is directed to be taken off the record.\n\n**Parties and Counsel:**\n\n* Plaintiff: WinZO Games Private Limited, represented by Mr. Abhishek Malhotra and Ms. Atmja Tripathy\n* Defendants: Google LLC & Ors., represented by Mr. Arun Kathpalia and others\n\n**Dates and References:**\n\n* October 19, 2020: Division Bench judgment in Ram Sarup Lugani & Anr. v. Nirmal Lugani & Ors.\n* February 14, 2023: Date of Court Decision\n* Page 11/11 of the PDF: Condonation of Delay Application dismissed",
      "pdf_source": "21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf",
      "nodes": [
        {
          "title": "Page 10",
          "node_id": "0013",
          "start_index": 10,
          "end_index": 10,
          "summary": "Here is a summary of page 10 from the PDF:\n\n**Case:** Winzo Games Private Limited vs. Google LLC & Ors.\n\n**Court:** High Court of Delhi at New Delhi\n\n**Date:** February 14, 2023 (Judgment)\n\n**Page 10 Summary:**\n\nThe plaintiff's argument that the defendant's warning deters users from entering into a contract with them is dismissed by the court as speculative. The court states that the plaintiff has not established a case on this ground and it can only be proven in the trial.\n\nThe court also notes that the warning displayed by the defendants does not constitute the tort of inducement for breach of contract.\n\n**Important points:**\n\n* Plaintiff's argument about warning deterring users is deemed speculative.\n* Case to be established through trial, not on face value.\n* Observations made are only relevant for this application and have no bearing on the final outcome of the suit.\n\n**Source:** 21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors/pdf (2023/DHC/001117)",
          "content": "2023/DHC/001117\nCS(COMM) 176/2022\nPage 10 of 11\ndeters ‘willing’ users from entering into a contract with the plaintiff.\nTherefore, there is no contract at the stage when the warning appears.\nParagraph 21 of the plaint is set out below:\n“21. It is further pertinent to note that when an internet user\nsearches ‘WinZO Games’ on any search engine or clicks on\nany paid/promoted links on any other social media platform or\nother internet-based platform and accesses the Plaintiff’s\nWebsite to download the Application, and ultimately clicks on\nthe download link on the Website, the said user is willing to\nexecute a contract with the Plaintiff by demonstrating a\nwillingness to download the Application. However, the Warning\ndisplayed on Defendants’ owned AOS device/platform deters\nsuch willing users from executing the contract with the Plaintiff.\nThe Plaintiff, therefore, states that the Defendants’ unwarranted\nand baseless Warning amounts to tort of inducement for breach\nof contract.”\n21.\nThe submission that the warning of the defendants has resulted in\ndecline of downloads from the plaintiff’s website is also speculative. At this\nstage, the plaintiff is yet to establish a case on the aforesaid ground. This\naspect can only be established in the trial.\n22.\nAccordingly, I do not find any merit in the application and the same is\ndismissed.\n23.\nNeedless to state, any observations made herein are only for the\npurposes of adjudication of the present application and would have no\nbearing on the final outcome of the suit.\nI.A. 18256/2022 (for condonation of delay of 93 days in filing\nreplication)\n24.\nCounsel for the plaintiff fairly admits that the replication has been\nfiled beyond maximum permissible period of 45 days as mandated in Rules\n5 and 7 of Chapter VII of the Delhi High Court (Original Side) Rules, 2018.\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified",
          "pdf_source": "21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf",
          "nodes": []
        },
        {
          "title": "Page 11",
          "node_id": "0014",
          "start_index": 11,
          "end_index": 11,
          "summary": "Here is a summary of page 11 from the PDF:\n\n**Case Details**\n\n* Case Number: CS(COMM) 176/2022\n* Plaintiff: Winzo Games Private Limited\n* Defendants: Google LLC & Ors.\n\n**Decision**\n\nThe Court has dismissed the plaintiff's application due to non-compliance with the rule that replication must be filed within 45 days. In view of the judgment in Ram Sarup Lugani v. Nirmal Lugani (FAO(OS) 47/2020), the delay cannot be condoned.\n\n**Action**\n\nThe replication filed by the plaintiff is directed to be taken off the record, and a separate order will be passed on it.\n\n**Next Hearing**\n\nList before the Joint Registrar for marking of exhibits on 22nd March, 2023.\n\n**Source**: WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors. (2022) [PDF file: 21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf]",
          "content": "2023/DHC/001117\nCS(COMM) 176/2022\nPage 11 of 11\nTherefore, in view of the judgment dated 19th October, 2020 of the Division\nBench in FAO(OS) 47/2020 titled Ram Sarup Lugani & Anr. v. Nirmal\nLugani & Ors., if the replication is filed beyond 45 days, the delay cannot\nbe condoned.\n25.\nIn view thereof, the present application is dismissed and the\nreplication filed on behalf of the plaintiff is directed to be taken off the\nrecord.\nCS(COMM) 176/2022\n26.\nList before the Joint Registrar for marking of exhibits on 22nd March,\n2023.\nAMIT BANSAL, J\nFEBRUARY 14, 2023\nsr\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified",
          "pdf_source": "21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-16T12:56:54.351617",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}