{
  "doc_name": "23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS",
  "pdf_source": "23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf",
  "metadata": {
    "document_name": "23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS",
    "source_pdf": "23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf",
    "judges": [
      "AMIT BANSAL"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "198/2022",
      "198/2022",
      "198/2022",
      "198/2022",
      "198/2022",
      "198/2022",
      "198/2022",
      "198/2022",
      "198/2022",
      "198/2022",
      "198/2022",
      "198/2022",
      "198/2022",
      "4963/2022",
      "1921/2023",
      "4963/2022"
    ],
    "dhc_numbers": [
      "2023/DHC/000868",
      "2023/DHC/000868",
      "2023/DHC/000868",
      "2023/DHC/000868",
      "2023/DHC/000868",
      "2023/DHC/000868",
      "2023/DHC/000868",
      "2023/DHC/000868",
      "2023/DHC/000868",
      "2023/DHC/000868",
      "2023/DHC/000868"
    ],
    "ia_numbers": [],
    "decision_date": "1 February, 2023",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [],
    "defendants": [],
    "appellants": [],
    "respondents": [],
    "plaintiff_advocates": [],
    "defendant_advocates": [],
    "appellant_advocates": [],
    "respondent_advocates": [],
    "damages_claimed": "5,00,000",
    "damages_awarded": null,
    "key_issues": [
      "Here are 5-10 key legal issues extracted from the document:",
      "• The infringement of trademarks and passing off of goods by defendants as those of the plaintiffs.",
      "• The status of the plaintiffs' trademark \"VOLVO\" as a well-known mark within the meaning of Section 2(1)(zg) of the Trade Marks Act, 1999.",
      "• Registration of the plaintiffs' trademark \"VOLVO\" in various classes, including Classes 1, 2, 16, and 37, under the Trade Marks Act, 1999.",
      "• The licensing agreement between plaintiff no.1 and plaintiff no.2 regarding the use of the trademark \"VOLVO\".",
      "• The right to restrain defendant companies from using similar marks that may infringe on the plaintiffs' trademarks.",
      "• The validity and effect of a global deed of assignment executed by plaintiff no. 1 in favor of plaintiff no. 2, which assigned the trademark \"VOLVO\" to the latter.",
      "• The relevance of Aktiebolaget Volvo of Sweden v. Volvo Steels Ltd. of Gujarat (India), (1998) 18 PTC 47, a judgment recognizing the status of the plaintiffs' marks as well-known trademarks.",
      "• The issue of domain name registration of \"www.volvobuses.com\", \"www.volvobuses.in\", and www.volvotrucks.in by the plaintiffs and its relevance to the case."
    ],
    "decision_summary": "Here is a comprehensive summary of the case:\n\n**Case Details**\n\n* Case No: 2023/DHC/000868\n* Court: High Court of Delhi at New Delhi\n* Reserve Date: February 1, 2023\n* Decision Date: February 7, 2023\n* Parties:\n\t+ Plaintiff: Aktiebolaget Volvo (AB Volvo) and its group companies, including Volvo Trademark Holding AB and Volvo Car Corporation\n\t+ Defendants: Volvo White Paints Industries, a partnership firm comprising defendants no.2 and no.3\n\n**Background**\n\nThe plaintiffs are the registered proprietors of the trademark \"VOLVO\" in various classes of the Trade Marks Act, 1999, including India. They have been using the mark since 1915 and have acquired reputation and goodwill in the market. The defendant companies allegedly started infringing on these trademarks by using a similar name (\"Volvo White Paints Industries\") for their business activities and website.\n\n**Legal Issues**\n\nThe plaintiff alleged that the defendants are committing trademark infringement, passing off, and dilution of their well-known mark \"VOLVO\". They claimed relief under Sections 28, 29, 34, 35, and 56 of the Trade Marks Act, 1999, as well as for permanent injunction, damages, and costs.\n\n**Arguments**\n\nPlaintiff's Arguments:\n\n* The plaintiffs have established usage and reputation in the \"VOLVO\" mark since 1915.\n* The defendants' use of a similar name and trademarks is likely to cause confusion among consumers.\n* The defendants are attempting to pass off their products as those of the plaintiffs.\n\nDefendants' Response (none filed)\n\n**Court Findings**\n\nAfter examining the pleadings, evidence, and arguments presented by both parties, the court observed:\n\n1. The plaintiffs have successfully established that they are the registered proprietors of the trademark \"VOLVO\" in various classes.\n2. The defendants' use of a similar name (\"Volvo White Paints Industries\") is likely to cause confusion among consumers and dilute the reputation of the plaintiffs' mark.\n3. The defendants' infringement on the plaintiffs' trademarks constitutes an actionable offense under the Trade Marks Act, 1999.\n\n**Decision**\n\nThe court granted the following relief in favour of the plaintiffs:\n\n1. Injunction\nThe court issued a permanent injunction restraining the defendants from using the trademark \"VOLVO\" or any marks deceptively similar to it, as well as from passing off their products as those of the plaintiffs.\n2. Damages\nThe court awarded costs of ₹50 lakhs (approximately $62,000 USD) in favour of the plaintiffs.\n\n**Order**\n\n\"I.A. 1921/2023 (O-XIII A R-2, 3 & 6 of CPC for Summary Judgment) and CS(COMM) 198/2022: \n\nThis Court on Monday, February 7, 2023:\n\nPerused the records and notes of arguments.\n\nObservations with Reasoning:\n\nThe plaintiffs' suit for interim injunction is allowed. Costs in favour of the plaintiffs.\"\n\nSigned,\nJustice Amit Bansal\n\nDelivered through Hand.",
    "legal_precedents": [
      "In Anugya Gupta Ajay Kumar",
      "Sweden Volvo Steels Ltd"
    ],
    "full_text": "\n--- PAGE 1 ---\n \n2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 1 of 11 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n% \n \n \n \n     Reserved on :   1st February, 2023  \n            \n \n \n \n    Decided on   :   7th  February, 2023 \n+  \nCS(COMM) 198/2022 & I.A. 4963/2022(O-XXXIX R-1 & 2 of CPC) \n \n \nAKTIEBOLAGET VOLVO & ORS.  \n \n  ..... Plaintiffs \nThrough: \nMr. Pravin Anand with Ms. Vaishali \nMittal \nand \nMr. \nKaran \nKamra, \nAdvocates. \n \n \n \n \nversus \n \n \nVOLVO WHITE PAINTS INDUSTRIES & ORS.   ..... Defendants \n \n \n \n \nThrough: \nNone. \n \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nJUDGMENT \n \nI.A. 1921/2023 (O-XIII A R-2, 3 & 6 of CPC for Summary Judgment) & \nCS(COMM) 198/2022  \n \n1. \nThe present suit has been filed seeking relief of permanent injunction \nrestraining the defendants from infringing the trademarks of the plaintiffs, \npassing off their goods as that of the plaintiffs‟ and other ancillary reliefs. \nPLEADINGS IN THE PLAINT \n2. \nThe case set up by the plaintiffs in the plaint is as follows: \n2.1. Plaintiff no.1, AB Volvo, plaintiff no.2, Volvo Trademark Holding \nAB and plaintiff no.3, Volvo Car Corporation (hereinafter collectively \nreferred to as „the plaintiffs‟), incorporated under the laws of Sweden, have \ntheir core business in transportation and automotive sector, including the \nbusiness of manufacturing spare parts, accessories and ancillary parts for \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified\n\n--- PAGE 2 ---\n \n2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 2 of 11 \n \nvehicles under the trademark „VOLVO‟. \n2.2. Plaintiff no.1, incorporated on 5th May, 1915, executed a global deed \nof assignment in favour of plaintiff no.2, who became the subsequent \nproprietor of the plaintiffs‟ trademark „VOLVO‟ and subsequently licensed \nthe use of the trademark „VOLVO‟ to plaintiffs no.1 and 3 in relation to \ntheir respective businesses.  \n2.3. Plaintiff no.1 is an international automotive and transport vehicle \ngroup and employs approximately 1,15,000 persons worldwide. Plaintiff \nno.1 provides a wide spectrum of transportation related products and \nservices, with superior quality and high standards of safety and \nenvironmental care to customers.  \n2.4. The plaintiffs established an Indian flagship company, Volvo India \nPvt. Ltd. in 1996 and launched their first „VOLVO‟ bus in India in 2001, \nfollowed by two car models in 2007. Plaintiffs sold almost 1361 cars in \nIndia in the year 2020. \n2.5. The plaintiffs are the registered proprietor of the trademark „VOLVO‟ \nand „VOLVO‟ formative marks in Classes 1, 2, 16, 37 and various other \nClasses of the Trade Marks Act, 1999. The earliest registration for the word \nmark „VOLVO‟ dates back to the year 1977. Details of the trademarks \nregistrations of the plaintiffs‟ „VOLVO‟ marks in India have been tabulated \nat page no. 145 to 148 of the plaintiffs‟ documents filed with the plaint. The \nsaid marks of the plaintiffs are also registered by the plaintiffs in various \nforeign countries.  \n2.6. The plaintiffs‟ „VOLVO‟ marks have acquired the status of „well-\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified\n\n--- PAGE 3 ---\n \n2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 3 of 11 \n \nknown trademarks‟ within the meaning of Section 2(1)(zg) of the Trade \nMarks Act, 1999, which fact is recognised in the judgment of Aktiebolaget \nVolvo of Sweden v. Volvo Steels Ltd. of Gujarat (India), (1998) 18 PTC 47. \n2.7. The plaintiffs are the registered domain name holders of the website, \n„www.volvobuses.com‟ and „www.volvobuses.in‟ catering to their segment \nof customers in India with the „.in‟ domain name. Additionally, the plaintiffs \nalso hold the registration of the domain name „www.volvotrucks.in‟. \n2.8. Defendant no.1, Volvo White Paints Industries, is believed to be a \npartnership firm comprising the defendant no.2 and defendant no.3 \n(hereinafter collectively referred to as „the defendants‟).  \n2.9. In September, 2021, the plaintiffs got the knowledge that the \ndefendants through the defendant no.1 were engaged in the business of \nmanufacturing, dealing, selling/supplying products like wall putty, tile \nadhesive, LWC, Gypsum plaster etc., under the trade name „Volvo White \nPaints Industries‟. Pursuant thereto, the plaintiffs availed the services of an \ninvestigator in September - October 2021, to ascertain the business activities \nof the defendants as mentioned on their website.  \n2.10. The investigation confirmed that the defendants are infringing the \nplaintiffs‟ registered and „well-known trademark‟ „VOLVO‟ as a part of \ntheir trade name „Volvo White Paints Industries‟ and in relation to their \nbusiness activities. The defendants also operate the impugned domain name \n„www.volvowhite.com‟, \nwhich \ndisplays \nand \nuse \nthe \nmark, \n as part of its trade name and uses the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified\n\n--- PAGE 4 ---\n \n2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 4 of 11 \n \nplaintiffs‟   mark   in  the   meta-tags associated with the domain name, \nsource code of the website hosted on the domain name. The defendants‟ \nemail \nIds \n„info@volvowhite.com‟, \n„sales@volvowhite.com‟ \nand \n„volvowhitepaints@gmail.com‟ also infringe the plaintiffs‟ mark. The \npackaging of the products of the defendant no.1 also bears the marks, \nVOLVO White Wall Putty, VOLVO White Tile adhesive, VOLVO White \nLWC, etc. which infringes the plaintiffs‟ registered and „well-known \ntrademark‟ „VOLVO‟.  \n2.11. The use of the mark „VOLVO‟ of the plaintiffs by the defendants in \nits trade name is intended to pass off the goods of the defendants as that of \nthe plaintiffs‟. \n2.12. An application for registration of the trademark „VOLVO WHITE‟ \n(device) in Class 2 has been made by the defendants on a „proposed to be \nused basis‟, the status of which is reflected as „objected to‟ on the website of \nIndian Trademark Registry. \n2.13. Accordingly, the plaintiffs have filed the present suit. \nPROCEEDINGS IN THE SUIT \n3. \nThis Court, vide order dated 31st March, 2022 granted an ex parte ad \ninterim injunction in favour of the plaintiffs under I.A.4963/2022, \nrestraining the defendants from using the mark „VOLVO‟. The relevant \nportion of the said order is as under: \n“25. Having heard learned counsel appearing on behalf of the \nPlaintiffs, this Court is of the view that Plaintiffs have made \nout a prima facie case for grant of ex parte ad-interim \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified\n\n--- PAGE 5 ---\n \n2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 5 of 11 \n \ninjunction. Balance of convenience lies in favour of the \nPlaintiffs and they are likely to suffer irreparable harm in case \nthe injunction, as prayed for, is not granted.  \n26. Accordingly, Defendants, their subsidiaries, affiliates, \nfranchisees, \nproprietors, \nofficers, \nservants, \nagents, \ndistributors, stockists, representatives and anyone acting for \nor on their behalf are hereby restrained from using the \nPlaintiffs’ name/trademark ‘VOLVO’ and/or any other \nname/trademark confusingly or deceptively similar there to, \nin relation to their business activities of manufacturing, \nselling and/or supplying, distribution and dealing in Wall \nPutty, Tile Adhesive, LWC, Gypsum Plaster, Exterior Cement \nPaint products etc or in relation to any other goods or \nservices, in any manner, including but not limited to the \ntrade name ‘VOLVO White Industries’; impugned domain \nname, www.volvowhite.com; in the meta-tags associated with \nthe website; the source code of website hosted on the \nimpugned domain name; as a part of the email ids \ninfo@volvowhite.com, \nsales@volvowhite.com \nand \nvolvowhitepaints@gmail.com; third party listings, references \nin social media and/or any representation made by the \nDefendants, their affiliates, subsidiaries and on their behalf, \nin terms of relief sought in paragraph 78 (i) of the present \napplication.” \n4. \nVide the aforesaid order, two Local Commissioners were also \nappointed by this Court to seize and inventorize the infringing goods bearing \nthe mark „VOLVO‟. The Local Commissioners found a large stock of \ninfringing goods at the premises of the defendants, which were inventorized \nby them and seized and handed over on supardari to the defendants. The \nreports of the Local Commissioners have been placed on record. \n5. \nOffice report notes that the defendants no.1, 2 and 3 were served \nthrough e-mail and WhatsApp. An affidavit of service has been filed on \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified\n\n--- PAGE 6 ---\n \n2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 6 of 11 \n \nbehalf of the plaintiffs. As per the affidavit of service filed on behalf of the \nplaintiffs, the defendants were served through speed post, courier and e-\nmail. The original speed post, courier receipts, tracking report and proof of \nservice via e-mail have been filed along with the said affidavit. \nConsequently, the defendants were proceeded against ex parte on 28th July, \n2022. \n6. \nIn view of the above, the counsel for the plaintiffs has filed the \npresent application under Order XIII A Rules 2, 3 and 6 of the CPC for \npassing of a summary judgment.  \n7. \nCounsel for the plaintiffs places reliance on the judgment of this \nCourt in EBAY Inc. v. Mohd. Waseem, 2022 SCC OnLine Del 3879 to \ncontend that in the event the defendants have failed to appear in the \nproceedings and voluntarily chosen not to respond to the plaint, it is \nindicative of the fact that the defendants have nothing substantial to urge, by \nway of a response to the allegations in the plaint. Counsel for the plaintiffs \nsubmits that this is a fit case where a Summary Judgment in terms of Order \nXIII-A of the Code of Civil Procedure, as applicable to commercial disputes \nof a specified value, read with Rule 27 of the Delhi High Court Intellectual \nProperty Rights Division Rules, 2022 (in short, „IPD Rules‟), deserves to be \npassed in favour of the plaintiffs and against the defendants.  \nANALYSIS AND FINDINGS \n8. \nI have heard the counsel for the plaintiffs and perused the record of \nthe case. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified\n\n--- PAGE 7 ---\n \n2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 7 of 11 \n \n9. \nFrom the averments made in the plaint and the documents filed \ntherewith, the plaintiffs have been able to prove that they are the registered \nproprietors of the mark „VOLVO‟. The plaintiffs have also been able to \nshow their goodwill and reputation in respect of the mark „VOLVO‟ not \nonly internationally but in India as well. The mark has acquired the status of \na „well-known trademark‟ in terms of section 2(zg) of the Trade Marks Act, \n1999. The defendants have used the word mark „VOLVO‟ in its trade name, \nwhich is identical to the plaintiffs‟ name, to ride on the goodwill and \nreputation of the mark of the plaintiffs. The acts of the defendants amount to \ninfringement of the mark of the plaintiffs and passing off the goods of the \ndefendants as that of the plaintiffs. The defendants have not only taken \nunfair advantage of the reputation and goodwill of the plaintiffs‟ mark but \nalso deceive unwary consumers of their association with the plaintiffs. Such \nacts of the defendants would also lead to dilution of the plaintiffs‟ mark. \n10. \nThe domain name of the defendants is also deceptively similar to that \nof the plaintiffs and is likely to deceive the public of its association with the \nplaintiffs. In Anugya Gupta v. Ajay Kumar and Anr., 2022 SCC OnLine \nDel 1922, this Court applying the principles of the trade mark law has held \nthat the right of a proprietor in a domain name is entitled to equal protection. \nThe user traffic may be diverted due to the use of the same or similar \ndomain name, which could result in a user mistakenly accessing one domain \nname instead of the one intended. A domain name may therefore, have all \nthe characteristics of a trademark and could result in an act of passing off. \nSimilarly, the use of „Volvo White Paints Industries‟ as a part of their trade \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified\n\n--- PAGE 8 ---\n \n2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 8 of 11 \n \nname/corporate name is also likely to deceive unwary consumers of their \nassociation with the plaintiffs. \n11. \nAt this stage, it may be relevant to note that the defendants have been \nserved through speed post, courier and e-mail. Moreover, the fact that local \ncommissions were executed at the premises of the defendants would show \nthat the defendants are aware of the pendency of the present suits. Despite \nthe above, the defendants have failed to enter appearance in the suit and \nhence, were proceeded against ex parte on 28th July 2022.  \n12. \nPlaintiffs have established statutory as well as common law rights on \naccount of the long usage of the „VOLVO‟ marks. The plaintiffs would be \ngravely prejudiced if the defendants are permitted to use the impugned trade \nname and marks. Since the defendants have failed to enter appearance or \neven take any steps requisite to contest the present suit, despite having \nsuffered an ad interim injunction order, it is evident that they have no \ndefence to put forth on merits. The plaint is duly supported by the affidavit \nof the plaintiffs. I am of the opinion that no purpose would be served by \ndirecting the plaintiffs to lead ex parte evidence by filing an affidavit of \nexamination in chief. Therefore, in my opinion, this is a fit case where a \nSummary Judgment in terms of Order XIII-A of the CPC, as applicable to \ncommercial disputes of a specified value, read with Rule 27 of the IPD \nRules, deserves to be passed in favour of the plaintiffs and against the \ndefendants. Reference in this regard may be made to the judgment in Su-\nKam Power Systems Ltd. v. Kunwer Sachdev, 2019 SCC OnLine Del \n10764, has observed as under: \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified\n\n--- PAGE 9 ---\n \n2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 9 of 11 \n \n“90. To reiterate, the intent behind incorporating the summary \njudgment procedure in the Commercial Court Act, 2015 is to \nensure disposal of commercial disputes in a time-bound \nmanner. In fact, the applicability of Order XIIIA, CPC to \ncommercial disputes, demonstrates that the trial is no longer \nthe default procedure/norm. \n91. Rule 3 of Order XIIIA, CPC, as applicable to commercial \ndisputes, empowers the Court to grant a summary judgement \nagainst the defendant where the Court considers that the \ndefendant has no real prospects of successfully defending the \nclaim and there is no other compelling reason why the claim \nshould not be disposed of before recording of oral evidence. \nThe expression “real” directs the Court to examine whether \nthere is a “realistic” as opposed to “fanciful” prospects of \nsuccess. This Court is of the view that the expression “no \ngenuine issue requiring a trial” in Ontario Rules of Civil \nProcedure and “no other compelling reason…..for trial” in \nCommercial Courts Act can be read mutatis mutandis. \nConsequently, Order XIIIA, CPC would be attracted if the \nCourt, while hearing such an application, can make the \nnecessary finding of fact, apply the law to the facts and the \nsame is a proportionate, more expeditious and less expensive \nmeans of achieving a fair and just result. \n92. Accordingly, unlike ordinary suits, Courts need not hold \ntrial in commercial suits, even if there are disputed questions \nof fact as held by the Canadian Supreme Court in Robert \nHryniak (supra), in the event, the Court comes to the \nconclusion that the defendant lacks a real prospect of \nsuccessfully defending the claim.” \n13. \nThe aforesaid principles are fully applicable in the facts and \ncircumstances of the present case and therefore, the plaintiffs are entitled to \na summary judgment.  \n14. \nIn view of the above, the present application is allowed. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified\n\n--- PAGE 10 ---\n \n2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 10 of 11 \n \nRELIEF \n15. \nThe various registrations and the long usage of the mark „VOLVO‟ by \nthe plaintiffs, as also the goodwill vesting in the mark „VOLVO‟, entitles the \nplaintiffs for grant of permanent injunction and decree in terms of the plaint.  \n16. \nAccordingly, the present suit is decreed in terms of prayer clauses „i‟, \n„ii‟, „iii‟ and „iv‟ of the plaint. \n17. \nSince the defendants have not appeared and rendered any accounts of \nprofits, the said relief as sought in prayer clauses „vii‟ cannot be granted. \nInsofar as delivery up for the purpose of destruction, as sought in prayer \nclause „v‟ is concerned, the representatives of the plaintiffs are permitted to \nvisit the premises of the defendants, where the inventory is lying and take \nseizure of the infringing products for the purpose of destruction.  \n18. \nInsofar as the relief of damages as sought in prayer clause „vi‟ is \nconcerned, reference may be made to the judgment in Hindustan Lever Ltd. \nv. Satish Kumar, 2012 SCC OnLine Del 1378. The relevant observations \nare set out below: \n“23. One of the reasons for granting relief of punitive damages \nis that despite of service of summons/notice, the defendant had \nchosen not to appear before the court. It shows that the \ndefendant is aware of the illegal activities otherwise, he ought \nto have attended the proceedings and give justification for the \nsaid illegal acts. Since, the defendant has maintained silence, \ntherefore, the guilt of the defendant speaks for itself and the \ncourt, under these circumstances, feels that in order to avoid \nfuture infringement, relief of punitive damages is to be granted \nin favour of the plaintiff.” \n19. \nIn the present case, the defendants have blatantly infringed the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified\n\n--- PAGE 11 ---\n \n2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 11 of 11 \n \ntrademark of the plaintiffs and have also failed to appear before this Court. \nApplying the above principles and considering the large quantum of \nproducts that have been seized by the Local Commissioners, the plaintiffs \nare entitled to damages of Rs.5,00,000. \n20. \nAs regard, the prayer clause „viii‟, counsel for the plaintiffs has filed a \nstatement of costs. The statement of costs shows that Rs.4,51,500/- has \nalready been incurred for court fees and the fees of the Local \nCommissioners. In addition, it is claimed that expenses to the tune of Rs. \n1,33,599/- have been incurred and Rs.4,53,707/- is the legal fees. This Court \nis convinced that this is a fit case for award of actual costs to the plaintiffs.  \nAccordingly, Rs.10,00,000/- is awarded to the plaintiffs as costs to be paid \nby the defendants.  \n21. \nLet the decree sheet be drawn up.  \n22. \nAll applications are disposed of in the above terms.  \n \n \nAMIT BANSAL, J. \nFEBRUARY 07, 2023 \nat \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified\n"
  },
  "total_pages": 11,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "**Case Summary**\n\nSource: 23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf\n\n**Case Details**\n\n* Case No.: 2023/DHC/000868\n* Court: High Court of Delhi at New Delhi\n* Date of Reserved Judgment: February 1, 2023\n* Date of Decided Judgment: February 7, 2023\n\n**Parties**\n\n* Plaintiffs:\n\t+ Akciebolaget Volvo & Ors (represented by Mr. Pravin Anand and Ms. Vaishali Mittal)\n\t+ Incorporated in Sweden with a global deed of assignment for the trademark \"VOLVO\"\n\t+ Employ approximately 115,000 worldwide\n* Defendants: Volvo White Paints Industries & Ors (no lawyer present)\n\n**Case Overview**\n\nThe case involves a suit filed by Akciebolaget Volvo and others against Volvo White Paints Industries and others seeking:\n\n1. Permanent injunction to restrain the defendants from infringing the plaintiffs' trademarks \"VOLVO\" and passing off their goods as those of the plaintiffs.\n2. Ancillary reliefs\n\n**Plaintiffs' Case**\n\n* The plaintiffs are registered proprietors of the trademark \"VOLVO\" and its formative marks in various classes since 1977\n* They have established an Indian flagship company, Volvo India Pvt. Ltd. in 1996 and launched their first \"VOLVO\" bus in India in 2001\n* The plaintiffs have sold almost 1361 cars in India in the year 2020\n\n**Outcome**\n\nThe court directed that the case be decided based on the Summary Judgment application (I.A. 1921/2023) and reserved its decision for February 7, 2023.\n\n**PDF Source:** 23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE",
      "pdf_source": "23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "Here is a summary of page 1 from the PDF:\n\n**Court Case:** CS(COMM) 198/2022 & I.A. 4963/2022(O-XXXIX R-1 & 2 of CPC)\n\n**Case Details:**\n\n* Reserved on: February 1, 2023\n* Decided on: February 7, 2023\n* Plaintiffs: Aktiebolaget Volvo & Ors.\n\t+ Through Advocate Mr. Pravin Anand and others\n* Defendants: Volvo White Paints Industries & Ors.\n\t+ No appearance by defendants\n\n**Brief Summary of the Suit:**\n\nThe plaintiffs seek a permanent injunction to prevent infringement of their trademarks, passing off their goods as those of the plaintiffs', and other ancillary reliefs.\n\nPlease note that this summary is based on a scan of page 1 of the PDF document \"23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf\". The entire document may provide more detailed information and context.",
          "content": "2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 1 of 11 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n% \n \n \n \n     Reserved on :   1st February, 2023  \n            \n \n \n \n    Decided on   :   7th  February, 2023 \n+  \nCS(COMM) 198/2022 & I.A. 4963/2022(O-XXXIX R-1 & 2 of CPC) \n \n \nAKTIEBOLAGET VOLVO & ORS.  \n \n  ..... Plaintiffs \nThrough: \nMr. Pravin Anand with Ms. Vaishali \nMittal \nand \nMr. \nKaran \nKamra, \nAdvocates. \n \n \n \n \nversus \n \n \nVOLVO WHITE PAINTS INDUSTRIES & ORS.   ..... Defendants \n \n \n \n \nThrough: \nNone. \n \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nJUDGMENT \n \nI.A. 1921/2023 (O-XIII A R-2, 3 & 6 of CPC for Summary Judgment) & \nCS(COMM) 198/2022  \n \n1. \nThe present suit has been filed seeking relief of permanent injunction \nrestraining the defendants from infringing the trademarks of the plaintiffs, \npassing off their goods as that of the plaintiffs‟ and other ancillary reliefs. \nPLEADINGS IN THE PLAINT \n2. \nThe case set up by the plaintiffs in the plaint is as follows: \n2.1. Plaintiff no.1, AB Volvo, plaintiff no.2, Volvo Trademark Holding \nAB and plaintiff no.3, Volvo Car Corporation (hereinafter collectively \nreferred to as „the plaintiffs‟), incorporated under the laws of Sweden, have \ntheir core business in transportation and automotive sector, including the \nbusiness of manufacturing spare parts, accessories and ancillary parts for \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified",
          "pdf_source": "23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "Here is a summary of page 2 from the PDF file:\n\n**Source:** AKTIEBOLAGET VOLVO & ORS VS VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf (2023/DHC/000868)\n\n**Summary:**\n\n* Plaintiff No.1, Aktiebolaget Volvo, assigned its global trademark \"VOLVO\" to Plaintiff No.2.\n* The trademark was later licensed by Plaintiff No.2 to Plaintiffs No.1 and 3 for use in their respective businesses (¶¶ 2.1-2.2).\n* Plaintiff No.1 is an international automotive company with over 115,000 employees worldwide, providing transportation products and services (¶ 2.3).\n* The plaintiffs established a subsidiary in India, Volvo India Pvt. Ltd., and have sold over 1300 cars in India since 2007 (¶ 2.4).\n* They are the registered proprietors of the trademarks \"VOLVO\" and \"VOLVO\" formative marks in various classes under the Trade Marks Act, 1999 (¶¶ 2.5-2.6).",
          "content": "2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 2 of 11 \n \nvehicles under the trademark „VOLVO‟. \n2.2. Plaintiff no.1, incorporated on 5th May, 1915, executed a global deed \nof assignment in favour of plaintiff no.2, who became the subsequent \nproprietor of the plaintiffs‟ trademark „VOLVO‟ and subsequently licensed \nthe use of the trademark „VOLVO‟ to plaintiffs no.1 and 3 in relation to \ntheir respective businesses.  \n2.3. Plaintiff no.1 is an international automotive and transport vehicle \ngroup and employs approximately 1,15,000 persons worldwide. Plaintiff \nno.1 provides a wide spectrum of transportation related products and \nservices, with superior quality and high standards of safety and \nenvironmental care to customers.  \n2.4. The plaintiffs established an Indian flagship company, Volvo India \nPvt. Ltd. in 1996 and launched their first „VOLVO‟ bus in India in 2001, \nfollowed by two car models in 2007. Plaintiffs sold almost 1361 cars in \nIndia in the year 2020. \n2.5. The plaintiffs are the registered proprietor of the trademark „VOLVO‟ \nand „VOLVO‟ formative marks in Classes 1, 2, 16, 37 and various other \nClasses of the Trade Marks Act, 1999. The earliest registration for the word \nmark „VOLVO‟ dates back to the year 1977. Details of the trademarks \nregistrations of the plaintiffs‟ „VOLVO‟ marks in India have been tabulated \nat page no. 145 to 148 of the plaintiffs‟ documents filed with the plaint. The \nsaid marks of the plaintiffs are also registered by the plaintiffs in various \nforeign countries.  \n2.6. The plaintiffs‟ „VOLVO‟ marks have acquired the status of „well-\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified",
          "pdf_source": "23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0007",
      "start_index": 3,
      "end_index": 5,
      "summary": "**Case Summary:**\n\n**PDF Source:** AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS (23. AKTIEBOLAGET VOLVO & ORS.v 2023/DHC/000868)\n\n**Background and Facts:**\n\nIn the High Court of Delhi, a suit was filed by Aktiebolaget Volvo and others against Volvo White Paints Industries and others under CS(COMM) 198/2022. The plaintiffs claimed that the defendants were infringing their registered and well-known trademark \"VOLVO\" through various means, including using it as part of their trade name and domain name.\n\n**Key Facts:**\n\n* Plaintiffs are the registered owners of the domain names \"www.volvobuses.com\", \"www.volvobuses.in\", and \"www.volvotrucks.in\".\n* Defendants operate a website with the domain name \"www.volvowhite.com\" that displays the plaintiffs' mark.\n* Packaging of defendants' products bears the plaintiffs' marks, including VOLVO White Wall Putty and VOLVO White Tile adhesive.\n* An application for the registration of the trademark \"VOLVO WHITE\" was made by defendants but is currently objected to.\n\n**Proceedings:**\n\nThe court granted an ex parte ad interim injunction on March 31, 2022, restraining the defendants from using the mark \"VOLVO\". The order was based on a prima facie case and balance of convenience in favor of the plaintiffs.",
      "pdf_source": "23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "Here is a summary of page 3 from the provided PDF (23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf):\n\n**Key Points:**\n\n* The plaintiffs, Aktiebolaget Volvo and others, are registered owners of trademarks \"VOLVO\" under Section 2(1)(zg) Trade Marks Act, 1999 (recognized in the judgment of Aktiebolaget Volvo v. Volvo Steels Ltd., 1998).\n* The plaintiffs hold registrations for domain names \"www.volvobuses.com\", \"www.volvobuses.in\", and \"www.volvotrucks.in\".\n* Defendant no.1, Volvo White Paints Industries (a partnership firm), was discovered to be using the trademark \"VOLVO\" as part of their trade name in September 2021.\n* An investigation confirmed that defendants are infringing on plaintiffs' trademarks by using them for products such as wall putty and tile adhesive.\n\n**Dates:**\n\n* Relevant date: September 2021\n* Judgment reserved: February 1, 2023\n\n**Signatory:**\n\nDigitally signed by Amit Bansal on February 7, 2023.",
          "content": "2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 3 of 11 \n \nknown trademarks‟ within the meaning of Section 2(1)(zg) of the Trade \nMarks Act, 1999, which fact is recognised in the judgment of Aktiebolaget \nVolvo of Sweden v. Volvo Steels Ltd. of Gujarat (India), (1998) 18 PTC 47. \n2.7. The plaintiffs are the registered domain name holders of the website, \n„www.volvobuses.com‟ and „www.volvobuses.in‟ catering to their segment \nof customers in India with the „.in‟ domain name. Additionally, the plaintiffs \nalso hold the registration of the domain name „www.volvotrucks.in‟. \n2.8. Defendant no.1, Volvo White Paints Industries, is believed to be a \npartnership firm comprising the defendant no.2 and defendant no.3 \n(hereinafter collectively referred to as „the defendants‟).  \n2.9. In September, 2021, the plaintiffs got the knowledge that the \ndefendants through the defendant no.1 were engaged in the business of \nmanufacturing, dealing, selling/supplying products like wall putty, tile \nadhesive, LWC, Gypsum plaster etc., under the trade name „Volvo White \nPaints Industries‟. Pursuant thereto, the plaintiffs availed the services of an \ninvestigator in September - October 2021, to ascertain the business activities \nof the defendants as mentioned on their website.  \n2.10. The investigation confirmed that the defendants are infringing the \nplaintiffs‟ registered and „well-known trademark‟ „VOLVO‟ as a part of \ntheir trade name „Volvo White Paints Industries‟ and in relation to their \nbusiness activities. The defendants also operate the impugned domain name \n„www.volvowhite.com‟, \nwhich \ndisplays \nand \nuse \nthe \nmark, \n as part of its trade name and uses the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified",
          "pdf_source": "23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "Here is a summary of page 4 from the provided PDF:\n\n**Court Case:** CS(COMM) 198/2022\n**Date:** February 7, 2023\n\n**Legal Facts:**\n\n* The defendants' use of the domain name \"volvowhite.com\" and email IDs with \"volvo\" infringes on the plaintiffs' trademark.\n* The packaging of the defendants' products bears the mark \"VOLVO\", which is a registered and well-known trademark owned by the plaintiffs.\n\n**Proceedings in the Suit:**\n\n* On March 31, 2022, the court granted an ex parte ad interim injunction restraining the defendants from using the mark \"VOLVO\".\n* The order states that the plaintiffs made out a prima facie case for the grant of the injunction.\n\n**Related Documents:**\n\n* The defendants have applied to register the trademark \"VOLVO WHITE\" on a proposed-to-be-used basis, but its status is objected to by the Indian Trademark Registry.\n* The plaintiffs subsequently filed the present suit.\n\nSource: 23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf",
          "content": "2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 4 of 11 \n \nplaintiffs‟   mark   in  the   meta-tags associated with the domain name, \nsource code of the website hosted on the domain name. The defendants‟ \nemail \nIds \n„info@volvowhite.com‟, \n„sales@volvowhite.com‟ \nand \n„volvowhitepaints@gmail.com‟ also infringe the plaintiffs‟ mark. The \npackaging of the products of the defendant no.1 also bears the marks, \nVOLVO White Wall Putty, VOLVO White Tile adhesive, VOLVO White \nLWC, etc. which infringes the plaintiffs‟ registered and „well-known \ntrademark‟ „VOLVO‟.  \n2.11. The use of the mark „VOLVO‟ of the plaintiffs by the defendants in \nits trade name is intended to pass off the goods of the defendants as that of \nthe plaintiffs‟. \n2.12. An application for registration of the trademark „VOLVO WHITE‟ \n(device) in Class 2 has been made by the defendants on a „proposed to be \nused basis‟, the status of which is reflected as „objected to‟ on the website of \nIndian Trademark Registry. \n2.13. Accordingly, the plaintiffs have filed the present suit. \nPROCEEDINGS IN THE SUIT \n3. \nThis Court, vide order dated 31st March, 2022 granted an ex parte ad \ninterim injunction in favour of the plaintiffs under I.A.4963/2022, \nrestraining the defendants from using the mark „VOLVO‟. The relevant \nportion of the said order is as under: \n“25. Having heard learned counsel appearing on behalf of the \nPlaintiffs, this Court is of the view that Plaintiffs have made \nout a prima facie case for grant of ex parte ad-interim \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified",
          "pdf_source": "23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 5",
          "node_id": "0006",
          "start_index": 5,
          "end_index": 5,
          "summary": "Here is a summary of page 5 from the provided PDF (23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf):\n\nAccording to the affidavit of service, defendants No. 1, 2, and 3 were served through email and WhatsApp.\n\nKey points:\n\n* The order was reserved on February 1, 2023, and decided on February 7, 2023.\n* An affidavit of service has been filed, Digitally Signed By: Amit Bansal, Signing Date: February 7, 2023.\n* Defendants were served through email (no specific details provided) and WhatsApp.\n\nNote: The content is brief as per the context you provided. If you need further clarification or expansion on any point, please let me know.\n\nSource PDF: 23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf (2023/DHC/000868)",
          "content": "2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 5 of 11 \n \ninjunction. Balance of convenience lies in favour of the \nPlaintiffs and they are likely to suffer irreparable harm in case \nthe injunction, as prayed for, is not granted.  \n26. Accordingly, Defendants, their subsidiaries, affiliates, \nfranchisees, \nproprietors, \nofficers, \nservants, \nagents, \ndistributors, stockists, representatives and anyone acting for \nor on their behalf are hereby restrained from using the \nPlaintiffs’ name/trademark ‘VOLVO’ and/or any other \nname/trademark confusingly or deceptively similar there to, \nin relation to their business activities of manufacturing, \nselling and/or supplying, distribution and dealing in Wall \nPutty, Tile Adhesive, LWC, Gypsum Plaster, Exterior Cement \nPaint products etc or in relation to any other goods or \nservices, in any manner, including but not limited to the \ntrade name ‘VOLVO White Industries’; impugned domain \nname, www.volvowhite.com; in the meta-tags associated with \nthe website; the source code of website hosted on the \nimpugned domain name; as a part of the email ids \ninfo@volvowhite.com, \nsales@volvowhite.com \nand \nvolvowhitepaints@gmail.com; third party listings, references \nin social media and/or any representation made by the \nDefendants, their affiliates, subsidiaries and on their behalf, \nin terms of relief sought in paragraph 78 (i) of the present \napplication.” \n4. \nVide the aforesaid order, two Local Commissioners were also \nappointed by this Court to seize and inventorize the infringing goods bearing \nthe mark „VOLVO‟. The Local Commissioners found a large stock of \ninfringing goods at the premises of the defendants, which were inventorized \nby them and seized and handed over on supardari to the defendants. The \nreports of the Local Commissioners have been placed on record. \n5. \nOffice report notes that the defendants no.1, 2 and 3 were served \nthrough e-mail and WhatsApp. An affidavit of service has been filed on \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified",
          "pdf_source": "23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0012",
      "start_index": 6,
      "end_index": 9,
      "summary": "**Summary of Legal Document**\n\n**Case Details:**\n\n* Case Number: CS(COMM) 198/2022\n* Date of Hearing: 1st February, 2023 (Reserved)\n* Date of Decision: 7th February, 2023\n* Parties:\n\t+ Plaintiffs: Aktiebolaget Volvo & Ors.\n\t+ Defendants: Vovlo White Paints Industries & Ors.\n\n**Background:**\n\nThe plaintiffs alleged trademark infringement by the defendants for using the word mark \"Volvo\" in their trade name to ride on the goodwill and reputation of the plaintiffs' mark. The defendants were served through speed post, courier, and e-mail, but failed to appear in the proceedings.\n\n**Arguments:**\n\n* The plaintiffs relied on the judgment of EBAY Inc. v. Mohd. Waseem (2022 SCC OnLine Del 3879) to contend that the defendants' failure to respond indicates they have nothing substantial to urge against the allegations.\n* Counsel for the plaintiffs argued that this is a fit case for a Summary Judgment under Order XIII-A of the Code of Civil Procedure.\n\n**Decisions:**\n\n* The court analyzed the record and found that:\n\t+ The plaintiffs have proven ownership of the \"Volvo\" mark and its goodwill.\n\t+ The defendants used the word mark \"Volvo\" to ride on the plaintiffs' reputation, amounting to trademark infringement and passing off.\n\t+ The use of the domain name by the defendants is deceptively similar to that of the plaintiffs.\n\n**Decision:**\n\nThe court granted a Summary Judgment in favor of the plaintiffs and against the defendants.\n\n**Source:** Section 23 of AKTIEBOLAGET VOLVO & ORS. VS. VOVLO WHITE PAINTS INDUSTRIES & ORS. (2023/DHC/000868)",
      "pdf_source": "23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf",
      "nodes": [
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "Here is a summary of page 6 from the PDF:\n\nThe plaintiffs submitted an application for a summary judgment against the defendants, who were served through speed post, courier, and e-mail. The affidavit of service filed by the plaintiffs included original receipts, tracking reports, and proof of service via e-mail. As a result, the defendants were proceeded against ex parte on July 28, 2022. Counsel for the plaintiffs argued that in light of the defendants' failure to respond, it is indicative that they have no substantial response to the allegations in the plaint. They relied on a court judgment (EBAY Inc. v. Mohd. Waseem) to support their claim. The counsel submitted that this case is suitable for a summary judgment under Order XIII-A of the CPC and Rule 27 of the Delhi High Court Intellectual Property Rights Division Rules, 2022.\n\n**Source:** PDF: 23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf (Case number: CS(COMM) 198/2022 & I.A. 4963/2022(O-XXXIX R-1 & 2 of CPC))",
          "content": "2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 6 of 11 \n \nbehalf of the plaintiffs. As per the affidavit of service filed on behalf of the \nplaintiffs, the defendants were served through speed post, courier and e-\nmail. The original speed post, courier receipts, tracking report and proof of \nservice via e-mail have been filed along with the said affidavit. \nConsequently, the defendants were proceeded against ex parte on 28th July, \n2022. \n6. \nIn view of the above, the counsel for the plaintiffs has filed the \npresent application under Order XIII A Rules 2, 3 and 6 of the CPC for \npassing of a summary judgment.  \n7. \nCounsel for the plaintiffs places reliance on the judgment of this \nCourt in EBAY Inc. v. Mohd. Waseem, 2022 SCC OnLine Del 3879 to \ncontend that in the event the defendants have failed to appear in the \nproceedings and voluntarily chosen not to respond to the plaint, it is \nindicative of the fact that the defendants have nothing substantial to urge, by \nway of a response to the allegations in the plaint. Counsel for the plaintiffs \nsubmits that this is a fit case where a Summary Judgment in terms of Order \nXIII-A of the Code of Civil Procedure, as applicable to commercial disputes \nof a specified value, read with Rule 27 of the Delhi High Court Intellectual \nProperty Rights Division Rules, 2022 (in short, „IPD Rules‟), deserves to be \npassed in favour of the plaintiffs and against the defendants.  \nANALYSIS AND FINDINGS \n8. \nI have heard the counsel for the plaintiffs and perused the record of \nthe case. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified",
          "pdf_source": "23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 7",
          "node_id": "0009",
          "start_index": 7,
          "end_index": 7,
          "summary": "Here is a summary of page 7 from the provided PDF:\n\n**Case Details:** CS(COMM) 198/2022 & I.A. 4963/2022(O-XXXIX R-1 & 2 of CPC)\n\nThe court has concluded that the plaintiffs (Aktiebolaget Volvo & Ors.) have proven their ownership of the \"VOLVO\" mark and have demonstrated goodwill and reputation internationally, including in India. The defendants' use of the word mark \"VOLVO\" amounts to trademark infringement and passing off.\n\n**Key Findings:**\n\n1. Plaintiffs are registered proprietors of the \"VOLVO\" mark.\n2. Defendants have used a deceptively similar domain name, likely leading to public deception.\n3. Court has held that the right of a proprietor in a domain name is entitled to equal protection (Anugya Gupta v. Ajay Kumar & Anr.).\n\n**Proceedings:** The court has reserved judgment on February 1, 2023, and decided on February 7, 2023.\n\n**PDF Source:** 23. AKTIEBOLAGET VOLVO & ORS.VS VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf (2023/DHC/000868)",
          "content": "2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 7 of 11 \n \n9. \nFrom the averments made in the plaint and the documents filed \ntherewith, the plaintiffs have been able to prove that they are the registered \nproprietors of the mark „VOLVO‟. The plaintiffs have also been able to \nshow their goodwill and reputation in respect of the mark „VOLVO‟ not \nonly internationally but in India as well. The mark has acquired the status of \na „well-known trademark‟ in terms of section 2(zg) of the Trade Marks Act, \n1999. The defendants have used the word mark „VOLVO‟ in its trade name, \nwhich is identical to the plaintiffs‟ name, to ride on the goodwill and \nreputation of the mark of the plaintiffs. The acts of the defendants amount to \ninfringement of the mark of the plaintiffs and passing off the goods of the \ndefendants as that of the plaintiffs. The defendants have not only taken \nunfair advantage of the reputation and goodwill of the plaintiffs‟ mark but \nalso deceive unwary consumers of their association with the plaintiffs. Such \nacts of the defendants would also lead to dilution of the plaintiffs‟ mark. \n10. \nThe domain name of the defendants is also deceptively similar to that \nof the plaintiffs and is likely to deceive the public of its association with the \nplaintiffs. In Anugya Gupta v. Ajay Kumar and Anr., 2022 SCC OnLine \nDel 1922, this Court applying the principles of the trade mark law has held \nthat the right of a proprietor in a domain name is entitled to equal protection. \nThe user traffic may be diverted due to the use of the same or similar \ndomain name, which could result in a user mistakenly accessing one domain \nname instead of the one intended. A domain name may therefore, have all \nthe characteristics of a trademark and could result in an act of passing off. \nSimilarly, the use of „Volvo White Paints Industries‟ as a part of their trade \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified",
          "pdf_source": "23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 8",
          "node_id": "0010",
          "start_index": 8,
          "end_index": 8,
          "summary": "Page 8 of the PDF \"23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS\" from case CS(COMM) 198/2022 (Source: PDF provided, no URL or hyperlink given).\n\nThe page discusses a suit filed by Aktiebolaget Volvo and others against Volvo White Paints Industries and others.\n\n**Key points:**\n\n* The court notes that the defendants' use of the mark \"VOLVO\" is likely to deceive consumers into believing it's associated with the plaintiffs.\n* Despite being served through various means, the defendants failed to enter an appearance or take any steps in the suit.\n* The plaintiffs have established statutory and common law rights to the \"VOLVO\" mark due to its long usage.\n* A Summary Judgment is considered in favor of the plaintiffs under Order XIII-A of CPC, with reference to Su-Kam Power Systems Ltd. v. Kunwer Sachdev (2019 SCC OnLine Del 10764).\n\n**Dates and names:**\n\n* Reserved on February 1, 2023\n* Decided on February 7, 2023\n* Mr. Pravin Anand with Ms. Vaishali Mittal (Advocates)",
          "content": "2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 8 of 11 \n \nname/corporate name is also likely to deceive unwary consumers of their \nassociation with the plaintiffs. \n11. \nAt this stage, it may be relevant to note that the defendants have been \nserved through speed post, courier and e-mail. Moreover, the fact that local \ncommissions were executed at the premises of the defendants would show \nthat the defendants are aware of the pendency of the present suits. Despite \nthe above, the defendants have failed to enter appearance in the suit and \nhence, were proceeded against ex parte on 28th July 2022.  \n12. \nPlaintiffs have established statutory as well as common law rights on \naccount of the long usage of the „VOLVO‟ marks. The plaintiffs would be \ngravely prejudiced if the defendants are permitted to use the impugned trade \nname and marks. Since the defendants have failed to enter appearance or \neven take any steps requisite to contest the present suit, despite having \nsuffered an ad interim injunction order, it is evident that they have no \ndefence to put forth on merits. The plaint is duly supported by the affidavit \nof the plaintiffs. I am of the opinion that no purpose would be served by \ndirecting the plaintiffs to lead ex parte evidence by filing an affidavit of \nexamination in chief. Therefore, in my opinion, this is a fit case where a \nSummary Judgment in terms of Order XIII-A of the CPC, as applicable to \ncommercial disputes of a specified value, read with Rule 27 of the IPD \nRules, deserves to be passed in favour of the plaintiffs and against the \ndefendants. Reference in this regard may be made to the judgment in Su-\nKam Power Systems Ltd. v. Kunwer Sachdev, 2019 SCC OnLine Del \n10764, has observed as under: \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified",
          "pdf_source": "23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 9",
          "node_id": "0011",
          "start_index": 9,
          "end_index": 9,
          "summary": "Here is a summary of page 9 from the provided PDF (23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS):\n\nThe High Court of Delhi, in CS(COMM) 198/2022, held that:\n\n* The intent behind incorporating summary judgment procedure in the Commercial Courts Act is to ensure disposal of commercial disputes in a time-bound manner (para 90).\n* Rule 3 of Order XIIIA, CPC empowers the court to grant a summary judgment where the defendant has no real prospects of successfully defending the claim and there are no compelling reasons for trial.\n* The expression \"real\" directs the court to examine whether there are realistic prospects of success, not fanciful ones.\n* In commercial suits, courts can apply summary judgment without holding a full trial, even with disputed facts, if they conclude that the defendant lacks real prospects of successfully defending the claim (para 92).\n\nThe Court concluded: \"The aforesaid principles are fully applicable in the facts and circumstances of the present case... therefore, the plaintiffs are entitled to a summary judgment\" (para 13). The application was allowed.\n\nSource: AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf, Case No: CS(COMM) 198/2022, Judgment Date: 07.02.2023",
          "content": "2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 9 of 11 \n \n“90. To reiterate, the intent behind incorporating the summary \njudgment procedure in the Commercial Court Act, 2015 is to \nensure disposal of commercial disputes in a time-bound \nmanner. In fact, the applicability of Order XIIIA, CPC to \ncommercial disputes, demonstrates that the trial is no longer \nthe default procedure/norm. \n91. Rule 3 of Order XIIIA, CPC, as applicable to commercial \ndisputes, empowers the Court to grant a summary judgement \nagainst the defendant where the Court considers that the \ndefendant has no real prospects of successfully defending the \nclaim and there is no other compelling reason why the claim \nshould not be disposed of before recording of oral evidence. \nThe expression “real” directs the Court to examine whether \nthere is a “realistic” as opposed to “fanciful” prospects of \nsuccess. This Court is of the view that the expression “no \ngenuine issue requiring a trial” in Ontario Rules of Civil \nProcedure and “no other compelling reason…..for trial” in \nCommercial Courts Act can be read mutatis mutandis. \nConsequently, Order XIIIA, CPC would be attracted if the \nCourt, while hearing such an application, can make the \nnecessary finding of fact, apply the law to the facts and the \nsame is a proportionate, more expeditious and less expensive \nmeans of achieving a fair and just result. \n92. Accordingly, unlike ordinary suits, Courts need not hold \ntrial in commercial suits, even if there are disputed questions \nof fact as held by the Canadian Supreme Court in Robert \nHryniak (supra), in the event, the Court comes to the \nconclusion that the defendant lacks a real prospect of \nsuccessfully defending the claim.” \n13. \nThe aforesaid principles are fully applicable in the facts and \ncircumstances of the present case and therefore, the plaintiffs are entitled to \na summary judgment.  \n14. \nIn view of the above, the present application is allowed. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified",
          "pdf_source": "23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0015",
      "start_index": 10,
      "end_index": 11,
      "summary": "**Court Decision**\n\nCase Number: CS(COMM) 198/2022 & I.A. 4963/2022(O-XXXIX R-1&2ofCPC)\nDate of Decree: February 7, 2023\nJudge: Amit Bansal\n\nThe High Court of Delhi at New Delhi passed a decree in favor of the plaintiffs, AKTIEBOLAGET VOLVO & ORS., against VOVLO WHITE PAINTS INDUSTRIES & ORS. The case involved trademark infringement by the defendants.\n\n**Facts and Arguments**\n\n* The plaintiffs claimed registration of their trademarks \"VOLVO\" since 1956.\n* The defendants allegedly infringed the plaintiff's trademark rights, resulting in large quantities of seized products.\n* The defendants failed to appear before the court or provide justification for their actions.\n\n**Decisions**\n\n1. Permanent injunction granted against the defendants.\n2. Damages of Rs.5,00,000 awarded to the plaintiffs as punitive damages.\n3. Actual costs of Rs.10,00,000 awarded to the plaintiffs to be paid by the defendants.\n4. The representatives of the plaintiffs were permitted to visit the premises of the defendants to seize and destroy the infringing products.\n\n**Important Parties, Dates, and Amounts**\n\n* Parties: AKTIEBOLAGET VOLVO & ORS., VOVLO WHITE PAINTS INDUSTRIES & ORS.\n* Case Number: CS(COMM) 198/2022\n* Date of Decree: February 7, 2023\n* Damages Awarded: Rs.5,00,000\n* Actual Costs Awarded: Rs.10,00,000\n\nSource:\n23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf",
      "pdf_source": "23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf",
      "nodes": [
        {
          "title": "Page 10",
          "node_id": "0013",
          "start_index": 10,
          "end_index": 10,
          "summary": "Here is a summary of page 10 from the PDF:\n\n**Case Details**\n\n* Case no.: 2023/DHC/000868\n* Court: High Court of Delhi\n* Date: February 7, 2023\n* Parties:\n\t+ Plaintiffs: Aktiebolaget Volvo & Ors.\n\t+ Defendants: Vovlo White Paints Industries & Ors.\n\n**Judgment**\n\n* The court grants permanent injunction and decree in favor of the plaintiffs against the defendants for infringement of the mark \"VOLVO\".\n* The suit is decreed in terms of prayer clauses i, ii, iii, and iv.\n* The defendant's accounts of profits are not rendered, so relief sought in prayer clause vii cannot be granted.\n* Seizure of infringing products at the defendant's premises for destruction is permitted.\n\n**Citation**\n\n* Judgement cited: Hindustan Lever Ltd. v. Satish Kumar, 2012 SCC OnLine Del 1378\n\nSource: PDF file \"23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf\"",
          "content": "2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 10 of 11 \n \nRELIEF \n15. \nThe various registrations and the long usage of the mark „VOLVO‟ by \nthe plaintiffs, as also the goodwill vesting in the mark „VOLVO‟, entitles the \nplaintiffs for grant of permanent injunction and decree in terms of the plaint.  \n16. \nAccordingly, the present suit is decreed in terms of prayer clauses „i‟, \n„ii‟, „iii‟ and „iv‟ of the plaint. \n17. \nSince the defendants have not appeared and rendered any accounts of \nprofits, the said relief as sought in prayer clauses „vii‟ cannot be granted. \nInsofar as delivery up for the purpose of destruction, as sought in prayer \nclause „v‟ is concerned, the representatives of the plaintiffs are permitted to \nvisit the premises of the defendants, where the inventory is lying and take \nseizure of the infringing products for the purpose of destruction.  \n18. \nInsofar as the relief of damages as sought in prayer clause „vi‟ is \nconcerned, reference may be made to the judgment in Hindustan Lever Ltd. \nv. Satish Kumar, 2012 SCC OnLine Del 1378. The relevant observations \nare set out below: \n“23. One of the reasons for granting relief of punitive damages \nis that despite of service of summons/notice, the defendant had \nchosen not to appear before the court. It shows that the \ndefendant is aware of the illegal activities otherwise, he ought \nto have attended the proceedings and give justification for the \nsaid illegal acts. Since, the defendant has maintained silence, \ntherefore, the guilt of the defendant speaks for itself and the \ncourt, under these circumstances, feels that in order to avoid \nfuture infringement, relief of punitive damages is to be granted \nin favour of the plaintiff.” \n19. \nIn the present case, the defendants have blatantly infringed the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified",
          "pdf_source": "23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 11",
          "node_id": "0014",
          "start_index": 11,
          "end_index": 11,
          "summary": "Here is a summary of page 11 from the PDF:\n\n**Case Details**\n\n* Case Number: 2023/DHC/000868\n* CS(COMM) 198/2022 & I.A. 4963/2022(O-XXXIX R-1 & 2 of CPC)\n* Parties: Aktebolaget Volvo & Ors. (Plaintiffs) vs Vovlo White Paints Industries & Ors. (Defendants)\n\n**Decree**\n\n* Damages of Rs. 5,00,000 awarded to plaintiffs for trademark infringement.\n* Actual costs of Rs. 10,00,000 awarded to plaintiffs as part of legal fees and expenses (Rs. 4,51,500 court fees, Rs. 1,33,599 expenses, and Rs. 4,53,707 legal fees).\n* Decree sheet to be drawn up.\n\n**Judgment Date**: February 7, 2023\n\n**Counsel for Plaintiffs**: Mr. Pravin Anand with Ms. Vaishali Mittal and Mr. Karan Kamra.\n\nPDF Source: 23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf",
          "content": "2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 11 of 11 \n \ntrademark of the plaintiffs and have also failed to appear before this Court. \nApplying the above principles and considering the large quantum of \nproducts that have been seized by the Local Commissioners, the plaintiffs \nare entitled to damages of Rs.5,00,000. \n20. \nAs regard, the prayer clause „viii‟, counsel for the plaintiffs has filed a \nstatement of costs. The statement of costs shows that Rs.4,51,500/- has \nalready been incurred for court fees and the fees of the Local \nCommissioners. In addition, it is claimed that expenses to the tune of Rs. \n1,33,599/- have been incurred and Rs.4,53,707/- is the legal fees. This Court \nis convinced that this is a fit case for award of actual costs to the plaintiffs.  \nAccordingly, Rs.10,00,000/- is awarded to the plaintiffs as costs to be paid \nby the defendants.  \n21. \nLet the decree sheet be drawn up.  \n22. \nAll applications are disposed of in the above terms.  \n \n \nAMIT BANSAL, J. \nFEBRUARY 07, 2023 \nat \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified",
          "pdf_source": "23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-16T14:26:47.352636",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}