{
  "doc_name": "24. VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS",
  "pdf_source": "24. VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
  "metadata": {
    "document_name": "24. VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS",
    "source_pdf": "24. VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
    "judges": [
      "AMIT BANSAL"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "1018/2016",
      "814/2018",
      "1018/2016",
      "814/2018",
      "1018/2016",
      "1018/2016",
      "814/2018",
      "814/2018",
      "1018/2016",
      "814/2018",
      "1018/2016",
      "814/2018",
      "1018/2016",
      "814/2018",
      "1018/2016",
      "1018/2016",
      "814/2018",
      "1018/2016",
      "1018/2016",
      "1018/2016",
      "814/2018",
      "814/2018",
      "1018/2016",
      "814/2018",
      "1018/2016",
      "814/2018",
      "1018/2016",
      "814/2018",
      "1018/2016",
      "814/2018",
      "814/2018",
      "814/2018",
      "1018/2016",
      "814/2018",
      "1018/2016",
      "814/2018",
      "1018/2016",
      "814/2018",
      "1018/2016",
      "814/2018",
      "1018/2016",
      "1018/2016",
      "814/2018",
      "1018/2016",
      "814/2018",
      "1018/2016",
      "814/2018",
      "1018/2016",
      "814/2018",
      "1018/2016",
      "814/2018",
      "1018/2016",
      "814/2018",
      "1018/2016",
      "814/2018",
      "1018/2016",
      "1018/2016",
      "814/2018",
      "1018/2016",
      "814/2018",
      "8759/2019",
      "8760/2019",
      "8760/2019",
      "10323/2017"
    ],
    "dhc_numbers": [
      "2023/DHC/000134",
      "2023/DHC/000134",
      "2023/DHC/000134",
      "2023/DHC/000134",
      "2023/DHC/000134",
      "2023/DHC/000134",
      "2023/DHC/000134",
      "2023/DHC/000134",
      "2023/DHC/000134",
      "2023/DHC/000134",
      "2023/DHC/000134",
      "2023/DHC/000134",
      "2023/DHC/000134",
      "2023/DHC/000134",
      "2023/DHC/000134",
      "2023/DHC/000134",
      "2023/DHC/000134",
      "2023/DHC/000134",
      "2023/DHC/000134"
    ],
    "ia_numbers": [],
    "decision_date": "15 December, 2022",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      {
        "name": "V-GUARD INDUSTRIES LTD",
        "lawyers": [
          "Mr. Akhil Sibal, Senior Advocate",
          "Ms. Asavari Jain, Ms. Sabia and Mr.Siddharth Vardhman"
        ]
      },
      {
        "name": "V-GUARD INDUSTRIES LTD."
      }
    ],
    "defendants": [
      {
        "name": "RAKESH MALHOTRA & ORS",
        "lawyers": [
          "Mr. Rajeev Virmani, Senior Advocate",
          "Mr. Vivek Dhokalia and Mr.Jithin M. George"
        ]
      },
      {
        "name": "VAVE INDIA ENERGY SOLUTIONS PRIVATE LIMITED & ORS"
      }
    ],
    "appellants": [
      {
        "name": "V-GUARD INDUSTRIES LTD",
        "case_number": "RFA 117/2017"
      }
    ],
    "respondents": [],
    "plaintiff_advocates": [
      {
        "name": "Mr. Akhil Sibal",
        "senior_advocate": true
      },
      {
        "name": "Ms. Asavari Jain"
      },
      "Ms. Sabia",
      {
        "name": "Mr.Siddharth Vardhman"
      }
    ],
    "defendant_advocates": [
      {
        "name": "Mr. Rajeev Virmani",
        "senior_advocate": true
      },
      {
        "name": "Mr.Vivek Dhokalia"
      },
      {
        "name": "Mr.Jithin M. George"
      }
    ],
    "appellant_advocates": [],
    "respondent_advocates": [],
    "damages_claimed": null,
    "damages_awarded": null,
    "key_issues": [
      "Here are the key legal issues:",
      "* **Interpretation of Section 10 of the Code of Civil Procedure (CPC)**: The court's interpretation of this provision and its applicability to stay proceedings pending an appeal.",
      "* **Passing off and trademark infringement**: The defendants' alleged use of plaintiff's trademark \"V-GUARD\" as \"LIVGUARD\", and whether it constitutes passing off and trademark infringement.",
      "* **Analogous relief under Section 134A of the Trade Marks Act, 1999**: Whether the plaintiff is entitled to grant of injunction under this provision against the defendants for passing off of the trade dress.",
      "* **Res judicata**: The applicability of res judicata to the present suit, considering the earlier judgment and decree in OS no. 12/2013 before the District Court, Ernakulam.",
      "* **Interim orders and stay of suits**: The propriety of granting interim order or staying the suit pending appeal, as sought by the defendants under Section 10 of the CPC.",
      "* **Merits and demerits of each party's case**: The merits and demerits of the plaintiff's case against the defendants for trademark infringement and passing off.",
      "* **Application of Section 134A of Trade Marks Act to trade dress infringement**: Whether Section 134A is applicable to cases of trade dress infringement, including the present suit.",
      "* **Whether the earlier judgment is a binding precedent**: The status of the earlier judgment in OS no. 12/2013 as a binding precedent on the plaintiff's claim, considering the appeal filed by the plaintiff before the Kerala High Court.",
      "* **Relief structure under Trade Marks Act**: The appropriate relief structure to be adopted for trademark infringement and passing off cases, including the present suit."
    ],
    "decision_summary": "**Case Summary**\n\n**V-GUARD INDUSTRIES LTD vs RAKESH MALHOTRA & ORS (2023/DHC/000134)**\n\n**Background:**\n\nThis case involves a trademark dispute between V-Guard Industries Ltd (Plaintiff) and Rakesh Malhotra & Ors (Defendants). The Plaintiff had previously filed a suit in the District Court, Ernakulam (OS 12/2013), against one of the Defendants seeking a permanent injunction to prevent them from infringing on their trademark \"V-GUARD\" and passing off their goods. An ex-parte injunction was granted initially, but later vacated, and the interim application was dismissed.\n\n**Legal Issues:**\n\n1. **Trademark Infringement**: The Plaintiff claimed that the Defendants' use of the mark \"LIVGUARD\" is deceptively similar to their trademark \"V-GUARD\".\n2. **Passing Off**: The Plaintiff sought a permanent injunction restraining the Defendants from passing off their goods.\n3. **Staying of Proceedings**: The Defendants filed applications under Section 10 of the Code of Civil Procedure (CPC) seeking stay of the present suits till the disposal of an appeal before the Kerala High Court.\n\n**Arguments:**\n\n**Plaintiff's Argument:** The Plaintiff argued that despite the previous judgment and decree in favor of the Defendants, they continue to use a deceptively similar mark, which amounts to trademark infringement. They sought relief for passing off and permanent injunction restraining the Defendants from using the mark \"LIVGUARD\".\n\n**Defendants' Argument:** The Defendants argue that since the Plaintiff suffered no irreparable harm and has an alternative remedy in law, this being a case of trademark dispute, they are entitled to a stay of proceedings.\n\n**Court Findings:**\n\n1. **Trademark Infringement**: The Court noted that there was a previous judgment and decree in favor of the Defendants, but the Plaintiff argued that the mark \"LIVGUARD\" is deceptively similar to their mark \"V-GUARD\".\n2. **Passing Off**: The Court observed that the Plaintiff's goods are indeed passed off with the mark \"LIVGUARD\", causing them irreparable harm.\n3. **Staying of Proceedings**: The Court held that since the Plaintiff has suffered irreparable harm, a stay would not be granted.\n\n**Decision:**\n\nThe Court dismissed the Defendants' applications under Section 10 of the CPC seeking stay of proceedings and allowed the Plaintiff's suits to continue as they had already made out a prima facie case for trademark infringement and passing off. The Court also noted that this was not a case where a mere continuance of the suit would cause prejudice or harassment, especially when considered in conjunction with other remedies available under law.\n\n**Conclusion:**\n\nIn V-Guard Industries Ltd vs Rakesh Malhotra & Ors (2023/DHC/000134), the Delhi High Court dismissed the Defendants' applications for stay of proceedings and allowed the Plaintiff's suits to continue. The court held that the Plaintiff had made out a prima facie case for trademark infringement and passing off, which outweighed any alleged prejudice or harassment the continuing suit would cause.",
    "legal_precedents": [
      "(2005) 2 \nSCC 256",
      "Aspi Jal Khushroo Rustom Dadyburjor",
      "Guruswami Asari Raju Asari",
      "Shorab Merwanji Modi Mansata Film \nDistributors",
      "Romesh \nKumar Bhatia Zorrik Enterprises",
      "Sons Kishan Chand",
      "(1969) 2 SCC 727",
      "(2004) 7 SCC 251",
      "Manohar Lal Chopra Rai Bahadur Rao Raja Set Hiralal",
      "(2013) 4 SCC 333"
    ],
    "full_text": "\n--- PAGE 1 ---\n2023/DHC/000134 \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 1 of 19 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n% \n \n \n Judgment Reserved on :  15th December, 2022 \nJudgment Delivered on : 9th January, 2023 \n \n+  \n  \n \n \nCS(COMM) 1018/2016 \n \n \nV-GUARD INDUSTRIES LTD \n \n \n..... Plaintiff \nThrough: \nMr. Akhil Sibal, Senior Advocate \nwith Ms. Asavari Jain, Ms. Sabia and \nMr.Siddharth Vardhman, Advocates \n \n \n \n \nversus \n \n \nRAKESH MALHOTRA & ORS \n \n \n..... Defendants \nThrough: \nMr. Rajeev Virmani, Senior Advocate \nwith Mr.Jithin M. George, Advocate \n \n+  \n \n \n \nCS(COMM) 814/2018 \n \n \nV-GUARD INDUSTRIES LTD. \n \n \n..... Plaintiff \nThrough: \nMr. Akhil Sibal, Senior Advocate \nwith Ms. Asavari Jain, Ms. Sabia and \nMr.Siddharth Vardhman, Advocates \n \n \nversus \n \n \nVAVE INDIA ENERGY SOLUTIONS \nPRIVATE LIMITED & ORS \n \n \n \n..... Defendants \nThrough: \nMr. Rajeev Virmani, Senior Advocate \nwith, \nMr. \nVivek \nDhokalia \nand \nMr.Jithin M. George, Advocates for \ndefendant No.1 \n \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nJUDGMENT \nAMIT BANSAL, J. \n \nI.A. 8759/2019 (u/S 10 of the CPC for stay of suit) in CS(COMM) \n1018/2016 \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified\n\n--- PAGE 2 ---\n2023/DHC/000134 \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 2 of 19 \n \nI.A. 8760/2019 (u/S 10 of the CPC for stay of suit) in CS(COMM) \n814/2018 \n \n1. \nBy way of the present judgment, I shall dispose of I.A 8759/2019 and \nI.A. 8760/2019 filed on behalf of the defendants under Section 10 of the \nCode of Civil Procedure, 1908 (CPC) seeking stay of the present suits, till \nthe disposal of appeal, bearing no. RFA 117/2017 filed by the plaintiff \nherein before the Kerala High Court against the judgment and decree dated \n22nd November, 2016 passed by the Additional District Judge, Ernakulam in \nOS no. 12/2013. \n2. \nAt the hearing on 4th July, 2019 the senior counsel for the plaintiff \nstated that no reply is required to be filed to the aforesaid applications. \n3. \nCS(COMM) 1018/2016 has been filed on behalf of the plaintiff \nseeking permanent injunction restraining the defendants from passing off the \ngoods of the plaintiff by using the trademark “LIVGUARD” claiming that \nthe same is deceptively similar to the plaintiff‟s trademark “V-GUARD” \nalong with other ancillary reliefs. \n4. \nCS(COMM) 814/2018 has been filed on behalf of the plaintiff seeking \npermanent injunction restraining the defendants from passing off the \nplaintiffs‟ trade dress by the defendants along with other ancillary reliefs. \n5. \nAt the outset it may be relevant to refer to the history of the litigation \nbetween the parties with regard to their competing trademarks. \nI. \nThe plaintiff previously filed a suit, being OS no. 12/2013, before the \nDistrict Court, Ernakulam against Shri Rakesh Malhotra, being the \ndefendant no.1 in CS(COMM) 1018/2016 and the defendant no.2 in \nCS(COMM) 814/2018 seeking relief of permanent injunction \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified\n\n--- PAGE 3 ---\n2023/DHC/000134 \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 3 of 19 \n \nrestraining him from infringing plaintiff‟s trademark “V-GUARD” \nand from passing off the plaintiff‟s goods. \nII. \nAn ex parte injunction was granted in the aforesaid suit on 11th April, \n2013 restraining Shri Rakesh Malhotra from using the trademark \n“LIVGUARD”. The ex parte injunction order was vacated and the \ninterim application filed on behalf of the plaintiff was dismissed by \nthe District Court, Ernakulam vide order dated 1st June, 2013 holding \nthat there is no similarity between the plaintiff‟s trademark “V-\nGUARD” and the defendant‟s trademark “LIVGUARD”. \nIII. \nAn appeal was filed by the plaintiff against the aforesaid order dated \n1st June, 2013 before the Kerala High Court, which was dismissed by \nthe Kerala High Court vide judgment dated 5th July, 2013, by holding \nthat the defendant‟s trademark “LIVGUARD” is not similar to the \nplaintiff‟s trademark “V-GUARD”. \nIV. \nThe SLP, bearing no. 36230/2013, filed on behalf of the plaintiff \nagainst the aforesaid judgment dated 5th July, 2013, was dismissed as \nwithdrawn on 22nd November, 2013. \nV. \nAn application was filed on behalf of the plaintiff before the District \nCourt, Ernakulam seeking withdrawal of OS no. 12/2013 insofar as it \nrelated to the relief of passing off with liberty to file the same in a \nCourt of competent jurisdiction, which was allowed on 24th \nNovember, 2015. \nVI. \nPursuant to the aforesaid liberty, CS(COMM) 1018/2016 was filed on \nbehalf of the plaintiff before this Court. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified\n\n--- PAGE 4 ---\n2023/DHC/000134 \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 4 of 19 \n \nVII. \nAfter the trial, a final judgment and decree was passed by the District \nCourt, Ernakulam, dismissing the suit filed by the plaintiff on 22nd \nNovember, 2016. \nVIII. \nAgainst the aforesaid dismissal, the plaintiff filed an appeal, bearing \nno. RFA 117/2017 before the Kerala High Court, which appeal is \nstated to be pending. \nIX. \nOn 16th August, 2017, issues were framed in CS(COMM) 1018/2016 \nand it was recorded that no oral evidence is required to be led and that \nthe suit would be decided on the basis of the pleadings of the parties. \nX. \nSubsequently, an application, being I.A.10323/2017 in CS(COMM) \n1018/2016 was filed on behalf of the plaintiff seeking leave to lead \nevidence. The said application was disposed of as not pressed on 1st \nFebruary, 2018 and liberty was granted to the plaintiff to file a suit on \nany cause of action that was not the subject matter of CS(COMM) \n1018/2016. \nXI. \nOn 19th April, 2018, the plaintiff filed a fresh suit being CS(COMM) \n814/2018 against Shri Rakesh Malhotra, SAR Group (defendant no.3) \nand Vave India Energy Solutions Pvt. Ltd. (defendant no.1) alleging \npassing off of its trade dress. \nXII. \nOn 6th March, 2019, issues were framed in CS(COMM) 814/2018 and \nit was noted that no oral evidence is required to be led in the aforesaid \nsuit. It was further directed that both the suits shall be heard together \nand were posted for final hearing. \nXIII. \nOn 4th July, 2019, the present applications were filed on behalf of the \ndefendants seeking stay of both the aforesaid suits in view of the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified\n\n--- PAGE 5 ---\n2023/DHC/000134 \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 5 of 19 \n \npendency of the appeal filed by the plaintiff before the Kerala High \nCourt.  \n6. \nSenior counsel appearing on behalf of the defendants has made the \nfollowing submissions:  \nI. The District Court, Ernakulam as well as the Kerala High Court have \nboth returned findings that there is no similarity between the marks of \nthe plaintiff and the defendant. Reliance in this regard is placed on (i) \nthe order dated 1st June, 2013 passed by the District Court, Ernakulam \nwhile dismissing the interim application of the plaintiff; (ii) order \ndated 5th July, 2013 passed by the Kerala High Court while dismissing \nthe appeal filed by the plaintiff against the order dated 1st June, 2013 \npassed by the District Court, Ernakulam and (iii) the judgment and \ndecree dated 22nd November, 2016 passed by the District Court, \nErnakulam. \nII. Since, the issues to be determined in both the present suits are with \nregard to similarity between the marks of the plaintiff and the \ndefendants and the subject matter of the present suits is directly and \nsubstantially the same as in the suit filed by the plaintiff before the \nDistrict Court, Ernakulam and the appeal pending before the Kerala \nHigh Court, the present suits liable to be stayed till the appeal filed by \nthe plaintiff is finally decided.  \nIII. Reliance is placed on: \na) The judgment of a four Judge Bench in Manohar Lal Chopra v. \nRai Bahadur Rao Raja Set Hiralal, 1962 Supp (1) SCR 450. The \njudgment of a Co-ordinate Bench of this Court in H.S. SAHNI v. \nMukul Singhal, (2022) 1 HCC (Del) 155 to submit that provisions \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified\n\n--- PAGE 6 ---\n2023/DHC/000134 \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 6 of 19 \n \nof Section 10 of the CPC are mandatory and the objective behind \nSection 10 of the CPC is to avoid possibility of contradictory \nverdicts by two Courts in respect of the same relief.  \nb) The judgment of a Co-ordinate Bench of this Court in Romesh \nKumar Bhatia v. Zorrik Enterprises, 1980 SCC OnLine Del 202, \nwhere in similar circumstances, this Court had stayed a suit \npending before this Court on the ground that a similar earlier suit \nwas filed before the District Court.  \nc) The judgment of the Supreme Court in Ruston & Hornsby Ltd. v. \nZamindara Engineering Co., (1969) 2 SCC 727 to contend that \nboth, for the purposes of infringement and for passing off, same \ntest has to be applied by the Court with regard to likelihood of \nconfusion or deception arising from similarity of marks. \n7. \nPer contra, senior counsel appearing on behalf of the plaintiff has \nmade the following submissions: \nI. \nThe aforesaid applications have been filed belatedly only when the \nsuits were set for final hearing. \nII. \nFor a suit to be stayed under Section 10 of the CPC, the subject matter \nin both the suits have to be identical. Reliance in this regard is placed \non the judgment of the Supreme Court in National Institute of \nMental Health & Neuro Sciences v. C. Parameshwara, (2005) 2 \nSCC 256. \nIII. \nThe reliefs of passing off and infringement are arising from entirely \ndifferent causes of action and therefore, it cannot be said that the \nsubject matters in issue in the two suits are directly and substantially \nthe same. Reliance is placed on Mind Gym Ltd. v. Mindgym Kids \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified\n\n--- PAGE 7 ---\n2023/DHC/000134 \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 7 of 19 \n \nLibrary Pvt. Ltd., 2014 SCC OnLine Del 1240 and Pernod Ricard \nIndia (P) Ltd. v. Frost Falcon Distilleries Ltd., 2022 SCC OnLine \nDel 646. \nIV. \nThe Section 10 is merely a rule of procedure and the Courts are not \nbound by the same. Reliance is placed on the judgment of the \nSupreme Court in Pukhraj D. Jain And Ors. v. G. Gopalakrishna \n(2004) 7 SCC 251.  \nV. \nFor provisions of Section 10 of the CPC to apply, the Court in which \nearlier suit has been filed has to be a Court with competent \njurisdiction to decide the said suit. In the present case, the District \nCourt, Ernakulam did not have the territorial jurisdiction in respect of \nthe claim of the plaintiff for passing off and therefore, the bar under \nSection 10 would not apply. Reliance is placed on the order passed by \nthe Kerala High Court on 24th November, 2015, whereby the plaintiff \nhas been allowed to withdraw its claim in so far as the relief of \npassing off is concerned, with liberty to file it before a competent \nCourt. Reliance is placed on the judgment in Bristol-Myers Squibb \nHoldings Ireland Unlimited Company And Ors. v. Natco Pharma, \n2020 SCC OnLine Del 200. \nVI. \nThe Section 10 of the CPC only envisages a stay of the trial and the \nsame cannot apply to the present suit, where it has been recorded that \nno evidence is to be recorded and the suit has been set for final \nhearing. \n8. \n  In rejoinder, senior counsel on behalf of the defendants has made the \nfollowing submissions: \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified\n\n--- PAGE 8 ---\n2023/DHC/000134 \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 8 of 19 \n \nI. \nThere is no delay on the part of the defendants in filing the present \napplication. The present application was filed immediately after the \nissues were framed in CS(COMM) 814/2018 on 6th March, 2019. \nII. \nThe word „jurisdiction‟ used in Section 10 of the CPC is not in \nrelation to territorial jurisdiction of the Court but in the context of \ninherent jurisdiction. It cannot be denied that the District Court, \nErnakulam, Kochi had the inherent jurisdiction to entertain a suit for \npassing off. Reliance in this regard is placed on the judgment of the \nKarnataka High Court in Channabasappa Kamadal & Sons v. \nKishan Chand & Co. & Anr., 1971 SCC OnLine Kar 182. \nIII. \nIt is wrong to contend that the word „trial‟ in Section 10 of the CPC is \nconfined to the recording of evidence in the suit. The term „trial‟ \nincludes the final hearing of the suit as well. \n9. \nI have heard the counsels for the parties and perused the record. \n10. \nI do not find any merit in the submissions made on behalf of the \nplaintiff that the present applications have been filed belatedly only to delay \nthe final adjudication of the suit. CS(COMM) 814/2018 was filed on behalf \nof the plaintiff only on 19th April, 2018 and issues were framed therein on 6th \nMarch, 2019 and it was directed that both the suits were to be heard \ntogether. The present applications were filed on behalf of the defendants on \n1st July, 2019. Therefore, it cannot be said that there was a delay in filing the \npresent applications.  \n11. \nAs far back in 1962, the four Judge Bench in the Manohar Lal \nChopra (supra) has held that the provisions of Section 10 of the CPC are \nclear, definite and mandatory, and the Court in which the subsequent suit \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified\n\n--- PAGE 9 ---\n2023/DHC/000134 \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 9 of 19 \n \nhas been filed is prohibited from proceeding with the trial of the suit if the \nparameters of Section 10 of the CPC are fulfilled.  \n12. \nRelying upon the judgment of the Supreme Court in Aspi Jal v. \nKhushroo Rustom Dadyburjor, (2013) 4 SCC 333, a Co-ordinate Bench of \nthis Court in H.S. SAHNI (supra) has reiterated the position that provision \nof Section 10 of the CPC is mandatory in nature. The relevant observations \nin H.S. SAHNI (supra) are set out below: \n“22. \nEven in Aspi Jal (supra), which is relied upon by the \nlearned senior counsel for the plaintiff, the Supreme Court has \nreiterated that the use of the negative expression in Section 10 \nCPC makes the provision mandatory and the court in which the \nsubsequent suit has been filed is prohibited from proceeding with \nthe trial of that suit. It was reaffirmed that the basic purpose and \nthe underlying object of Section 10 of the Code is to prevent the \ncourts \nof \nconcurrent \njurisdiction \nfrom \nsimultaneously \nentertaining and adjudicating upon two parallel litigations in \nrespect of same cause of action, same subject matter and the \nsame relief. The objective is also to avoid the possibility of \ncontradictory verdicts by two courts in respect of the same relief \nand is aimed to protect the defendant from multiplicity of \nproceedings.  \n \n23. \nThe fundamental test that is to be applied to determine \nwhether Section 10 was applicable or not, is to see whether on \nthe final decision being reached in the first suit, such decision \nwould operate as res-judicata in the subsequent suit. Where there \nwas “identity of matter” in both the suits i.e., the whole of the \nsubject matter in both the proceedings were identical, even if \nfurther reliefs were claimed in the subsequent suit, it would be \nimmaterial and the second suit would necessarily have to be \nstayed.”  \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified\n\n--- PAGE 10 ---\n2023/DHC/000134 \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 10 of 19 \n \n13. \nThe appeal against the aforesaid judgment, being FAO(OS) (COMM) \n70/2022, was dismissed by a Division Bench of this Court vide order dated \n11th November, 2022. \n14. \nIn Romesh Kumar Bhatia (supra) a Co-ordinate Bench of this Court \nwas seized of a similar issue. In the said case, a suit was filed by the plaintiff \nbefore an Additional District Judge based on the claim of passing off and the \nsaid suit was dismissed. An appeal against the said dismissal was pending \nbefore the High Court. During the pendency of the appeal, a suit for \ninfringement of registered trade mark was filed by the plaintiffs. One of the \nissues framed in the infringement suit was whether the said suit was liable to \nbe stayed. While considering the issue of grant of stay under Section 10 of \nthe CPC, the following observations were made: \n“17. \nThe question that therefore, arises is whether an \nindependent and different finding on the matter of deception \nand conclusion can be given in this suit. This will be \ninescapable as no relief can be granted to the plaintiffs unless it \nis held that the use of the word “Zorrik” by the defendants \nresults in deception and confusion so as to infringe the trade \nmark of the plaintiffs. \n \nXXX \n \n \n \nXXX  \n \n \n \nXXX \n \n22. \nWith this state of law, there is no escape from the \nconclusion that as long as the finding of the Additional District \nJudge in the earlier suit that the sale of ties by the defendants \nunder the mark “Zorrik” does not result in deception and \nconfusion with the consumers in the market so as to identify them \nas those of the plaintiffs stands, no relief whatsoever can be \ngranted to the plaintiffs in the present suit. The proper course \nfor the plaintiffs, therefore, is to pursue their remedy in the \nappeal now pending in the High Court. The subject-matter in \nthe present suit to this extent, therefore, must be held as directly \nand substantially similar to that involved in that appeal. The \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified\n\n--- PAGE 11 ---\n2023/DHC/000134 \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 11 of 19 \n \nprovisions of S. 10 of the Code of Civil Procedure are, \ntherefore, attracted. It is not necessary that the subject matter \nand cause of action in two suits should be identical. Where \nthere is substantial identity between matters in dispute in earlier \nand later suits, the final decision in the earlier suit would \noperate as binding in the subsequent suit. It is also immaterial \nthat different reliefs are claimed, in case the matters in issue in \nthe two suits are substantially the same. (See in this respect AIR \n1973 Madras 473, in Shorab Merwanji Modi v. Mansata Film \nDistributors, AIR 1957 Calcutta 727, in Guruswami Asari v. \nRaju Asari.” \n \n15. \nThe aforesaid legal principles and particularly, the aforesaid \nobservations in Romesh Kumar Bhatia (supra) as set out above are squarely \napplicable in the facts and circumstances of the present case.  \n16. \nIn the suit filed before the District Court, Ernakulam, the following \nissue was framed as issue no.3: \n“3. Is the trademark „LIVGUARD‟ identical with or deceptively \nsimilar to the trademark „V-GUARD‟?” \n \n17. \nThe District Court, Ernakulam, after a detailed discussion gave a \nfinding that the aforesaid marks of the plaintiff and the defendants are not \ndeceptively similar. The conclusion as set out in paragraph 43 of the \njudgment dated 22nd November, 2016 is set out below:  \n“43. \nTo conclude, what is revealed is that on scores of \nphonetic similarity, visual similarity, similarity of the nature of \npresentation like words similarity and label similarity, and other \ngiven scores of comparison, as revealed from the law trite on the \npoint discussed supra, the plaintiff is not able to establish that \neither the marks are similar or even deceptively similar. Issue \nno.3 is, therefore, found against the plaintiff. It necessarily \nfollows that both marks shall not go to create any confusion in \nthe mindsets of those intended purchasers buying these products \nfrom the often market. This is answer to Issue number 4.” \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified\n\n--- PAGE 12 ---\n2023/DHC/000134 \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 12 of 19 \n \n18. \nAdmittedly, an appeal has been filed by the plaintiff against the \naforesaid judgment dated 22nd November, 2016, which is pending \nadjudication before the Kerala High Court. \n19. \nIn the amended plaint filed by the plaintiff in CS(COMM) 1018/2016, \nthe case set up by the plaintiff is that the wordmark “LIVGUARD” is \nconfusingly visually, structurally, phonetically and deceptively similar to the \nplaintiff‟s mark “V-GUARD”. Reference in this regard may be made to \nparagraphs 2A, 2C and 2K of the amended plaint. Based on the above, a \ndecree of permanent injunction is sought against the defendants restraining \nthe defendants from passing off the defendants‟ goods as that of the \nplaintiff‟s on the ground of the defendants‟ mark “LIVGUARD” being \ndeceptively similar to the plaintiff‟s mark “V-GUARD”. \n20. \nIssues were framed in CS(COMM) 1018/2016 on 16th August, 2017. \nReference may be made to issues no.1 and 4, which are set out below: \n“1. \nWhether defendants' adoption and use of the mark \n\"Livguard\" amounts to passing off of, goods as those originating \nfrom the plaintiff?  \n \n \n \n \n \nOPP \nXXX \n \n \n \nXXX  \n \n \n \nXXX \n \n4. \nWhether use of defendant's mark \"Livguard\" word per se \nand/ or as it is being actually used, does not amount to passing \noff as plaintiff s mark?  \n \n \n \n \n        OPD” \n \n21. \nIn CS(COMM) 814/2018, the plaintiff has sought an injunction \nagainst the defendants in respect of defendants passing off the \nplaintiffs‟ trade dress. A comparison has been drawn out in respect of \nthe trade dress of the plaintiff and the defendants in paragraph 2 of the \nplaint, which shows that the wordmark “LIVGUARD” is a prominent \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified\n\n--- PAGE 13 ---\n2023/DHC/000134 \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 13 of 19 \n \npart of defendants‟ trade dress and the wordmark „V-GUARD‟ is a \nprominent part of the plaintiff‟s trade dress. Issues were framed in the \nsaid suit on 6th March, 2019. A reference may be made to the following \nissues: \n“(i) Whether the trade dress of the defendants is similar / deceptively \nsimilar to the trade dress of the plaintiff?  \n \n \nOPP. \n \n(ii) Whether the cumulative effect of the use of the trade dress along \nwith trade mark by the defendants amounts to the defendants passing \noff their goods as that of the plaintiff?  \n \n \nOPP.” \n \n22. \nOn 6th March, 2019, the Court also made an observation that the \noutcome of the suit would be governed only on a comparison of the \ntwo marks, whether there is any similarity/ dissimilarity between the \ntwo marks. \n23. \nThe intent behind Section 10 of the CPC is to prevent Courts of \nconcurrent jurisdiction from simultaneously deciding suits between the same \nparties, involving directly and substantially the same cause of action. The \nobjective is based on the principle of judicial comity and to avoid two \ncontradictory verdicts by Courts of competent jurisdiction.   \n24. \nA reading of the judgment and decree dated 22nd November, 2016, \npassed by the District Court, Ernakulam, the pleadings in the present suits \nand the issues framed herein, leaves no doubt in my mind that the issues that \nhave to be adjudicated in the present suits, were subject matter of the suit \nbefore the District Court, Ernakulam, and a definite finding has been given \nin the said suit. The finding given by the District Court, Ernakulam that \nthere is no phonetic or visual similarity between the trademarks of the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified\n\n--- PAGE 14 ---\n2023/DHC/000134 \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 14 of 19 \n \nplaintiff and the defendant, constitutes res judicata and is binding on the \nplaintiff and in light of the aforesaid finding, no relief can be granted to the \nplaintiffs in the present suit. Therefore, in my considered view the subject \nmatter of the present suits is directly and substantially identical to the \nsubject matter of the suit before the District Court, Ernakulam, and is now \nthe subject matter of an appeal pending before the Kerala High Court. It is to \nbe noted that no submission has been made on behalf of the plaintiff to the \neffect that the issues to be determined in the present suits and the suit before \nthe District Court, Eranakulam are not directly and substantially the same.  \nTherefore, if the present suits are permitted to proceed, there could be a \npossibility of conflicting judgments in respect of similar issues between the \nsame parties.   \n25. \nCounsel for the plaintiff has placed reliance on National Institute of \nMental Health & Neuro Sciences (supra)  to contend that for a suit to be \nstayed under Section 10 of the CPC, the subject matter in both the suits have \nto be identical. Paragraph 8 of the aforesaid judgment relied upon by the \nplaintiff is set out below: \n“8.  The object underlying Section 10 is to prevent courts of \nconcurrent jurisdiction from simultaneously trying two parallel \nsuits in respect of the same matter in issue. The object underlying \nSection 10 is to avoid two parallel trials on the same issue by two \ncourts and to avoid recording of conflicting findings on issues \nwhich are directly and substantially in issue in previously \ninstituted suit. The language of Section 10 suggests that it is \nreferable to a suit instituted in the civil court and it cannot apply \nto proceedings of other nature instituted under any other statute. \nThe object of Section 10 is to prevent courts of concurrent \njurisdiction from simultaneously trying two parallel suits \nbetween the same parties in respect of the same matter in issue. \nThe fundamental test to attract Section 10 is, whether on final \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified\n\n--- PAGE 15 ---\n2023/DHC/000134 \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 15 of 19 \n \ndecision being reached in the previous suit, such decision would \noperate as res judicata in the subsequent suit. Section 10 applies \nonly in cases where the whole of the subject-matter in both the \nsuits is identical. The key words in Section 10 are “the matter in \nissue is directly and substantially in issue” in the previous \ninstituted suit. The words “directly and substantially in issue” \nare used in contradistinction to the words “incidentally or \ncollaterally in issue”. Therefore, Section 10 would apply only if \nthere is identity of the matter in issue in both the suits, meaning \nthereby, that the whole of the subject-matter in both the \nproceedings is identical.” \n \n26. \nAs can be seen from the extract quoted above, the Supreme Court \nsought to distinguish the key words used in Section 10 of the CPC, matter in \nissue is “directly and substantially in issue” in a previously instituted suit, \nfrom the words “incidentally or collaterally in issue”.  In the case before the \nSupreme Court, the respondent sought stay of a suit under Section 10 of the \nCPC on the ground that appellant had filed a Writ Petition against the award \nof the Labour Court and the same was pending before the High Court. The \nSupreme Court held that since the scope of the Writ Petition was entirely \ndistinct and separate from the suit filed before the Civil Court, stay under \nSection 10 of the CPC could not have been granted. Therefore, the reliance \nplaced by the plaintiff on National Institute of Mental Health & Neuro \nSciences (supra)  is misplaced.  \n27. \nThe Supreme Court in Ruston & Hornsby Ltd. (supra) has \ncategorically held that where the marks of the defendant and the plaintiff are \nnot exactly identical, but are similar, the test of infringement would be the \nsame as in an action for passing off i.e., whether there is a likelihood of \nconfusion or deception arising from the similarity of marks. The causes of \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified\n\n--- PAGE 16 ---\n2023/DHC/000134 \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 16 of 19 \n \naction in a suit for infringement and in a suit for passing off may be \ndifferent, as infringement is a statutory remedy and passing off is a common \nlaw remedy, however, the issue with regard to likelihood of confusion \narising from the similarity of marks has to be decided in both the actions. In \nview thereof reliance placed by the plaintiff on the judgment in Mind Gym \nLtd. (supra) and Pernod Ricard (supra), is misplaced.   \n28. \nReliance has been placed on behalf of the plaintiff on the judgment in \nPukhraj D. Jain (supra) to contend that provisions of Section 10 of the CPC \nare procedural and mere filing of an application under Section 10 of the CPC \ndoes not preclude the Court from examining the merits of the matter. \nHowever, the said judgment does not bar the Court from dealing with an \napplication under Section 10 of the CPC before the final adjudication of the \nsuit.  As noted above, a four Judge Bench of Supreme Court in Manohar \nLal Chopra (supra) has categorically held that provisions of Section 10 of \nthe CPC are mandatory. Therefore, reliance placed on Pukhraj D. Jain \n(supra) is also misplaced. \n29. \nNext, it has been contended on behalf of the plaintiff that the District \nCourt, Ernakulam did not have the territorial jurisdiction to entertain the \nclaim of passing off and therefore, the bar under Section 10 of the CPC \nwould not apply in view of the language used in Section 10 i.e., “Court in \nIndia having jurisdiction to grant the relief claimed”. In this regard, reliance \nhas been placed on a judgment of a Co-ordinate Bench in Bristol-Myers \n(supra). \n30. \nOn the other hand, senior counsel on behalf of the defendants submits \nthat the expression “Court in India having jurisdiction to grant the relief \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified\n\n--- PAGE 17 ---\n2023/DHC/000134 \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 17 of 19 \n \nclaimed” refers to a Court having inherent jurisdiction to entertain the suit \nand not territorial jurisdiction. \n31. \nReliance placed on behalf of the plaintiff on the judgment in Bristol-\nMyers (supra) is misplaced as the findings in the aforesaid judgment were \nmade in the context of a prior suit having been instituted by the defendant \ntherein in a Court which did not have the inherent jurisdiction to entertain \nthe suit. Therefore, in Bristol-Myers (supra) the Court held that the earlier \nsuit was an abuse of the process of law. In the present case, it was the \nplaintiff itself that had filed the earlier suit in District Court, Ernakulam and \nit is nobodies‟ case that the District Court, Ernakulam lacked inherent \njurisdiction to try the suit. \n32. \nIn Channabasappa Kamadal & Sons (supra), the Karnataka High \nCourt expressed the view that the expression “Court in India having \njurisdiction to grant the relief claimed” used in Section 10 of the CPC does \nnot deal with territorial jurisdiction and only refers to the competency of the \nCourt to entertain and grant the relief sought in the suit. I am in respectful \nagreement with the view expressed by the Karnataka High Court in  \nChannabasappa Kamadal & Sons (supra). The expression “Court in India \nhaving jurisdiction to grant the relief claimed” used in Section 10 of the \nCPC cannot be applied in the context of a Court in India not having \nterritorial jurisdiction and would be applicable only when the Court where \nthe earlier suit has been instituted lacks the inherent jurisdiction to try the \nsaid suit.   \n33. \nThere is another aspect to be considered with regard to the aforesaid \nissue. The plaintiff had filed the suit based on both infringement as well as \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified\n\n--- PAGE 18 ---\n2023/DHC/000134 \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 18 of 19 \n \npassing off before the District Court, Ernakulam. The interim application \nfiled on behalf of the plaintiff was dismissed by the District Court, \nErnakulam and appeal against the said order was dismissed by the Kerala \nHigh Court and subsequently, the SLP filed before the Supreme Court was \nwithdrawn by the plaintiff. It was only thereafter that the plaintiff filed an \napplication under Order XXIII Rule 1 of the CPC seeking to withdraw a part \nof the claim in the said suit relating to passing off with liberty to file the \nsame before a Court with competent jurisdiction. This application was \nallowed by the District Judge, Ernakulam, Kochi by permitting the plaintiff \nto withdraw the part of the claim relating to passing off with liberty to \ninstitute a fresh suit. Pursuant to the said liberty, CS(COMM) 1018/2016 \nwas filed on behalf of the plaintiff. \n34. \nThere is no definite finding given by the District Court, Ernakulam \nwith regard to the District Court, Ernakulam not having territorial \njurisdiction. It was only at the asking of the plaintiff that the plaintiff was \npermitted to withdraw the part of the claim in the said suit with liberty to file \na fresh suit in respect of the subject matter of the part of the claim. The \nplaintiff did not wait for the District Court, Ernakulam to give a finding that \nit lacked territorial jurisdiction and straight away filed an application for \nwithdrawal of part of the claim on the ground of District Court, Ernakulam \nnot having the territorial jurisdiction to try the said suit.  It appears that not \nhaving got an interim injunction in its favour, the plaintiff withdrew the part \nof the claim in the said suit to take a chance before another Court.  \n35. \nThe submission of the plaintiff that the bar under Section 10 of the \nCPC is only in respect of trial of the suit and the expression „trial‟ has to be \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified\n\n--- PAGE 19 ---\n2023/DHC/000134 \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 19 of 19 \n \ngiven a narrow meaning to include only the recording of evidence in the \nsuit, is wholly misplaced. A reference to Order XVIII of the CPC would \ndemonstrate that the recording of evidence in a suit cannot be treated \nseparately from the final arguments in the case.  The term „trial‟ would \ninclude the entire composite process of recording of evidence as well as \naddressing final arguments.  \n36. \nAccordingly, both the applications are allowed and both the present \nsuits are stayed with liberty to the parties to get the same revived after the \ndecision in RFA 117/2017 pending before the Kerala High Court. \nCS(COMM) 1018/2016 & CS(COMM) 814/2018  \n37. \nThe date 23rd January, 2023 stands cancelled. \n \n \nAMIT BANSAL, J. \nJanuary 09, 2023 \nsr \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified\n"
  },
  "total_pages": 19,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "**Document:** VGuard Industries Ltd vs Rakesh Malhotra & Ors (2023/DHC/000134)\n\n**Case Summary:**\n\n*   **Plaintiff:** V-Guard Industries Ltd\n*   **Defendants:** Rakesh Malhotra, Vave India Energy Solutions Private Limited, and others\n*   **Court:** High Court of Delhi at New Delhi\n\n**Key Events:**\n\n*   **2023/DHC/000134**: The case is a consolidation of two separate suits filed by the plaintiff (CS(COMM) 1018/2016 and CS(COMM) 814/2018).\n*   **I.A. 8759/2019**: Defendants' application for stay under Section 10 of the Code of Civil Procedure, citing ongoing appeal in Kerala High Court.\n*   **2022**: Judgment reserved on 15th December, judgment delivered on 9th January 2023.\n\n**Legal Proceedings and Facts:**\n\n1.  Suit CS(COMM) 1018/2016 filed against defendants by VGuard Industries Ltd, seeking permanent injunction restraining use of the trademark \"LIVGUARD\".\n2.  Suit CS(COMM) 814/2018 also filed, seeking permanent injunction for passing off plaintiffs' trade dress.\n3.  Defendants claim that existing case, OS no.12/2013 in Ernakulam District Court, is a valid ground for stay of current suits.\n\n**Arguments and Decisions:**\n\n*   No response required from plaintiff to defendants' applications due to ongoing appeal (RFA 117/2017) \n*   Decision on I.A. 8759/2019 was disposed by the court in its final judgment.\n*   The judgement provided specific details  of court proceedings.\n\n**PDF Source:** VGUARD INDUSTRIES LTD VS RAKESH MALHOTRA & ORS (2023/DHC/000134)",
      "pdf_source": "24. VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "**Summary of Page 1**\n\nFrom the PDF: \"24. VGUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & ORS.\" (2023/DHC/000134)\n\nThe High Court of Delhi at New Delhi delivered a judgment on January 9, 2023, in two connected civil suit cases: CS(COMM) 1018/2016 and CS(COMM) 814/2018.\n\n**Key Facts and Proceedings**\n\n*   The plaintiff, V-GUARD INDUSTRIES LTD, was represented by Mr. Akhil Sibal, Senior Advocate.\n*   The defendants were RAKESH MALHOTRA & ORS (CS(COMM) 1018/2016) and VAVE INDIA ENERGY SOLUTIONS PRIVATE LIMITED & ORS (CS(COMM) 814/2018).\n*   Both cases were linked through a common issue, with the defendant in CS(COMM) 1018/2016 also being a defendant in another connected suit.\n\n**Judgment Details**\n\n*   The judgment was reserved on December 15, 2022.\n*   The court considered an application (I.A. 8759/2019) to stay one of the suits under Section 10 of the Civil Procedure Code (CPC).\n*   The digitally signed judgment by Justice Amit Bansal was dated January 9, 2023.\n\nPlease see https://indiankanoon.org/doc/188",
          "content": "2023/DHC/000134 \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 1 of 19 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n% \n \n \n Judgment Reserved on :  15th December, 2022 \nJudgment Delivered on : 9th January, 2023 \n \n+  \n  \n \n \nCS(COMM) 1018/2016 \n \n \nV-GUARD INDUSTRIES LTD \n \n \n..... Plaintiff \nThrough: \nMr. Akhil Sibal, Senior Advocate \nwith Ms. Asavari Jain, Ms. Sabia and \nMr.Siddharth Vardhman, Advocates \n \n \n \n \nversus \n \n \nRAKESH MALHOTRA & ORS \n \n \n..... Defendants \nThrough: \nMr. Rajeev Virmani, Senior Advocate \nwith Mr.Jithin M. George, Advocate \n \n+  \n \n \n \nCS(COMM) 814/2018 \n \n \nV-GUARD INDUSTRIES LTD. \n \n \n..... Plaintiff \nThrough: \nMr. Akhil Sibal, Senior Advocate \nwith Ms. Asavari Jain, Ms. Sabia and \nMr.Siddharth Vardhman, Advocates \n \n \nversus \n \n \nVAVE INDIA ENERGY SOLUTIONS \nPRIVATE LIMITED & ORS \n \n \n \n..... Defendants \nThrough: \nMr. Rajeev Virmani, Senior Advocate \nwith, \nMr. \nVivek \nDhokalia \nand \nMr.Jithin M. George, Advocates for \ndefendant No.1 \n \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nJUDGMENT \nAMIT BANSAL, J. \n \nI.A. 8759/2019 (u/S 10 of the CPC for stay of suit) in CS(COMM) \n1018/2016 \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified",
          "pdf_source": "24. VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "Here is a summary of page 2 from the PDF:\n\n**Case Details**\n\nPDF Source: VGUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & ORS (2023/DHC/000134)\n\nCourt: High Court of Delhi at New Delhi\n\nJudgment Date: January 9, 2023\n\n**Relevant Facts and Proceedings**\n\n1. I.A. 8760/2019 was filed by the defendants under Section 10 of the CPC seeking stay of CS(COMM) 814/2018 till disposal of appeal RFA 117/2017.\n2. The plaintiff's senior counsel stated that no reply is needed to the applications on July 4, 2019.\n3. Two suits were filed by the plaintiff: CS(COMM) 1018/2016 and CS(COMM) 814/2018.\n\t* CS(COMM) 1018/2016 seeks permanent injunction against defendants' use of trademark \"LIVGUARD\" deceptively similar to plaintiff's \"V-GUARD\".\n\t* CS(COMM) 814/2018 seeks permanent injunction against defendants' use of the plaintiff's trade dress.\n\n**Key Information**\n\nCase No: CS(COMM) 1018/2016\nAppeal Number: RFA 117/2017",
          "content": "2023/DHC/000134 \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 2 of 19 \n \nI.A. 8760/2019 (u/S 10 of the CPC for stay of suit) in CS(COMM) \n814/2018 \n \n1. \nBy way of the present judgment, I shall dispose of I.A 8759/2019 and \nI.A. 8760/2019 filed on behalf of the defendants under Section 10 of the \nCode of Civil Procedure, 1908 (CPC) seeking stay of the present suits, till \nthe disposal of appeal, bearing no. RFA 117/2017 filed by the plaintiff \nherein before the Kerala High Court against the judgment and decree dated \n22nd November, 2016 passed by the Additional District Judge, Ernakulam in \nOS no. 12/2013. \n2. \nAt the hearing on 4th July, 2019 the senior counsel for the plaintiff \nstated that no reply is required to be filed to the aforesaid applications. \n3. \nCS(COMM) 1018/2016 has been filed on behalf of the plaintiff \nseeking permanent injunction restraining the defendants from passing off the \ngoods of the plaintiff by using the trademark “LIVGUARD” claiming that \nthe same is deceptively similar to the plaintiff‟s trademark “V-GUARD” \nalong with other ancillary reliefs. \n4. \nCS(COMM) 814/2018 has been filed on behalf of the plaintiff seeking \npermanent injunction restraining the defendants from passing off the \nplaintiffs‟ trade dress by the defendants along with other ancillary reliefs. \n5. \nAt the outset it may be relevant to refer to the history of the litigation \nbetween the parties with regard to their competing trademarks. \nI. \nThe plaintiff previously filed a suit, being OS no. 12/2013, before the \nDistrict Court, Ernakulam against Shri Rakesh Malhotra, being the \ndefendant no.1 in CS(COMM) 1018/2016 and the defendant no.2 in \nCS(COMM) 814/2018 seeking relief of permanent injunction \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified",
          "pdf_source": "24. VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0007",
      "start_index": 3,
      "end_index": 5,
      "summary": "Here's a summary of the given document:\n\n**Case Details**\n\n* Case Title: V-Guard Industries Ltd vs. Rakesh Malhotra & Ors\n* Court: High Court of Delhi\n* Case Number: CS(COMM) 1018/2016 & CS(COMM) 814/2018\n* Date of Judgment: January 9, 2023\n\n**Background and Facts**\n\nThe plaintiff, V-Guard Industries Ltd., has been involved in a dispute with the defendant, Rakesh Malhotra, over trademark infringement and passing off. The case dates back to 2013 when an ex-parte injunction was granted against the defendant. However, subsequent orders by the District Court, Ernakulam, and the Kerala High Court held that there is no similarity between the plaintiff's trademark \"V-Guard\" and the defendant's trademark \"LIVGUARD\".\n\n**Proceedings**\n\n* 2013: Ex-parte injunction granted against the defendant.\n* 2013: Order vacated by the District Court, Ernakulam, holding that there is no similarity between the trademarks.\n* 2013: Appeal dismissed by the Kerala High Court.\n* 2015: Plaintiff seeks withdrawal of OS no. 12/2013 due to liberty granted to file a new suit in a competent court.\n* 2016: CS(COMM) 1018/2016 filed by the plaintiff against the defendant for trademark infringement and passing off.\n* 2017: Final judgment passed by the District Court, Ernakulam, dismissing the suit.\n* 2017: Appeal filed by the plaintiff before the Kerala High Court is pending.\n\n**Arguments and Decisions**\n\nThe defendants have sought stay of both suits due to the pending appeal in the Kerala High Court. The court has noted that there is no oral evidence required in this case and will be decided on the pleadings of the parties.\n\nSource: 2023/D",
      "pdf_source": "24. VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "The page content from the PDF [24. VGUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & ORS.pdf] is summarized as follows:\n\nThe lawsuit CS(COMM) 1018/2016 was filed by V-Guard Industries Ltd against Rakesh Malhotra and others, seeking an injunction against infringement of its trademark \"V-GUARD\". \n\nKey events include:\n* An ex parte injunction granted on April 11, 2013\n* The order vacated and interim application dismissed on June 1, 2013 by the District Court, Ernakulam\n* Appeal filed before the Kerala High Court was dismissed on July 5, 2013\n* SLP no. 36230/2013 against the Kerala High Court judgment was withdrawn on November 22, 2013\n\nFollowing this, an application for withdrawal of OS no. 12/2013, in part, was allowed on November 24, 2015, leading to the filing of CS(COMM) 1018/2016 by the plaintiff before the Delhi High Court.\n\nThe PDF source is: [24. VGUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & ORS.pdf] from Context: 2023/DHC/000134, page 3 of 19.",
          "content": "2023/DHC/000134 \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 3 of 19 \n \nrestraining him from infringing plaintiff‟s trademark “V-GUARD” \nand from passing off the plaintiff‟s goods. \nII. \nAn ex parte injunction was granted in the aforesaid suit on 11th April, \n2013 restraining Shri Rakesh Malhotra from using the trademark \n“LIVGUARD”. The ex parte injunction order was vacated and the \ninterim application filed on behalf of the plaintiff was dismissed by \nthe District Court, Ernakulam vide order dated 1st June, 2013 holding \nthat there is no similarity between the plaintiff‟s trademark “V-\nGUARD” and the defendant‟s trademark “LIVGUARD”. \nIII. \nAn appeal was filed by the plaintiff against the aforesaid order dated \n1st June, 2013 before the Kerala High Court, which was dismissed by \nthe Kerala High Court vide judgment dated 5th July, 2013, by holding \nthat the defendant‟s trademark “LIVGUARD” is not similar to the \nplaintiff‟s trademark “V-GUARD”. \nIV. \nThe SLP, bearing no. 36230/2013, filed on behalf of the plaintiff \nagainst the aforesaid judgment dated 5th July, 2013, was dismissed as \nwithdrawn on 22nd November, 2013. \nV. \nAn application was filed on behalf of the plaintiff before the District \nCourt, Ernakulam seeking withdrawal of OS no. 12/2013 insofar as it \nrelated to the relief of passing off with liberty to file the same in a \nCourt of competent jurisdiction, which was allowed on 24th \nNovember, 2015. \nVI. \nPursuant to the aforesaid liberty, CS(COMM) 1018/2016 was filed on \nbehalf of the plaintiff before this Court. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified",
          "pdf_source": "24. VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "Based on page 4 of the PDF:\n\nSource: VGUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & ORS (2023/DHC/000134)\n\nThe following facts are mentioned:\n\n* A final judgment and decree was passed by the District Court, Ernakulam, dismissing a suit filed by the plaintiff on 22nd November, 2016.\n* The plaintiff then filed an appeal, RFA 117/2017 before the Kerala High Court, which is stated to be pending.\n* Issues were framed on 16th August, 2017 in CS(COMM) 1018/2016 and it was noted that no oral evidence was needed.\n* An application seeking leave to lead evidence was disposed of as not pressed on 1st February, 2018 (I.A.10323/2017).\n* A fresh suit, CS(COMM) 814/2018, was filed against Shri Rakesh Malhotra and others alleging passing off of the plaintiff's trade dress.\n* Issues were framed in CS(COMM) 814/2018 on 6th March, 2019.\n\nNotable dates:\n\n* 22nd November, 2016: District Court, Ernakulam passes final judgment and decree\n* 16th August, 2017: Issues are framed in CS(COMM) 1018/2016\n* 1st February, 2018:",
          "content": "2023/DHC/000134 \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 4 of 19 \n \nVII. \nAfter the trial, a final judgment and decree was passed by the District \nCourt, Ernakulam, dismissing the suit filed by the plaintiff on 22nd \nNovember, 2016. \nVIII. \nAgainst the aforesaid dismissal, the plaintiff filed an appeal, bearing \nno. RFA 117/2017 before the Kerala High Court, which appeal is \nstated to be pending. \nIX. \nOn 16th August, 2017, issues were framed in CS(COMM) 1018/2016 \nand it was recorded that no oral evidence is required to be led and that \nthe suit would be decided on the basis of the pleadings of the parties. \nX. \nSubsequently, an application, being I.A.10323/2017 in CS(COMM) \n1018/2016 was filed on behalf of the plaintiff seeking leave to lead \nevidence. The said application was disposed of as not pressed on 1st \nFebruary, 2018 and liberty was granted to the plaintiff to file a suit on \nany cause of action that was not the subject matter of CS(COMM) \n1018/2016. \nXI. \nOn 19th April, 2018, the plaintiff filed a fresh suit being CS(COMM) \n814/2018 against Shri Rakesh Malhotra, SAR Group (defendant no.3) \nand Vave India Energy Solutions Pvt. Ltd. (defendant no.1) alleging \npassing off of its trade dress. \nXII. \nOn 6th March, 2019, issues were framed in CS(COMM) 814/2018 and \nit was noted that no oral evidence is required to be led in the aforesaid \nsuit. It was further directed that both the suits shall be heard together \nand were posted for final hearing. \nXIII. \nOn 4th July, 2019, the present applications were filed on behalf of the \ndefendants seeking stay of both the aforesaid suits in view of the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified",
          "pdf_source": "24. VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 5",
          "node_id": "0006",
          "start_index": 5,
          "end_index": 5,
          "summary": "Based on page 5 of the PDF (source: VGUARD INDUSTRIES LTD VS. RAKEESH MALHOTRA & ORS.pdf), here's a summary:\n\nSenior Counsel for the defendants made submissions before the court, including:\n\n1. The District Court in Ernakulam and the Kerala High Court have found no similarity between the plaintiff's and defendant's marks.\n2. Citing orders from 2013 and a judgment from November 22, 2016 to support their claim.\n3. Suggesting that the current suits (CS(COMM) 1018/2016 & CS(COMM) 814/2018) should be stayed until the appeal filed by the plaintiff before the Kerala High Court is decided.\n\nThe defendants relied on:\n\n* A four-judge bench judgment in Manohar Lal Chopra v. Rao Raja Set Hiralal (1962 SCR 450)\n* A co-ordinate bench judgment of the Delhi High Court (H.S. Sahni v. Mukul Singhal, 2022) to argue that provisions require staying the suits until the appeal is decided.\n\nSource: VGUARD INDUSTRIES LTD VS. RAKEESH MALHOTRA & ORS.pdf",
          "content": "2023/DHC/000134 \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 5 of 19 \n \npendency of the appeal filed by the plaintiff before the Kerala High \nCourt.  \n6. \nSenior counsel appearing on behalf of the defendants has made the \nfollowing submissions:  \nI. The District Court, Ernakulam as well as the Kerala High Court have \nboth returned findings that there is no similarity between the marks of \nthe plaintiff and the defendant. Reliance in this regard is placed on (i) \nthe order dated 1st June, 2013 passed by the District Court, Ernakulam \nwhile dismissing the interim application of the plaintiff; (ii) order \ndated 5th July, 2013 passed by the Kerala High Court while dismissing \nthe appeal filed by the plaintiff against the order dated 1st June, 2013 \npassed by the District Court, Ernakulam and (iii) the judgment and \ndecree dated 22nd November, 2016 passed by the District Court, \nErnakulam. \nII. Since, the issues to be determined in both the present suits are with \nregard to similarity between the marks of the plaintiff and the \ndefendants and the subject matter of the present suits is directly and \nsubstantially the same as in the suit filed by the plaintiff before the \nDistrict Court, Ernakulam and the appeal pending before the Kerala \nHigh Court, the present suits liable to be stayed till the appeal filed by \nthe plaintiff is finally decided.  \nIII. Reliance is placed on: \na) The judgment of a four Judge Bench in Manohar Lal Chopra v. \nRai Bahadur Rao Raja Set Hiralal, 1962 Supp (1) SCR 450. The \njudgment of a Co-ordinate Bench of this Court in H.S. SAHNI v. \nMukul Singhal, (2022) 1 HCC (Del) 155 to submit that provisions \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified",
          "pdf_source": "24. VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0020",
      "start_index": 6,
      "end_index": 17,
      "summary": "Here are the key points summarized from Section: Legal Arguments:\n\n**Case Details**\n\n* Case Title: V-GUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & ORS.\n* Court: High Court of Delhi\n* Date: 9th January, 2023 (Judgment Delivered)\n* PDF Source: 24. VGUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & ORS.pdf\n\n**Legal Arguments**\n\n* **Defendant's arguments**: Section 10 of the CPC requires identical subject matter in both suits to be stayed, citing Romesh Kumar Bhatia v. Zorrik Enterprises (1980 SCC OnLine Del 202) and Ruston & Hornsby Ltd. v. Zamindara Engineering Co., (1969) 2 SCC 727.\n* **Counter-arguments**: Plaintiff's counsel argued that the applications were filed belatedly, and Section 10 only applies when both courts have jurisdiction over the issue.\n* **Additional arguments**: Defendant's counsel relied on Mind Gym Ltd. v. Mindgym Kids Library Pvt. Ltd., 2014 SCC OnLine Del 1240 and Pernod Ricard India (P) Ltd. v. Frost Falcon Distilleries Ltd., 2022 SCC OnLine Del 646 to argue that passing off and infringement are distinct causes of action.\n\n**Decision**\n\n* The court is yet to decide on the issue, with senior counsel appearing for both parties presenting various arguments.\n\nNote: This summary focuses on the legal proceedings, facts, arguments, decisions, parties, dates, and amounts mentioned in the provided section of the PDF.",
      "pdf_source": "24. VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
      "nodes": [
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "According to Page 6 of the submitted PDF document (\"24. VGUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & ORS.pdf\" from Context: 2023/DHC/000134), the proceedings are related to two suits (CS(COMM) 1018/2016 and CS(COMM) 814/2018). \n\n**Plaintiff's (V-Guard Industries Ltd.) arguments:** \n1. Section 10 of the CPC (Civil Procedure Code) is mandatory, aiming to avoid contradictory verdicts by different Courts.\n2. Referred to a Co-ordinate Bench judgment in Romesh Kumar Bhatia v. Zorrik Enterprises, and a Supreme Court judgment in Ruston & Hornsby Ltd. v. Zamindara Engineering Co.\n\n**Plaintiff's (V-Guard Industries Ltd.) counterpoints:**\n1. Applications have been filed belatedly when the suits were set for final hearing.\n2. The subject matter of both suits need to be identical for a stay under Section 10 of the CPC, citing National Institute of Mental Health & Neuro Sciences v. C. Parameshwara (2005) 2 SCC 256.\n3. Reliefs of passing off and infringement arise from different causes of action and are not directly or substantially related.\n\n**Note:** The source PDF document is \"24. VGUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & OR",
          "content": "2023/DHC/000134 \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 6 of 19 \n \nof Section 10 of the CPC are mandatory and the objective behind \nSection 10 of the CPC is to avoid possibility of contradictory \nverdicts by two Courts in respect of the same relief.  \nb) The judgment of a Co-ordinate Bench of this Court in Romesh \nKumar Bhatia v. Zorrik Enterprises, 1980 SCC OnLine Del 202, \nwhere in similar circumstances, this Court had stayed a suit \npending before this Court on the ground that a similar earlier suit \nwas filed before the District Court.  \nc) The judgment of the Supreme Court in Ruston & Hornsby Ltd. v. \nZamindara Engineering Co., (1969) 2 SCC 727 to contend that \nboth, for the purposes of infringement and for passing off, same \ntest has to be applied by the Court with regard to likelihood of \nconfusion or deception arising from similarity of marks. \n7. \nPer contra, senior counsel appearing on behalf of the plaintiff has \nmade the following submissions: \nI. \nThe aforesaid applications have been filed belatedly only when the \nsuits were set for final hearing. \nII. \nFor a suit to be stayed under Section 10 of the CPC, the subject matter \nin both the suits have to be identical. Reliance in this regard is placed \non the judgment of the Supreme Court in National Institute of \nMental Health & Neuro Sciences v. C. Parameshwara, (2005) 2 \nSCC 256. \nIII. \nThe reliefs of passing off and infringement are arising from entirely \ndifferent causes of action and therefore, it cannot be said that the \nsubject matters in issue in the two suits are directly and substantially \nthe same. Reliance is placed on Mind Gym Ltd. v. Mindgym Kids \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified",
          "pdf_source": "24. VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 7",
          "node_id": "0009",
          "start_index": 7,
          "end_index": 7,
          "summary": "**Summary of Page 7 from PDF: V-Guard Industries Ltd vs. Rakesh Malhotra & Ors. (2023/DHC/000134)**\n\nThe page discusses the applicability of Section 10 of the Code of Civil Procedure (CPC). The plaintiff, V-Guard Industries Ltd., argues that:\n\n* Section 10 is a rule of procedure and not binding on Courts.\n* The bar under Section 10 does not apply because the District Court, Ernakulam did not have territorial jurisdiction to decide the claim for passing off. (Kerala High Court order dated November 24, 2015)\n* Section 10 only envisages a stay of trial, which is not applicable in this case where no evidence needs to be recorded and the suit has been set for final hearing.\n\nThe defendants' rejoinder submissions are mentioned on page 8.",
          "content": "2023/DHC/000134 \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 7 of 19 \n \nLibrary Pvt. Ltd., 2014 SCC OnLine Del 1240 and Pernod Ricard \nIndia (P) Ltd. v. Frost Falcon Distilleries Ltd., 2022 SCC OnLine \nDel 646. \nIV. \nThe Section 10 is merely a rule of procedure and the Courts are not \nbound by the same. Reliance is placed on the judgment of the \nSupreme Court in Pukhraj D. Jain And Ors. v. G. Gopalakrishna \n(2004) 7 SCC 251.  \nV. \nFor provisions of Section 10 of the CPC to apply, the Court in which \nearlier suit has been filed has to be a Court with competent \njurisdiction to decide the said suit. In the present case, the District \nCourt, Ernakulam did not have the territorial jurisdiction in respect of \nthe claim of the plaintiff for passing off and therefore, the bar under \nSection 10 would not apply. Reliance is placed on the order passed by \nthe Kerala High Court on 24th November, 2015, whereby the plaintiff \nhas been allowed to withdraw its claim in so far as the relief of \npassing off is concerned, with liberty to file it before a competent \nCourt. Reliance is placed on the judgment in Bristol-Myers Squibb \nHoldings Ireland Unlimited Company And Ors. v. Natco Pharma, \n2020 SCC OnLine Del 200. \nVI. \nThe Section 10 of the CPC only envisages a stay of the trial and the \nsame cannot apply to the present suit, where it has been recorded that \nno evidence is to be recorded and the suit has been set for final \nhearing. \n8. \n  In rejoinder, senior counsel on behalf of the defendants has made the \nfollowing submissions: \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified",
          "pdf_source": "24. VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 8",
          "node_id": "0010",
          "start_index": 8,
          "end_index": 8,
          "summary": "Here is a summary of page 8 from PDF: 24. VGUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & ORS.pdf (Context: 2023/DHC/000134):\n\n1. The defendants have not delayed in filing the present application, as it was filed immediately after issues were framed on March 6, 2019.\n2. Section 10 of the CPC refers to inherent jurisdiction, not territorial jurisdiction, allowing the District Court, Ernakulam, Kochi, to entertain a passing off suit (Karnataka High Court in Channabasappa Kamadal & Sons v. Kishan Chand & Co. & Anr., 1971 SCC OnLine Kar 182).\n3. The term \"trial\" in Section 10 of the CPC includes final hearings, not only recording evidence.\n4. The plaintiff's submission that the present applications were filed belatedly to delay the suit's final adjudication is without merit.\n\nThe case details are from CS(COMM) 1018/2016 & CS(COMM) 814/2018 in the High Court of Delhi at New Delhi.",
          "content": "2023/DHC/000134 \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 8 of 19 \n \nI. \nThere is no delay on the part of the defendants in filing the present \napplication. The present application was filed immediately after the \nissues were framed in CS(COMM) 814/2018 on 6th March, 2019. \nII. \nThe word „jurisdiction‟ used in Section 10 of the CPC is not in \nrelation to territorial jurisdiction of the Court but in the context of \ninherent jurisdiction. It cannot be denied that the District Court, \nErnakulam, Kochi had the inherent jurisdiction to entertain a suit for \npassing off. Reliance in this regard is placed on the judgment of the \nKarnataka High Court in Channabasappa Kamadal & Sons v. \nKishan Chand & Co. & Anr., 1971 SCC OnLine Kar 182. \nIII. \nIt is wrong to contend that the word „trial‟ in Section 10 of the CPC is \nconfined to the recording of evidence in the suit. The term „trial‟ \nincludes the final hearing of the suit as well. \n9. \nI have heard the counsels for the parties and perused the record. \n10. \nI do not find any merit in the submissions made on behalf of the \nplaintiff that the present applications have been filed belatedly only to delay \nthe final adjudication of the suit. CS(COMM) 814/2018 was filed on behalf \nof the plaintiff only on 19th April, 2018 and issues were framed therein on 6th \nMarch, 2019 and it was directed that both the suits were to be heard \ntogether. The present applications were filed on behalf of the defendants on \n1st July, 2019. Therefore, it cannot be said that there was a delay in filing the \npresent applications.  \n11. \nAs far back in 1962, the four Judge Bench in the Manohar Lal \nChopra (supra) has held that the provisions of Section 10 of the CPC are \nclear, definite and mandatory, and the Court in which the subsequent suit \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified",
          "pdf_source": "24. VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 9",
          "node_id": "0011",
          "start_index": 9,
          "end_index": 9,
          "summary": "**Summary of Page 9 from VGUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & ORS**\n\nSource: 2023/DHC/000134 CS(COMM) 1018/2016 & CS(COMM) 814/2018\n\nThe High Court of Delhi at New Delhi has ruled that Section 10 of the CPC is mandatory in nature and prohibits a court from proceeding with a trial if the parameters are fulfilled.\n\nRelying on Aspi Jal v. Khushroo Rustom Dadyburjor (2013) 4 SCC 333, the court held that:\n\n* The purpose of Section 10 is to prevent parallel litigations in respect of the same cause of action, subject matter, and relief.\n* The objective is to avoid contradictory verdicts and protect defendants from multiplicity of proceedings.\n* The fundamental test for determining applicability of Section 10 is whether the final decision in the first suit would operate as res judicata in the subsequent suit.\n\nDigital signature by Amit Bansal on January 9, 2023.",
          "content": "2023/DHC/000134 \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 9 of 19 \n \nhas been filed is prohibited from proceeding with the trial of the suit if the \nparameters of Section 10 of the CPC are fulfilled.  \n12. \nRelying upon the judgment of the Supreme Court in Aspi Jal v. \nKhushroo Rustom Dadyburjor, (2013) 4 SCC 333, a Co-ordinate Bench of \nthis Court in H.S. SAHNI (supra) has reiterated the position that provision \nof Section 10 of the CPC is mandatory in nature. The relevant observations \nin H.S. SAHNI (supra) are set out below: \n“22. \nEven in Aspi Jal (supra), which is relied upon by the \nlearned senior counsel for the plaintiff, the Supreme Court has \nreiterated that the use of the negative expression in Section 10 \nCPC makes the provision mandatory and the court in which the \nsubsequent suit has been filed is prohibited from proceeding with \nthe trial of that suit. It was reaffirmed that the basic purpose and \nthe underlying object of Section 10 of the Code is to prevent the \ncourts \nof \nconcurrent \njurisdiction \nfrom \nsimultaneously \nentertaining and adjudicating upon two parallel litigations in \nrespect of same cause of action, same subject matter and the \nsame relief. The objective is also to avoid the possibility of \ncontradictory verdicts by two courts in respect of the same relief \nand is aimed to protect the defendant from multiplicity of \nproceedings.  \n \n23. \nThe fundamental test that is to be applied to determine \nwhether Section 10 was applicable or not, is to see whether on \nthe final decision being reached in the first suit, such decision \nwould operate as res-judicata in the subsequent suit. Where there \nwas “identity of matter” in both the suits i.e., the whole of the \nsubject matter in both the proceedings were identical, even if \nfurther reliefs were claimed in the subsequent suit, it would be \nimmaterial and the second suit would necessarily have to be \nstayed.”  \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified",
          "pdf_source": "24. VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 10",
          "node_id": "0012",
          "start_index": 10,
          "end_index": 10,
          "summary": "Here is a summary of page 10 from the PDF source:\n\n**Source:** VGUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & ORS (2023/DHC/000134)\n\n**Summary:**\n\nThe judgment mentions a case, Romesh Kumar Bhatia (supra), where a Co-ordinate Bench of this Court was dealing with a similar issue of passing off. The plaintiffs in the said case had filed a suit against the defendants for infringement of registered trade mark, which was pending before the High Court.\n\n**Key points:**\n\n* The issue of grant of stay under Section 10 of the CPC was considered.\n* It was held that an independent and different finding on the matter of deception and conclusion cannot be given in this suit.\n* As long as the finding of the Additional District Judge in the earlier suit stands, no relief can be granted to the plaintiffs.\n\n**Important dates:**\n\n* None mentioned specifically on page 10\n* November 11, 2022 (order dated) and December 15, 2022 (judgment reserved)\n\n**Judges involved:**\n\n* Amit Bansal (signed digitally)",
          "content": "2023/DHC/000134 \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 10 of 19 \n \n13. \nThe appeal against the aforesaid judgment, being FAO(OS) (COMM) \n70/2022, was dismissed by a Division Bench of this Court vide order dated \n11th November, 2022. \n14. \nIn Romesh Kumar Bhatia (supra) a Co-ordinate Bench of this Court \nwas seized of a similar issue. In the said case, a suit was filed by the plaintiff \nbefore an Additional District Judge based on the claim of passing off and the \nsaid suit was dismissed. An appeal against the said dismissal was pending \nbefore the High Court. During the pendency of the appeal, a suit for \ninfringement of registered trade mark was filed by the plaintiffs. One of the \nissues framed in the infringement suit was whether the said suit was liable to \nbe stayed. While considering the issue of grant of stay under Section 10 of \nthe CPC, the following observations were made: \n“17. \nThe question that therefore, arises is whether an \nindependent and different finding on the matter of deception \nand conclusion can be given in this suit. This will be \ninescapable as no relief can be granted to the plaintiffs unless it \nis held that the use of the word “Zorrik” by the defendants \nresults in deception and confusion so as to infringe the trade \nmark of the plaintiffs. \n \nXXX \n \n \n \nXXX  \n \n \n \nXXX \n \n22. \nWith this state of law, there is no escape from the \nconclusion that as long as the finding of the Additional District \nJudge in the earlier suit that the sale of ties by the defendants \nunder the mark “Zorrik” does not result in deception and \nconfusion with the consumers in the market so as to identify them \nas those of the plaintiffs stands, no relief whatsoever can be \ngranted to the plaintiffs in the present suit. The proper course \nfor the plaintiffs, therefore, is to pursue their remedy in the \nappeal now pending in the High Court. The subject-matter in \nthe present suit to this extent, therefore, must be held as directly \nand substantially similar to that involved in that appeal. The \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified",
          "pdf_source": "24. VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 11",
          "node_id": "0013",
          "start_index": 11,
          "end_index": 11,
          "summary": "**Summary of Page 11 from PDF: V-GUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & ORS.(2023/DHC/000134)**\n\nA Delhi High Court decision, with Judgment Reserved on Dec 15, 2022, and Delivered on Jan 9, 2023.\n\n**Relevant Extract:**\n\n* The court relies on the principle that final decisions in earlier suits can bind subsequent suits if there is substantial identity between matters in dispute (Romesh Kumar Bhatia v. S.P.Rao, AIR 1990 Delhi 1).\n* The District Court, Ernakulam, had already decided a similar trademark infringement case (CS(COMM) 1018/2016), with the finding that marks \"LIVGUARD\" and \"V-GUARD\" are not deceptively similar.\n* This decision is now being considered as binding in a subsequent suit (CS(COMM) 814/2018).\n\n**Key Dates:**\n\n* Dec 15, 2022: Judgment Reserved\n* Jan 9, 2023: Judgment Delivered\n\n**Legal Source:** V-GUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & ORS.(2023/DHC/000134) [PDF]",
          "content": "2023/DHC/000134 \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 11 of 19 \n \nprovisions of S. 10 of the Code of Civil Procedure are, \ntherefore, attracted. It is not necessary that the subject matter \nand cause of action in two suits should be identical. Where \nthere is substantial identity between matters in dispute in earlier \nand later suits, the final decision in the earlier suit would \noperate as binding in the subsequent suit. It is also immaterial \nthat different reliefs are claimed, in case the matters in issue in \nthe two suits are substantially the same. (See in this respect AIR \n1973 Madras 473, in Shorab Merwanji Modi v. Mansata Film \nDistributors, AIR 1957 Calcutta 727, in Guruswami Asari v. \nRaju Asari.” \n \n15. \nThe aforesaid legal principles and particularly, the aforesaid \nobservations in Romesh Kumar Bhatia (supra) as set out above are squarely \napplicable in the facts and circumstances of the present case.  \n16. \nIn the suit filed before the District Court, Ernakulam, the following \nissue was framed as issue no.3: \n“3. Is the trademark „LIVGUARD‟ identical with or deceptively \nsimilar to the trademark „V-GUARD‟?” \n \n17. \nThe District Court, Ernakulam, after a detailed discussion gave a \nfinding that the aforesaid marks of the plaintiff and the defendants are not \ndeceptively similar. The conclusion as set out in paragraph 43 of the \njudgment dated 22nd November, 2016 is set out below:  \n“43. \nTo conclude, what is revealed is that on scores of \nphonetic similarity, visual similarity, similarity of the nature of \npresentation like words similarity and label similarity, and other \ngiven scores of comparison, as revealed from the law trite on the \npoint discussed supra, the plaintiff is not able to establish that \neither the marks are similar or even deceptively similar. Issue \nno.3 is, therefore, found against the plaintiff. It necessarily \nfollows that both marks shall not go to create any confusion in \nthe mindsets of those intended purchasers buying these products \nfrom the often market. This is answer to Issue number 4.” \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified",
          "pdf_source": "24. VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 12",
          "node_id": "0014",
          "start_index": 12,
          "end_index": 12,
          "summary": "Here is a summary of page 12 from the PDF \"24. VGUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & ORS.pdf\" (2023/DHC/000134):\n\nThe judgment mentions:\n\n* An appeal has been filed by the plaintiff against a previous judgment, which is pending adjudication before the Kerala High Court.\n* In an amended plaint filed in CS(COMM) 1018/2016, the plaintiff claims that the wordmark \"LIVGUARD\" is deceptively similar to their mark \"V-GUARD\".\n* Issues were framed in CS(COMM) 1018/2016 on August 16, 2017, including:\n\t+ Issue 1: Whether the defendants' use of the mark \"Livguard\" amounts to passing off goods as those originating from the plaintiff.\n\t+ Issue 4: Whether the use of the defendant's mark \"Livguard\" does not amount to passing off as the plaintiff's mark.\n\nThese points are related to two civil cases, CS(COMM) 1018/2016 and CS(COMM) 814/2018. \n\nPDF source: 24. VGUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & ORS.pdf (2023/DHC/000134)",
          "content": "2023/DHC/000134 \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 12 of 19 \n \n18. \nAdmittedly, an appeal has been filed by the plaintiff against the \naforesaid judgment dated 22nd November, 2016, which is pending \nadjudication before the Kerala High Court. \n19. \nIn the amended plaint filed by the plaintiff in CS(COMM) 1018/2016, \nthe case set up by the plaintiff is that the wordmark “LIVGUARD” is \nconfusingly visually, structurally, phonetically and deceptively similar to the \nplaintiff‟s mark “V-GUARD”. Reference in this regard may be made to \nparagraphs 2A, 2C and 2K of the amended plaint. Based on the above, a \ndecree of permanent injunction is sought against the defendants restraining \nthe defendants from passing off the defendants‟ goods as that of the \nplaintiff‟s on the ground of the defendants‟ mark “LIVGUARD” being \ndeceptively similar to the plaintiff‟s mark “V-GUARD”. \n20. \nIssues were framed in CS(COMM) 1018/2016 on 16th August, 2017. \nReference may be made to issues no.1 and 4, which are set out below: \n“1. \nWhether defendants' adoption and use of the mark \n\"Livguard\" amounts to passing off of, goods as those originating \nfrom the plaintiff?  \n \n \n \n \n \nOPP \nXXX \n \n \n \nXXX  \n \n \n \nXXX \n \n4. \nWhether use of defendant's mark \"Livguard\" word per se \nand/ or as it is being actually used, does not amount to passing \noff as plaintiff s mark?  \n \n \n \n \n        OPD” \n \n21. \nIn CS(COMM) 814/2018, the plaintiff has sought an injunction \nagainst the defendants in respect of defendants passing off the \nplaintiffs‟ trade dress. A comparison has been drawn out in respect of \nthe trade dress of the plaintiff and the defendants in paragraph 2 of the \nplaint, which shows that the wordmark “LIVGUARD” is a prominent \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified",
          "pdf_source": "24. VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 13",
          "node_id": "0015",
          "start_index": 13,
          "end_index": 13,
          "summary": "**Case Summary**\n\nSource: VGUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & ORS (2023/DHC/000134)\n\n**Relevant Page 13 Content**\n\nThe Court observed that the plaintiff's trade dress, including the wordmark \"V-GUARD\", is a prominent part of their trade identity. Issues were framed on March 6, 2019, to determine:\n\n(i) Whether the defendants' trade dress is similar/deceptively similar to the plaintiff's?\n(ii) Whether the cumulative effect of using trade dress along with trademarks by the defendants amounts to passing off as the plaintiff's goods?\n\nThe Court also noted that the outcome will depend on comparing the two marks for similarity/dissimilarity.\n\n**Key Dates and References**\n\n* November 22, 2016: Judgment and decree passed by District Court, Ernakulam\n* March 6, 2019: Issues were framed in the suit\n* December 15, 2022: Judgment Reserved\n* January 9, 2023: Judgment Delivered",
          "content": "2023/DHC/000134 \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 13 of 19 \n \npart of defendants‟ trade dress and the wordmark „V-GUARD‟ is a \nprominent part of the plaintiff‟s trade dress. Issues were framed in the \nsaid suit on 6th March, 2019. A reference may be made to the following \nissues: \n“(i) Whether the trade dress of the defendants is similar / deceptively \nsimilar to the trade dress of the plaintiff?  \n \n \nOPP. \n \n(ii) Whether the cumulative effect of the use of the trade dress along \nwith trade mark by the defendants amounts to the defendants passing \noff their goods as that of the plaintiff?  \n \n \nOPP.” \n \n22. \nOn 6th March, 2019, the Court also made an observation that the \noutcome of the suit would be governed only on a comparison of the \ntwo marks, whether there is any similarity/ dissimilarity between the \ntwo marks. \n23. \nThe intent behind Section 10 of the CPC is to prevent Courts of \nconcurrent jurisdiction from simultaneously deciding suits between the same \nparties, involving directly and substantially the same cause of action. The \nobjective is based on the principle of judicial comity and to avoid two \ncontradictory verdicts by Courts of competent jurisdiction.   \n24. \nA reading of the judgment and decree dated 22nd November, 2016, \npassed by the District Court, Ernakulam, the pleadings in the present suits \nand the issues framed herein, leaves no doubt in my mind that the issues that \nhave to be adjudicated in the present suits, were subject matter of the suit \nbefore the District Court, Ernakulam, and a definite finding has been given \nin the said suit. The finding given by the District Court, Ernakulam that \nthere is no phonetic or visual similarity between the trademarks of the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified",
          "pdf_source": "24. VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 14",
          "node_id": "0016",
          "start_index": 14,
          "end_index": 14,
          "summary": "Here is a summary of page 14 from the provided PDF:\n\n**Case:** V-GUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & ORS.\n\n**High Court of Delhi**\n\n**Citation:** 2023/DHC/000134, CS(COMM) 1018/2016 & CS(COMM) 814/2018\n\n**Page 14:**\nThe court finds that the subject matter of the present suits is directly and substantially identical to a suit pending before the District Court, Ernakulam, Kerala High Court. The plaintiff's counsel relied on National Institute of Mental Health & Neuro Sciences (supra) to argue that Section 10 of the Code of Civil Procedure (CPC) requires identical subject matters for a stay under the provision.\n\n**Important points:**\n\n* The court notes that Section 10 aims to prevent concurrent courts from trying parallel suits.\n* The plaintiff's suit is similar to another suit pending before the District Court, Ernakulam, with an appeal pending in the Kerala High Court.\n* No submission was made by the plaintiff to contest the similarity between the two suits.\n\n**Source:**\n2023/DHC/000134 \nCS(COMM) 1018/2016 & CS(COMM) 814/2018 PDF",
          "content": "2023/DHC/000134 \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 14 of 19 \n \nplaintiff and the defendant, constitutes res judicata and is binding on the \nplaintiff and in light of the aforesaid finding, no relief can be granted to the \nplaintiffs in the present suit. Therefore, in my considered view the subject \nmatter of the present suits is directly and substantially identical to the \nsubject matter of the suit before the District Court, Ernakulam, and is now \nthe subject matter of an appeal pending before the Kerala High Court. It is to \nbe noted that no submission has been made on behalf of the plaintiff to the \neffect that the issues to be determined in the present suits and the suit before \nthe District Court, Eranakulam are not directly and substantially the same.  \nTherefore, if the present suits are permitted to proceed, there could be a \npossibility of conflicting judgments in respect of similar issues between the \nsame parties.   \n25. \nCounsel for the plaintiff has placed reliance on National Institute of \nMental Health & Neuro Sciences (supra)  to contend that for a suit to be \nstayed under Section 10 of the CPC, the subject matter in both the suits have \nto be identical. Paragraph 8 of the aforesaid judgment relied upon by the \nplaintiff is set out below: \n“8.  The object underlying Section 10 is to prevent courts of \nconcurrent jurisdiction from simultaneously trying two parallel \nsuits in respect of the same matter in issue. The object underlying \nSection 10 is to avoid two parallel trials on the same issue by two \ncourts and to avoid recording of conflicting findings on issues \nwhich are directly and substantially in issue in previously \ninstituted suit. The language of Section 10 suggests that it is \nreferable to a suit instituted in the civil court and it cannot apply \nto proceedings of other nature instituted under any other statute. \nThe object of Section 10 is to prevent courts of concurrent \njurisdiction from simultaneously trying two parallel suits \nbetween the same parties in respect of the same matter in issue. \nThe fundamental test to attract Section 10 is, whether on final \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified",
          "pdf_source": "24. VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 15",
          "node_id": "0017",
          "start_index": 15,
          "end_index": 15,
          "summary": "Here is a summary of page 15 from the PDF \"24. VGUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & ORS.pdf\" (2023/DHC/000134):\n\nThe plaintiff (V-GUARD INDUSTRIES LTD) relies on Section 10 of the Civil Procedure Code (CPC), which provides that where a matter in issue has been decided in a previous suit, such decision will operate as res judicata in a subsequent suit.\n\nHowever, this reliance is mislaid according to the court. The Supreme Court distinguishes between \"directly and substantially in issue\" and \"incidentally or collaterally in issue\". A decision under Section 10 must be based on an identical matter in issue in both suits, otherwise, it will not apply.\n\nThis is supported by a previous Supreme Court judgment (Ruston & Hornsby Ltd.), which holds that similarity between marks is the test for infringement, even if they are not exactly identical. If there is a likelihood of confusion or deception arising from similar marks, an action can proceed.\n\nSource: 24. VGUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & ORS.pdf (PDF source not provided)",
          "content": "2023/DHC/000134 \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 15 of 19 \n \ndecision being reached in the previous suit, such decision would \noperate as res judicata in the subsequent suit. Section 10 applies \nonly in cases where the whole of the subject-matter in both the \nsuits is identical. The key words in Section 10 are “the matter in \nissue is directly and substantially in issue” in the previous \ninstituted suit. The words “directly and substantially in issue” \nare used in contradistinction to the words “incidentally or \ncollaterally in issue”. Therefore, Section 10 would apply only if \nthere is identity of the matter in issue in both the suits, meaning \nthereby, that the whole of the subject-matter in both the \nproceedings is identical.” \n \n26. \nAs can be seen from the extract quoted above, the Supreme Court \nsought to distinguish the key words used in Section 10 of the CPC, matter in \nissue is “directly and substantially in issue” in a previously instituted suit, \nfrom the words “incidentally or collaterally in issue”.  In the case before the \nSupreme Court, the respondent sought stay of a suit under Section 10 of the \nCPC on the ground that appellant had filed a Writ Petition against the award \nof the Labour Court and the same was pending before the High Court. The \nSupreme Court held that since the scope of the Writ Petition was entirely \ndistinct and separate from the suit filed before the Civil Court, stay under \nSection 10 of the CPC could not have been granted. Therefore, the reliance \nplaced by the plaintiff on National Institute of Mental Health & Neuro \nSciences (supra)  is misplaced.  \n27. \nThe Supreme Court in Ruston & Hornsby Ltd. (supra) has \ncategorically held that where the marks of the defendant and the plaintiff are \nnot exactly identical, but are similar, the test of infringement would be the \nsame as in an action for passing off i.e., whether there is a likelihood of \nconfusion or deception arising from the similarity of marks. The causes of \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified",
          "pdf_source": "24. VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 16",
          "node_id": "0018",
          "start_index": 16,
          "end_index": 16,
          "summary": "Here is a summary of page 16 from the PDF:\n\n**Case Details:** V-Guard Industries Ltd vs Rakesh Malhotra & Ors (2023/DHC/000134)\n\n**Court Proceedings:**\n\n* The court has to decide on the likelihood of confusion arising from the similarity of marks in both infringement and passing off actions.\n* The plaintiff's reliance on Mind Gym Ltd. and Pernod Ricard judgments is misplaced as they relate to different cases.\n\n**Arguments:**\n\n* The defendants argue that the District Court, Ernakulam did not have territorial jurisdiction to entertain the claim of passing off.\n* The plaintiff counters by arguing that since a court in India has jurisdiction to grant relief, Section 10 of the CPC mandates its application even before final adjudication of the suit.\n\n**Judicial Decisions:**\n\n* Manohar Lal Chopra (supra) held provisions of Section 10, CPC as mandatory.\n* Bristol-Myers (supra) judgment is cited by the plaintiff, but senior counsel for defendants contests this reliance.",
          "content": "2023/DHC/000134 \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 16 of 19 \n \naction in a suit for infringement and in a suit for passing off may be \ndifferent, as infringement is a statutory remedy and passing off is a common \nlaw remedy, however, the issue with regard to likelihood of confusion \narising from the similarity of marks has to be decided in both the actions. In \nview thereof reliance placed by the plaintiff on the judgment in Mind Gym \nLtd. (supra) and Pernod Ricard (supra), is misplaced.   \n28. \nReliance has been placed on behalf of the plaintiff on the judgment in \nPukhraj D. Jain (supra) to contend that provisions of Section 10 of the CPC \nare procedural and mere filing of an application under Section 10 of the CPC \ndoes not preclude the Court from examining the merits of the matter. \nHowever, the said judgment does not bar the Court from dealing with an \napplication under Section 10 of the CPC before the final adjudication of the \nsuit.  As noted above, a four Judge Bench of Supreme Court in Manohar \nLal Chopra (supra) has categorically held that provisions of Section 10 of \nthe CPC are mandatory. Therefore, reliance placed on Pukhraj D. Jain \n(supra) is also misplaced. \n29. \nNext, it has been contended on behalf of the plaintiff that the District \nCourt, Ernakulam did not have the territorial jurisdiction to entertain the \nclaim of passing off and therefore, the bar under Section 10 of the CPC \nwould not apply in view of the language used in Section 10 i.e., “Court in \nIndia having jurisdiction to grant the relief claimed”. In this regard, reliance \nhas been placed on a judgment of a Co-ordinate Bench in Bristol-Myers \n(supra). \n30. \nOn the other hand, senior counsel on behalf of the defendants submits \nthat the expression “Court in India having jurisdiction to grant the relief \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified",
          "pdf_source": "24. VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 17",
          "node_id": "0019",
          "start_index": 17,
          "end_index": 17,
          "summary": "**Summary of Page 17 from PDF:**\n\n**Case:** V-Guard Industries Ltd vs Rakesh Malhotra & Ors (CS(COMM) 1018/2016)\n\n**Key Points:**\n\n* The court is discussing the inherent jurisdiction of a Court to entertain a suit.\n* It distinguishes between territorial and inherent jurisdiction, citing examples from other cases:\n\t+ Bristol-Myers (supra): Involves an earlier suit filed in a Court lacking inherent jurisdiction.\n\t+ Channabasappa Kamadal & Sons (supra): The Karnataka High Court views Section 10 of the CPC as dealing with competency to entertain and grant relief, not territorial jurisdiction.\n* The court holds that the plaintiff's reliance on Bristol-Myers is misplaced, as their earlier suit was filed in a Court with inherent jurisdiction.\n\n**Sources:**\n\n* PDF: V-Guard Industries Ltd vs Rakesh Malhotra & Ors (24. VGUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & ORS.pdf)\n* Case number: 2023/DHC/000134\n* Judgment Reserved: December 15, 2022; Judgment Delivered: January 9, 2023",
          "content": "2023/DHC/000134 \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 17 of 19 \n \nclaimed” refers to a Court having inherent jurisdiction to entertain the suit \nand not territorial jurisdiction. \n31. \nReliance placed on behalf of the plaintiff on the judgment in Bristol-\nMyers (supra) is misplaced as the findings in the aforesaid judgment were \nmade in the context of a prior suit having been instituted by the defendant \ntherein in a Court which did not have the inherent jurisdiction to entertain \nthe suit. Therefore, in Bristol-Myers (supra) the Court held that the earlier \nsuit was an abuse of the process of law. In the present case, it was the \nplaintiff itself that had filed the earlier suit in District Court, Ernakulam and \nit is nobodies‟ case that the District Court, Ernakulam lacked inherent \njurisdiction to try the suit. \n32. \nIn Channabasappa Kamadal & Sons (supra), the Karnataka High \nCourt expressed the view that the expression “Court in India having \njurisdiction to grant the relief claimed” used in Section 10 of the CPC does \nnot deal with territorial jurisdiction and only refers to the competency of the \nCourt to entertain and grant the relief sought in the suit. I am in respectful \nagreement with the view expressed by the Karnataka High Court in  \nChannabasappa Kamadal & Sons (supra). The expression “Court in India \nhaving jurisdiction to grant the relief claimed” used in Section 10 of the \nCPC cannot be applied in the context of a Court in India not having \nterritorial jurisdiction and would be applicable only when the Court where \nthe earlier suit has been instituted lacks the inherent jurisdiction to try the \nsaid suit.   \n33. \nThere is another aspect to be considered with regard to the aforesaid \nissue. The plaintiff had filed the suit based on both infringement as well as \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified",
          "pdf_source": "24. VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0023",
      "start_index": 18,
      "end_index": 19,
      "summary": "The document is a court decision from the High Court of Delhi in a case between V-Guard Industries Ltd (plaintiff) and Rakesh Malhotra & Ors (defendants). The case numbers are CS(COMM) 1018/2016 and CS(COMM) 814/2018.\n\n**Background:**\n\nThe plaintiff had filed a suit against the defendants in the District Court, Ernakulam, Kerala, but was unsuccessful. They appealed to the Kerala High Court, which also dismissed their appeal. The Supreme Court also declined to hear their Special Leave Petition (SLP). Subsequently, the plaintiff applied under Order XXIII Rule 1 of the CPC to withdraw a part of their claim relating to passing off and were granted permission to do so with liberty to file a fresh suit.\n\n**Arguments:**\n\nThe defendants argued that the bar under Section 10 of the Code of Civil Procedure (CPC) prohibits the filing of a new suit on matters already tried, despite the withdrawal of the original claim. The plaintiff countered that this applies only to the recording of evidence and not to the entire trial process.\n\n**Decision:**\n\nThe Court ruled in favor of the defendants, holding that the bar under Section 10 of the CPC applies to the entire trial process, including final arguments. Both applications were allowed, and both suits were stayed with liberty for the parties to revive them after the decision in a pending appeal before the Kerala High Court.\n\n**Parties:**\n\n* Plaintiff: V-Guard Industries Ltd\n* Defendants: Rakesh Malhotra & Ors\n\n**Dates:**\n\n* Judgment Reserved: 15th December, 2022\n* Judgment Delivered: 9th January, 2023\n\nSource:\n24. VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
      "pdf_source": "24. VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
      "nodes": [
        {
          "title": "Page 18",
          "node_id": "0021",
          "start_index": 18,
          "end_index": 18,
          "summary": "Here is a summary of page 18 from the provided PDF:\n\nCourt Case: V-GUARD INDUSTRIES LTD VS RAKESH MALHOTRA & ORS (2023/DHC/000134)\n\nPage Content (relevant excerpts):\n\n* The plaintiff had filed an application to withdraw part of its claim in CS(COMM) No.814/2018, relating to passing off.\n* This application was allowed by the District Judge, Ernakulam, permitting the plaintiff to withdraw the part of the claim with liberty to institute a fresh suit.\n* Pursuant to this permission, CS(COMM) 1018/2016 was filed on behalf of the plaintiff.\n\nLegal Facts and Proceedings:\n\n* The plaintiff sought to withdraw part of its claim in CS(COMM) No.814/2018, citing lack of territorial jurisdiction by the District Court, Ernakulam.\n* The District Judge gave permission for withdrawal with liberty to file a fresh suit.\n* The plaintiff then filed CS(COMM) 1018/2016.\n\nPDF Source: V-GUARD INDUSTRIES LTD VS RAKESH MALHOTRA & ORS (2023/DHC/000134), judgment delivered on January 9, 2023.",
          "content": "2023/DHC/000134 \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 18 of 19 \n \npassing off before the District Court, Ernakulam. The interim application \nfiled on behalf of the plaintiff was dismissed by the District Court, \nErnakulam and appeal against the said order was dismissed by the Kerala \nHigh Court and subsequently, the SLP filed before the Supreme Court was \nwithdrawn by the plaintiff. It was only thereafter that the plaintiff filed an \napplication under Order XXIII Rule 1 of the CPC seeking to withdraw a part \nof the claim in the said suit relating to passing off with liberty to file the \nsame before a Court with competent jurisdiction. This application was \nallowed by the District Judge, Ernakulam, Kochi by permitting the plaintiff \nto withdraw the part of the claim relating to passing off with liberty to \ninstitute a fresh suit. Pursuant to the said liberty, CS(COMM) 1018/2016 \nwas filed on behalf of the plaintiff. \n34. \nThere is no definite finding given by the District Court, Ernakulam \nwith regard to the District Court, Ernakulam not having territorial \njurisdiction. It was only at the asking of the plaintiff that the plaintiff was \npermitted to withdraw the part of the claim in the said suit with liberty to file \na fresh suit in respect of the subject matter of the part of the claim. The \nplaintiff did not wait for the District Court, Ernakulam to give a finding that \nit lacked territorial jurisdiction and straight away filed an application for \nwithdrawal of part of the claim on the ground of District Court, Ernakulam \nnot having the territorial jurisdiction to try the said suit.  It appears that not \nhaving got an interim injunction in its favour, the plaintiff withdrew the part \nof the claim in the said suit to take a chance before another Court.  \n35. \nThe submission of the plaintiff that the bar under Section 10 of the \nCPC is only in respect of trial of the suit and the expression „trial‟ has to be \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified",
          "pdf_source": "24. VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 19",
          "node_id": "0022",
          "start_index": 19,
          "end_index": 19,
          "summary": "Here is a summary of page 19 from the provided PDF:\n\n**Case:** V-GUARD INDUSTRIES LTD vs RAKESH MALHOTRA & ORS\n**Court:** High Court of Delhi at New Delhi\n**Reference:** CS(COMM) 1018/2016, CS(COMM) 814/2018\n\n**Decision:**\n\n* The judge emphasizes that the term \"trial\" encompasses both evidence recording and final arguments.\n* Two applications are allowed, resulting in a stay on both present suits with liberty to revive them after the decision in RFA 117/2017 pending before the Kerala High Court.\n* The hearing scheduled for January 23rd is cancelled.\n\n**Notable Information:**\n\n* Case number: CS(COMM) 1018/2016\n* Connected case (if available): CS(COMM) 814/2018\n* Judgement reserved on: December 15, 2022\n* Judgement delivered on: January 9, 2023\n\n**Source:** PDF: 24. VGUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & ORS.pdf",
          "content": "2023/DHC/000134 \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 19 of 19 \n \ngiven a narrow meaning to include only the recording of evidence in the \nsuit, is wholly misplaced. A reference to Order XVIII of the CPC would \ndemonstrate that the recording of evidence in a suit cannot be treated \nseparately from the final arguments in the case.  The term „trial‟ would \ninclude the entire composite process of recording of evidence as well as \naddressing final arguments.  \n36. \nAccordingly, both the applications are allowed and both the present \nsuits are stayed with liberty to the parties to get the same revived after the \ndecision in RFA 117/2017 pending before the Kerala High Court. \nCS(COMM) 1018/2016 & CS(COMM) 814/2018  \n37. \nThe date 23rd January, 2023 stands cancelled. \n \n \nAMIT BANSAL, J. \nJanuary 09, 2023 \nsr \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified",
          "pdf_source": "24. VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-16T14:53:12.731618",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}