{
  "doc_name": "29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks",
  "pdf_source": "29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf",
  "metadata": {
    "document_name": "29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks",
    "source_pdf": "29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf",
    "judges": [
      "C. HARI SHANKAR J U D G M E N T (ORAL) % 22.02.2023 1."
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "113/2021",
      "113/2021",
      "113/2021",
      "113/2021",
      "113/2021",
      "113/2021",
      "113/2021",
      "113/2021",
      "113/2021"
    ],
    "dhc_numbers": [
      "2023/DHC/001284",
      "2023/DHC/001284",
      "2023/DHC/001284",
      "2023/DHC/001284",
      "2023/DHC/001284",
      "2023/DHC/001284",
      "2023/DHC/001284",
      "2023/DHC/001284"
    ],
    "ia_numbers": [],
    "decision_date": "7 March, 2017",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      "Jainsons Lights Private Limited"
    ],
    "defendants": [
      "The Registrar of Trade Marks"
    ],
    "appellants": [
      "Jainsons Lights Private Limited"
    ],
    "respondents": [
      "The Registrar of Trade Marks"
    ],
    "plaintiff_advocates": [],
    "defendant_advocates": [
      "Mr. Harish Vaidyanathan Shankar, CGSC"
    ],
    "appellant_advocates": [
      "Mr. Vikram Grover and Mr. Harish K. Chauhan, Advs."
    ],
    "respondent_advocates": [
      "Mr. Harish Vaidyanathan Shankar, CGSC"
    ],
    "damages_claimed": null,
    "damages_awarded": null,
    "key_issues": [
      "Here are the main legal issues from the document:",
      "* Section 11(1) of the Trade Marks Act 1999 and its application to objections to registration of a mark due to similarity with an earlier trademark.",
      "* Likelihood of confusion in the minds of the public as a ground for objection to registration under the Trade Marks Act 1999.",
      "* Definition of \"deceptively similar\" marks under the Trade Marks Act 1999.",
      "* Effectiveness of a unique colour combination in distinguishing a mark from earlier similar marks.",
      "* Consideration of goodwill and reputation in determining likelihood of confusion.",
      "* Significance of prior user claims and ownership history of a trademark under the Trade Marks Act 1999.",
      "* Applicability of trade mark law to different classes of goods and services.",
      "* Standard for evaluating similarity between two trade marks under the Trade Marks Act 1999.",
      "* Burden of proof in establishing distinctiveness or reputation of a trade mark."
    ],
    "decision_summary": "Here is a comprehensive summary of the case:\n\n**Background:**\n\nThe present appeal is filed by Jainsons Lights Private Limited (hereinafter referred to as \"the appellant\") against the decision of the Registrar of Trade Marks dated 27th April 2020, rejecting their application for registration of the mark (hereinafter referred to as “the subject mark”) in Class 11.\n\n**Legal Issues:**\n\nThe legal issue in this case is whether the subject mark can be registered under Section 11(1) of the Trade Marks Act, 1999, or not. The Registrar had objected to the registration of the subject mark on the ground that it was deceptively similar to an earlier trade mark \"M/s JAINSONS LITES\" (Application No. 2242763), which had been filed by Mr. Rakesh Jain in respect of electrical fancy lights, electrical goods, items and instruments.\n\n**Arguments:**\n\nThe appellant submitted their response to the First Examination Report (FER) dated 7th March 2017, and relied on their user claim of the mark \"JAINSONS\" since 1978 for lighting goods. They contended that the subject mark was a highly stylised representation of their trade name, which included the year of adoption of the mark \"JAINSONS\", i.e., 1978. The appellant also claimed goodwill and reputation achieved since 1978.\n\nThe Senior Examiner, however, rejected the application on three grounds:\n\n(i) Phonetic similarity between the subject mark and Mark No. 2242763\n(ii) Conceptual similarity between the two marks\n(iii) Similarity of goods and services covered under both marks\n\n**Court Findings:**\n\nThe Hon'ble Mr. Justice C. Hari Shankar, while considering the submissions made by the appellant and their predecessors, noted that:\n\n* The trade mark \"JAINSONS\" had been adopted in 1978 primarily for lighting goods\n* The subject mark was a stylised representation of the trade name, which included the year 1978\n* The applicant claimed user since 2014\n\nHowever, after perusing the response to the FER and evidence filed by the Senior Examiner, the court found that:\n\n* The subject mark was phonetically similar to Mark No. 2242763\n* There were conceptual similarities between the two marks\n* Similar goods and services were covered under both marks\n\n**Decision:**\n\nThe Hon'ble Mr. Justice C. Hari Shankar upholding the impugned order held that the subject mark is deceptively similar to an earlier trade mark, i.e., Mark No. 2242763, which was already in existence with a user claim of 2005. He relied on Section 11(1) of the Trade Marks Act, 1999, and rejected the application.\n\nThe final verdict is in favour of the Registrar of Trade Marks, and the appeal filed by the appellant is dismissed.",
    "legal_precedents": [],
    "full_text": "\n--- PAGE 1 ---\nNeutral Citation Number : 2023/DHC/001284 \nC.A.(COMM.IPD-TM) 113/2021  \nPage 1 of 8    \n \n$~3(Original) \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.A.(COMM.IPD-TM) 113/2021 \n \nJAINSONS LIGHTS PRIVATE LIMITED          ..... Appellant \nThrough: \nMr. Vikram Grover and Mr. \nHarish K. Chauhan, Advs. \n \n \n \n \n \nversus \n \n \nTHE REGISTRAR OF TRADE MARKS \n      ..... Respondent \nThrough: \nMr. \nHarish \nVaidyanathan \nShankar, CGSC \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C. HARI SHANKAR \n \n \n \n     J U D G M E N T (ORAL) \n% \n \n \n \n     22.02.2023 \n \n1. \nApplication no. 3487036  was filed by the appellant before the \nTrade \nMarks \nRegistry \nfor \nregistration \nof \nthe \nMark \n (hereinafter referred to as “the subject mark”) \nin Class 11, for electric lamps, lighting apparatus and installations, \nluminaries chandeliers, lamp shades, lamps, led and fluorescent lights, \nflash lights, lanterns for lighting, lighting fittings and fixtures, \ndecorative lighting, light diffusers, ceiling light, wall lights, outdoor \nlights, water proof lights, desk lamps, floor lamps, hanging lamps, \nlighting tubes, light bulbs, security lights, garden lights, mood \nlighting, display lighting etc.  The appellant claimed user of the \nsubject mark since 2014.  \n \n2. \nThe Registrar, vide First Examination Report (FER) dated 7th \nMarch 2017, objected to the registration of the subject mark.  In the \nFER, “M/s JAINSONS LITES” was cited as an earlier trade mark, for \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.02.2023\n15:30:55\nSignature Not Verified\n\n--- PAGE 2 ---\nNeutral Citation Number : 2023/DHC/001284 \nC.A.(COMM.IPD-TM) 113/2021  \nPage 2 of 8    \n \nwhich Application No. 2242763, submitted by Mr. Rakesh Jain, \nseeking registration of the mark in Class 11 in respect of “electrical \nfancy lights, electrical goods, items and instruments”, was already in \nexistence with user claim of 2005.  The FER objected to the \nregistration of the subject mark on the ground that it was deceptively \nsimilar to the earlier mark “M/s JAINSONS LITES”.  \n \n3. \nThe appellant submitted his response to the FER on 1st May \n2017. It was sought to be contended, in the response, that the trade \nmark “JAINSONS” had been adopted by the predecessor of the \nappellant in 1978 primarily in respect of lighting goods and was in use \nsince then.   The subject mark, it was submitted, was a highly stylised \nrepresentation of the predominant feature of the trade name of the \nappellant, which was Jainsons Lights Pvt. Ltd., and also included 1978 \nas representing the year of adoption of the mark “JAINSONS”. \nMoreover, it was submitted that the subject mark was in a unique \ncolour combination of teal and black, which was specifically claimed \nwhile applying for registration of the subject mark.  The reply also \nemphasised the goodwill and reputation that the appellant had gained \nsince 1978. \n \n4. \nThe impugned order dated 27th April 2020 rejected Application \nNo. 3487036 in the following terms: \n“The mark applied for registration is objectionable under following \nprovision of the Trade Marks Act, 1999-  \n \nThe mark applied for registration is identical with /similar to earlier  \ntrademarks on record, as mentioned in the Examination report and \nby similarity of marks as well as similarity of goods and services \ncovered under such marks, there exists a likelihood of confusion in \nthe mind of public. As such the registration of the mark is \nobjectionable under Section 11(1) of the Trade Marks Act 1999  \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.02.2023\n15:30:55\nSignature Not Verified\n\n--- PAGE 3 ---\nNeutral Citation Number : 2023/DHC/001284 \nC.A.(COMM.IPD-TM) 113/2021  \nPage 3 of 8    \n \nADV. HARISH appeared and argued and submitted that, the cited \nmark is different, heard, and checked the details of application, it \nappeared that. Reply perused not satisfactory, Deceptively and \nphonetically and conceptually similar registered mark no. \n12242763 with the identical goods are on record, so it will cause \nthe confusion to the public and in the market, moreover user claim \nsince 2014, and user affidavit submitted along with the evidence in \nsupport has proved the user since 2014 which is subsequent to the \nuser of the cited mark, and adv. also fails to establish the \nsignificance and uniqueness in the adoption of the trade mark, \nsince the prefix is a common English term, as there is phonetically \nsimilarity with the cited mark, hence no difference between cited \nmark and the applicant mark, so; upon considering the material on \nrecord and submissions made by the adv. And applicant is fail to \nprove the justification for waving off obj. raised under sec. 11 trade \nMark Act 1999.” \n \n5. \nWith some effort, the court has been able to glean, from the \nimpugned order, the grounds on which the Senior Examiner has \nrejected the appellant’s application as \n(i) \nphonetic similarity between the subject mark and Mark \nNo. 2242763, \n(ii) \nconceptual similarity between the subject mark and Mark \nNo. 2242763, \n(iii) \nthe fact that both marks were claimed in respect of \nidentical goods/services.  \n(iv) \nthe possibility, therefore, of confusion to the public were \nboth marks to be registered, \n(v) \nthe user claim of the appellant, of 2014, being subsequent \nto user claim of Mr. Rakesh Jain in respect of Mark No. \n2242763, which was 2005, and \n(vi) \nlack of significance and uniqueness in the subject mark, \nas “lights” was a common English term. \n \n6. \nOf these findings, no cavil, in the opinion of the court, can be \ntaken with the findings no. (i), (iii), (iv) and (v). \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.02.2023\n15:30:55\nSignature Not Verified\n\n--- PAGE 4 ---\nNeutral Citation Number : 2023/DHC/001284 \nC.A.(COMM.IPD-TM) 113/2021  \nPage 4 of 8    \n \n \n7. \nThe court is in agreement with the Senior Examiner in her \nobservation that  \n(i)  \nthe subject mark was phonetically identical to Mark No. \n2242763 as the subject mark was “Jainsons Lights” and Mark \nNo. 2242763 was “M/s Jainsons Lites”,  \n(ii)  \nthe registration of the marks were sought in respect of \nidentical goods, i.e. electrical lamps, lights, electrical goods and \nfittings etc. and   \n(iii)  the claim of user, by the appellant, was subsequent to the \nclaim of user of Rakesh Jain in respect of Mark no. 2242763. \n \n8. \nThe court is also in agreement with the finding of the Senior \nExaminer that permitting registration of both the marks is likely to \nresult in confusion. Section 11(1)(b)1 of the Trade Marks Act \nproscribes registration of a trade mark if, owing to its similarity to an \nearlier trade mark, and the identity of similarity of the goods or \nservices covered by the two marks, a likelihood of confusion on the \npart of the public can be said to exist.   \n \n9. \nThere can be no gainsaying the fact that the mark “Jainsons \nLights” is similar to the mark “Jainsons Lites”. Both marks were used \nin respect of similar goods and services.  \n \n                                          \n1 11.  \nRelative grounds for refusal of registration. –  \n(1)  \nSave as provided in Section 12, a trade mark shall not be registered if, because of –  \n(a)  \nits identity with an earlier trade mark and similarity of goods or services \ncovered by the trade mark; or \n(b)  \nits similarity to an earlier trade mark and the identity or similarity of the goods \nor services covered by the trade mark, \nthere exists a likelihood of confusion on the part of the public, which includes the likelihood of association \nwith the earlier trade mark. \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.02.2023\n15:30:55\nSignature Not Verified\n\n--- PAGE 5 ---\nNeutral Citation Number : 2023/DHC/001284 \nC.A.(COMM.IPD-TM) 113/2021  \nPage 5 of 8    \n \n10. \nMr. Grover has sought to contend that the Senior Examiner as \nerred to note (i) the unique stylised nature of the subject mark, which \ndistinguished it from the “Jainsons Lites” mark of Rakesh Jain and (ii) \nthe inclusion, in the subject mark, of the phrase “since 1978” which \nwas essentially intended to indicate tht the mark “Jainsons”, which \nwas the prominent part of the subject mark, had been in use since \n1978. \n \n11. \nAs already noted, the aspect of likelihood of confusion, for the \npurposes of Section 11(1)(b) has to be examined from the point of \nview of “the public”, as the clause refers to “likelihood of  confusion \non the part of the public”.  Insofar as the aspect of confusion, in the \nmatter of trade marks is concerned, it is settled that the test has to \napply from the point of view of a customer of average intelligence and \nimperfect recollection. Viewed from the perspective of such a \ncustomer, the court cannot characterise the finding, of the Senior \nExaminer, that there is a likelihood of confusion between the subject \nmark “Jainsons Lights” and the earlier mark “Jainsons Lites” as \narbitrary, or otherwise deserving of interference in appeal, especially \nas both the marks were being used in respect of identical goods. The \nunwary customer of average intelligence and imperfect recollection \ncannot be attributed the perspicacity to be able to recollect that, in one \ncase, “lights” was spelt “Lites” and, in the other, “Lights”.  Nor can \nthe mere inclusion, in the subject mark, of the words “since 1978”, or \nof the word “M/s” in Mark No. 2242763, be regarded as factors which \nwould mitigate the possibility of such confusion arising in the minds \nof the customer of average intelligence and imperfect recollection as \nthese are elements of a mark which may change from time to time.   \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.02.2023\n15:30:55\nSignature Not Verified\n\n--- PAGE 6 ---\nNeutral Citation Number : 2023/DHC/001284 \nC.A.(COMM.IPD-TM) 113/2021  \nPage 6 of 8    \n \n12. \nBesides, in the \n, the dominant impression \nthat the average customer, who views the mark without prior \nfamiliarity with it, would carry with him, is of “JAINSONS \nLIGHTS”, rather than of “since 1978”.  An average consumer, \nrealistically speaking, would identify the appellant from its name \n“JAINSONS LIGHTS”, rather than from the year from which it had \nstarted using the mark “JAINSONS”.  This reality is apparent from the \nmark itself, in which the “since 1978” slogan is in disproportionately \nsmall letters, as compared to “JAINSONS LIGHTS”.  If the mythical \ncustomer of imperfect recollection were to to be asked to recollect the \nmark, he would recollect it as “JAINSONS LIGHTS”, not as \n“JAINSONS LIGHTS SINCE 1978”.  Equally, he would recollect \nMark No. 2242763 as “JAINSONS LITES”, not as “M/s JAINSONS \nLITES”.   \n \n13. \nThe Senior Examiner is also correct in her observation that \n“lights” – whether spelt “lights” or “lites” – is an ordinary English \nword.  Perhaps it would be more appropriate to hold that the dominant \npart, whether of “JAINSONS LIGHTS” or “JAINSONS LITES”, is \n“JAINSONS”.  That dominant part, in the two marks, is identical, \nthereby exacerbating the chance of confusion.  \n \n14. \n Mr. Grover has also sought to press into service Sections 122 \nand 343 of the Trade Marks Act.  \n                                          \n2 12.  \nRegistration in the case of honest concurrent use, etc. – In the case of honest concurrent use or \nof other special circumstances which in the opinion of the Registrar, make it proper so to do, he may permit \nthe registration by more than one proprietor of the trade marks which are identical or similar (whether any \nsuch trade mark is already registered or not) in respect of the same or similar goods or services, subject to \nsuch conditions and limitations, if any, as the Registrar may think fit to impose. \n3 34.  \nSaving for vested rights. – Nothing in this Act shall entitle the proprietor or a registered user of \nregistered trade mark to interfere with or restrain the use by any person of a trade mark identical with or \nnearly resembling it in relation to goods or services in relation to which that person or a predecessor in title of \nhis has continuously used that trade mark from a date prior –  \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.02.2023\n15:30:55\nSignature Not Verified\n\n--- PAGE 7 ---\nNeutral Citation Number : 2023/DHC/001284 \nC.A.(COMM.IPD-TM) 113/2021  \nPage 7 of 8    \n \n15. \nI am, unfortunately, unable to accept his submission that either \nof these provisions would serve to vitiate the impugned order.  Section \n12 permits the Registrar, in an appropriate case, to allow registration \nof a mark which is identical, or similar to an earlier trade mark, where \nthe case is one of “honest concurrent use”, or where there are “other \nspecial circumstances”.  \n \n16. \nMr. Grover seeks to submit that the present case has to be \nregarded as one involving “other special circumstances”, the “special \ncircumstance” being that the “Jainsons” mark had been in use by his \nclient since 1978.  For this purpose, Mr. Grover seeks to submit that \nSection 12 may be read in conjunction with Section 34 of the Trade \nMarks Act.    \n \n17. \nSection 34 of the Trade Marks Act allows the Registrar to \nregister a trade mark which is identical with or nearly resembling an \nearlier trade mark, in respect of identical goods or services, provided \nthe user of the former is prior in point of time both to registration and \nuser of the latter.  \n \n18. \nThis defence obviously, cannot come to the aid of the appellant, \nas the claim of user of the appellant, in respect of the subject trade \nmark, is of 2014, whereas the user claim of Rakesh Jain in respect of \nMark No. 2242763 is of 2005.  Though Mr Grover emphasizes that \nthe mark “JAINSONS” was being used since 1978, that is irrelevant.  \nThe court, while applying Section 34, has to take into account the \n                                                                                                                   \n(a)  \nto the use of the first-mentioned trade mark in relation to those goods or services be the \nproprietor or a predecessor in title of his; or \n(b)  \nto the date of registration of the first-mentioned trade mark in respect of those goods or \nservices in the name of the proprietor of a predecessor in title of his; \nwhichever is the earlier, and the Registrar shall not refuse (on such use being proved) to register the second \nmentioned trade mark by reason only of the registration of the first-mentioned trade mark. \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.02.2023\n15:30:55\nSignature Not Verified\n\n--- PAGE 8 ---\nNeutral Citation Number : 2023/DHC/001284 \nC.A.(COMM.IPD-TM) 113/2021  \nPage 8 of 8    \n \nclaim of user in respect of the subject mark which, in the present case, \nis “\n”.  “Since 1978” is only a part of the \ncomplete \n mark, and user, in respect of the \ncomplete mark, is claimed, by the appellant itself, since 2014. \n \n19. \nInasmuch as the appellant itself has claimed user, while \napplying for subject mark, of 2014, it cannot claim prior user over \nRakesh Jain, so as to entitle it to the benefit of Section 34 of the Trade \nMarks Act.  \n \n20. \nFor the aforesaid reasons, I do not find that a case for \ninterference with impugned order dated 27th April 2020 can be said to \nexist.  \n \n21. \nThe appeal is accordingly dismissed.  \n \n \n \nC. HARI SHANKAR, J. \n \nFEBRUARY 22, 2023 \n \ndsn \n \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.02.2023\n15:30:55\nSignature Not Verified\n"
  },
  "total_pages": 8,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "**Case Summary:** Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks (2023/DHC/001284)\n\n**Context:** High Court of Delhi at New Delhi\n\n**Parties:**\n\n* **Appellant:** Jainsons Lights Private Limited (through Mr. Vikram Grover and Mr. Harish K. Chauhan, Advs)\n* **Respondent:** The Registrar of Trade Marks (through Mr. Harish Vaidyanathan Shankar, CGSC)\n\n**Case History:**\n\n* Application No. 3487036 was filed by the appellant for registration of the mark \"Jainsons Lights Pvt Ltd\" in Class 11 on May 28, 2015.\n* The Registrar objected to the registration in the First Examination Report (FER) dated March 7, 2017, citing an earlier trade mark \"M/s JAINSONS LITES\" for similar goods and services.\n* The appellant submitted a response on May 1, 2017, claiming user of the mark since 1978 and highlighting the unique stylization and colour combination of their proposed mark.\n\n**Decision:**\n\n* Impugned order dated April 27, 2020, rejected Application No. 3487036 under Section 11(1) of the Trade Marks Act 1999 on grounds of likelihood of confusion due to similarity between the marks and goods/services covered.\n* The court refused registration, finding no substantial difference between the proposed mark and the earlier trade mark.\n\n**Outcome:**\n\n* The appellant's application for registration was hereby rejected.\n\n**Source:** Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks (2023/DHC/001284) - [PDF source attached]",
      "pdf_source": "29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "**Case Summary: Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks**\n\nFrom page 1 of the PDF file: \"29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks\" (Source: 2023/DHC/001284, C.A.(COMM.IPD-TM) 113/2021), the case involves the registration of a trade mark by an applicant named Jainsons Lights Private Limited.\n\n**Case Facts and Proceedings**\n\n* Application no. 3487036 was filed for registration of the subject mark (electric lamps, lighting apparatus, etc.) in Class 11.\n* The appellant claimed user of the subject mark since 2014.\n* The Registrar raised objections vide a First Examination Report dated March 7, 2017, citing \"M/s JAINSONS LITES\" as an earlier trade mark.\n\n**Parties Involved**\n\n* Appellant: Jainsons Lights Private Limited\n* Respondent: The Registrar of Trade Marks\n\n**Key Dates and Decision-Makers**\n\n* Case number: 113/2021 (C.A.(COMM.IPD-TM))\n* Date of judgment: Not explicitly mentioned on page 1.\n* Coram: Hon'ble Mr. Justice C. HARI SHANKAR",
          "content": "Neutral Citation Number : 2023/DHC/001284 \nC.A.(COMM.IPD-TM) 113/2021  \nPage 1 of 8    \n \n$~3(Original) \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.A.(COMM.IPD-TM) 113/2021 \n \nJAINSONS LIGHTS PRIVATE LIMITED          ..... Appellant \nThrough: \nMr. Vikram Grover and Mr. \nHarish K. Chauhan, Advs. \n \n \n \n \n \nversus \n \n \nTHE REGISTRAR OF TRADE MARKS \n      ..... Respondent \nThrough: \nMr. \nHarish \nVaidyanathan \nShankar, CGSC \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C. HARI SHANKAR \n \n \n \n     J U D G M E N T (ORAL) \n% \n \n \n \n     22.02.2023 \n \n1. \nApplication no. 3487036  was filed by the appellant before the \nTrade \nMarks \nRegistry \nfor \nregistration \nof \nthe \nMark \n (hereinafter referred to as “the subject mark”) \nin Class 11, for electric lamps, lighting apparatus and installations, \nluminaries chandeliers, lamp shades, lamps, led and fluorescent lights, \nflash lights, lanterns for lighting, lighting fittings and fixtures, \ndecorative lighting, light diffusers, ceiling light, wall lights, outdoor \nlights, water proof lights, desk lamps, floor lamps, hanging lamps, \nlighting tubes, light bulbs, security lights, garden lights, mood \nlighting, display lighting etc.  The appellant claimed user of the \nsubject mark since 2014.  \n \n2. \nThe Registrar, vide First Examination Report (FER) dated 7th \nMarch 2017, objected to the registration of the subject mark.  In the \nFER, “M/s JAINSONS LITES” was cited as an earlier trade mark, for \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.02.2023\n15:30:55\nSignature Not Verified",
          "pdf_source": "29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "**Page 2 Summary from PDF**\n\nNeutral Citation Number : 2023/DHC/001284 \nC.A.(COMM.IPD-TM) 113/2021 \n\nFrom Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks (PDF)\n\n**Key Points:**\n\n* Application No. 2242763 for registration of \"JAINSONS LIGHTS\" mark was made by Rakesh Jain in Class 11 in 2017.\n* FER objected to the registration, stating it's deceptively similar to the existing mark \"M/s JAINSONS LITES\".\n* The appellant (Jainsons Lights Pvt Ltd) claimed that their trade mark \"JAINSONS\" was adopted by their predecessor in 1978 and has been in use since.\n* The subject mark is a highly stylized representation of their company name and includes the year 1978, which reflects its adoption.\n* The firm emphasized its goodwill and reputation gained since 1978.\n\n**Dates:**\n\n* 1978: Adoption of \"JAINSONS\" trade mark by predecessor\n* May 1, 2017: Appellant's response to FER\n\n**Legal Provisions:**\n\n* Section 11(1) of the Trade Marks Act 1999 (objectionable for identical or similar marks causing confusion)\n\nSource: Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks (PDF)",
          "content": "Neutral Citation Number : 2023/DHC/001284 \nC.A.(COMM.IPD-TM) 113/2021  \nPage 2 of 8    \n \nwhich Application No. 2242763, submitted by Mr. Rakesh Jain, \nseeking registration of the mark in Class 11 in respect of “electrical \nfancy lights, electrical goods, items and instruments”, was already in \nexistence with user claim of 2005.  The FER objected to the \nregistration of the subject mark on the ground that it was deceptively \nsimilar to the earlier mark “M/s JAINSONS LITES”.  \n \n3. \nThe appellant submitted his response to the FER on 1st May \n2017. It was sought to be contended, in the response, that the trade \nmark “JAINSONS” had been adopted by the predecessor of the \nappellant in 1978 primarily in respect of lighting goods and was in use \nsince then.   The subject mark, it was submitted, was a highly stylised \nrepresentation of the predominant feature of the trade name of the \nappellant, which was Jainsons Lights Pvt. Ltd., and also included 1978 \nas representing the year of adoption of the mark “JAINSONS”. \nMoreover, it was submitted that the subject mark was in a unique \ncolour combination of teal and black, which was specifically claimed \nwhile applying for registration of the subject mark.  The reply also \nemphasised the goodwill and reputation that the appellant had gained \nsince 1978. \n \n4. \nThe impugned order dated 27th April 2020 rejected Application \nNo. 3487036 in the following terms: \n“The mark applied for registration is objectionable under following \nprovision of the Trade Marks Act, 1999-  \n \nThe mark applied for registration is identical with /similar to earlier  \ntrademarks on record, as mentioned in the Examination report and \nby similarity of marks as well as similarity of goods and services \ncovered under such marks, there exists a likelihood of confusion in \nthe mind of public. As such the registration of the mark is \nobjectionable under Section 11(1) of the Trade Marks Act 1999  \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.02.2023\n15:30:55\nSignature Not Verified",
          "pdf_source": "29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0006",
      "start_index": 3,
      "end_index": 4,
      "summary": "**Case Summary:** Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks (2023/DHC/001284)\n\n**Facts:**\n\n* Jainsons Lights Pvt Ltd (Appellant) applied to register a trade mark \"Jainsons Lights\" for electrical goods and fittings.\n* The application was opposed by The Registrar of Trade Marks (Respondent) citing an earlier registered trade mark \"M/s Jainsons Lites\" under No. 12242763.\n\n**Arguments:**\n\n* Appellant claimed user since 2014, but the Respondent argued that this was subsequent to the user claim of Rakesh Jain in respect of Mark No. 2242763 (2005).\n* The Respondent also argued that there is phonetic and conceptual similarity between the two marks, and permitting registration would result in confusion.\n\n**Decision:**\n\n* The High Court of Delhi, with Hon'ble Mr. Justice C.Hari Shankar, held that:\n\t+ The subject mark was phonetically identical to Mark No. 2242763 (\"Jainsons Lights\" vs \"M/s Jainsons Lites\").\n\t+ Registration of both marks in respect of identical goods would likely cause confusion under Section 11(1)(b) of the Trade Marks Act.\n\t+ The Appellant's user claim was subsequent to the earlier registered mark.\n\n**Relevant Sections:**\n\n* Section 11(1)(b) of the Trade Marks Act prescribes registration refusal where similarity between a new trade mark and an earlier trade mark may cause confusion on the part of the public.\n\n**Source:** 29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf",
      "pdf_source": "29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "Here is a summary of page 3 from the provided PDF:\n\n**Jainsons Lights Pvt Ltd v The Registrar of Trade Marks**\n\n**Neutral Citation Number:** 2023/DHC/001284\n**C.A.(COMM.IPD-TM) 113/2021**\n\n**Page 3 Summary:**\n\n* The respondent (Registrar of Trade Marks) argued through Advocate Harish that the cited mark and the applicant's mark are deceptively, phonetically, and conceptually similar.\n* The respondent submitted that the marks are identical in relation to goods (electric lights).\n* The user affidavit filed by the applicant has been proved since 2014, which is subsequent to the user of the cited mark in 2005.\n* Advocate Harish failed to establish the significance and uniqueness of the applicant's trade mark as \"lights\" is a common English term.\n\n**Proceedings:**\n\n* The court examined the material on record and submitted by the advocates.\n* The Senior Examiner rejected the appellant's application based on several grounds, which are mentioned in points (i) to (vi).\n\n**Source:** 29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf",
          "content": "Neutral Citation Number : 2023/DHC/001284 \nC.A.(COMM.IPD-TM) 113/2021  \nPage 3 of 8    \n \nADV. HARISH appeared and argued and submitted that, the cited \nmark is different, heard, and checked the details of application, it \nappeared that. Reply perused not satisfactory, Deceptively and \nphonetically and conceptually similar registered mark no. \n12242763 with the identical goods are on record, so it will cause \nthe confusion to the public and in the market, moreover user claim \nsince 2014, and user affidavit submitted along with the evidence in \nsupport has proved the user since 2014 which is subsequent to the \nuser of the cited mark, and adv. also fails to establish the \nsignificance and uniqueness in the adoption of the trade mark, \nsince the prefix is a common English term, as there is phonetically \nsimilarity with the cited mark, hence no difference between cited \nmark and the applicant mark, so; upon considering the material on \nrecord and submissions made by the adv. And applicant is fail to \nprove the justification for waving off obj. raised under sec. 11 trade \nMark Act 1999.” \n \n5. \nWith some effort, the court has been able to glean, from the \nimpugned order, the grounds on which the Senior Examiner has \nrejected the appellant’s application as \n(i) \nphonetic similarity between the subject mark and Mark \nNo. 2242763, \n(ii) \nconceptual similarity between the subject mark and Mark \nNo. 2242763, \n(iii) \nthe fact that both marks were claimed in respect of \nidentical goods/services.  \n(iv) \nthe possibility, therefore, of confusion to the public were \nboth marks to be registered, \n(v) \nthe user claim of the appellant, of 2014, being subsequent \nto user claim of Mr. Rakesh Jain in respect of Mark No. \n2242763, which was 2005, and \n(vi) \nlack of significance and uniqueness in the subject mark, \nas “lights” was a common English term. \n \n6. \nOf these findings, no cavil, in the opinion of the court, can be \ntaken with the findings no. (i), (iii), (iv) and (v). \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.02.2023\n15:30:55\nSignature Not Verified",
          "pdf_source": "29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "**High Court of Delhi Case No. 2023/DHC/001284**\n\n**Case Summary (Page 4)**\n\n* The court agrees with the Senior Examiner's observation that the subject mark \"Jainsons Lights\" is phonetically identical to the earlier mark \"M/s Jainsons Lites\" (2242763).\n* Registration of both marks may lead to confusion among consumers, as they cover similar goods and services.\n* Section 11(1)(b) of the Trade Marks Act prohibits registration if a likelihood of confusion exists due to similarity in marks and identical or similar goods/services.\n\n**Key Points**\n\n* The Senior Examiner's findings are upheld by the court.\n* Similarity in marks (\"Jainsons Lights\" and \"M/s Jainsons Lites\") may lead to consumer confusion.\n* Registration would require separate analysis under Section 12 of the Trade Marks Act (not provided on this page).\n\n**Source:** Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks [2023/DHC/001284] (delivered Feb 23, 2023)\n\nNote: This summary focuses on the key points from Page 4 and is within the 200-word limit.",
          "content": "Neutral Citation Number : 2023/DHC/001284 \nC.A.(COMM.IPD-TM) 113/2021  \nPage 4 of 8    \n \n \n7. \nThe court is in agreement with the Senior Examiner in her \nobservation that  \n(i)  \nthe subject mark was phonetically identical to Mark No. \n2242763 as the subject mark was “Jainsons Lights” and Mark \nNo. 2242763 was “M/s Jainsons Lites”,  \n(ii)  \nthe registration of the marks were sought in respect of \nidentical goods, i.e. electrical lamps, lights, electrical goods and \nfittings etc. and   \n(iii)  the claim of user, by the appellant, was subsequent to the \nclaim of user of Rakesh Jain in respect of Mark no. 2242763. \n \n8. \nThe court is also in agreement with the finding of the Senior \nExaminer that permitting registration of both the marks is likely to \nresult in confusion. Section 11(1)(b)1 of the Trade Marks Act \nproscribes registration of a trade mark if, owing to its similarity to an \nearlier trade mark, and the identity of similarity of the goods or \nservices covered by the two marks, a likelihood of confusion on the \npart of the public can be said to exist.   \n \n9. \nThere can be no gainsaying the fact that the mark “Jainsons \nLights” is similar to the mark “Jainsons Lites”. Both marks were used \nin respect of similar goods and services.  \n \n                                          \n1 11.  \nRelative grounds for refusal of registration. –  \n(1)  \nSave as provided in Section 12, a trade mark shall not be registered if, because of –  \n(a)  \nits identity with an earlier trade mark and similarity of goods or services \ncovered by the trade mark; or \n(b)  \nits similarity to an earlier trade mark and the identity or similarity of the goods \nor services covered by the trade mark, \nthere exists a likelihood of confusion on the part of the public, which includes the likelihood of association \nwith the earlier trade mark. \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.02.2023\n15:30:55\nSignature Not Verified",
          "pdf_source": "29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0009",
      "start_index": 5,
      "end_index": 6,
      "summary": "**Legal Document Summary**\n\nSource: Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks (2023/DHC/001284)\n\n**Case Background**: A trade mark dispute between Jainsons Lights Pvt Ltd (Appellant) and The Registrar of Trade Marks (Respondent).\n\n**Facts and Arguments**:\n\n* The Appellant sought to register the trade mark \"Jainsons Lights\" for identical goods, while there was an existing registration of the mark \"Jainsons Lites\".\n* The Senior Examiner rejected the application, citing a likelihood of confusion between the two marks.\n* The Appellant argued that the stylized nature and inclusion of \"since 1978\" in their mark distinguished it from \"Jainsons Lites\".\n\n**Court's Decision**:\n\n* The Court held that the dominant impression of the average customer would be \"JAINSONS LIGHTS\", rather than \"since 1978\".\n* The Court agreed with the Senior Examiner that the inclusion of ordinary English words like \"lights\" and the mere use of \"M/s\" in Mark No. 2242763 do not mitigate confusion.\n* The dominant part of both marks, \"JAINSONS\", is identical, exacerbating the chance of confusion.\n* The Appellant's arguments under Sections 122 and 343 of the Trade Marks Act were not convincing.\n\n**Parties and Dates**: \n\n* Jainsons Lights Pvt Ltd (Appellant)\n* The Registrar of Trade Marks (Respondent)\n* Date: Not explicitly stated\n* Neutral Citation Number: 2023/DHC/001284\n\n**Note**: This summary is based on a PDF source, and the court's decision may not be comprehensive or final.",
      "pdf_source": "29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 5",
          "node_id": "0007",
          "start_index": 5,
          "end_index": 5,
          "summary": "**Case Summary**\n\nSource: Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks (2023/DHC/001284)\n\n**Key Points:**\n\n* The appeal is C.A.(COMM.IPD-TM) 113/2021.\n* The Senior Examiner found that the subject mark \"Jainsons Lights\" and the earlier mark \"Jainsons Lites\" were likely to cause confusion among the public.\n* However, Mr. Grover argues that the subject mark is stylized and that the inclusion of \"since 1978\" in the subject mark indicates a longer history of use.\n\n**Proceedings:**\n\n* On page 5, the court considers whether the likelihood of confusion should be examined from the perspective of an average customer with imperfect recollection.\n* The court finds that such a customer may not notice the difference between \"Lites\" and \"Lights\", or the changes in the mark over time.\n\n**Law and Reasoning:**\n\n* The test for likelihood of confusion is applied from the perspective of the public.\n* Confusion among an average customer with imperfect recollection can justify a finding of confusion.\n\n\n PDF Source: Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks (2023/DHC/001284)",
          "content": "Neutral Citation Number : 2023/DHC/001284 \nC.A.(COMM.IPD-TM) 113/2021  \nPage 5 of 8    \n \n10. \nMr. Grover has sought to contend that the Senior Examiner as \nerred to note (i) the unique stylised nature of the subject mark, which \ndistinguished it from the “Jainsons Lites” mark of Rakesh Jain and (ii) \nthe inclusion, in the subject mark, of the phrase “since 1978” which \nwas essentially intended to indicate tht the mark “Jainsons”, which \nwas the prominent part of the subject mark, had been in use since \n1978. \n \n11. \nAs already noted, the aspect of likelihood of confusion, for the \npurposes of Section 11(1)(b) has to be examined from the point of \nview of “the public”, as the clause refers to “likelihood of  confusion \non the part of the public”.  Insofar as the aspect of confusion, in the \nmatter of trade marks is concerned, it is settled that the test has to \napply from the point of view of a customer of average intelligence and \nimperfect recollection. Viewed from the perspective of such a \ncustomer, the court cannot characterise the finding, of the Senior \nExaminer, that there is a likelihood of confusion between the subject \nmark “Jainsons Lights” and the earlier mark “Jainsons Lites” as \narbitrary, or otherwise deserving of interference in appeal, especially \nas both the marks were being used in respect of identical goods. The \nunwary customer of average intelligence and imperfect recollection \ncannot be attributed the perspicacity to be able to recollect that, in one \ncase, “lights” was spelt “Lites” and, in the other, “Lights”.  Nor can \nthe mere inclusion, in the subject mark, of the words “since 1978”, or \nof the word “M/s” in Mark No. 2242763, be regarded as factors which \nwould mitigate the possibility of such confusion arising in the minds \nof the customer of average intelligence and imperfect recollection as \nthese are elements of a mark which may change from time to time.   \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.02.2023\n15:30:55\nSignature Not Verified",
          "pdf_source": "29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "**Summary of Page 6 from Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks (2023/DHC/001284)**\n\nThis page is part of a court case in the High Court of Delhi at New Delhi, India. Here are the key points:\n\n* The dominant impression an average customer gets from the mark \"JAINSONS LIGHTS\" is of the company name itself (\"JAINSONS LIGHTS\"), rather than its founding year (\"since 1978\").\n* An ordinary English word like \"lights\" (or \"lites\") is not distinctive, and its presence in a trademark does not make it unique.\n* The Senior Examiner's observation that the dominant part of both marks (\"JAINSONS\") is identical, making confusion more likely.\n* Counsel Mr. Grover argued Sections 122 and 343 of the Trade Marks Act, but specific details about his arguments are not provided on this page.\n\n**Reference:** Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks (2023/DHC/001284) [PDF]",
          "content": "Neutral Citation Number : 2023/DHC/001284 \nC.A.(COMM.IPD-TM) 113/2021  \nPage 6 of 8    \n \n12. \nBesides, in the \n, the dominant impression \nthat the average customer, who views the mark without prior \nfamiliarity with it, would carry with him, is of “JAINSONS \nLIGHTS”, rather than of “since 1978”.  An average consumer, \nrealistically speaking, would identify the appellant from its name \n“JAINSONS LIGHTS”, rather than from the year from which it had \nstarted using the mark “JAINSONS”.  This reality is apparent from the \nmark itself, in which the “since 1978” slogan is in disproportionately \nsmall letters, as compared to “JAINSONS LIGHTS”.  If the mythical \ncustomer of imperfect recollection were to to be asked to recollect the \nmark, he would recollect it as “JAINSONS LIGHTS”, not as \n“JAINSONS LIGHTS SINCE 1978”.  Equally, he would recollect \nMark No. 2242763 as “JAINSONS LITES”, not as “M/s JAINSONS \nLITES”.   \n \n13. \nThe Senior Examiner is also correct in her observation that \n“lights” – whether spelt “lights” or “lites” – is an ordinary English \nword.  Perhaps it would be more appropriate to hold that the dominant \npart, whether of “JAINSONS LIGHTS” or “JAINSONS LITES”, is \n“JAINSONS”.  That dominant part, in the two marks, is identical, \nthereby exacerbating the chance of confusion.  \n \n14. \n Mr. Grover has also sought to press into service Sections 122 \nand 343 of the Trade Marks Act.  \n                                          \n2 12.  \nRegistration in the case of honest concurrent use, etc. – In the case of honest concurrent use or \nof other special circumstances which in the opinion of the Registrar, make it proper so to do, he may permit \nthe registration by more than one proprietor of the trade marks which are identical or similar (whether any \nsuch trade mark is already registered or not) in respect of the same or similar goods or services, subject to \nsuch conditions and limitations, if any, as the Registrar may think fit to impose. \n3 34.  \nSaving for vested rights. – Nothing in this Act shall entitle the proprietor or a registered user of \nregistered trade mark to interfere with or restrain the use by any person of a trade mark identical with or \nnearly resembling it in relation to goods or services in relation to which that person or a predecessor in title of \nhis has continuously used that trade mark from a date prior –  \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.02.2023\n15:30:55\nSignature Not Verified",
          "pdf_source": "29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0012",
      "start_index": 7,
      "end_index": 8,
      "summary": "**Court Decision:** JAINSONS LIGHTS PRIVATE LIMITED v. THE REGISTRAR OF TRADE MARKS (2023/DHC/001284)\n\n**Context:** This is a High Court of Delhi at New Delhi judgment in an appeal case, C.A.(COMM.IPD-TM) 113/2021.\n\n**Facts:**\n\n* Jainsons Lights Private Limited (Appellant) claimed trademark registration for the mark \"& Jainsons\" since 1978.\n* The Registrar of Trade Marks (Respondent) refused the application as it was identical to an earlier registered trade mark (& Rakesh Jain).\n\n**Arguments:**\n\n* Appellant's counsel Mr. Grover argued that Section 12 and Section 34 of the Trade Marks Act exempted concurrent use or prior user in special circumstances.\n* Respondent's counsel Mr. Vaidyanathan Shankar argued that Appellant's claim of user since 1978 was irrelevant as their application for the subject mark was only from 2014.\n\n**Decisions:**\n\n* The Hon'ble Mr. Justice C. Hari Shankar found that Appellant's defence under Section 34 of the Trade Marks Act failed as:\n\t+ The Appellant claimed user of the subject mark since 2014, which is later than Rakesh Jain's claim of user in 2005.\n\t+ Section 34 requires priority in point of time in both registration and use for identical goods or services, which Appellant does not possess.\n\n**Ruling:**\n\n* The appeal was dismissed due to the lack of a valid defence under Section 34 of the Trade Marks Act.\n* This decision upholds the impugned order dated April 27, 2020.\n\nSource: Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks (2023/DHC/001284) [PDF]",
      "pdf_source": "29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 7",
          "node_id": "0010",
          "start_index": 7,
          "end_index": 7,
          "summary": "Here is a summary of page 7 from the provided PDF:\n\n**Case:** Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks (2023/DHC/001284 & C.A.(COMM.IPD-TM) 113/2021)\n\n**Points discussed:**\n\n* Section 12 of the Trade Marks Act permits the Registrar to register a mark similar to an earlier trade mark in specific circumstances, including \"honest concurrent use\" or \"other special circumstances\".\n* The appellant (Jainsons Lights Pvt Ltd) argues that this provision applies because its client has been using the Jainsons mark since 1978.\n* However, Section 34 of the Trade Marks Act takes precedence in cases where user priority is concerned. This section allows registration if the prior user proves their mark was used before both registration and the other party's use.\n\n**Key points:**\n\n* The court finds that the appellant's claim of user (2014) is later than Rakesh Jain's claimed date of use (2005).\n* Section 34 applies, requiring proof of prior user to register.\n* The 1978 start date of mark usage by the appellant's client does not affect this outcome.\n\n**Reference:** Source: [29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf](file/url).",
          "content": "Neutral Citation Number : 2023/DHC/001284 \nC.A.(COMM.IPD-TM) 113/2021  \nPage 7 of 8    \n \n15. \nI am, unfortunately, unable to accept his submission that either \nof these provisions would serve to vitiate the impugned order.  Section \n12 permits the Registrar, in an appropriate case, to allow registration \nof a mark which is identical, or similar to an earlier trade mark, where \nthe case is one of “honest concurrent use”, or where there are “other \nspecial circumstances”.  \n \n16. \nMr. Grover seeks to submit that the present case has to be \nregarded as one involving “other special circumstances”, the “special \ncircumstance” being that the “Jainsons” mark had been in use by his \nclient since 1978.  For this purpose, Mr. Grover seeks to submit that \nSection 12 may be read in conjunction with Section 34 of the Trade \nMarks Act.    \n \n17. \nSection 34 of the Trade Marks Act allows the Registrar to \nregister a trade mark which is identical with or nearly resembling an \nearlier trade mark, in respect of identical goods or services, provided \nthe user of the former is prior in point of time both to registration and \nuser of the latter.  \n \n18. \nThis defence obviously, cannot come to the aid of the appellant, \nas the claim of user of the appellant, in respect of the subject trade \nmark, is of 2014, whereas the user claim of Rakesh Jain in respect of \nMark No. 2242763 is of 2005.  Though Mr Grover emphasizes that \nthe mark “JAINSONS” was being used since 1978, that is irrelevant.  \nThe court, while applying Section 34, has to take into account the \n                                                                                                                   \n(a)  \nto the use of the first-mentioned trade mark in relation to those goods or services be the \nproprietor or a predecessor in title of his; or \n(b)  \nto the date of registration of the first-mentioned trade mark in respect of those goods or \nservices in the name of the proprietor of a predecessor in title of his; \nwhichever is the earlier, and the Registrar shall not refuse (on such use being proved) to register the second \nmentioned trade mark by reason only of the registration of the first-mentioned trade mark. \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.02.2023\n15:30:55\nSignature Not Verified",
          "pdf_source": "29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 8",
          "node_id": "0011",
          "start_index": 8,
          "end_index": 8,
          "summary": "Here is a summary of page 8 from the PDF:\n\nOn page 8 of the PDF \"29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf\", the court addresses the following points:\n\n* **User claim**: The appellant (Jainsons Lights Private Limited) has claimed user of the complete mark since 2014, not just a part of it.\n* **Prior user**: The court states that the appellant cannot claim prior user over Rakesh Jain to entitle it to the benefit of Section 34 of the Trade Marks Act.\n* **Interference with impugned order**: The court finds no case for interference with the impugned order dated April 27, 2020.\n* **Dismissal of appeal**: The appeal is dismissed.\n\nKey points:\n\n* Appellant's claim of user since 2014\n* Prior user issue\n* No interference with impugned order\n* Appeal dismissed\n\nSource: PDF \"29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf\" (Neutral Citation Number : 2023/DHC/001284, C.A.(COMM.IPD-TM) 113/2021).",
          "content": "Neutral Citation Number : 2023/DHC/001284 \nC.A.(COMM.IPD-TM) 113/2021  \nPage 8 of 8    \n \nclaim of user in respect of the subject mark which, in the present case, \nis “\n”.  “Since 1978” is only a part of the \ncomplete \n mark, and user, in respect of the \ncomplete mark, is claimed, by the appellant itself, since 2014. \n \n19. \nInasmuch as the appellant itself has claimed user, while \napplying for subject mark, of 2014, it cannot claim prior user over \nRakesh Jain, so as to entitle it to the benefit of Section 34 of the Trade \nMarks Act.  \n \n20. \nFor the aforesaid reasons, I do not find that a case for \ninterference with impugned order dated 27th April 2020 can be said to \nexist.  \n \n21. \nThe appeal is accordingly dismissed.  \n \n \n \nC. HARI SHANKAR, J. \n \nFEBRUARY 22, 2023 \n \ndsn \n \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.02.2023\n15:30:55\nSignature Not Verified",
          "pdf_source": "29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-16T12:16:45.178114",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}