{
  "doc_name": "3. LOREAL INDIA PVT. LTD vs Kumar",
  "pdf_source": "3. LOREAL INDIA PVT. LTD vs Kumar.pdf",
  "metadata": {
    "document_name": "3. LOREAL INDIA PVT. LTD vs Kumar",
    "source_pdf": "3. LOREAL INDIA PVT. LTD vs Kumar.pdf",
    "judges": [
      "AMIT BANSAL"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "C.O. (COMM.IPD-TM) 497/2022",
      "IN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI"
    ],
    "dhc_numbers": [],
    "ia_numbers": [],
    "decision_date": "27 February, 2023",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      {
        "name": "LOREAL INDIA PVT. LTD.",
        "advocates": [
          "S.K. Bansal",
          "Ajay Amitabh Suman"
        ]
      }
    ],
    "defendants": [
      {
        "name": "RAJESH KUMAR TANEJA TRADING AS INNOVATIVE DERMA CARE AND ANR",
        "advocates": [
          {
            "name": "Pramod Kumar Singh"
          },
          {
            "name": "Priya Nagpal"
          }
        ],
        "associates": [
          "Harish Vaidyanathan Shankar",
          "Srish Kumar Mishra",
          "Sagar Mehlawat",
          "Alexander Mathai Paikaday"
        ]
      }
    ],
    "appellants": [],
    "respondents": [
      {
        "name": "RAJESH KUMAR TANEJA TRADING AS INNOVATIVE DERMA CARE AND ANR",
        "advocates": [
          {
            "name": "Pramod Kumar Singh"
          },
          {
            "name": "Priya Nagpal"
          }
        ],
        "associates": [
          "Harish Vaidyanathan Shankar",
          "Srish Kumar Mishra",
          "Sagar Mehlawat",
          "Alexander Mathai Paikaday"
        ]
      }
    ],
    "plaintiff_advocates": [
      "S.K. Bansal",
      "Ajay Amitabh Suman"
    ],
    "defendant_advocates": [
      "Pramod Kumar Singh",
      "Priya Nagpal",
      "Harish Vaidyanathan Shankar",
      "Srish Kumar Mishra",
      "Sagar Mehlawat",
      "Alexander Mathai Paikaday"
    ],
    "appellant_advocates": [],
    "respondent_advocates": [
      "Pramod Kumar Singh",
      "Priya Nagpal",
      "Harish Vaidyanathan Shankar",
      "Srish Kumar Mishra",
      "Sagar Mehlawat",
      "Alexander Mathai Paikaday"
    ],
    "damages_claimed": null,
    "damages_awarded": null,
    "key_issues": [
      "Here are the key legal issues:",
      "• Prior user vs registered trademark owner: Whether the petitioner's prior use of \"Clari\" formative marks prior to the respondent's registration date affects the respondent's right to register the mark \"CLARIWASH\".",
      "• Simultaneous use and concurrent user: Whether the respondents can claim concurrent user under Section 12 of the Trademarks Act, given that their trademark application was filed after they started using the mark.",
      "• Inconsistencies in Examination Report: Whether the Registry's issuance of a Certificate of Registration with incorrect information (\"CHARIWASH\" instead of \"CLARIWASH\") affects the validity of the respondent's registration.",
      "• Deed of Assignment and Transfer Agreement: Whether the petitioner acquired all rights, including reputation and goodwill, to the \"Clari\" formative marks from Cheryl's Cosmeceuticals.",
      "• Trademark infringement claims: Whether the respondent's use of \"CLARIWASH\" constitutes trademark infringement against the petitioner's existing trademarks.",
      "• Burden of proof in cancellation proceedings: Who bears the burden of proof in these proceedings, and whether the petitioner has met its burden to show that the respondent's registration should be cancelled."
    ],
    "decision_summary": "**Case Summary: LOREAL INDIA PVT. LTD. vs RAJESH KUMAR TANEJA TRADING AND ANOTHER**\n\n**Background:**\nThe present case is a cancellation petition filed by L'Oreal India Pvt. Ltd. (petitioner) seeking removal of the registered trademark \"CLARIWASH\" ( respondent no.1's mark) from the Register of Trademarks.\n\n**Case Set-up by Petitioner:**\n\n* The petitioner is the proprietor of various trademarks with the word \"Clari\".\n* The \"CLARIWASH\" mark was adopted in 2010 by a predecessor company, Cheryl's Cosmeceuticals Pvt. Ltd., which was acquired by the petitioner in 2013.\n* The petitioner has been using the \"Clari\" formative marks since 2009.\n* Respondent no.1 applied for registration of \"CLARIWASH\" on April 16, 2010, but the first invoice submitted is dated May 10, 2010, which is after the registration of the \"Clari\" formative marks.\n\n**Case Set-up by Respondent:**\n\n* Respondent no.1 has filed a suit for infringement against the petitioner in the District Courts, Tis Hazari.\n* Respondent no.1 claims that the Examination Report issued on January 3, 2012, was incorrect and notes the mark as \"CHARIWASH\" instead of \"CLARIWASH\".\n* Respondent no.1 argues that the Certificate of Registration was modified to reflect the correct mark.\n\n**Legal Issues:**\n\n* The main issue in this case is whether the respondent no.1's registration of \"CLARIWASH\" should be cancelled due to prior user rights of the petitioner.\n* Another issue is whether the Examination Report issued by the Registrar of Trade Marks was incorrect and resulted in an improper modification of the Certificate of Registration.\n\n**Arguments:**\n\n* Petitioner argues that they have used the \"Clari\" formative marks since 2009, and respondent no.1's registration should be cancelled due to prior user rights.\n* Respondent no.1 argues that their suit for infringement is pending before the District Courts, Tis Hazari, and that the Examination Report issued by the Registrar of Trade Marks was incorrect.\n\n**Court Findings:**\n\n* The court held that the respondent no.1's registration should not be cancelled due to prior user rights.\n* However, the court also found that the modification of the Certificate of Registration from \"CHARIWASH\" to \"CLARIWASH\" without a fresh examination was an error and in contravention of Section 32(3) of the Trademarks Act.\n\n**Decision:**\n\n* The court refused to cancel respondent no.1's registration of \"CLARIWASH\", but ordered that the modification of the Certificate of Registration be rectified by issuing a Fresh Examination Report.\n\nIn conclusion, the court held in favor of the respondent no.1 and refused to grant cancellation of the trademark \"CLARIWASH\" due to prior user rights. However, it also found that the modification of the Certificate of Registration was an error and ordered that a fresh examination be conducted.",
    "legal_precedents": [
      "AIR 1960 SC 142"
    ],
    "full_text": "\n--- PAGE 1 ---\n2023:DHC:2089 \n \nC.O. (COMM.IPD-TM) 497/2022 \n                                          \n \n      Page 1 of 10 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n \n% \n \n \nJudgment Reserved on:  27th February, 2023  \nJudgment Delivered on: 23rd March, 2023  \n \n+  \n \n \nC.O. (COMM.IPD-TM) 497/2022 \n \nLOREAL INDIA PVT. LTD.  \n \n       \n  ..... Petitioner \nThrough: \nMr. \nS.K. \nBansal \nand \nMr.Ajay \nAmitabh Suman, Advocates \n \n \n \n \nversus \n \nRAJESH KUMAR TANEJA TRADING  \nAS INNOVATIVE DERMA CARE AND ANR \n...... Respondents \nThrough: \nMr. Pramod Kumar Singh and \nMs. Priya Nagpal, Advocates for R-1. \n \nMr. Harish Vaidyanathan Shankar, \nCGSC with Mr. Srish Kumar Mishra, \nMr. \nSagar \nMehlawat \nand \nMr.Alexander \nMathai \nPaikaday, \nAdvocates for R-2. \n \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nJUDGMENT \n1. \nThe present cancellation petition has been filed on behalf of the \npetitioner seeking removal of impugned trademark „CLARIWASH‟ \nregistered under No.1950938 in Class 03 in the name of the respondent no.1 \nfrom the Register of Trademarks. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.03.2023 17:39:04\nSignature Not Verified\n\n--- PAGE 2 ---\n2023:DHC:2089 \n \nC.O. (COMM.IPD-TM) 497/2022 \n                                          \n \n      Page 2 of 10 \n \nCASE SET UP BY THE PETITIONER \n2. \nThe case set up in the petition is as under: \n2.1. The petitioner is the registered proprietor of various trademarks with \nthe word “Clari”, details of which are given in paragraph 4 of the \npetition. The petitioner is engaged in the business of manufacture and \nsale of a wide range of hair care, skin care, toiletries and beauty \nproducts.  \n2.2. The “CLARIWASH” mark was adopted in 2010 by the petitioner and \nhas been used along with the other “Clari” formative marks. \n2.3. The first of the “Clari” formative marks were adopted by a company \nby the name of Cheryl‟s Cosmeceuticals Pvt. Ltd. [hereinafter \n“Cheryl‟s Cosmeceuticals”] in 2009. The petitioner acquired Cheryl‟s \nCosmeceuticals in 2013 by way of a Deed of Assignment and Asset \nTransfer Agreement.  \n2.4. By virtue of the said Deed of Assignment and Transfer Agreement, \nthe reputation and goodwill related to various “Clari” formative marks \nstood transferred to the petitioner. \n2.5. The petitioner is the prior user of the “Clari” formative marks from \nthe year 2009 on account of the user of his predecessor. \n2.6. The respondent no.1 applied for registration of the trademark \n“CLARIWASH” in Class 03 on 16th April, 2010 showing user from \n16th November, 2009. However, the first invoice filed on behalf of the \nrespondent no.1 is dated 10th May, 2010, which is after the \nregistration of the “Clari” formative marks. On the other hand, the \nregistration granted in favour of the petitioner in respect of trademark \n“CLARI-FI” is of 3rd February, 2010 with user from 1st April, 2009. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.03.2023 17:39:04\nSignature Not Verified\n\n--- PAGE 3 ---\n2023:DHC:2089 \n \nC.O. (COMM.IPD-TM) 497/2022 \n                                          \n \n      Page 3 of 10 \n \n2.7. It is further submitted that the respondent no.1 cannot claim the \nbenefit of concurrent user under Section 12 of the Trademarks Act as \nthere was no use by the respondent no.1 at the time of the trademark \napplication. The trademark application was filed on 16th April, 2010 \nand the earliest invoice filed on behalf of the respondents is of 10th \nMay, 2010. \n2.8. The Examination Report dated 3rd January, 2012 issued by the \nRegistrar of Trade Marks wrongly notes the mark of the respondent \nno.1 as “CHARIWASH” instead of “CLARIWASH”. Based on the \naforesaid Examination Report, the Certificate of Registration of Trade \nMark was issued in favour of the respondent no.1 for the word mark \n“CHARIWASH”. However, subsequently, the Certificate was \nmodified by the Registry to “CLARIWASH”. \n2.9. The procedure adopted by the Registry in changing the Registration \nCertificate of word mark from “CHARIWASH” to “CLARIWASH” \nwas an erroneous. Having discovered the error, the Registry should \nhave \nproceeded \nfor \na \nfresh \nexamination \nfor \nthe \nmark \n“CLARIWASH”. Reliance in this regard is placed on the orders of the \nIntellectual Property Appellate Board (IPAB) in Vans Inc. USA v. \nFateh Chand Bhansali and Anr., 2020 SCC OnLine IPAB 44 and \nPrajapati Constructions Ltd. v.  Manoj Ramanand Prajapati and \nAnr., 2018 SCC OnLine IPAB 313. \nCASE SET UP BY THE RESPONDENT \n3. \nThe case set up by the respondent no.1 is as under: \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.03.2023 17:39:04\nSignature Not Verified\n\n--- PAGE 4 ---\n2023:DHC:2089 \n \nC.O. (COMM.IPD-TM) 497/2022 \n                                          \n \n      Page 4 of 10 \n \n3.1. The respondent no.1 has filed a suit for infringement of the registered \ntrademark “CLARIWASH” of the respondent no.1 against the \npetitioner, which is pending before the District Courts, Tis Hazari. \n3.2. Even though the Examination Report was in respect of the mark \n“CHARIWASH”, the Trademark Journal correctly published the \nmark “CLARIWASH” and not “CHARIWASH”. In May, 2012, the \nTrademark Registry erroneously issued Trademark Registration \nCertificate for the word mark “CHARIWASH”. The respondent no.1 \nimmediately filed an application to rectify the said clerical error and \naccordingly, the Trademark Registry rectified the error and issued a \nfresh Trademark Registration Certificate for the correct word mark \n“CLARIWASH”. Reliance is placed on the judgment of a Coordinate \nBench in Epsilon Publishing House Pvt. Ltd. v. Union of India and \nOrs., 2009 SCC OnLine Del 3922.  \n3.3. Though the petitioner claims adoption of the mark “CLARIWASH” \nin the year 2010, nothing has been filed in support of the same. \nFurther, the petitioner has not filed any application for registration of \nthe mark “CLARIWASH” till date. \n3.4. Use of the mark “CLARIWASH” by the petitioner or its predecessor \nwas only in the year 2013. Attention of the Court in this regard is \ndrawn to the invoices filed on behalf petitioner. \n3.5. The petitioner uses several other marks other than the “Clari” \nformative marks. Therefore, it cannot be said that “Clari” belongs to a \nfamily of marks. \n3.6. The petitioner cannot claim any monopoly on a part of the trademark \n“Clari”. The fact that the petitioner has various marks registered with \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.03.2023 17:39:04\nSignature Not Verified\n\n--- PAGE 5 ---\n2023:DHC:2089 \n \nC.O. (COMM.IPD-TM) 497/2022 \n                                          \n \n      Page 5 of 10 \n \nthe prefix “Clari” does not mean that the registration granted in favour \nof the respondent no.1 for the mark “CLARIWASH” is defective. \nThere are a number of trademarks registered where the word “Clari” \nhas been used as a prefix or suffix.  \n3.7. The petitioner was aware of the respondent‟s use of the trademark \n“CLARIWASH”, yet never applied for its trademark registration. \n4. \nDespite opportunity being granted, the respondent no.2 has not filed \nany reply/counter statement or written submissions in the present petition. \nANALYSIS AND FINDINGS \n5. \nI have heard the counsels for the parties. \n6. \nIn the present case, it appears from the record that the Trademarks \nRegistry erroneously issued the Examination Report for the mark \n“CHARIWASH” instead of “CLARIWASH”. Yet again, the Registry issued \na Trademark Registration Certificate in favour of the respondent, wherein \nthe mark of the respondent was wrongly shown as “CHARIWASH”. \nImmediately thereafter, an application was filed on behalf of the respondents \non 14th June, 2012, requesting for rectification of the clerical error and the \nsame was allowed by the Registry and a correct Trademark Registration \nCertificate was issued in favour of the respondent for the mark \n“CLARIWASH”. However, it is pertinent to note that the mark of the \nrespondent no.1 was published correctly as “CLARIWASH” in the \nTrademark Journal No.1519 on 16th January, 2012.  Therefore, it was open \nfor the petitioner or its predecessor to oppose the said application, which \nthey failed to do. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.03.2023 17:39:04\nSignature Not Verified\n\n--- PAGE 6 ---\n2023:DHC:2089 \n \nC.O. (COMM.IPD-TM) 497/2022 \n                                          \n \n      Page 6 of 10 \n \n7. \nIf the Registrar has committed an error and issued a faulty \nexamination report, the respondent no.1 cannot be faulted for the same.  It is \nnot that the respondent no.1 had misrepresented or misled the trademark \nRegistry into issuing a faulty examination report.  The registration of a \ntrademark entails valuable rights and the respondent no.1 cannot be deprived \nof the same on account of mistake committed by the Registry. Therefore, \nthis by itself cannot be the ground for removal of the registration granted in \nfavour of the respondent no.1. \n8. \nIn Epsilon Publishing (supra), a Coordinate Bench of this Court was \nseized of a petition challenging the order of the Registrar renewing the \ntrademark granted in favour of the respondent therein.  The ground taken by \nthe petitioner was that since the respondent had not filed an application for \nrenewal of the registration before its expiration and not paid the surcharge, \nthe Registrar was required to remove the trademark from the Register.  \nWhile noting that the Trade Marks Registry has not adhered to the statutory \ntimelines, it was held that the respondent cannot be penalized for the same \nand would be entitled to pursue its renewal application.  In the said case, the \nRegistrar had admitted that the renewal application filed on behalf of the \nprivate respondent was not examined and therefore, could not be processed \nfurther.  It was observed that the private respondent could not be deprived of \nits rights on account of the fault of the Registrar. The relevant observations \nof the court as set out in paragraph 26 are reproduced below: \n“26. \nThere may be merit in the contention that the Registrar \nhas to follow the procedure as prescribed; however, the essential \nquestion is not whether the Registrar has any discretion in the \nmatter, but, what are the consequences of the Registrar not \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.03.2023 17:39:04\nSignature Not Verified\n\n--- PAGE 7 ---\n2023:DHC:2089 \n \nC.O. (COMM.IPD-TM) 497/2022 \n                                          \n \n      Page 7 of 10 \n \nfollowing the established procedure? Plainly, in the facts of the \npresent case, it is apparent that the Trademark Registry has not \nadhered to the timelines as required. Surely, respondent no.3 \ncannot be penalised for the same and would be entitled to purse its \napplication for renewal of its trademark. The same was filed well \nwithin the period of six months and even though the same was not \naccompanied by a fee of surcharge, nonetheless, respondent no.3 \nhad the right to know the fate of its application. Since no \ndeficiency was pointed out at the material time, respondent no.3 \ncannot be deprived of its valuable rights to cure the defects within \nthe prescribed period. The Registrar also did not advertise the \nremoval of the trademark as required under section 25(4) of the \nAct read with Rule 66 of the 2002 Rules. Such advertisement \nwould have provided another opportunity for the petitioner to seek \nrestoration of the trademark.” \n9. \nThe dicta of the aforesaid judgment is squarely applicable to the \npresent case. The respondent no.1 cannot be deprived of his valuable rights \nof registration on account of the error of the Registry. \n10. \nCounsel for the petitioner has relied upon the orders passed by the \nIPAB in Prajapati Constructions (supra) and Vans Inc. USA (supra) in \nsupport of his submission that the Registrar of Trade Marks has to follow \nthe statutory procedure prescribed under the Trade Marks Act, 1999 in \nrespect of examination of a trade mark application. At the outset, it may be \nnoted that both are interim orders passed by the IPAB and therefore, no \nreliance can be placed on the same in the present case, which is at the stage \nof final hearing. After noticing the various procedural lapses committed by \nthe Trademark Registry, the IPAB only ordered that the respondent therein \nshall not rely upon the impugned registration in any proceedings during the \npendency of the rectification proceedings.  There was no order for removal \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.03.2023 17:39:04\nSignature Not Verified\n\n--- PAGE 8 ---\n2023:DHC:2089 \n \nC.O. (COMM.IPD-TM) 497/2022 \n                                          \n \n      Page 8 of 10 \n \nof the registration granted in favour of the respondent on account of lapses \ncommitted by the Registry.  \n11. \nReliance has also been placed on the order passed by the IPAB in \nJahangir Biri Factory Pvt. Ltd. v. Mohd. Dildar Hossain (Proporietor) & \nAnr., 2018 (76) PTC 479 [IPAB]. In the aforesaid order, the marks of the \npetitioner and the respondent were identical, namely, “HOWRAH BIDI”. \nThe respondent therein had merely added a number to the mark “HOWRAH \nBIDI”, which is not the position in the present case. Therefore, the said \njudgment does not further the case of the petitioner. \n12. \nCounsel for the petitioner also submitted that the matter be remanded \nback to the Registry for reconsideration of the trademark application of the \nrespondent no.1 from the stage of issuance of examination report. I am not \ninclined to remand back the matter as this would amount to cancellation of \nthe registration already granted in favour of the respondent no.1 as far back \nas in 2012. Therefore, I proceed to consider the matter on merits, i.e., \nwhether the registration in favour of the respondent no.1 was granted \nerroneously. \n13. \nAt the time when the respondent no.1 filed its application for \nregistration of the mark “CLARIWASH” in 2010, there was one mark of the \npredecessor of the petitioner, “CLARI-FI”, that was registered in Class 03. \nAll other marks of the petitioner with the term “Clari” have been registered \nsubsequent to the registration of the respondent no.1. The petitioner acquired \nrights in the mark “CLARI-FI” in 2013, pursuant to the Asset Transfer \nAgreement dated 19th September, 2013. It is submitted on behalf of the \npetitioner that since the mark of the respondent no.1, “CLARIWASH” was \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.03.2023 17:39:04\nSignature Not Verified\n\n--- PAGE 9 ---\n2023:DHC:2089 \n \nC.O. (COMM.IPD-TM) 497/2022 \n                                          \n \n      Page 9 of 10 \n \nsimilar to the earlier registered trademark “CLARI-FI”, in respect of similar \ngoods, the respondent no.1 should not have been granted registration in \nterms of Section 11 of the Trade Marks Act, 1999. In my considered view, \nthere is no similarity in the marks “CLARI-FI” and “CLARIWASH” so as \nto cause a likelihood of confusion in the public or likelihood of association \nof “CLARIWASH” with “CLARI-FI”. It is a settled position of law that \nwhile comparing the marks, the marks have to be seen as a whole and \ncannot be broken into their individual components. Reference in this regard \nmay be made to the judgment of the Supreme Court in Corn Products \nRefining Co. v. Shangrila Food Products Ltd., AIR 1960 SC 142. \nTherefore, “CLARIWASH” cannot be read as “CLARI” plus “WASH” and \nsimilarly, “CLARI-FI” cannot be read as “CLARI” plus “FI”. Taken as a \nwhole, there is no similarity in the competing marks so as to cause \nconfusion.  Therefore, on the basis of registration of the mark “CLARI-FI”, \nthe petitioner cannot seek cancellation of the trademark “CLARIWASH” \nregistered in favour of the respondent no.1 in Class 03.  \n14. \nUnder the Asset Transfer Agreement dated 19th September, 2013, the \npetitioner took over approximately 170 marks, both registered and pending \nregistration, from Cheryl‟s Consmeceuticals. Only 12 out of the 170 marks \nuse “Clari” as a part of the mark. Therefore, the petitioner cannot say that \nthere was a family of marks with the term “Clari” as part of the marks that \nwere registered in favour of the petitioner. \n15. \nCounsel for the petitioner has contended that even though the user \nshown in the application filed by the respondent no.1 is 16th November, \n2009, the first invoice placed on record is of 12th May, 2010. In my view, \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.03.2023 17:39:04\nSignature Not Verified\n\n--- PAGE 10 ---\n2023:DHC:2089 \n \nC.O. (COMM.IPD-TM) 497/2022 \n                                          \n \n      Page 10 of 10 \n \nthis would not make any difference as registration can be granted on a \n„proposed to be used‟ basis. Even if the first user of the respondent no.1 is \ntaken to be 12th May, 2010, the user of the petitioner or its predecessor of \nthe trademark “CLARIWASH” is after the said date. Nothing has been \nplaced on record on behalf of the petitioner to show that the mark \n“CLARIWASH” was adopted in 2010 either by the petitioner or its \npredecessor. It was only on 22nd August, 2013 that a license was issued by \nthe FDA, Maharashtra in favour of the predecessor of the petitioner, \nCheryl‟s Cosmeceuticals. Even the first invoice placed on record by the \npetitioner that corresponds to the use of “CLARIWASH” is dated 5th \nDecember, 2013 and the sales figures in the petition have been given only \nfrom the year 2014. It is also relevant to note that the petitioner has not filed \nany application for registration of the mark “CLARIWASH” till date.   \n16. \nIn light of the discussion above, no grounds for rectification are made \nout.   \n17. \nThe petition is dismissed with no order as to costs. \n \n \n                       AMIT BANSAL, J. \nMARCH 23, 2023 \nat \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.03.2023 17:39:04\nSignature Not Verified\n"
  },
  "total_pages": 10,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "**Case Summary**\n\nThe case involves a trademark dispute between L'Oréal India Pvt. Ltd (Petitioner) and Rajesh Kumar Taneja Trading as Innovative Derma Care and anr (Respondents). The Petitioner has filed a cancellation petition (C.O. (COMM.IPD-TM) 497/2022) seeking removal of the Respondent No.1's registered trademark \"CLARIWASH\" (reg. no.1950938 in Class 03).\n\n**Key Facts and Proceedings**\n\n* Judgment reserved on: February 27, 2023\n* Judgment delivered on: March 23, 2023\n* Petitioner is the owner of various trademarks with the word \"Clari\", engaged in manufacturing and sale of hair care, skin care, toiletries, and beauty products.\n* Respondent No.1 applied for registration of \"CLARIWASH\" on April 16, 2010, showing user from November 16, 2009, but evidence suggests user started after May 10, 2010.\n* Petitioner claims prior user status based on predecessor's use since 2009.\n\n**Arguments and Decision**\n\nNo detailed arguments are mentioned in the provided section. The Judge's decision is not clearly stated, but it appears that the case was likely decided based on prior user rights.\n\n**Parties and Dates**\n\n* Petitioner: L'Oréal India Pvt. Ltd.\n* Respondents: Rajesh Kumar Taneja Trading as Innovative Derma Care and anr\n* Judgment reserved and delivered dates: February 27, 2023 (reserved) and March 23, 2023 (delivered)\n* Date of application for trademark registration: April 16, 2010\n\n**PDF Source**\n\nSource: L'Oréal India Pvt. Ltd vs Kumar.pdf",
      "pdf_source": "3. LOREAL INDIA PVT. LTD vs Kumar.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "**Case Summary**\n\nSource: Pdf document \"LOREAL INDIA PVT. LTD vs Kumar.pdf\"\n\n**Case Details**\n\n* Case No.: C.O. (COMM.IPD-TM) 497/2022\n* Court: High Court of Delhi at New Delhi\n* Date of Judgment Reserved: February 27, 2023\n* Date of Judgment Delivered: March 23, 2023\n\n**Case Parties**\n\n* Petitioner: L'Oreal India Pvt. Ltd.\n\t+ Represented by: Mr. S.K. Bansal and Mr. Ajay Amitabh Suman, Advocates\n* Respondents:\n\t+ Rajesh Kumar Taneja Trading (Respondent-1)\n\t\t- Represented by: Mr. Pramod Kumar Singh and Ms. Priya Nagpal, Advocates\n\t+ Innovative Derma Care and Anr. (Respondent-2)\n\t\t- Represented by: CGSC with Mr. Srish Kumar Mishra, Mr. Sagar Melaawat, and Mr. Alexander Mathai Paikady, Advocates\n\n**Case Subject**\n\n* Cancellation petition seeking removal of trademark \"CLARIWASH\" registered under No.1950938 in Class 03 from the Register of Trademarks.",
          "content": "2023:DHC:2089 \n \nC.O. (COMM.IPD-TM) 497/2022 \n                                          \n \n      Page 1 of 10 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n \n% \n \n \nJudgment Reserved on:  27th February, 2023  \nJudgment Delivered on: 23rd March, 2023  \n \n+  \n \n \nC.O. (COMM.IPD-TM) 497/2022 \n \nLOREAL INDIA PVT. LTD.  \n \n       \n  ..... Petitioner \nThrough: \nMr. \nS.K. \nBansal \nand \nMr.Ajay \nAmitabh Suman, Advocates \n \n \n \n \nversus \n \nRAJESH KUMAR TANEJA TRADING  \nAS INNOVATIVE DERMA CARE AND ANR \n...... Respondents \nThrough: \nMr. Pramod Kumar Singh and \nMs. Priya Nagpal, Advocates for R-1. \n \nMr. Harish Vaidyanathan Shankar, \nCGSC with Mr. Srish Kumar Mishra, \nMr. \nSagar \nMehlawat \nand \nMr.Alexander \nMathai \nPaikaday, \nAdvocates for R-2. \n \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nJUDGMENT \n1. \nThe present cancellation petition has been filed on behalf of the \npetitioner seeking removal of impugned trademark „CLARIWASH‟ \nregistered under No.1950938 in Class 03 in the name of the respondent no.1 \nfrom the Register of Trademarks. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.03.2023 17:39:04\nSignature Not Verified",
          "pdf_source": "3. LOREAL INDIA PVT. LTD vs Kumar.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "**Case Summary from Page 2 of LOREAL INDIA PVT. LTD vs Kumar.pdf**\n\nThe petitioner, L'Oréal India Pvt. Ltd., is the proprietor of various trademarks with the word \"Clari\". The case revolves around a dispute over the trademark registration of \"CLARIWASH\" and other \"Clari\" formative marks.\n\n**Key Facts:**\n\n* The petitioner adopted the \"CLARIWASH\" mark in 2010.\n* A company, Cheryl's Cosmeceuticals, adopted the first \"Clari\" formative marks in 2009.\n* The petitioner acquired Cheryl's Cosmeceuticals in 2013 and transferred the reputation and goodwill related to the \"Clari\" marks.\n* Respondent no.1 applied for registration of \"CLARIWASH\" on April 16, 2010, showing user from November 16, 2009.\n\n**Notices:**\n\n* Registration granted to the petitioner in respect of trademark \"CLARI-FI\" on February 3, 2010.\n* First invoice filed by Respondent no.1 is dated May 10, 2010, after registration of petitioner's marks.\n\n**PDF Source:** LOREAL INDIA PVT. LTD vs Kumar.pdf (High Court of Delhi at New Delhi)",
          "content": "2023:DHC:2089 \n \nC.O. (COMM.IPD-TM) 497/2022 \n                                          \n \n      Page 2 of 10 \n \nCASE SET UP BY THE PETITIONER \n2. \nThe case set up in the petition is as under: \n2.1. The petitioner is the registered proprietor of various trademarks with \nthe word “Clari”, details of which are given in paragraph 4 of the \npetition. The petitioner is engaged in the business of manufacture and \nsale of a wide range of hair care, skin care, toiletries and beauty \nproducts.  \n2.2. The “CLARIWASH” mark was adopted in 2010 by the petitioner and \nhas been used along with the other “Clari” formative marks. \n2.3. The first of the “Clari” formative marks were adopted by a company \nby the name of Cheryl‟s Cosmeceuticals Pvt. Ltd. [hereinafter \n“Cheryl‟s Cosmeceuticals”] in 2009. The petitioner acquired Cheryl‟s \nCosmeceuticals in 2013 by way of a Deed of Assignment and Asset \nTransfer Agreement.  \n2.4. By virtue of the said Deed of Assignment and Transfer Agreement, \nthe reputation and goodwill related to various “Clari” formative marks \nstood transferred to the petitioner. \n2.5. The petitioner is the prior user of the “Clari” formative marks from \nthe year 2009 on account of the user of his predecessor. \n2.6. The respondent no.1 applied for registration of the trademark \n“CLARIWASH” in Class 03 on 16th April, 2010 showing user from \n16th November, 2009. However, the first invoice filed on behalf of the \nrespondent no.1 is dated 10th May, 2010, which is after the \nregistration of the “Clari” formative marks. On the other hand, the \nregistration granted in favour of the petitioner in respect of trademark \n“CLARI-FI” is of 3rd February, 2010 with user from 1st April, 2009. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.03.2023 17:39:04\nSignature Not Verified",
          "pdf_source": "3. LOREAL INDIA PVT. LTD vs Kumar.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0007",
      "start_index": 3,
      "end_index": 5,
      "summary": "Legal Document Summary: LOREAL INDIA PVT. LTD vs Kumar (2023:DHC:2089)\n\n**Background**\n\nSection 12 of the Trademarks Act is at issue in this case filed by L'Oreal India Pvt. Ltd against Rajesh Kumar Taneja Trading as Innovative Derma Care, over a trademark dispute.\n\n**Facts**\n\n* L'Oreal had challenged the registration of trademark \"CLARIWASH\" by Rajesh Kumar Taneja Trading, citing prior use and identical/similar mark.\n* The Examiner's Report noted the mark as \"CHARIWASH\", leading to a Certificate of Registration in that name. Later corrected to \"CLARIWASH\".\n* L'Oreal claims adoption of \"CLARIWASH\" in 2010 but failed to provide supporting documents for this.\n* Respondent had commenced a suit against L'Oreal in District Courts, Tis Hazari.\n\n**Arguments**\n\nRajesh Kumar Taneja Trading's arguments:\n\n* Cannot claim concurrent user under Section 12 as did not use mark at time of application filing.\n* Trademark Registry error corrected by issuing a fresh Certificate for \"CLARIWASH\", relying on Epsilon Publishing House Private Limited vs Union of India (2009 SCC OnLine Del).\n* L'Oreal's adoption and usage of the mark came later, in 2013.\n\n**Decisions**\n\nCourt to deliberate on this matter given trademark registration errors and concurrent user under Section 12.\n\nPDF Source: LOREAL INDIA PVT. LTD vs Kumar.pdf",
      "pdf_source": "3. LOREAL INDIA PVT. LTD vs Kumar.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "Here is a summary of page 3 from the PDF:\n\nThe petitioner (Loreal India PVT. LTD) submits that the respondent (Rajesh Kumar Taneja Trading) cannot claim benefit of \"concurrent user\" under Section 12 of Trademarks Act as they had no use of the trademark at the time of application.\n\n* Respondent's trademark application was filed on April 16, 2010.\n* Earliest invoice from respondent is dated May 10, 2010, more than a month after application filing.\n* Examination Report issued by Registrar notes respondent's mark as \"CHARIWASH\" instead of \"CLARIWASH\", resulting in Certificate of Registration for \"CHARIWASH\".\n* Registry later modified certificate to \"CLARIWASH\".\n\nThe petitioner argues that the Registry made an error in changing the registration certificate and should have proceeded with a fresh examination.\n\nPDF source: LOREAL INDIA PVT. LTD vs Kumar.pdf, 2023:DHC:2089 (High Court of Delhi)",
          "content": "2023:DHC:2089 \n \nC.O. (COMM.IPD-TM) 497/2022 \n                                          \n \n      Page 3 of 10 \n \n2.7. It is further submitted that the respondent no.1 cannot claim the \nbenefit of concurrent user under Section 12 of the Trademarks Act as \nthere was no use by the respondent no.1 at the time of the trademark \napplication. The trademark application was filed on 16th April, 2010 \nand the earliest invoice filed on behalf of the respondents is of 10th \nMay, 2010. \n2.8. The Examination Report dated 3rd January, 2012 issued by the \nRegistrar of Trade Marks wrongly notes the mark of the respondent \nno.1 as “CHARIWASH” instead of “CLARIWASH”. Based on the \naforesaid Examination Report, the Certificate of Registration of Trade \nMark was issued in favour of the respondent no.1 for the word mark \n“CHARIWASH”. However, subsequently, the Certificate was \nmodified by the Registry to “CLARIWASH”. \n2.9. The procedure adopted by the Registry in changing the Registration \nCertificate of word mark from “CHARIWASH” to “CLARIWASH” \nwas an erroneous. Having discovered the error, the Registry should \nhave \nproceeded \nfor \na \nfresh \nexamination \nfor \nthe \nmark \n“CLARIWASH”. Reliance in this regard is placed on the orders of the \nIntellectual Property Appellate Board (IPAB) in Vans Inc. USA v. \nFateh Chand Bhansali and Anr., 2020 SCC OnLine IPAB 44 and \nPrajapati Constructions Ltd. v.  Manoj Ramanand Prajapati and \nAnr., 2018 SCC OnLine IPAB 313. \nCASE SET UP BY THE RESPONDENT \n3. \nThe case set up by the respondent no.1 is as under: \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.03.2023 17:39:04\nSignature Not Verified",
          "pdf_source": "3. LOREAL INDIA PVT. LTD vs Kumar.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "Here is a summary of page 4 from PDF: 3. LOREAL INDIA PVT. LTD vs Kumar.pdf:\n\n**Trademark Dispute**\n\nThe respondent No.1 has filed a suit against L'Oreal India Pvt. Ltd. (petitioner) for infringement of its registered trademark \"CLARIWASH\". The dispute is pending before the District Courts, Tis Hazari.\n\nKey facts and arguments:\n\n* Trademark Registry erroneously issued a certificate for the mark \"CHARIWASH\" instead of \"CLARIWASH\".\n* Respondent No.1 rectified the error and obtained a fresh registration certificate for \"CLARIWASH\" in 2012 (Epsilon Publishing House Pvt. Ltd. v. Union of India and Ors., 2009 SCC OnLine Del 3922).\n* Petitioner claims adoption of the mark in 2010, but no evidence has been filed to support this.\n* Petitioner does not have a registered trademark for \"CLARIWASH\".\n* Petitioner's use of the mark started only in 2013.\n\n**Source:** PDF: 3. LOREAL INDIA PVT. LTD vs Kumar.pdf (2023:DHC:2089)",
          "content": "2023:DHC:2089 \n \nC.O. (COMM.IPD-TM) 497/2022 \n                                          \n \n      Page 4 of 10 \n \n3.1. The respondent no.1 has filed a suit for infringement of the registered \ntrademark “CLARIWASH” of the respondent no.1 against the \npetitioner, which is pending before the District Courts, Tis Hazari. \n3.2. Even though the Examination Report was in respect of the mark \n“CHARIWASH”, the Trademark Journal correctly published the \nmark “CLARIWASH” and not “CHARIWASH”. In May, 2012, the \nTrademark Registry erroneously issued Trademark Registration \nCertificate for the word mark “CHARIWASH”. The respondent no.1 \nimmediately filed an application to rectify the said clerical error and \naccordingly, the Trademark Registry rectified the error and issued a \nfresh Trademark Registration Certificate for the correct word mark \n“CLARIWASH”. Reliance is placed on the judgment of a Coordinate \nBench in Epsilon Publishing House Pvt. Ltd. v. Union of India and \nOrs., 2009 SCC OnLine Del 3922.  \n3.3. Though the petitioner claims adoption of the mark “CLARIWASH” \nin the year 2010, nothing has been filed in support of the same. \nFurther, the petitioner has not filed any application for registration of \nthe mark “CLARIWASH” till date. \n3.4. Use of the mark “CLARIWASH” by the petitioner or its predecessor \nwas only in the year 2013. Attention of the Court in this regard is \ndrawn to the invoices filed on behalf petitioner. \n3.5. The petitioner uses several other marks other than the “Clari” \nformative marks. Therefore, it cannot be said that “Clari” belongs to a \nfamily of marks. \n3.6. The petitioner cannot claim any monopoly on a part of the trademark \n“Clari”. The fact that the petitioner has various marks registered with \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.03.2023 17:39:04\nSignature Not Verified",
          "pdf_source": "3. LOREAL INDIA PVT. LTD vs Kumar.pdf",
          "nodes": []
        },
        {
          "title": "Page 5",
          "node_id": "0006",
          "start_index": 5,
          "end_index": 5,
          "summary": "The content of page 5 from PDF: 3. LOREAL INDIA PVT. LTD vs Kumar.pdf (2023:DHC:2089 C.O. (COMM.IPD-TM) 497/2022) is as follows:\n\nThe court has heard counsels for both parties and observed the following facts:\n\n* The Trademarks Registry issued an Examination Report and a Registration Certificate in favor of respondent no.1, but mistakenly showed \"CHARIWASH\" instead of \"CLARIWASH\".\n* An application was later filed by respondent no.2 to rectify the error on June 14, 2012, which was allowed by the Registry.\n* A correct Trademark Registration Certificate was issued for \"CLARIWASH\", and the mark had been correctly published in the Trademark Journal No.1519 on January 16, 2012.\n\nThis information indicates that:\n\n* Date: January 16, 2012 (Publication of mark \"CLARIWASH\")\n* Date: June 14, 2012 (Application for rectification)\n* Party: Respondent no.1\n* Event: Erroneous issuance of Examination Report and Registration Certificate",
          "content": "2023:DHC:2089 \n \nC.O. (COMM.IPD-TM) 497/2022 \n                                          \n \n      Page 5 of 10 \n \nthe prefix “Clari” does not mean that the registration granted in favour \nof the respondent no.1 for the mark “CLARIWASH” is defective. \nThere are a number of trademarks registered where the word “Clari” \nhas been used as a prefix or suffix.  \n3.7. The petitioner was aware of the respondent‟s use of the trademark \n“CLARIWASH”, yet never applied for its trademark registration. \n4. \nDespite opportunity being granted, the respondent no.2 has not filed \nany reply/counter statement or written submissions in the present petition. \nANALYSIS AND FINDINGS \n5. \nI have heard the counsels for the parties. \n6. \nIn the present case, it appears from the record that the Trademarks \nRegistry erroneously issued the Examination Report for the mark \n“CHARIWASH” instead of “CLARIWASH”. Yet again, the Registry issued \na Trademark Registration Certificate in favour of the respondent, wherein \nthe mark of the respondent was wrongly shown as “CHARIWASH”. \nImmediately thereafter, an application was filed on behalf of the respondents \non 14th June, 2012, requesting for rectification of the clerical error and the \nsame was allowed by the Registry and a correct Trademark Registration \nCertificate was issued in favour of the respondent for the mark \n“CLARIWASH”. However, it is pertinent to note that the mark of the \nrespondent no.1 was published correctly as “CLARIWASH” in the \nTrademark Journal No.1519 on 16th January, 2012.  Therefore, it was open \nfor the petitioner or its predecessor to oppose the said application, which \nthey failed to do. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.03.2023 17:39:04\nSignature Not Verified",
          "pdf_source": "3. LOREAL INDIA PVT. LTD vs Kumar.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0011",
      "start_index": 6,
      "end_index": 8,
      "summary": "**Legal Proceedings:**\n\nThe High Court of Delhi (2023:DHC:2089) heard a matter between L'Oréal India PVT. LTD. and Rajesh Kumar Taneja Trading as Innovative Derma Care, regarding trademark registration.\n\n**Facts:**\n\n* The Trademark Registry issued a faulty examination report.\n* Respondent no.1 was granted trademark registration despite the error.\n* Petitioner (L'Oréal) seeks removal of trademark registration on account of mistake by the Registry.\n\n**Arguments:**\n\n* Counsel for respondent no.1 (Rajesh Kumar Taneja) argued that he cannot be faulted for a mistake committed by the Registry.\n* Relying on Epsilon Publishing, the Court was asked to consider whether the Registrar's error can lead to removal of trademark registration.\n* Petitioner relied on interim orders from IPAB in Prajapati Constructions and Vans Inc. USA, stating that the Trademark Registry must follow statutory procedure.\n\n**Decisions:**\n\n* The Court held that respondent no.1 cannot be deprived of valuable rights due to error by the Registry (Sections 7-9).\n* The dictum in Epsilon Publishing was applied to the present case.\n* IPAB interim orders were deemed not binding at the final hearing stage, highlighting procedural lapses by the Trademark Registry.\n\n**Parties:**\n\n* L'Oréal India PVT. LTD. (Petitioner)\n* Rajesh Kumar Taneja Trading as Innovative Derma Care (Respondent no.1)\n\n**Dates:**\n\n* Judgment Reserved: 27th February, 2023\n* Judgment Delivered: 23rd March, 2023\n\n**Source:** LOREAL INDIA PVT. LTD vs Kumar.pdf, Page 6-10 of 10.",
      "pdf_source": "3. LOREAL INDIA PVT. LTD vs Kumar.pdf",
      "nodes": [
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "Here is a summary of page 6 from the PDF:\n\nThe court concludes that an error by the registry in issuing a faulty examination report cannot be used as grounds for removing the registration granted to respondent no.1. The respondent cannot be faulted for misleading or misrepresenting information, and deprivation of registration due to a mistake by the registry would be unjust.\n\nA similar case, Epsilon Publishing (not quoted further), held that a respondent cannot be penalized when the Trade Marks Registry fails to adhere to statutory timelines. In this case, the Registrar admitted not examining a renewal application, but the private respondent was allowed to pursue its rights despite the fault of the Registrar. \n\nNote: The PDF source is \"LOREAL INDIA PVT. LTD vs Kumar\" (2023:DHC:2089), Case No. C.O. (COMM.IPD-TM) 497/2022.",
          "content": "2023:DHC:2089 \n \nC.O. (COMM.IPD-TM) 497/2022 \n                                          \n \n      Page 6 of 10 \n \n7. \nIf the Registrar has committed an error and issued a faulty \nexamination report, the respondent no.1 cannot be faulted for the same.  It is \nnot that the respondent no.1 had misrepresented or misled the trademark \nRegistry into issuing a faulty examination report.  The registration of a \ntrademark entails valuable rights and the respondent no.1 cannot be deprived \nof the same on account of mistake committed by the Registry. Therefore, \nthis by itself cannot be the ground for removal of the registration granted in \nfavour of the respondent no.1. \n8. \nIn Epsilon Publishing (supra), a Coordinate Bench of this Court was \nseized of a petition challenging the order of the Registrar renewing the \ntrademark granted in favour of the respondent therein.  The ground taken by \nthe petitioner was that since the respondent had not filed an application for \nrenewal of the registration before its expiration and not paid the surcharge, \nthe Registrar was required to remove the trademark from the Register.  \nWhile noting that the Trade Marks Registry has not adhered to the statutory \ntimelines, it was held that the respondent cannot be penalized for the same \nand would be entitled to pursue its renewal application.  In the said case, the \nRegistrar had admitted that the renewal application filed on behalf of the \nprivate respondent was not examined and therefore, could not be processed \nfurther.  It was observed that the private respondent could not be deprived of \nits rights on account of the fault of the Registrar. The relevant observations \nof the court as set out in paragraph 26 are reproduced below: \n“26. \nThere may be merit in the contention that the Registrar \nhas to follow the procedure as prescribed; however, the essential \nquestion is not whether the Registrar has any discretion in the \nmatter, but, what are the consequences of the Registrar not \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.03.2023 17:39:04\nSignature Not Verified",
          "pdf_source": "3. LOREAL INDIA PVT. LTD vs Kumar.pdf",
          "nodes": []
        },
        {
          "title": "Page 7",
          "node_id": "0009",
          "start_index": 7,
          "end_index": 7,
          "summary": "Here is a summary of page 7 from the provided PDF:\n\n**Case:** LOREAL INDIA PVT. LTD vs Kumar (2023:DHC:2089)\n\n**Page 7 Summary:**\n\nThe court finds that the Trademark Registry has not adhered to the timelines as required under the Trade Marks Act, 1999. Respondent No.3 had filed its application for renewal of its trademark well within the prescribed period and was entitled to know the fate of its application. The Registry did not advertise the removal of the trademark as required, which would have provided an opportunity for the petitioner to seek restoration.\n\n**Applicable Dicta:** The court cites a previous judgment, applicable to the present case, which states that the respondent cannot be deprived of its valuable rights of registration on account of the error of the Registry.\n\n**IPAB Rulings:** The counsel for the petitioner relies on interim orders passed by the IPAB in Prajapati Constructions (supra) and Vans Inc. USA (supra), but the court notes that these rulings are not relevant at this stage of final hearing.\n\n**Source:** 3. LOREAL INDIA PVT. LTD vs Kumar.pdf",
          "content": "2023:DHC:2089 \n \nC.O. (COMM.IPD-TM) 497/2022 \n                                          \n \n      Page 7 of 10 \n \nfollowing the established procedure? Plainly, in the facts of the \npresent case, it is apparent that the Trademark Registry has not \nadhered to the timelines as required. Surely, respondent no.3 \ncannot be penalised for the same and would be entitled to purse its \napplication for renewal of its trademark. The same was filed well \nwithin the period of six months and even though the same was not \naccompanied by a fee of surcharge, nonetheless, respondent no.3 \nhad the right to know the fate of its application. Since no \ndeficiency was pointed out at the material time, respondent no.3 \ncannot be deprived of its valuable rights to cure the defects within \nthe prescribed period. The Registrar also did not advertise the \nremoval of the trademark as required under section 25(4) of the \nAct read with Rule 66 of the 2002 Rules. Such advertisement \nwould have provided another opportunity for the petitioner to seek \nrestoration of the trademark.” \n9. \nThe dicta of the aforesaid judgment is squarely applicable to the \npresent case. The respondent no.1 cannot be deprived of his valuable rights \nof registration on account of the error of the Registry. \n10. \nCounsel for the petitioner has relied upon the orders passed by the \nIPAB in Prajapati Constructions (supra) and Vans Inc. USA (supra) in \nsupport of his submission that the Registrar of Trade Marks has to follow \nthe statutory procedure prescribed under the Trade Marks Act, 1999 in \nrespect of examination of a trade mark application. At the outset, it may be \nnoted that both are interim orders passed by the IPAB and therefore, no \nreliance can be placed on the same in the present case, which is at the stage \nof final hearing. After noticing the various procedural lapses committed by \nthe Trademark Registry, the IPAB only ordered that the respondent therein \nshall not rely upon the impugned registration in any proceedings during the \npendency of the rectification proceedings.  There was no order for removal \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.03.2023 17:39:04\nSignature Not Verified",
          "pdf_source": "3. LOREAL INDIA PVT. LTD vs Kumar.pdf",
          "nodes": []
        },
        {
          "title": "Page 8",
          "node_id": "0010",
          "start_index": 8,
          "end_index": 8,
          "summary": "Here is a summary of page 8 from the PDF document:\n\n**LOREAL INDIA PVT. LTD vs Kumar (2023:DHC:2089)**\n\nPage 8 states that the respondent's trademark registration was granted due to lapses committed by the Registry. The petitioner argues that this was an error.\n\nThe court relies on a previous judgment, **Jahangir Biri Factory Pvt. Ltd. v. Mohd. Dildar Hossain (Proporietor) & Anr., 2018 (76) PTC 479 [IPAB]**, where the marks of the petitioner and respondent were identical, but notes that this is not applicable in the present case.\n\nThe petitioner's counsel submits that the matter be remanded back to the Registry for reconsideration. However, the court declines, considering it would amount to cancellation of the respondent's registration granted in 2012.\n\n**Key points:**\n\n* Respondent's trademark registration was granted due to Registry lapses.\n* Court relies on previous judgment with similar marks but notes difference in present case.\n* Petitioner's counsel requests remand back to Registry for reconsideration, which is declined.",
          "content": "2023:DHC:2089 \n \nC.O. (COMM.IPD-TM) 497/2022 \n                                          \n \n      Page 8 of 10 \n \nof the registration granted in favour of the respondent on account of lapses \ncommitted by the Registry.  \n11. \nReliance has also been placed on the order passed by the IPAB in \nJahangir Biri Factory Pvt. Ltd. v. Mohd. Dildar Hossain (Proporietor) & \nAnr., 2018 (76) PTC 479 [IPAB]. In the aforesaid order, the marks of the \npetitioner and the respondent were identical, namely, “HOWRAH BIDI”. \nThe respondent therein had merely added a number to the mark “HOWRAH \nBIDI”, which is not the position in the present case. Therefore, the said \njudgment does not further the case of the petitioner. \n12. \nCounsel for the petitioner also submitted that the matter be remanded \nback to the Registry for reconsideration of the trademark application of the \nrespondent no.1 from the stage of issuance of examination report. I am not \ninclined to remand back the matter as this would amount to cancellation of \nthe registration already granted in favour of the respondent no.1 as far back \nas in 2012. Therefore, I proceed to consider the matter on merits, i.e., \nwhether the registration in favour of the respondent no.1 was granted \nerroneously. \n13. \nAt the time when the respondent no.1 filed its application for \nregistration of the mark “CLARIWASH” in 2010, there was one mark of the \npredecessor of the petitioner, “CLARI-FI”, that was registered in Class 03. \nAll other marks of the petitioner with the term “Clari” have been registered \nsubsequent to the registration of the respondent no.1. The petitioner acquired \nrights in the mark “CLARI-FI” in 2013, pursuant to the Asset Transfer \nAgreement dated 19th September, 2013. It is submitted on behalf of the \npetitioner that since the mark of the respondent no.1, “CLARIWASH” was \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.03.2023 17:39:04\nSignature Not Verified",
          "pdf_source": "3. LOREAL INDIA PVT. LTD vs Kumar.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0014",
      "start_index": 9,
      "end_index": 10,
      "summary": "**Case Summary:** LOREAL INDIA PVT. LTD vs Kumar (2023:DHC:2089)\n\nThe Delhi High Court dismissed a petition filed by L'Oréal India Pvt. Ltd. seeking cancellation of the trademark \"CLARIWASH\" registered in favor of Rajesh Kumar Taneja Trading as Innovative Derma Care (Respondent No. 1) on grounds that it was deceptively similar to L'Oréal's previously registered trademark \"CLARI-FI\".\n\n**Facts and Arguments:**\n\n* L'Oréal India Pvt. Ltd. took over approximately 170 marks from Cheryl's Cosmeceuticals in 2013, but only 12 of them used the term \"Clari\" as part of the mark.\n* The Respondent No. 1 obtained registration for \"CLARIWASH\" on November 16, 2009 (user shown), with first invoice dated May 12, 2010 (placed on record).\n* L'Oréal contended that the use and registration of \"CLARIWASH\" would cause a likelihood of confusion with \"CLARI-FI\".\n* The Court held that while comparing marks, they must be seen as a whole and not broken down into individual components.\n\n**Decision:**\n\n* The Court found no similarity between the marks \"CLARI-FI\" and \"CLARIWASH\" to cause confusion or association.\n* Registration of \"CLARI-FI\" does not prevent other users from registering similar marks, especially when seen as a whole.\n* No grounds for rectification were made out.\n\n**Dates:**\n\n* Judgment Reserved on: 27th February, 2023\n* Judgment Delivered on: 23rd March, 2023\n\n**Source:** 3. LOREAL INDIA PVT. LTD vs Kumar (PDF file from 2023:DHC:2089)",
      "pdf_source": "3. LOREAL INDIA PVT. LTD vs Kumar.pdf",
      "nodes": [
        {
          "title": "Page 9",
          "node_id": "0012",
          "start_index": 9,
          "end_index": 9,
          "summary": "Based on page 9 of the PDF document \"LOREAL INDIA PVT. LTD vs Kumar\" (`2023:DHC:2089`), here is a summary of the key points:\n\n**Arguments against cancellation**\n\n* The court finds no similarity between the marks \"CLARI-FI\" and \"CLARIWASH\", which means there is no likelihood of confusion among consumers.\n* The court relies on the Supreme Court judgment in Corn Products Refining Co. v. Shangrila Food Products Ltd., AIR 1960 SC 142, which states that comparable marks should be viewed as a whole.\n\n**Analysis of mark usage**\n\n* Petitioner took over approximately 170 marks from Cheryl's Cosmeceuticals under an Asset Transfer Agreement dated 19th September, 2013.\n* Only 12 out of the 170 marks use \"Clari\" as part of the mark.\n\n**Dates and facts**\n\n* First invoice submitted by respondent no.1 was on May 12, 2010 (more than a year after claimed user date of November 16, 2009).\n\nSource: PDF document LOREAL INDIA PVT. LTD vs Kumar (`2023:DHC:2089`) Page 9 of 10",
          "content": "2023:DHC:2089 \n \nC.O. (COMM.IPD-TM) 497/2022 \n                                          \n \n      Page 9 of 10 \n \nsimilar to the earlier registered trademark “CLARI-FI”, in respect of similar \ngoods, the respondent no.1 should not have been granted registration in \nterms of Section 11 of the Trade Marks Act, 1999. In my considered view, \nthere is no similarity in the marks “CLARI-FI” and “CLARIWASH” so as \nto cause a likelihood of confusion in the public or likelihood of association \nof “CLARIWASH” with “CLARI-FI”. It is a settled position of law that \nwhile comparing the marks, the marks have to be seen as a whole and \ncannot be broken into their individual components. Reference in this regard \nmay be made to the judgment of the Supreme Court in Corn Products \nRefining Co. v. Shangrila Food Products Ltd., AIR 1960 SC 142. \nTherefore, “CLARIWASH” cannot be read as “CLARI” plus “WASH” and \nsimilarly, “CLARI-FI” cannot be read as “CLARI” plus “FI”. Taken as a \nwhole, there is no similarity in the competing marks so as to cause \nconfusion.  Therefore, on the basis of registration of the mark “CLARI-FI”, \nthe petitioner cannot seek cancellation of the trademark “CLARIWASH” \nregistered in favour of the respondent no.1 in Class 03.  \n14. \nUnder the Asset Transfer Agreement dated 19th September, 2013, the \npetitioner took over approximately 170 marks, both registered and pending \nregistration, from Cheryl‟s Consmeceuticals. Only 12 out of the 170 marks \nuse “Clari” as a part of the mark. Therefore, the petitioner cannot say that \nthere was a family of marks with the term “Clari” as part of the marks that \nwere registered in favour of the petitioner. \n15. \nCounsel for the petitioner has contended that even though the user \nshown in the application filed by the respondent no.1 is 16th November, \n2009, the first invoice placed on record is of 12th May, 2010. In my view, \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.03.2023 17:39:04\nSignature Not Verified",
          "pdf_source": "3. LOREAL INDIA PVT. LTD vs Kumar.pdf",
          "nodes": []
        },
        {
          "title": "Page 10",
          "node_id": "0013",
          "start_index": 10,
          "end_index": 10,
          "summary": "**PDF Source:** L'Oreal India Pvt. Ltd vs Kumar (2023:DHC:2089)\n\n**Summary of Page 10:**\n\nThe judgment reserves on February 27, 2023, and is delivered on March 23, 2023.\n\n**Key Findings:**\n\n1. **Trademark Registration**: The court rules that registration can be granted on a \"proposed to be used\" basis.\n2. **Priority Date**: Even if the respondent's first user date is taken as May 12, 2010, the petitioner's (L'Oreal) use of the trademark \"CLARIWASH\" is after this date.\n3. **Lack of Evidence**: No evidence was presented to show that L'Oreal or its predecessor adopted the mark \"CLARIWASH\" in 2010.\n\n**Decision:**\n\n* The petition for rectification of the trademark registration is dismissed with no order as to costs.\n\n**Parties:**\n\n1. L'Oreal India Pvt. Ltd. (Petitioner)\n2. Rajesh Kumar Taneja Trading Co. (Respondent)",
          "content": "2023:DHC:2089 \n \nC.O. (COMM.IPD-TM) 497/2022 \n                                          \n \n      Page 10 of 10 \n \nthis would not make any difference as registration can be granted on a \n„proposed to be used‟ basis. Even if the first user of the respondent no.1 is \ntaken to be 12th May, 2010, the user of the petitioner or its predecessor of \nthe trademark “CLARIWASH” is after the said date. Nothing has been \nplaced on record on behalf of the petitioner to show that the mark \n“CLARIWASH” was adopted in 2010 either by the petitioner or its \npredecessor. It was only on 22nd August, 2013 that a license was issued by \nthe FDA, Maharashtra in favour of the predecessor of the petitioner, \nCheryl‟s Cosmeceuticals. Even the first invoice placed on record by the \npetitioner that corresponds to the use of “CLARIWASH” is dated 5th \nDecember, 2013 and the sales figures in the petition have been given only \nfrom the year 2014. It is also relevant to note that the petitioner has not filed \nany application for registration of the mark “CLARIWASH” till date.   \n16. \nIn light of the discussion above, no grounds for rectification are made \nout.   \n17. \nThe petition is dismissed with no order as to costs. \n \n \n                       AMIT BANSAL, J. \nMARCH 23, 2023 \nat \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.03.2023 17:39:04\nSignature Not Verified",
          "pdf_source": "3. LOREAL INDIA PVT. LTD vs Kumar.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-16T13:11:18.061949",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}