{
  "doc_name": "32. Mahesh Gupta v. Registrar of Trade Marks",
  "pdf_source": "32. Mahesh Gupta v. Registrar of Trade Marks.pdf",
  "metadata": {
    "document_name": "32. Mahesh Gupta v. Registrar of Trade Marks",
    "source_pdf": "32. Mahesh Gupta v. Registrar of Trade Marks.pdf",
    "judges": [
      "C. HARI SHANKAR J U D G M E N T (ORAL) % 02.03.2023 1."
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "143/2022",
      "143/2022",
      "143/2022",
      "143/2022",
      "143/2022",
      "143/2022",
      "143/2022",
      "143/2022",
      "143/2022",
      "143/2022",
      "4245/2023"
    ],
    "dhc_numbers": [
      "2023/DHC/001627",
      "2023/DHC/001627",
      "2023/DHC/001627",
      "2023/DHC/001627",
      "2023/DHC/001627",
      "2023/DHC/001627",
      "2023/DHC/001627",
      "2023/DHC/001627",
      "2023/DHC/001627"
    ],
    "ia_numbers": [],
    "decision_date": "28 April, 1998",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [],
    "defendants": [],
    "appellants": [],
    "respondents": [],
    "plaintiff_advocates": [],
    "defendant_advocates": [],
    "appellant_advocates": [],
    "respondent_advocates": [],
    "damages_claimed": null,
    "damages_awarded": null,
    "key_issues": [
      "Here are the extracted main legal issues:",
      "Abandonment of opposition under Rule 45(2) of the Trade Marks Rules 2017.",
      "Deemed abandonment of opposition due to non-action within specified time limit.",
      "Proper service of counter statement and documents to the applicant/Appellant.",
      "Time extension for filing evidence in support of opposition under Rule 50 (1)(i) of the Trade Marks Rules 2002.",
      "Application of Tribunal Reforms Act 2021 on IPAB appeals.",
      "Jurisdictional implications of transfer of appeal from learned IPAB to Delhi High Court.",
      "Interpretation of Rule 45(2) of the Trade Marks Rules 2017 regarding deemed abandonment of opposition.",
      "Applicability of Section 91 of the Trade Marks Act for appealing against deemed abandonment of opposition.",
      "Whether non-action within specified time limit for filing evidence constitutes waiver of right to oppose trade mark application."
    ],
    "decision_summary": "Here is a comprehensive summary of the case:\n\n**Background**\n\nThis case involves a dispute over the registration of a device mark under the Trade Marks Act 1999. Mahesh Gupta (Appellant) opposed an application filed by Vinayak Healthcare Limited (Respondent 2), seeking to register the device mark in respect of non-alcoholic drinks and beverages, including aerated water, beer, and porter.\n\n**Legal Issues**\n\nThe main legal issue is whether the Appellant's opposition was deemed abandoned as per Rule 45(2) of the Trade Marks Rules 2017 (2017 Rules), and whether the Deputy Registrar's order dated August 7, 2019, holding the opposition to be abandoned was correct.\n\n**Arguments**\n\nThe Appellant submitted that it had filed evidence in support of its opposition on June 10, 2010, albeit after a delay of four months. The Appellant sought an extension of time and acknowledged the delayed filing. However, the Deputy Registrar held the opposition to be deemed abandoned under Rule 45(2) of the 2017 Rules.\n\n**Court Findings**\n\nThe High Court of Delhi at New Delhi (Division Bench) considered the appeal filed by the Appellant under Section 91 of the Trade Marks Act 1999 against the order of the Deputy Registrar. The court noted that all proceedings before the Deputy Registrar took place when the Trade Marks Rules 2002 (2002 Rules) were in force, and not the 2017 Rules.\n\n**Legal Issues Raised**\n\nThe court identified several legal issues:\n\n1. Whether the Deputy Registrar was correct in applying Rule 45(2) of the 2017 Rules to hold the opposition abandoned.\n2. Whether the Appellant's delay in filing evidence should have been considered under Rule 45 (deemed abandonment) of the 2002 Rules or the 2017 Rules.\n\n**Court Decision**\n\nThe court held that the Depute Registrar erred in law by passing the order under the 2017 Rules, as all proceedings took place when the 2002 Rules were in force. The court noted that Rule 45 (deemed abandonment) of the 2017 Rules was not applicable to this case.\n\n**Decision**\n\nThe court allowed the Appellant's appeal and set aside the order passed by the Deputy Registrar holding the opposition to be abandoned. However, no order has been passed on the merits of the application or opposition at this stage.\n\nNote: This summary is based on a limited understanding of trademarks laws in India. For an authoritative account of trademark law and practice, experts should consult relevant sources from the Indian Trade Marks Act 1999 and Rules related to the case cited above.",
    "legal_precedents": [
      "(2007) 143 DLT 148"
    ],
    "full_text": "\n--- PAGE 1 ---\nNeutral Citation Number : 2023/DHC/001627 \nC.A.(COMM.IPD-TM) 143/2022 \n \nPage 1 of 9    \n \n$~1 \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.A.(COMM.IPD-TM) 143/2022 & I.A. 4245/2023 \n \nMAHESH GUPTA \n \n \n \n         ..... Appellant \nThrough: \nMs. \nRajeshwari \nH. \nand  \nMs.Swapnil Gaur, Advs. \n \n \n \n \n \nversus \n \n \nREGISTRAR OF TRADEMARKS AND ANR .... Respondents \nThrough: \nMs. \nSwathi \nSukumar, \nMr. \nNaveen Nagarjuna, Mr. Pratyush Rao and \nMr. Ritik Raghuvanshi, Adv. for R-2 \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C. HARI SHANKAR \n \n \n \n   J U D G M E N T (ORAL) \n% \n \n \n \n  02.03.2023 \n \n1. \nOn 28th April 1998, Respondent 2 filed Application No. 800324 \nfor registration of the device mark \n under class 32 in \nrespect of ―non-alcoholic drinks and beverages aerated water, beer and \nporter, syrups for making beverages essences‖.  \n \n2. \nOn 15th September 2006, the appellant filed an opposition under \nSection 21 of the Trade Marks Act 1999, opposing the request of \nRespondent 2 for registration of the aforesaid device mark. Notice on \nthe opposition was served on the Respondent 2, who filed a counter \nstatement by way of response to the opposition on 15th April 2008.  \nThe date on which the counter statement was served on the appellant \nis not immediately forthcoming. However, it is not in dispute that the \nappellant filed its evidence in support of the opposition under Rule \nDigitally Signed By:SUNIL\nSINGH NEGI\nSigning Date:04.03.2023\n16:11:50\nSignature Not Verified\n\n--- PAGE 2 ---\nNeutral Citation Number : 2023/DHC/001627 \nC.A.(COMM.IPD-TM) 143/2022 \n \nPage 2 of 9    \n \n50(1)1 of the Trade Marks Rules 2002 (hereinafter referred to as ―the \n2002 Rules‖), on 10th June 2010.  On 11th June 2010, the appellant \nfiled an application for extension of time in filing the evidence in \nsupport of the opposition.  In the application, it was acknowledged \nthat the evidence was filed after a delay of four months, for which \nextension was sought in the application.  \n \n3. \nBy the following order dated 7th August 2019, the Deputy \nRegistrar of Trade Marks held the opposition filed by the appellant to \nbe deemed to have been abandoned under Rule 45(2)2 of the Trade \nMarks Rule 2017 (hereinafter referred to as ―the 2017 Rules‖) and \ndirected that the application would proceed further as per rules.  \n \n4. \nAggrieved thereby, the appellant has preferred the present \nappeal under Section 91 of the Trade Marks Act before the learned \nIntellectual Property Appellate Board (―the learned IPAB‖). \nConsequent to abolition of the learned IPAB by The Tribunals \nReforms Act 2021, the appeal stands transferred to this Court.  \n \n5. \nPleadings in the appeal have been completed and I have heard \nMs. Rajeshwari H., learned Counsel for the appellant and Ms. Swathi \nSukumar, learned Counsel for the Respondent 2 at length on the \nappeal. \n \n6. \n Though there are certain averments in the appeal regarding the \n                                          \n1 50. \nEvidence in support of opposition.— (1) Within two months from services on him of a copy of \nthe counterstatement or within such further period not exceeding one month in the aggregate thereafter as the \nRegistrar may on request allow, the opponent shall either leave with the Registrar, such evidence by way of \naffidavit as he may desire to adduce in support of his opposition or shall intimate to the Registrar and to the \napplicant in writing that he does not desire to adduce evidence in support of his opposition but intends to rely \non the facts stated in the notice of opposition. He shall deliver to the applicant copies of any evidence that he \nleaves with the Registrar under this sub-rule and intimate the Registrar in writing of such delivery. \n2 45. \nEvidence in support of opposition.—  (2) If an opponent takes no action under sub-rule (1) within \nthe time mentioned therein, he shall be deemed to have abandoned his opposition. \nDigitally Signed By:SUNIL\nSINGH NEGI\nSigning Date:04.03.2023\n16:11:50\nSignature Not Verified\n\n--- PAGE 3 ---\nNeutral Citation Number : 2023/DHC/001627 \nC.A.(COMM.IPD-TM) 143/2022 \n \nPage 3 of 9    \n \nmerits of the respondent’s application seeking registration of the  \n device mark and on the merits of the appellant’s \nopposition to such registration, I do not deem it necessary to enter into \nthe meits of the matter, as the appellant’s objection was rejected by the \nlearned Deputy Registrar as abandoned. All that this Court has to see,  \ntherefore, is whether the learned Deputy Registrar was correct in her \ndecision to treat the appellant’s opposition to the application of \nRespondent 2 as abandoned.  \n \n7. \nI may observe, at the very outset, that the learend Deputy \nRegistrar has formally erred in law in passing the impugned order \nunder the 2017 Rules.  All proceedings before the learend Deputy \nRegistrar, save and except for the passing of the impugned order, on \n7th August  2019, took place when the 2002 Rules were in force. The \napplciation seeking registration, the oppostion thereto, the counter \nstatement filed by way of response to the oppositin and the filing of \nthe evidence in support of the opposition by the appellant along with \nthe application seeking condonation of delay, were all prior to coming \ninto force the 2017 Rules; in fact, much prior thereto.  \n \n8. \nRule 1583 of the 2017 Rules, even while repealing the 2002 \nRules, clearly holds that such repeal would be ―without prejudice to \nanything done under such rules before the coming into force of these \nrules‖.  In other words, the repeal of the 2002 Rules by the 2017 Rules \nwould, inter alia, be without prejudice to all proceedings which took \nplace in the present case, including the filing of the evidence in \nsupport of the opposition by the appellant which, admittedly, was \n                                          \n3 158. \nRepeal.— \nThe Trade Marks Rules, 2002, are hereby repealed without prejudice to \nanything done under such rules before the coming into force of these rules. \n \nDigitally Signed By:SUNIL\nSINGH NEGI\nSigning Date:04.03.2023\n16:11:50\nSignature Not Verified\n\n--- PAGE 4 ---\nNeutral Citation Number : 2023/DHC/001627 \nC.A.(COMM.IPD-TM) 143/2022 \n \nPage 4 of 9    \n \nunder Rule 50(1) of the 2002 Rules.  The repeal of the 2002 Rules by \nthe 2017 Rules cannot, therefore, prejudice the applicability of the \n2002 Rules, insofar as the issue of whether the evidence filed by the \nappellant under Rule 50(1) of the 2002 Rules could be taken on \nrecord, is concerned. \n \n9. \nThe dispute has, therefore, to be examined in the light of Rule \n50(1) of the 2002 Rules. What has to be seen, therefore, is whether the \nopposition of the appellant could be treated as having deemed to have \nbeen abandoned by applying Rule 50(1) of the 2002 Rules.    \n \n10. \nA coordinate Single Bench of this Court of Hon’ble Mr. Justice \nBudar Durrez Ahmed, as he then was, has examined this aspect in \ndetail in Sunrider Corporation, U.S.A. v. Hindustan Lever Ltd4. The \nrelevant passages from the said decision may be reproduced thus: \n \n―8. \nReading Rule 50, it is clear that the evidence by way of \naffidavit in support of an opposition to the registration of a trade \nmark has to be filed within two months of the service of a copy of \nthe counter-statement on the opponent. This period of two months \nis further extendable by a period of one month in the aggregate \nthereafter as the Registrar may on request allow. Clearly, in the \nfirst instance, the evidence affidavit has to be filed within two \nmonths of the receipt of a copy of the counter-statement. The \nRegistrar may extend this period by a further one month in the \naggregate if a request for the same is made in time. Sub-rule (2) of \nRule 50 makes it clear that if an opponent takes no action under \nSub-rule (1) within the time mentioned therein, he shall be deemed \nto have abandoned his opposition. It is also interesting to note that \nSub-rule (3) refers to the application for extension of the period of \none month mentioned in Sub-rule (1). It is also stipulated that such \nan application has to be made in Form TM-56 accompanied by the \nprescribed fee before the expiry of the period of two months \nmentioned therein. So, it is clear that a strict regimen has been \nprescribed for the filing of evidence by way of affidavit in support \nof an opposition. A plain reading of the provisions makes it \nabundantly clear that the evidence has to be filed within two \n                                          \n4 (2007) 143 DLT 148 \nDigitally Signed By:SUNIL\nSINGH NEGI\nSigning Date:04.03.2023\n16:11:50\nSignature Not Verified\n\n--- PAGE 5 ---\nNeutral Citation Number : 2023/DHC/001627 \nC.A.(COMM.IPD-TM) 143/2022 \n \nPage 5 of 9    \n \nmonths in the first instance and, if an appropriate application for \nextension of time is made before the expiry of the period of two \nmonths and if such application is allowed by the Registrar, then \nlatest by a further month. In other words, under no circumstances \ncan the evidence affidavit be filed beyond the maximum three \nmonths prescribed under the said rule. In case the opponent has \nnot taken steps within the prescribed time, then there is no option \nleft with the Registrar but to deem that the opponent has \nabandoned his opposition.‖ \n(Emphasis Supplied) \n \n11. \nMs. Rajeshwari seeks, however, to distinguish the decision in \nSunrider4 essentially on two grounds.   She relies, in the first instance, \non the judgment of a learned Single Judge of the High Court of \nGujarat in Wyeth Holdings Corpn. v. Controller General of Patents, \nDesigns and Trade Marks5 , which holds, in paras 58 to 60 thus: \n―58.  \nIn view of the nature of the prayer sought for, there is no \nquestion of any alternative remedy being available to the \npetitioners. Having found the submissions made by the learned \nsenior counsel appearing for the petitioners with substance, the \nsame are accepted. There is no question of the petition being  \ndismissed on the ground of alternative remedy being available. \n59.  \nIn view of the aforesaid discussion, in view of the settled \nlegal position that subordinate legislation cannot travel beyond the \nscope of main legislation and having regard to the provisions \nof Section 131 which provides for extension of time, this Court has \nonly two options, either to declare Sub-rule (2) of Rule 50 as ultra \nvirus the Act or by employing principle of 'harmonious \nconstruction', to read Sub-rule (2) of Rule 50 to be a 'directory' one. \n60. \nIn the considered opinion of this Court, there is no reason \nmuch less a compelling reason for which the first option should be \nexercised and the 'Rule' be struck down by holding it to be \n'mandatory'. As against that, it is a well settled position of law that \nprinciple of 'harmonious construction' should be pressed into \nservice and Sub-rule (2) of Rule 50 be read as 'directory'. This \nCourt is of the opinion that by declaring Sub-rule (2) of Rule 50, \n'directory', no injustice or prejudice is going to be caused to any \nparty. On the contrary, it will be serving the interest of justice. \nHence, second option is exercised. Sub-rule (2) of Rule 50 is held \nto be 'directory' in nature.‖ \n \n                                          \n5 2006 SCC OnLine Guj 620 \nDigitally Signed By:SUNIL\nSINGH NEGI\nSigning Date:04.03.2023\n16:11:50\nSignature Not Verified\n\n--- PAGE 6 ---\nNeutral Citation Number : 2023/DHC/001627 \nC.A.(COMM.IPD-TM) 143/2022 \n \nPage 6 of 9    \n \n12. \nWyeth5, she submits, was not noticed in Sunrider4.  \n \n13. \nWith greatest respect, I am unable to subscribe to the view \nexpressed by the High Court of Gujarat in Wyeth5. \n \n14. \nTo my mind, the view espoused in para 60 of the decision in \nWyeth5, if accepted, would amount to no less than re-writing of the \napplicable statutory provisions. Rule 50(1) of the 2002 Rules is even \nmore peremptory, in its application, than Rule 48 of the succeeding \n2017 Rules. While providing a period of two months to an opponent \nopposing an application seeking registration of a trade mark file its \nevidence after receipt of the counter-statement of the applicant, Rule \n50(1) empowers the Registrar to extend the said period only upto one \nmonth, specifically using the words ―not exceeding one month‖. The \nwords ―not exceeding one month‖ are mandatory in their import.  The \nlearned Registrar could not, therefore, grant extension of more than \none month beyond the period of two months from the date of service, \non the opponent opposing the registration of a mark, of a copy of the \ncounter statement.  Grant of any further extension would clearly be in \nthe teeth of Rule 50(1). \n \n15. \nRule 50(2) is even clearer in its import.  It states, in \nunambiguous terms, that, if the opponent took no action under Rule \n50(1) within the time period mentioned therein – meaning two months \nextendable by a maximum period of one month – he shall be deemed \nto have abandoned his opposition.  \n \n16. \nDeemed abandonment of the opposition, therefore, follows as \nan inexorable statutory sequitur to the failure, on the part of the \nDigitally Signed By:SUNIL\nSINGH NEGI\nSigning Date:04.03.2023\n16:11:50\nSignature Not Verified\n\n--- PAGE 7 ---\nNeutral Citation Number : 2023/DHC/001627 \nC.A.(COMM.IPD-TM) 143/2022 \n \nPage 7 of 9    \n \nopponent, in filing the evidence in support of the opposition within the \nperiod envisaged in Rule 50(1).  Deemed abandonment, therefore, \noccurs by operation of the statute. Even sans any judicial or quasi-\njudicial order, therefore, if the opponent opposing the application \nseeking grant of the trade mark fails to file its evidence in support of \nthe opposition within a maximum of three months from the receipt, by \nit, of the counter-statement of the trade mark applicant, the opposition \nwould ipso facto be deemed to be abandoned irrespective of whether \nany order to that effect is, or is not, passed by any judicial or quasi-\njudicial forum. \n \n17. \nThe view expressed in Wyeth5, if accepted, would amount to \nrendering largely otiose Rule 50(2) of the 2002 Rules. With respect, \ntherefore, it is not possible to accept the said view.  \n \n18. \nMs. Rajeshwari also sought to place reliance on Rule 1056 of \nthe 2002 Rules read with Section 1317 of the 1999 Act. \n \n19. \nThough these provisions have been considered by the \ncoordinate Bench in Sunrider4, Ms. Rajeshwari advances a \nsubmission which, according to her, was not advanced in Sunrider4 \nand was not, therefore, considered.  She draws attention to the \n                                          \n6 105. \nExtension of time.— \n(1) An application for extension of time under Section 131 (not being \na time expressly provided in the Act or prescribed by Rule 79 or by sub-rule (4) of Rule 80 or a time for the \nextension of which provision is made in the rules) shall be made in Form TM-56. \n(2) Upon an application made under sub-rule (1) the Registrar, if satisfied that the circumstances are such as \nto justify the extension of the time applied for, may, subject to the provisions of the rules where a maximum \ntime limit is prescribed and subject to such conditions as he may think fit to impose, extend the time and \nnotify the parties accordingly and the extension may be granted though the time for doing the act or taking the \nproceeding for which it is applied for has already expired. \n7131.  \nExtension of time.— \n(1) If the Registrar is satisfied, on application made to him in the \nprescribed manner and accompanied by the prescribed fee, that there is sufficient cause for extending the time \nfor doing any act (not being a time expressly provided in this Act), whether the time so specified has expired \nor not, he may, subject to such conditions as he may think fit to impose, extend the time and inform the \nparties accordingly. \n(2) Nothing in sub-section (1) shall be deemed to require the Registrar to hear the parties before disposing of \nan application for extension of time, and no appeal shall lie from any order of the Registrar under this section. \n \nDigitally Signed By:SUNIL\nSINGH NEGI\nSigning Date:04.03.2023\n16:11:50\nSignature Not Verified\n\n--- PAGE 8 ---\nNeutral Citation Number : 2023/DHC/001627 \nC.A.(COMM.IPD-TM) 143/2022 \n \nPage 8 of 9    \n \nparenthesized words in Rule 105(1) reading ―not being a time \nexpressly provided in the Act or prescribed by rule 79 or by sub-rule \n(4) of rule 80 or a time for the extension of which provision is made in \nthe rules‖. According to Ms. Rajeshwari, the import of the afore-\nextracted parenthesized words in Rule 105(1) was to restrict the \ninflexibility of the provision only to cases where the time was \nprovided in the Act or prescribed by Rule 79 or Rule 80(4).   \n \n20. \nThe submission is obviously unacceptable, as the parentheses \nalso include the words ―or a time for the extension of which provision \nis made in the rules‖. As already noted, Rule 50(1) provides for \nextension of time and curtails the maximum period by which such \nextension could be granted to one month.  The provision for extension \nof time as contained in Rule 50(1), therefore, rules out the \napplicability of Rule 105 to the facts of the present case.  \n \n21. \nOn all other aspects, the coordinate Bench in Sunrider4, having \nexamined the issue in law in detail, this Bench does not deem it \nnecessary to reinvent the wheel. I express my respectful concurrence \nwith the views expressed in the passages from Sunrider4 extracted \nhereinabove which, unfortunately for the appellant, cover the case \nagainst it on all fours.  \n \n22. \nI see no reason, therefore, to differ with the ultimate decision, of \nthe Deputy Registrar, to deem the opposition of the appellant as \nhaving been abandoned.  The deemed abandonment would, however, \nbe under Rule 50(1) of the 2002 Rules, and not Rule 45(1) of the 2017 \nRules.  \n \nDigitally Signed By:SUNIL\nSINGH NEGI\nSigning Date:04.03.2023\n16:11:50\nSignature Not Verified\n\n--- PAGE 9 ---\nNeutral Citation Number : 2023/DHC/001627 \nC.A.(COMM.IPD-TM) 143/2022 \n \nPage 9 of 9    \n \n23. \nSubject to that modification, the impugned order dated 7th \nAugust 2019 is, therefore, upheld.  \n \n24. \nThe appeal is dismissed. \n \n \n \nC. HARI SHANKAR, J. \n \nMARCH 2, 2023 \n \ndsn \n \nDigitally Signed By:SUNIL\nSINGH NEGI\nSigning Date:04.03.2023\n16:11:50\nSignature Not Verified\n"
  },
  "total_pages": 9,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "Here is a summary of the legal document section from PDF \"32. Mahesh Gupta v. Registrar of Trade Marks.pdf\":\n\n**Case Details**\n\n* Case number: C.A.(COMM.IPD-TM) 143/2022\n* Appeal number: I.A. 4245/2023\n* Neutral Citation Number: 2023/DHC/001627\n\n**Parties**\n\n* Appellant (Plaintiff): Mahesh Gupta, represented by Ms. Rajeshwari H. and Ms. Swapnil Gaur\n* Respondents (Defendants): Registrar of Trademarks and another person, represented by Ms. Swathi Sukumar and others\n\n**Background**\n\nThe case involves an opposition to the registration of a device mark under class 32 for non-alcoholic drinks and beverages. The Respondent-2 filed application No. 800324 on April 28, 1998, which was opposed by the Appellant on September 15, 2006.\n\n**Proceedings**\n\n* On August 7, 2019, the Deputy Registrar of Trade Marks deemed the opposition to be abandoned under Rule 45(2) of the Trade Marks Rules 2017 and directed that the application would proceed further as per rules.\n* The Appellant filed an appeal against this order before the Intellectual Property Appellate Board, which was later transferred to the Delhi High Court due to the abolition of the IPAB.\n\n**Current Status**\n\nThe appeal has been heard by HON'BLE MR. JUSTICE C. HARI SHANKAR on February 2, 2023, with pleadings completed and arguments heard from both sides.\n\n**Source**: PDF document \"32. Mahesh Gupta v. Registrar of Trade Marks.pdf\"",
      "pdf_source": "32. Mahesh Gupta v. Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "Here is a summary of page 1 from the PDF document \"Mahesh Gupta v. Registrar of Trade Marks.pdf\":\n\n**Case Details**\n\n* Neutral Citation Number: 2023/DHC/001627\n* Case Title: Mahesh Gupta v. Registrar of Trade Marks and Anr.\n\n**Parties Involved**\n\n* Appellant: Mahesh Gupta, represented by Ms. Rajeshwari H. and Ms. Swapnil Gaur\n* Respondents:\n\t+ Registrar of Trademarks (R-1)\n\t+ Another person (R-2), represented by Ms. Swathi Sukumar, Mr. Naveen Nagarjuna, Mr. Pratyush Rao, and Mr. Ritik Raghuvanshi\n\n**Proceedings**\n\n* Opposite number 800324 was filed by respondent 2 on April 28, 1998, for the registration of a device mark.\n* The appellant opposed the application under Section 21 of the Trade Marks Act 1999 on September 15, 2006.\n\n**Source**\n\n* PDF Document: Mahesh Gupta v. Registrar of Trade Marks.pdf ( page 1 of 9)",
          "content": "Neutral Citation Number : 2023/DHC/001627 \nC.A.(COMM.IPD-TM) 143/2022 \n \nPage 1 of 9    \n \n$~1 \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.A.(COMM.IPD-TM) 143/2022 & I.A. 4245/2023 \n \nMAHESH GUPTA \n \n \n \n         ..... Appellant \nThrough: \nMs. \nRajeshwari \nH. \nand  \nMs.Swapnil Gaur, Advs. \n \n \n \n \n \nversus \n \n \nREGISTRAR OF TRADEMARKS AND ANR .... Respondents \nThrough: \nMs. \nSwathi \nSukumar, \nMr. \nNaveen Nagarjuna, Mr. Pratyush Rao and \nMr. Ritik Raghuvanshi, Adv. for R-2 \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C. HARI SHANKAR \n \n \n \n   J U D G M E N T (ORAL) \n% \n \n \n \n  02.03.2023 \n \n1. \nOn 28th April 1998, Respondent 2 filed Application No. 800324 \nfor registration of the device mark \n under class 32 in \nrespect of ―non-alcoholic drinks and beverages aerated water, beer and \nporter, syrups for making beverages essences‖.  \n \n2. \nOn 15th September 2006, the appellant filed an opposition under \nSection 21 of the Trade Marks Act 1999, opposing the request of \nRespondent 2 for registration of the aforesaid device mark. Notice on \nthe opposition was served on the Respondent 2, who filed a counter \nstatement by way of response to the opposition on 15th April 2008.  \nThe date on which the counter statement was served on the appellant \nis not immediately forthcoming. However, it is not in dispute that the \nappellant filed its evidence in support of the opposition under Rule \nDigitally Signed By:SUNIL\nSINGH NEGI\nSigning Date:04.03.2023\n16:11:50\nSignature Not Verified",
          "pdf_source": "32. Mahesh Gupta v. Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "**Case Summary**\n\n**PDF Source:** \"Mahesh Gupta v. Registrar of Trade Marks\" (2023/DHC/001627)\n\nThe appeal is against an order dated August 7, 2019, by the Deputy Registrar of Trade Marks, where the opposition filed by the appellant was deemed to have been abandoned under Rule 45(2) of the Trade Marks Rules 2017.\n\n**Key Facts and Proceedings:**\n\n* The application for extension of time in filing evidence was made on June 11, 2010.\n* The Deputy Registrar held the opposition to be abandoned due to failure to file evidence within the stipulated timeframe.\n* The appellant filed an appeal under Section 91 of the Trade Marks Act before the Intellectual Property Appellate Board (IPAB), which was transferred to the High Court of Delhi after the abolition of IPAB.\n\n**Legal Argument:**\n\n* The issue revolves around the application of Rule 45(2) of the Trade Marks Rules 2017 and whether the opposition can be deemed abandoned due to delayed filing of evidence.",
          "content": "Neutral Citation Number : 2023/DHC/001627 \nC.A.(COMM.IPD-TM) 143/2022 \n \nPage 2 of 9    \n \n50(1)1 of the Trade Marks Rules 2002 (hereinafter referred to as ―the \n2002 Rules‖), on 10th June 2010.  On 11th June 2010, the appellant \nfiled an application for extension of time in filing the evidence in \nsupport of the opposition.  In the application, it was acknowledged \nthat the evidence was filed after a delay of four months, for which \nextension was sought in the application.  \n \n3. \nBy the following order dated 7th August 2019, the Deputy \nRegistrar of Trade Marks held the opposition filed by the appellant to \nbe deemed to have been abandoned under Rule 45(2)2 of the Trade \nMarks Rule 2017 (hereinafter referred to as ―the 2017 Rules‖) and \ndirected that the application would proceed further as per rules.  \n \n4. \nAggrieved thereby, the appellant has preferred the present \nappeal under Section 91 of the Trade Marks Act before the learned \nIntellectual Property Appellate Board (―the learned IPAB‖). \nConsequent to abolition of the learned IPAB by The Tribunals \nReforms Act 2021, the appeal stands transferred to this Court.  \n \n5. \nPleadings in the appeal have been completed and I have heard \nMs. Rajeshwari H., learned Counsel for the appellant and Ms. Swathi \nSukumar, learned Counsel for the Respondent 2 at length on the \nappeal. \n \n6. \n Though there are certain averments in the appeal regarding the \n                                          \n1 50. \nEvidence in support of opposition.— (1) Within two months from services on him of a copy of \nthe counterstatement or within such further period not exceeding one month in the aggregate thereafter as the \nRegistrar may on request allow, the opponent shall either leave with the Registrar, such evidence by way of \naffidavit as he may desire to adduce in support of his opposition or shall intimate to the Registrar and to the \napplicant in writing that he does not desire to adduce evidence in support of his opposition but intends to rely \non the facts stated in the notice of opposition. He shall deliver to the applicant copies of any evidence that he \nleaves with the Registrar under this sub-rule and intimate the Registrar in writing of such delivery. \n2 45. \nEvidence in support of opposition.—  (2) If an opponent takes no action under sub-rule (1) within \nthe time mentioned therein, he shall be deemed to have abandoned his opposition. \nDigitally Signed By:SUNIL\nSINGH NEGI\nSigning Date:04.03.2023\n16:11:50\nSignature Not Verified",
          "pdf_source": "32. Mahesh Gupta v. Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0006",
      "start_index": 3,
      "end_index": 4,
      "summary": "Here's a summary of the given document section:\n\n**Case Overview**\n\nThe case is Mahesh Gupta v. Registrar of Trade Marks & Anr (2023/DHC/001627). The High Court of Delhi is hearing an appeal against the rejection of the appellant's opposition to the registration of a trade mark, on grounds that their objection was considered abandoned.\n\n**Background and Facts**\n\nMahesh Gupta (Appellant) filed an opposition against Registrar of Trade Marks (Respondent) under Rule 50(1) of the 2002 Rules. The application for trade mark registration, counter-statement, and evidence were all filed before the 2017 Rules came into force. Respondent 2 applied for the registration.\n\n**Decision**\n\nThe Court found that the Deputy Registrar erred in law by passing an impugned order under the 2017 Rules when proceedings took place under the 2002 Rules. The repeal of the 2002 Rules (without prejudice to anything done before) cannot affect the applicability of the 2002 Rules regarding evidence filed under Rule 50(1). \n\n**Argument and Ruling**\n\nThe dispute should be examined under Rule 50(1) of the 2002 Rules, which stipulates that if the opponent does not take action within two months + one month extension (allowed by the Registrar), their opposition will be deemed abandoned. The Court concluded that this rule applies to the present case.\n\n**Judgment**\n\nThe matter should be re-examined in light of Rule 50(1) of the 2002 Rules, considering whether the opposition was deemed abandoned due to non-action within specified timelines.\n\nSource: [32. Mahesh Gupta v. Registrar of Trade Marks.pdf](https://www.pmf.org.in/index.php/eCourts/Case-Law-Service)",
      "pdf_source": "32. Mahesh Gupta v. Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "**Summary of Page 3 from PDF: 32. Mahesh Gupta v. Registrar of Trade Marks.pdf**\n\nThis page is part of a Delhi High Court case (2023/DHC/001627) on trademark registration.\n\nThe court notes that:\n\n* The learned Deputy Registrar erred in law by passing an order under the 2017 Rules, which came into force after all previous proceedings.\n* All relevant actions, including opposition and evidence filing, occurred prior to the 2017 Rules' enforcement.\n* Rule 1583 states that the 2002 Rules are repealed \"without prejudice to anything done\" before the 2017 Rules took effect.\n\n**Key points:**\n\n* Case number: C.A.(COMM.IPD-TM) 143/2022\n* Judge's observation on Deputy Registrar's error in law\n* Previous proceedings took place under the 2002 Rules, not 2017 Rules\n* Rule 1583: Repeal of 2002 Rules without prejudice to anything done under them\n\n**Source:** PDF: 32. Mahesh Gupta v. Registrar of Trade Marks",
          "content": "Neutral Citation Number : 2023/DHC/001627 \nC.A.(COMM.IPD-TM) 143/2022 \n \nPage 3 of 9    \n \nmerits of the respondent’s application seeking registration of the  \n device mark and on the merits of the appellant’s \nopposition to such registration, I do not deem it necessary to enter into \nthe meits of the matter, as the appellant’s objection was rejected by the \nlearned Deputy Registrar as abandoned. All that this Court has to see,  \ntherefore, is whether the learned Deputy Registrar was correct in her \ndecision to treat the appellant’s opposition to the application of \nRespondent 2 as abandoned.  \n \n7. \nI may observe, at the very outset, that the learend Deputy \nRegistrar has formally erred in law in passing the impugned order \nunder the 2017 Rules.  All proceedings before the learend Deputy \nRegistrar, save and except for the passing of the impugned order, on \n7th August  2019, took place when the 2002 Rules were in force. The \napplciation seeking registration, the oppostion thereto, the counter \nstatement filed by way of response to the oppositin and the filing of \nthe evidence in support of the opposition by the appellant along with \nthe application seeking condonation of delay, were all prior to coming \ninto force the 2017 Rules; in fact, much prior thereto.  \n \n8. \nRule 1583 of the 2017 Rules, even while repealing the 2002 \nRules, clearly holds that such repeal would be ―without prejudice to \nanything done under such rules before the coming into force of these \nrules‖.  In other words, the repeal of the 2002 Rules by the 2017 Rules \nwould, inter alia, be without prejudice to all proceedings which took \nplace in the present case, including the filing of the evidence in \nsupport of the opposition by the appellant which, admittedly, was \n                                          \n3 158. \nRepeal.— \nThe Trade Marks Rules, 2002, are hereby repealed without prejudice to \nanything done under such rules before the coming into force of these rules. \n \nDigitally Signed By:SUNIL\nSINGH NEGI\nSigning Date:04.03.2023\n16:11:50\nSignature Not Verified",
          "pdf_source": "32. Mahesh Gupta v. Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "Here is a summary of page 4 from the PDF \"32. Mahesh Gupta v. Registrar of Trade Marks.pdf\":\n\n**Case details:** C.A.(COMM.IPD-TM) 143/2022 & I.A. 4245/2023, Neutral Citation Number: 2023/DHC/001627\n\n**Key points:**\n\n1. Rule 50(1) of the 2002 Rules is relevant to the case.\n2. Even though the 2017 Rules have repealed the 2002 Rules, they cannot prejudice the applicability of the 2002 Rules in this matter.\n3. The dispute must be examined under Rule 50(1) of the 2002 Rules.\n\n**Key precedent:**\n\n* Sunrider Corporation, U.S.A. v. Hindustan Lever Ltd (4) (2007) 143 DLT 148: A coordinate Single Bench decision of this Court, cited for its explanation of Rule 50(1).\n\n**Important points in the law:** Under Rule 50(1), if an opponent takes no action within two months of receiving a copy of the counter-statement, they are deemed to have abandoned their opposition.",
          "content": "Neutral Citation Number : 2023/DHC/001627 \nC.A.(COMM.IPD-TM) 143/2022 \n \nPage 4 of 9    \n \nunder Rule 50(1) of the 2002 Rules.  The repeal of the 2002 Rules by \nthe 2017 Rules cannot, therefore, prejudice the applicability of the \n2002 Rules, insofar as the issue of whether the evidence filed by the \nappellant under Rule 50(1) of the 2002 Rules could be taken on \nrecord, is concerned. \n \n9. \nThe dispute has, therefore, to be examined in the light of Rule \n50(1) of the 2002 Rules. What has to be seen, therefore, is whether the \nopposition of the appellant could be treated as having deemed to have \nbeen abandoned by applying Rule 50(1) of the 2002 Rules.    \n \n10. \nA coordinate Single Bench of this Court of Hon’ble Mr. Justice \nBudar Durrez Ahmed, as he then was, has examined this aspect in \ndetail in Sunrider Corporation, U.S.A. v. Hindustan Lever Ltd4. The \nrelevant passages from the said decision may be reproduced thus: \n \n―8. \nReading Rule 50, it is clear that the evidence by way of \naffidavit in support of an opposition to the registration of a trade \nmark has to be filed within two months of the service of a copy of \nthe counter-statement on the opponent. This period of two months \nis further extendable by a period of one month in the aggregate \nthereafter as the Registrar may on request allow. Clearly, in the \nfirst instance, the evidence affidavit has to be filed within two \nmonths of the receipt of a copy of the counter-statement. The \nRegistrar may extend this period by a further one month in the \naggregate if a request for the same is made in time. Sub-rule (2) of \nRule 50 makes it clear that if an opponent takes no action under \nSub-rule (1) within the time mentioned therein, he shall be deemed \nto have abandoned his opposition. It is also interesting to note that \nSub-rule (3) refers to the application for extension of the period of \none month mentioned in Sub-rule (1). It is also stipulated that such \nan application has to be made in Form TM-56 accompanied by the \nprescribed fee before the expiry of the period of two months \nmentioned therein. So, it is clear that a strict regimen has been \nprescribed for the filing of evidence by way of affidavit in support \nof an opposition. A plain reading of the provisions makes it \nabundantly clear that the evidence has to be filed within two \n                                          \n4 (2007) 143 DLT 148 \nDigitally Signed By:SUNIL\nSINGH NEGI\nSigning Date:04.03.2023\n16:11:50\nSignature Not Verified",
          "pdf_source": "32. Mahesh Gupta v. Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0010",
      "start_index": 5,
      "end_index": 7,
      "summary": "Here is a summary of the provided legal document section in 300 words or less:\n\n**Case Details**\n\n* Case Name: Mahesh Gupta v. Registrar of Trade Marks\n* Neutral Citation Number: 2023/DHC/001627\n* C.A.(COMM.IPD-TM) 143/2022\n\n**Context**\n\nThe case is an appeal against the decision of the Registrar of Trade Marks, which deemed an opponent's opposition as abandoned due to non-compliance with Rule 50(1) of the Trade Marks Rules, 2002.\n\n**Legal Arguments**\n\n* The applicant's advocate, Ms. Rajeshwari, relies on a High Court of Gujarat judgment (Wyeth Holdings Corpn. v. Controller General of Patents, Designs and Trade Marks) to argue that Sub-rule (2) of Rule 50 is directory in nature.\n* However, the Delhi High Court declines to accept this view, holding that it would amount to rewriting the applicable statutory provisions.\n* The court notes that Rule 50(1) empowers the Registrar to extend the period only up to one month beyond the initial period of two months, and granting further extensions would be in direct contravention of the rule.\n\n**Decision**\n\nThe Delhi High Court declines to exercise the second option of declaring Sub-rule (2) of Rule 50 as \"directory\" in nature. Instead, it sticks to the view that subordinate legislation cannot travel beyond the scope of main legislation, and therefore Sub-rule (2) can be declared ultra vires the Act.\n\n**PDF Source**\n\nSection: Legal Arguments from Mahesh Gupta v. Registrar of Trade Marks.pdf",
      "pdf_source": "32. Mahesh Gupta v. Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 5",
          "node_id": "0007",
          "start_index": 5,
          "end_index": 5,
          "summary": "Here is a summary of page 5 from the PDF:\n\n**Case:** Mahesh Gupta v. Registrar of Trade Marks\n\n**Court:** High Court of Delhi\n\n**Case Number:** C.A.(COMM.IPD-TM) 143/2022 & I.A. 4245/2023\n\n**Page Summary:**\n\nThe court cites a Supreme Court decision in Sunrider (Emphasis Supplied) that states that evidence affidavits cannot be filed beyond 3 months under Rule 50 of the Trade Marks Rules, 2017.\n\nHowever, Ms. Rajeshwari, counsel for the appellant, seeks to distinguish this decision on two grounds. She relies on a Gujarat High Court judgment in Wyeth Holdings Corpn. v. Controller General of Patents, Designs and Trade Marks (2006 SCC OnLine Guj 620), which holds that Sub-rule (2) of Rule 50 is directory in nature.\n\nThe court considers the argument and observes that the decision in Sunrider does not apply to the instant case, where the opposition proceedings were initiated without a valid reason for delay. The matter remains pending in the court.\n\n**PDF Source:** 32. Mahesh Gupta v. Registrar of Trade Marks.pdf",
          "content": "Neutral Citation Number : 2023/DHC/001627 \nC.A.(COMM.IPD-TM) 143/2022 \n \nPage 5 of 9    \n \nmonths in the first instance and, if an appropriate application for \nextension of time is made before the expiry of the period of two \nmonths and if such application is allowed by the Registrar, then \nlatest by a further month. In other words, under no circumstances \ncan the evidence affidavit be filed beyond the maximum three \nmonths prescribed under the said rule. In case the opponent has \nnot taken steps within the prescribed time, then there is no option \nleft with the Registrar but to deem that the opponent has \nabandoned his opposition.‖ \n(Emphasis Supplied) \n \n11. \nMs. Rajeshwari seeks, however, to distinguish the decision in \nSunrider4 essentially on two grounds.   She relies, in the first instance, \non the judgment of a learned Single Judge of the High Court of \nGujarat in Wyeth Holdings Corpn. v. Controller General of Patents, \nDesigns and Trade Marks5 , which holds, in paras 58 to 60 thus: \n―58.  \nIn view of the nature of the prayer sought for, there is no \nquestion of any alternative remedy being available to the \npetitioners. Having found the submissions made by the learned \nsenior counsel appearing for the petitioners with substance, the \nsame are accepted. There is no question of the petition being  \ndismissed on the ground of alternative remedy being available. \n59.  \nIn view of the aforesaid discussion, in view of the settled \nlegal position that subordinate legislation cannot travel beyond the \nscope of main legislation and having regard to the provisions \nof Section 131 which provides for extension of time, this Court has \nonly two options, either to declare Sub-rule (2) of Rule 50 as ultra \nvirus the Act or by employing principle of 'harmonious \nconstruction', to read Sub-rule (2) of Rule 50 to be a 'directory' one. \n60. \nIn the considered opinion of this Court, there is no reason \nmuch less a compelling reason for which the first option should be \nexercised and the 'Rule' be struck down by holding it to be \n'mandatory'. As against that, it is a well settled position of law that \nprinciple of 'harmonious construction' should be pressed into \nservice and Sub-rule (2) of Rule 50 be read as 'directory'. This \nCourt is of the opinion that by declaring Sub-rule (2) of Rule 50, \n'directory', no injustice or prejudice is going to be caused to any \nparty. On the contrary, it will be serving the interest of justice. \nHence, second option is exercised. Sub-rule (2) of Rule 50 is held \nto be 'directory' in nature.‖ \n \n                                          \n5 2006 SCC OnLine Guj 620 \nDigitally Signed By:SUNIL\nSINGH NEGI\nSigning Date:04.03.2023\n16:11:50\nSignature Not Verified",
          "pdf_source": "32. Mahesh Gupta v. Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "Here is a summary of page 6 of the PDF \"Mahesh Gupta v. Registrar of Trade Marks\":\n\nIn this High Court of Delhi case (2023/DHC/001627 C.A.(COMM.IPD-TM) 143/2022), Mr. Mahesh Gupta (Appellant) is challenging the Registrar of Trademarks and another (Respondents).\n\nContent highlighted on page 6:\n\n* The Supreme Court is not following the view expressed by the High Court of Gujarat in Wyeth, which would rewrite Rule 50(1) of the 2002 Rules.\n* The applicable statutory provision sets a limit of one month beyond two months for an opponent to respond to a counter-statement. Granting further extensions would be contrary to Rule 50(1).\n* Rule 50(2) explicitly states that if an opponent fails to take action within the time period, they shall be deemed to have abandoned their opposition.\n\nSource: Mahesh Gupta v. Registrar of Trade Marks (PDF)\n\nDate range: None mentioned\n\nKey parties:\n\n* Appellant: Mahesh Gupta\n* Respondents: Registrar of Trademarks and another",
          "content": "Neutral Citation Number : 2023/DHC/001627 \nC.A.(COMM.IPD-TM) 143/2022 \n \nPage 6 of 9    \n \n12. \nWyeth5, she submits, was not noticed in Sunrider4.  \n \n13. \nWith greatest respect, I am unable to subscribe to the view \nexpressed by the High Court of Gujarat in Wyeth5. \n \n14. \nTo my mind, the view espoused in para 60 of the decision in \nWyeth5, if accepted, would amount to no less than re-writing of the \napplicable statutory provisions. Rule 50(1) of the 2002 Rules is even \nmore peremptory, in its application, than Rule 48 of the succeeding \n2017 Rules. While providing a period of two months to an opponent \nopposing an application seeking registration of a trade mark file its \nevidence after receipt of the counter-statement of the applicant, Rule \n50(1) empowers the Registrar to extend the said period only upto one \nmonth, specifically using the words ―not exceeding one month‖. The \nwords ―not exceeding one month‖ are mandatory in their import.  The \nlearned Registrar could not, therefore, grant extension of more than \none month beyond the period of two months from the date of service, \non the opponent opposing the registration of a mark, of a copy of the \ncounter statement.  Grant of any further extension would clearly be in \nthe teeth of Rule 50(1). \n \n15. \nRule 50(2) is even clearer in its import.  It states, in \nunambiguous terms, that, if the opponent took no action under Rule \n50(1) within the time period mentioned therein – meaning two months \nextendable by a maximum period of one month – he shall be deemed \nto have abandoned his opposition.  \n \n16. \nDeemed abandonment of the opposition, therefore, follows as \nan inexorable statutory sequitur to the failure, on the part of the \nDigitally Signed By:SUNIL\nSINGH NEGI\nSigning Date:04.03.2023\n16:11:50\nSignature Not Verified",
          "pdf_source": "32. Mahesh Gupta v. Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 7",
          "node_id": "0009",
          "start_index": 7,
          "end_index": 7,
          "summary": "**Summary of Page 7 from PDF: 32. Mahesh Gupta v. Registrar of Trade Marks**\n\nThis page discusses the interpretation of Rule 50(1) of the Trademark Rules, 2002, which deals with the time limit for filing evidence in support of opposition.\n\n* The court holds that deemed abandonment occurs automatically if the opponent fails to file its evidence within a maximum of three months from receipt of the counter-statement.\n* This view is taken to avoid rendering Rule 50(2) otiose (meaning, having no practical effect), as suggested by the opposing party in Wyeth.\n* The court then considers Rule 105 of the 2002 Rules and Section 131(7) of the Trade Marks Act, 1999.\n\n**Key points:**\n\n* Deemed abandonment occurs automatically if evidence is not filed within three months from counter-statement receipt.\n* Rule 50(2) would become otiose if the opposing view in Wyeth were accepted.\n\n**PDF Source:** 32. Mahesh Gupta v. Registrar of Trade Marks.pdf, Neutral Citation Number: 2023/DHC/001627",
          "content": "Neutral Citation Number : 2023/DHC/001627 \nC.A.(COMM.IPD-TM) 143/2022 \n \nPage 7 of 9    \n \nopponent, in filing the evidence in support of the opposition within the \nperiod envisaged in Rule 50(1).  Deemed abandonment, therefore, \noccurs by operation of the statute. Even sans any judicial or quasi-\njudicial order, therefore, if the opponent opposing the application \nseeking grant of the trade mark fails to file its evidence in support of \nthe opposition within a maximum of three months from the receipt, by \nit, of the counter-statement of the trade mark applicant, the opposition \nwould ipso facto be deemed to be abandoned irrespective of whether \nany order to that effect is, or is not, passed by any judicial or quasi-\njudicial forum. \n \n17. \nThe view expressed in Wyeth5, if accepted, would amount to \nrendering largely otiose Rule 50(2) of the 2002 Rules. With respect, \ntherefore, it is not possible to accept the said view.  \n \n18. \nMs. Rajeshwari also sought to place reliance on Rule 1056 of \nthe 2002 Rules read with Section 1317 of the 1999 Act. \n \n19. \nThough these provisions have been considered by the \ncoordinate Bench in Sunrider4, Ms. Rajeshwari advances a \nsubmission which, according to her, was not advanced in Sunrider4 \nand was not, therefore, considered.  She draws attention to the \n                                          \n6 105. \nExtension of time.— \n(1) An application for extension of time under Section 131 (not being \na time expressly provided in the Act or prescribed by Rule 79 or by sub-rule (4) of Rule 80 or a time for the \nextension of which provision is made in the rules) shall be made in Form TM-56. \n(2) Upon an application made under sub-rule (1) the Registrar, if satisfied that the circumstances are such as \nto justify the extension of the time applied for, may, subject to the provisions of the rules where a maximum \ntime limit is prescribed and subject to such conditions as he may think fit to impose, extend the time and \nnotify the parties accordingly and the extension may be granted though the time for doing the act or taking the \nproceeding for which it is applied for has already expired. \n7131.  \nExtension of time.— \n(1) If the Registrar is satisfied, on application made to him in the \nprescribed manner and accompanied by the prescribed fee, that there is sufficient cause for extending the time \nfor doing any act (not being a time expressly provided in this Act), whether the time so specified has expired \nor not, he may, subject to such conditions as he may think fit to impose, extend the time and inform the \nparties accordingly. \n(2) Nothing in sub-section (1) shall be deemed to require the Registrar to hear the parties before disposing of \nan application for extension of time, and no appeal shall lie from any order of the Registrar under this section. \n \nDigitally Signed By:SUNIL\nSINGH NEGI\nSigning Date:04.03.2023\n16:11:50\nSignature Not Verified",
          "pdf_source": "32. Mahesh Gupta v. Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0013",
      "start_index": 8,
      "end_index": 9,
      "summary": "The document is a court decision from Case No. C.A.(COMM.IPD-TM) 143/2022, Mahesh Gupta vs Registrar of Trade Marks & Anr., Neutral Citation Number: 2023/DHC/001627.\n\n**Background:** Mahesh Gupta filed an appeal against the order of the Deputy Registrar dated August 7, 2019, deeming his opposition to be abandoned in a trade mark case.\n\n**Arguments:** Ms. Rajeshwari, Counsel for Appellant Mahesh Gupta, argued that the provision for deemed abandonment under Rule 105(1) was restricted to cases where time was provided in the Act or prescribed by rule (79 or 80(4)). However, this argument was rejected as the words \"or a time for the extension of which provision is made in the rules\" included Rule 50(1), which provides for an extension of time.\n\n**Decisions:**\n\n* The court agreed with the views expressed in Sunrider (a coordinate Bench decision) on all aspects.\n* The Deputy Registrar's order deeming the opposition abandoned was upheld, subject to a modification that it was under Rule 50(1) of the 2002 Rules, not Rule 45(1) of the 2017 Rules.\n* The appeal was dismissed.\n\n**Key Dates:**\n\n* August 7, 2019: Deputy Registrar's order deeming opposition abandoned\n* March 2, 2023: Court's decision upholding the impugned order\n\n**Note:** This summary is based on the PDF document \"Mahesh Gupta v. Registrar of Trade Marks.pdf\".",
      "pdf_source": "32. Mahesh Gupta v. Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 8",
          "node_id": "0011",
          "start_index": 8,
          "end_index": 8,
          "summary": "Here is a summary of page 8 from the provided PDF (Mahesh Gupta v. Registrar of Trade Marks):\n\nThe court examines the implication of \"parenthesized words\" in Rule 105(1) of the trade mark rules. Ms. Rajeshwari argues that these words restrict inflexibility to cases where time is provided in the Act or prescribed by Rule 79 or Rule 80(4). The court finds this submission unacceptable as the parentheses also include \"or a time for the extension of which provision is made in the rules\", which refers to Rule 50(1) that provides for the extension of time.\n\nThe court notes that the provision for extension of time in Rule 50(1) curtails the maximum period by which such extension could be granted to one month. This rules out the applicability of Rule 105 to the case. The court also cites a previous decision (Sunrider) on the same issue, expressing respect and concurrence with its views.\n\nThe ultimate decision in this case is based on the deemed abandonment of the opposition under Rule 50(1) of the 2002 Rules, not Rule 45(1) of the 2017 Rules. \n\nSource: Mahesh Gupta v. Registrar of Trade Marks (2023/DHC/001627)\nPDF location: (provided in original question)",
          "content": "Neutral Citation Number : 2023/DHC/001627 \nC.A.(COMM.IPD-TM) 143/2022 \n \nPage 8 of 9    \n \nparenthesized words in Rule 105(1) reading ―not being a time \nexpressly provided in the Act or prescribed by rule 79 or by sub-rule \n(4) of rule 80 or a time for the extension of which provision is made in \nthe rules‖. According to Ms. Rajeshwari, the import of the afore-\nextracted parenthesized words in Rule 105(1) was to restrict the \ninflexibility of the provision only to cases where the time was \nprovided in the Act or prescribed by Rule 79 or Rule 80(4).   \n \n20. \nThe submission is obviously unacceptable, as the parentheses \nalso include the words ―or a time for the extension of which provision \nis made in the rules‖. As already noted, Rule 50(1) provides for \nextension of time and curtails the maximum period by which such \nextension could be granted to one month.  The provision for extension \nof time as contained in Rule 50(1), therefore, rules out the \napplicability of Rule 105 to the facts of the present case.  \n \n21. \nOn all other aspects, the coordinate Bench in Sunrider4, having \nexamined the issue in law in detail, this Bench does not deem it \nnecessary to reinvent the wheel. I express my respectful concurrence \nwith the views expressed in the passages from Sunrider4 extracted \nhereinabove which, unfortunately for the appellant, cover the case \nagainst it on all fours.  \n \n22. \nI see no reason, therefore, to differ with the ultimate decision, of \nthe Deputy Registrar, to deem the opposition of the appellant as \nhaving been abandoned.  The deemed abandonment would, however, \nbe under Rule 50(1) of the 2002 Rules, and not Rule 45(1) of the 2017 \nRules.  \n \nDigitally Signed By:SUNIL\nSINGH NEGI\nSigning Date:04.03.2023\n16:11:50\nSignature Not Verified",
          "pdf_source": "32. Mahesh Gupta v. Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 9",
          "node_id": "0012",
          "start_index": 9,
          "end_index": 9,
          "summary": "Here is a summary of page 9 from the PDF \"32. Mahesh Gupta v. Registrar of Trade Marks.pdf\":\n\nThe order by the High Court of Delhi at New Delhi, dated March 2, 2023, in C.A.(COMM.IPD-TM) 143/2022 and I.A. 4245/2023, is being finalized.\n\n**Key facts and decisions:**\n\n* The impugned order dated August 7, 2019, is upheld subject to a modification.\n* The appeal is dismissed.\n* Justice C. Hari Shankar delivers the judgment on March 2, 2023.\n* Digitally signed by Judge Sunil Singh Negi on March 4, 2023.\n\n**PDF source:** \"32. Mahesh Gupta v. Registrar of Trade Marks.pdf\"",
          "content": "Neutral Citation Number : 2023/DHC/001627 \nC.A.(COMM.IPD-TM) 143/2022 \n \nPage 9 of 9    \n \n23. \nSubject to that modification, the impugned order dated 7th \nAugust 2019 is, therefore, upheld.  \n \n24. \nThe appeal is dismissed. \n \n \n \nC. HARI SHANKAR, J. \n \nMARCH 2, 2023 \n \ndsn \n \nDigitally Signed By:SUNIL\nSINGH NEGI\nSigning Date:04.03.2023\n16:11:50\nSignature Not Verified",
          "pdf_source": "32. Mahesh Gupta v. Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-16T13:15:10.735267",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}