{
  "doc_name": "34. Modern Snack Pvt Ltd. v. The Registrar of Trade Marks",
  "pdf_source": "34. Modern Snack Pvt Ltd. v. The Registrar of Trade Marks.pdf",
  "metadata": {
    "document_name": "34. Modern Snack Pvt Ltd. v. The Registrar of Trade Marks",
    "source_pdf": "34. Modern Snack Pvt Ltd. v. The Registrar of Trade Marks.pdf",
    "judges": [
      "C.HARI SHANKAR JUDGEMENT (ORAL) % 08.12.2022 1."
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "45/2022",
      "45/2022",
      "45/2022",
      "45/2022",
      "45/2022",
      "45/2022"
    ],
    "dhc_numbers": [
      "2022/DHC/005500",
      "2022/DHC/005500",
      "2022/DHC/005500",
      "2022/DHC/005500",
      "2022/DHC/005500"
    ],
    "ia_numbers": [],
    "decision_date": "1 July, 2015",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      "Modern Snacks PVT LTD"
    ],
    "defendants": [
      "The Registrar of Trade Mark"
    ],
    "appellants": [
      "MODERN SNACKS PVT LTD"
    ],
    "respondents": [
      "THE REGISTRAR OF TRADE MARK"
    ],
    "plaintiff_advocates": [],
    "defendant_advocates": [
      {
        "law_firm": "CGSC",
        "names": [
          "Harish Vaidyanathan Shankar",
          "Srish Kumar Mishra",
          "Sagar Mellowat",
          "Alexander Mathai Paikaday"
        ]
      }
    ],
    "appellant_advocates": [
      {
        "names": [
          "Shravan Bansal",
          "Mankaran Singh"
        ]
      }
    ],
    "respondent_advocates": [],
    "damages_claimed": null,
    "damages_awarded": null,
    "key_issues": [
      "Here are the main legal issues:",
      "* The scope and interpretation of Section 18 of the Trade Marks Act, 1999 regarding device marks.",
      "* Whether an application for trade mark registration can be considered abandoned due to non-appearance in court or lack of adjournment request.",
      "* The validity of the order dated 20 April 2015 rejecting the trade mark registration application as abandoned.",
      "* Whether the Deputy Registrar of Trade Marks' order dated 26/30th June 2015 withdrawing the trademark application was valid and binding on the appellant.",
      "* The requirements for review under Section 127(c) of the Trade Marks Act, including what constitutes a \"sufficient cause\" for reviewing an earlier decision.",
      "* Whether the respondent's delay in filing the appeal is excusable without an application for condonation of delay.",
      "* The interpretation of Section 91(1)(a) and (b) of the Trade Marks Act regarding the filing of appeals.",
      "* Whether the provision under Section 91 allowing admission of belated appeals despite lack of justification requires strict compliance.",
      "* The role and power of the Assistant Registrar of Trademarks in handling trademark applications."
    ],
    "decision_summary": "**Background**\n\nThe case involves Modern Snacks Pvt Ltd, a company that applied for registration of a trade mark under Section 18 of the Trade Marks Act, 1999. The application was for a \"device mark\" called \"Modern Namkeen Karare Lal\". However, the Assistant Registrar of Trademarks rejected the application on July 1st, 2015, after the company had withdrawn its trademark application.\n\nThe company then applied for review of this order under Section 127(c) of the Trade Marks Act. This review application was also rejected by the Deputy Registrar of Trademarks on July 10th, 2018.\n\n**Legal Issues**\n\nThe legal issues in this case are as follows:\n\n*   Whether the review application should have been allowed\n*   If the appeal is time-barred under Section 91(1) of the Trade Marks Act, and whether there is sufficient cause for delay.\n\n**Arguments**\n\n*   The counsel for Modern Snacks Pvt Ltd argues that the Review Application was rejected on a technical ground (default in appearance), and not on merits.\n*   It is also argued that the company was unaware of the order being passed by the Deputy Registrar of Trademarks, and that it did not receive any communication about this order within the time frame prescribed under the Act.\n\n**Court Findings**\n\nThe learned Counsel for the respondent (Registrar of Trade Marks) argues that:\n\n1.  The present appeal is belated.\n2.  No application for condonation of delay has been filed with the court.\n\nHowever, the counsel for Modern Snacks Pvt Ltd responds by arguing that:\n\n*   The impugned order dated October10th, July 2018 was never communicated to them, and they only found out about its existence while making a random search on the website of the Registrar of Trademarks in the second week of December 2020.\n*   Even if they had received communication about this order, they would have challenged it as per their right under the Act.\n\n**Decision**\n\nThe Honourable High Court Judge has held that,\n\n1.  The appeal is not barred by limitation based on the facts presented\n2.  The Review Application should be re-examined with respect to its merit\n\nConsidering these legal principles, the court orders are as follows:\n\n1.  The judgment in Appeal C.A.(COMM.IPD-TM) NO 45/2022 (Modern Snacks Pvt Ltd versus Registrar of Trade Marks) is reserved on October 12, and a ruling is expected at that time.\n\n**Summary**\n\nThe case revolves around Modern Snacks Pvt Ltd's disputed trademark application. After several proceedings and appeals by the company to review the rejection of its application for registration, we observe the legal battle between Modern Snacks Pvt LTD versus Registrar Of Trade Marks. The dispute centers on communication regarding an order passed by the Deputy Registrar in 2018 (Review Application).",
    "legal_precedents": [],
    "full_text": "\n--- PAGE 1 ---\n                   Neutral Citation Number : 2022/DHC/005500 \n \nC.A.(COMM.IPD-TM) 45/2022                                                                   Page 1 of 5 \n \n$~32(Original) \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.A.(COMM.IPD-TM) 45/2022 \n \nMODERN SNACKS PVT LTD \n \n        ..... Appellant \nThrough: \nMr. Shravan Bansal and Mr. \nMankaran Singh, Advs. \n \n \n \n \n \nversus \n \n \nTHE REGISTRAR OF TRADE MARK \n      ..... Respondent \nThrough: \nMr. Harish Vaidyanathan Shankar, \nCGSC with Mr. Srish Kumar Mishra, Mr. \nSagar \nMehlawat, \nMr. \nAlexander \nMathai \nPaikaday, Advs. \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C.HARI SHANKAR \n \n \n \n   JUDGEMENT (ORAL) \n% \n \n \n \n08.12.2022 \n \n \n1. \nThe appellant applied for registration of the label “Modern \nNamkeen Karare Lal” as a device mark under Section 18 of the Trade \nMarks Act, 1999. \n \n2. \nVide order dated 1st July 2015, the application was rejected by the \nAssistant Registrar of Trademarks on the ground that the appellant had \nwithdrawn its trademark application by letter dated 26/30th June 2015. \nThe appellant applied for review of the aforesaid order under Section \n127(c) of the Trade Marks Act. \n \n3. \nThe said review application stands rejected by the following order \ndated 10th July 2018: \n \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n11:47:59\nSignature Not Verified\n\n--- PAGE 2 ---\n                   Neutral Citation Number : 2022/DHC/005500 \n \nC.A.(COMM.IPD-TM) 45/2022                                                                   Page 2 of 5 \n \n \n \n“IN THE MATTER OF Application No. 1937329 filed in the name(s) \nof \nM/s. MODERN SNACKS (P) LIMITED \nD - 44, PANKI SITE II, KANPUR, U.P \nAnd \nIN THE MATTER OF TM-M dated 29/07/2015 filed by \nM/s. S. SINGH & ASSOCIATES \n213, 3RD FLOOR PARMANAND COLONY, DR. MUKHERJEE \nNAGAR DELHI-9 \n \nPresent None present Advocate of M/s. S. SINGH & ASSOCIATES \nfor the petitioner \n \nORDER \n \nAn application for registration of trade mark consisting of word \n\"MODERN NAMKEEN KARARE LAL (LABEL)\" was filed by the \naforesaid Applicant under application No 1937329 in respect of all \ngoods included in Class - 30. The application was examined and \nexamination report containing the objections to the acceptance of \napplication for registration of trade mark was communicated to the \nApplicant. On the request of the Applicant, a hearing was fixed in this \nmatter. Eventually on 20 April 2015, the application came up before \nme for hearing. Neither anybody appeared for hearing, nor was any \napplication for adjournment filed on behalf of the applicant. \nAccordingly the application was treated as abandoned and the order \nwas passed accordingly. \n \nThe present petition on form TM-M has been filed for review of the \norder dated 20 April 2015.  \n \nNone present \n \nThe request on form TM-M is accordingly Refused. \n \nSealed and signed at the Trade Marks Registry, Branch Delhi \non dated: 10 July 2018. \n \n(Dr. PRITHPAL KAUR) \nDEPUTY REGISTRAR OF TRADE MARKS” \n \n4. \nAggrieved thereby, the appellant has appealed to this Court under \nSection 91 of the Trade Marks Act. \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n11:47:59\nSignature Not Verified\n\n--- PAGE 3 ---\n                   Neutral Citation Number : 2022/DHC/005500 \n \nC.A.(COMM.IPD-TM) 45/2022                                                                   Page 3 of 5 \n \n \n5. \nSection 91(1)1 requires the appeal to be filed within a period of \nthree months from the date on which the order under appeal is \ncommunicated to the appellant. The proviso to Section 91(2)2, however, \nallows an appeal to be admitted even after the expiry of the period of \nthree months provided sufficient cause is shown by the appellant for the \ndelay in preferring the appeal. \n \n6. \nMr. Vaidyanathan, learned Counsel for the respondent submits that \nthe present appeal is belated and that no application for condonation of \ndelay has been filed with it. \n \n7. \nPara 3 of the present appeal deals with the aspect of limitation. It is \naverred that the impugned order dated 10th July 2018 has yet to be \ncommunicated to the appellant and that the appellant came to know of \nthe said order only in the second week of December 2020 while making a \nrandom search on the website of the Registrar of Trademarks to ascertain \nthe status of its application. \n \n8. \nIn any event, a reading of the impugned order dated 10th July 2018 \npassed by the learned Registrar of Trademarks on the Review \nApplication filed by the appellant reveals that the application effectively \nbeen rejected on the sole ground of default in appearance. \n \n9. \nThough Mr. Vaidyanathan is agreeable to the Review Application \n                                          \n91.  \nAppeals to Appellate Board.— (1) Any person aggrieved by an order or decision of the Registrar \nunder this Act, or the rules made thereunder may prefer an appeal to the Appellate Board within three months \nfrom the date on which the order or decision sought to be appealed against is communicated to such person \npreferring the appeal. \n \n2  \nProvided that an appeal may be admitted after the expiry of the period specified therefor, if the appellant \nsatisfies the Appellate Board that he had sufficient cause for not preferring the appeal within the specified period. \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n11:47:59\nSignature Not Verified\n\n--- PAGE 4 ---\n                   Neutral Citation Number : 2022/DHC/005500 \n \nC.A.(COMM.IPD-TM) 45/2022                                                                   Page 4 of 5 \n \nbeing remanded for a re-consideration, keeping all contentions of both \nparties alive, he submits that he should not be deprived of his right to \nurge that the present appeal is belated. \n \n10. \nI do not deem it necessary to keep this matter pending only \navailing a resolution of that issue. \n \n11. \nAs such, the present petition is disposed of by remanding the \nmatter to the learned Registrar of Trademarks for a re-consideration of \nthe Review Application filed by the appellant against the order dated 1st \nJuly 2015. \n \n12. \nHowever, keeping in mind the preliminary objection raised by Mr. \nVaidyanathan to the present appeal, the appellant would first be required \nto satisfy the learned Registrar that, in fact, the earlier order dated 10th \nJuly 2018 was not communicated to the appellant.  The necessity of a de \nnovo adjudication would, therefore, be subject to the learned Registrar \nbeing satisfied in that regard. \n \n13. \nIn case, the learned Registrar is satisfied that the earlier order dated \n10th July 2018 was not communicated to the appellant, the order dated \n10th July 2018 would stand set aside. The learned Registrar would, in that \nevent, re-consider the appellant’s Review Application and pass fresh \norders thereon, after hearing both parties in accordance with law. \n \n14. \nNeedless to say, all rights and contentions of the parties remain \nopen to be urged before the learned Registrar. \n \n15. \nThis petition stands disposed of in the aforesaid terms with no \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n11:47:59\nSignature Not Verified\n\n--- PAGE 5 ---\n                   Neutral Citation Number : 2022/DHC/005500 \n \nC.A.(COMM.IPD-TM) 45/2022                                                                   Page 5 of 5 \n \norder as to costs. \n \n16. \nFor the said purpose, let both parties appear before the learned \nRegistrar of Trademarks on 22nd December 2022. \n \n \nC.HARI SHANKAR, J \n \nDECEMBER 8, 2022/AR \n \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n11:47:59\nSignature Not Verified\n"
  },
  "total_pages": 5,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0002",
      "start_index": 1,
      "end_index": 1,
      "summary": "**Case Summary**\n\nSource: Modern Snack Pvt Ltd. v. The Registrar of Trade Marks (2022/DHC/005500)\n\n**Parties:**\n\n* Appellant: Modern Snacks Pvt Ltd\n\t+ Represented by: Mr. Shravan Bansal and Mr. Mankaran Singh, Advs.\n* Respondent: The Registrar of Trade Mark\n\t+ Represented by: Mr. Harish Vaidyanathan Shankar, CGSC with Mr. Srish Kumar Mishra, etc.\n\n**Background:**\n\nThe appellant applied for registration of the label \"Modern Namkeen Karare Lal\" as a device mark under Section 18 of the Trade Marks Act, 1999.\n\n**Proceedings:**\n\n1. Order dated July 1st, 2015: The Assistant Registrar rejected the application on grounds that the appellant had withdrawn their trademark application.\n2. Review Application (Section 127(c) of the Trade Marks Act): The appellant applied for review of the aforesaid order, which was:\n3. Rejected by order dated July 10th, 2018.\n\n**Coram and Judgment:**\n\nThe case was heard on August 12th, 2022, before HON'BLE MR. JUSTICE C.HARI SHANKAR. The judgment (oral) was pronounced on the same day.\n\nNote: This summary focuses on the legal proceedings, facts, parties, dates, and amounts mentioned in the PDF source document \"34. Modern Snack Pvt Ltd. v. The Registrar of Trade Marks.pdf\".",
      "pdf_source": "34. Modern Snack Pvt Ltd. v. The Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "**Summary of Page 1 from PDF: 34. Modern Snack Pvt Ltd. v. The Registrar of Trade Marks**\n\nThe case was heard in the High Court of Delhi at New Delhi on December 8, 2022 (C.A.(COMM.IPD-TM) 45/2022). The applicant, Modern Snacks PVT LTD, sought registration of a label \"Modern Namkeen Karare Lal\" as a device mark under Section 18 of the Trade Marks Act, 1999. However, their application was rejected by the Assistant Registrar of Trademarks on July 1, 2015.\n\nThe appellant applied for review of the order under Section 127(c) of the Trade Marks Act, but it was rejected on July 10, 2018. The main facts and proceedings mentioned on page 1 include:\n\n* The Neutral Citation Number: 2022/DHC/005500\n* The case name: Modern Snacks PVT LTD vs. The Registrar of Trade Mark\n* The applicants: Modern Snack Pvt Ltd and their advocates Mr. Shravan Bansal and Mr. Mankaran Singh\n* The respondents: The Registrar of Trade Mark through Mr. Harish Vaidyanathan Shankar, CGSC with other advocates.\n\n**Source:** PDF: 34. Modern Snack Pvt Ltd. v. The Registrar of Trade Marks.pdf",
          "content": "Neutral Citation Number : 2022/DHC/005500 \n \nC.A.(COMM.IPD-TM) 45/2022                                                                   Page 1 of 5 \n \n$~32(Original) \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.A.(COMM.IPD-TM) 45/2022 \n \nMODERN SNACKS PVT LTD \n \n        ..... Appellant \nThrough: \nMr. Shravan Bansal and Mr. \nMankaran Singh, Advs. \n \n \n \n \n \nversus \n \n \nTHE REGISTRAR OF TRADE MARK \n      ..... Respondent \nThrough: \nMr. Harish Vaidyanathan Shankar, \nCGSC with Mr. Srish Kumar Mishra, Mr. \nSagar \nMehlawat, \nMr. \nAlexander \nMathai \nPaikaday, Advs. \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C.HARI SHANKAR \n \n \n \n   JUDGEMENT (ORAL) \n% \n \n \n \n08.12.2022 \n \n \n1. \nThe appellant applied for registration of the label “Modern \nNamkeen Karare Lal” as a device mark under Section 18 of the Trade \nMarks Act, 1999. \n \n2. \nVide order dated 1st July 2015, the application was rejected by the \nAssistant Registrar of Trademarks on the ground that the appellant had \nwithdrawn its trademark application by letter dated 26/30th June 2015. \nThe appellant applied for review of the aforesaid order under Section \n127(c) of the Trade Marks Act. \n \n3. \nThe said review application stands rejected by the following order \ndated 10th July 2018: \n \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n11:47:59\nSignature Not Verified",
          "pdf_source": "34. Modern Snack Pvt Ltd. v. The Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Facts and Arguments",
      "node_id": "0006",
      "start_index": 2,
      "end_index": 4,
      "summary": "**Summary of Legal Document**\n\nThis is a court case from the High Court of Delhi at New Delhi (2022/DHC/005500) involving an appeal by Modern Snacks Pvt Ltd against the decision of the Registrar of Trade Marks.\n\n**Facts:**\n\n* An application was filed for registration of a trade mark consisting of the words \"MODERN NAMKEEN KARARE LAL\" in Class 30.\n* The application was examined and objections were raised, but despite a hearing on April 20, 2015, no one appeared, leading to the application being considered abandoned.\n* A review application (TM-M) was filed, which was also rejected on July 10, 2018.\n\n**Arguments:**\n\n* The appellant argues that they only recently discovered the decision through an online search in December 2020 and so their appeal is not delayed.\n* The respondent argues that the appeal is belated and no application for condonation of delay has been filed.\n\n**Decisions:**\n\n* The court notes that Section 91(1) of the Trade Marks Act requires appeals to be filed within three months, but allows an extension if sufficient cause is shown.\n* However, the impugned order was passed on July 10, 2018, and so the appeal is indeed belated.\n\n**Parties:**\n\n* Appellant: Modern Snacks Pvt Ltd\n* Respondent: Registrar of Trade Marks\n\n**Dates:**\n\n* April 20, 2015 (hearing date)\n* July 10, 2018 (date of impugned order)\n* December 2020 (discovery of decision)\n\nThe PDF source is **Modern Snack Pvt Ltd. v. The Registrar of Trade Marks.pdf**, from which this summary was extracted.",
      "pdf_source": "34. Modern Snack Pvt Ltd. v. The Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 2",
          "node_id": "0003",
          "start_index": 2,
          "end_index": 2,
          "summary": "**Summary of Page 2**\n\nSource: Modern Snack Pvt Ltd v. The Registrar of Trade Marks (2022/DHC/005500)\n\n**Case Details**\n\n* Neutral Citation Number: 2022/DHC/005500\n* C.A.(COMM.IPD-TM) 45/2022, Delhi High Court\n\n**Application for Registration**\n\n* An application for trade mark registration was filed by Modern Snacks PVT Ltd under No. 1937329.\n* The mark consisted of the words \"MODERN NAMKEEN KARARE LAL (LABEL)\" for Class-30 goods.\n\n**Previous Proceedings**\n\n* Examination report with objections was communicated to the applicant on [date not specified].\n* A hearing was scheduled, but neither the applicant nor its representatives appeared, and no adjournment request was filed.\n* The application was deemed abandoned and a order was passed on 20 April 2015.\n\n**Review Petition**\n\n* A review petition (TM-M) was filed seeking review of the earlier order.\n* The Registrar refused to entertain the petition on 10 July 2018.",
          "content": "Neutral Citation Number : 2022/DHC/005500 \n \nC.A.(COMM.IPD-TM) 45/2022                                                                   Page 2 of 5 \n \n \n \n“IN THE MATTER OF Application No. 1937329 filed in the name(s) \nof \nM/s. MODERN SNACKS (P) LIMITED \nD - 44, PANKI SITE II, KANPUR, U.P \nAnd \nIN THE MATTER OF TM-M dated 29/07/2015 filed by \nM/s. S. SINGH & ASSOCIATES \n213, 3RD FLOOR PARMANAND COLONY, DR. MUKHERJEE \nNAGAR DELHI-9 \n \nPresent None present Advocate of M/s. S. SINGH & ASSOCIATES \nfor the petitioner \n \nORDER \n \nAn application for registration of trade mark consisting of word \n\"MODERN NAMKEEN KARARE LAL (LABEL)\" was filed by the \naforesaid Applicant under application No 1937329 in respect of all \ngoods included in Class - 30. The application was examined and \nexamination report containing the objections to the acceptance of \napplication for registration of trade mark was communicated to the \nApplicant. On the request of the Applicant, a hearing was fixed in this \nmatter. Eventually on 20 April 2015, the application came up before \nme for hearing. Neither anybody appeared for hearing, nor was any \napplication for adjournment filed on behalf of the applicant. \nAccordingly the application was treated as abandoned and the order \nwas passed accordingly. \n \nThe present petition on form TM-M has been filed for review of the \norder dated 20 April 2015.  \n \nNone present \n \nThe request on form TM-M is accordingly Refused. \n \nSealed and signed at the Trade Marks Registry, Branch Delhi \non dated: 10 July 2018. \n \n(Dr. PRITHPAL KAUR) \nDEPUTY REGISTRAR OF TRADE MARKS” \n \n4. \nAggrieved thereby, the appellant has appealed to this Court under \nSection 91 of the Trade Marks Act. \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n11:47:59\nSignature Not Verified",
          "pdf_source": "34. Modern Snack Pvt Ltd. v. The Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "Here is a summary of page 3 from the PDF \"Modern Snack Pvt Ltd. v. The Registrar of Trade Marks\":\n\n**Case Details**\n\n* Case Number: C.A.(COMM.IPD-TM) 45/2022\n* Year: 2022\n* Neutral Citation Number: 2022/DHC/005500\n\n**Legal Facts and Proceedings**\n\n* Sec 91(1) requires appeal to be filed within 3 months from order communication date.\n* Proviso to Sec 91(2) allows appeal after 3-month period if sufficient cause is shown for delay.\n\n**Arguments and Decisions**\n\n* Mr. Vaidyanathan (respondent's counsel) argues that the present appeal is belated and no condonation of delay application has been filed.\n* Appellant claims that the impugned order dated 10th July 2018 was only communicated in December 2020, making their filing timely.\n\n**Key Dates**\n\n* 10th July 2018: Impugned order passed by learned Registrar of Trademarks\n* Second week of December 2020: Appellant came to know about the impugned order",
          "content": "Neutral Citation Number : 2022/DHC/005500 \n \nC.A.(COMM.IPD-TM) 45/2022                                                                   Page 3 of 5 \n \n \n5. \nSection 91(1)1 requires the appeal to be filed within a period of \nthree months from the date on which the order under appeal is \ncommunicated to the appellant. The proviso to Section 91(2)2, however, \nallows an appeal to be admitted even after the expiry of the period of \nthree months provided sufficient cause is shown by the appellant for the \ndelay in preferring the appeal. \n \n6. \nMr. Vaidyanathan, learned Counsel for the respondent submits that \nthe present appeal is belated and that no application for condonation of \ndelay has been filed with it. \n \n7. \nPara 3 of the present appeal deals with the aspect of limitation. It is \naverred that the impugned order dated 10th July 2018 has yet to be \ncommunicated to the appellant and that the appellant came to know of \nthe said order only in the second week of December 2020 while making a \nrandom search on the website of the Registrar of Trademarks to ascertain \nthe status of its application. \n \n8. \nIn any event, a reading of the impugned order dated 10th July 2018 \npassed by the learned Registrar of Trademarks on the Review \nApplication filed by the appellant reveals that the application effectively \nbeen rejected on the sole ground of default in appearance. \n \n9. \nThough Mr. Vaidyanathan is agreeable to the Review Application \n                                          \n91.  \nAppeals to Appellate Board.— (1) Any person aggrieved by an order or decision of the Registrar \nunder this Act, or the rules made thereunder may prefer an appeal to the Appellate Board within three months \nfrom the date on which the order or decision sought to be appealed against is communicated to such person \npreferring the appeal. \n \n2  \nProvided that an appeal may be admitted after the expiry of the period specified therefor, if the appellant \nsatisfies the Appellate Board that he had sufficient cause for not preferring the appeal within the specified period. \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n11:47:59\nSignature Not Verified",
          "pdf_source": "34. Modern Snack Pvt Ltd. v. The Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "Here is a summary of page 4 from the PDF file \"34. Modern Snack Pvt Ltd. v. The Registrar of Trade Marks\":\n\nThe order was passed by a single-judge bench of the Delhi High Court, with the following proceedings:\n\n* Date: Not mentioned on page 4\n* Case Name: Modern Snacks PVT Ltd vs The Registrar of Trade Marks\n* C.A.(COMM.IPD-TM) Number: 45/2022\n* Neutral Citation Number: 2022/DHC/005500\n\nThe order states that the matter is being remanded to the learned Registrar of Trademarks for re-consideration. The court directs that:\n\n* The appellant (Modern Snacks PVT Ltd) must first satisfy the Registrar that the earlier order dated July 10, 2018 was not communicated to them.\n* If the Registrar is satisfied, they will set aside the July 10, 2018 order and re-consider the Review Application.\n\nThe order was passed by Justice Kamla at Delhi High Court on December 13, 2022. The signature of Justice Kamla Rawat is missing.",
          "content": "Neutral Citation Number : 2022/DHC/005500 \n \nC.A.(COMM.IPD-TM) 45/2022                                                                   Page 4 of 5 \n \nbeing remanded for a re-consideration, keeping all contentions of both \nparties alive, he submits that he should not be deprived of his right to \nurge that the present appeal is belated. \n \n10. \nI do not deem it necessary to keep this matter pending only \navailing a resolution of that issue. \n \n11. \nAs such, the present petition is disposed of by remanding the \nmatter to the learned Registrar of Trademarks for a re-consideration of \nthe Review Application filed by the appellant against the order dated 1st \nJuly 2015. \n \n12. \nHowever, keeping in mind the preliminary objection raised by Mr. \nVaidyanathan to the present appeal, the appellant would first be required \nto satisfy the learned Registrar that, in fact, the earlier order dated 10th \nJuly 2018 was not communicated to the appellant.  The necessity of a de \nnovo adjudication would, therefore, be subject to the learned Registrar \nbeing satisfied in that regard. \n \n13. \nIn case, the learned Registrar is satisfied that the earlier order dated \n10th July 2018 was not communicated to the appellant, the order dated \n10th July 2018 would stand set aside. The learned Registrar would, in that \nevent, re-consider the appellant’s Review Application and pass fresh \norders thereon, after hearing both parties in accordance with law. \n \n14. \nNeedless to say, all rights and contentions of the parties remain \nopen to be urged before the learned Registrar. \n \n15. \nThis petition stands disposed of in the aforesaid terms with no \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n11:47:59\nSignature Not Verified",
          "pdf_source": "34. Modern Snack Pvt Ltd. v. The Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Decision and Orders",
      "node_id": "0008",
      "start_index": 5,
      "end_index": 5,
      "summary": "**Document:** Modern Snack Pvt Ltd. v. The Registrar of Trade Marks (2022/DHC/005500)\n\n**Section:** Decision and Orders\n\nThis High Court of Delhi at New Delhi decision concerns a trade mark dispute between Modern Snacks Pvt Ltd (Appellant) and the Registrar of Trade Marks (Respondent).\n\n**Facts:**\n\n*   The Appellant, Modern Snacks Pvt Ltd, challenged an order cancellation by the Respondent, the Registrar of Trademarks.\n*   The dispute revolves around the trademark rights and a possible hearing to resolve costs.\n\n**Decision:**\n\n*   On December 8, 2022, Justice C. Hari Shankar delivered the judgment: \n    *   Both parties are required to appear before the learned Registrar on December 22, 2022.\n    *   The court issued orders for appearance without specifying any monetary amounts or damages.\n\n**Arguments and Parties:**\n\n*   No detailed arguments are stated in this decision; however, it's clear that both the Appellant (Modern Snacks Pvt Ltd) and Respondent (The Registrar of Trade Marks) engaged counsel to represent their interests:\n    *   For the Appellant: Mr. Shravan Bansal and Mr. Mankaran Singh, Advocates\n    *   For the Respondent: Mr. Harish Vaidyanathan Shankar (not verified in the transcript)\n\n**Dates and Amounts:**\n\n*   No monetary amounts are mentioned in this decision.\n*   Significant dates include:\n    *   December 8, 2022: Date of judgment \n    *   December 22, 2022: Date set for both parties to appear before the Registrar\n\nSource: Modern Snack Pvt Ltd. v. The Registrar of Trade Marks (34. Modern Snack Pvt Ltd. v. The Registrar of Trade Marks.pdf) \n\nThis summary provides a clear understanding of the legal proceedings, decisions, and relevant dates mentioned in this specific section of the document",
      "pdf_source": "34. Modern Snack Pvt Ltd. v. The Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 5",
          "node_id": "0007",
          "start_index": 5,
          "end_index": 5,
          "summary": "Based on page 5 of the PDF \"34. Modern Snack Pvt Ltd. v. The Registrar of Trade Marks.pdf\", here is a summary of the key points:\n\n**Date**: December 8, 2022\n**Order by Judge C.HARI SHANKAR, J**\n\nThe court directs both parties to appear before the Learned Registrar of Trademarks on **December 22, 2022**, to take further action as necessary.\n\nThere are no other specific legal facts, proceedings, arguments, decisions, dates, names, or amounts mentioned in this page of the PDF. The court's order is brief and focused on scheduling a future appearance by both parties.\n\nSource: File name \"34. Modern Snack Pvt Ltd. v. The Registrar of Trade Marks.pdf\"",
          "content": "Neutral Citation Number : 2022/DHC/005500 \n \nC.A.(COMM.IPD-TM) 45/2022                                                                   Page 5 of 5 \n \norder as to costs. \n \n16. \nFor the said purpose, let both parties appear before the learned \nRegistrar of Trademarks on 22nd December 2022. \n \n \nC.HARI SHANKAR, J \n \nDECEMBER 8, 2022/AR \n \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n11:47:59\nSignature Not Verified",
          "pdf_source": "34. Modern Snack Pvt Ltd. v. The Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-16T12:13:10.945926",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}