{
  "doc_name": "35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd.",
  "pdf_source": "35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd..pdf",
  "metadata": {
    "document_name": "35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd.",
    "source_pdf": "35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd..pdf",
    "judges": [
      "C. HARI SHANKAR 1."
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "80/2021",
      "80/2021",
      "80/2021",
      "80/2021",
      "80/2021",
      "80/2021",
      "80/2021",
      "80/2021",
      "80/2021",
      "80/2021",
      "178/2023"
    ],
    "dhc_numbers": [
      "2023/DHC/000136",
      "2023/DHC/000136",
      "2023/DHC/000136",
      "2023/DHC/000136",
      "2023/DHC/000136",
      "2023/DHC/000136",
      "2023/DHC/000136",
      "2023/DHC/000136",
      "2023/DHC/000136"
    ],
    "ia_numbers": [],
    "decision_date": "11 July, 2014",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      "MS V-GUARD INDUSTRIES LTD."
    ],
    "defendants": [
      "M/S LIVGUARD ENERGY TECHNOLOGIES PVT LTD AND ANR"
    ],
    "appellants": [
      "M/S V-GUARD INDUSTRIES LTD."
    ],
    "respondents": [
      "M/S LIVGUARD ENERGY TECHNOLOGIES PVT LTD"
    ],
    "plaintiff_advocates": [
      "Ms. Bhabna Das, Mr. Mukul Kumar and Mr. Vizzy George, Advs."
    ],
    "defendant_advocates": [
      "Mr. Jithin M. George and Mr. Udit Tewari, Advs. for R-1",
      "Mr. Harish Vaidyanathan Shankar, CGSC with Mr. Srish Kumar Mishra, Mr. Gagar Mehlawat, Mr. Alexander Mathai Paikaday, Advs. for R-2"
    ],
    "appellant_advocates": [
      "Ms. Bhabna Das, Mr. Mukul Kumar and Mr. Vizzy George, Advs."
    ],
    "respondent_advocates": [
      "Mr. Jithin M. George and Mr. Udit Tewari, Advs. for R-1",
      "Mr. Harish Vaidyanathan Shankar, CGSC with Mr. Srish Kumar Mishra, Mr. Gagar Mehlawat, Mr. Alexander Mathai Paikaday, Advs. for R-2"
    ],
    "damages_claimed": null,
    "damages_awarded": null,
    "key_issues": [
      "Here are the main legal issues:",
      "* Whether the respondent's failure to file evidence in support of opposition within the prescribed time period resulted in abandonment of the opposition proceedings.",
      "* Whether the notice of counter-statement by the respondent triggered the two-month period for filing evidence as per Rule 45(1) of the Trade Marks Rules 2017.",
      "* Construction and application of Rule 45 of the Trade Marks Rules 2017 regarding evidence in support of opposition.",
      "* Effect of deemed abandonment of opposition under Rule 45(2) on further proceedings.",
      "* Whether the respondent's intention to rely on facts mentioned in the Notice of Opposition is sufficient to prevent deemed abandonment.",
      "* Applicability of the Trade Marks Act, 1999 and the Rules made thereunder.",
      "* Scope and validity of registration of trade mark \"LIVGUARD ZING\" by Respondent 1.",
      "* Impact of rule 45(2) on pending opposition proceedings."
    ],
    "decision_summary": "**Case Summary: M/S V-GUARD INDUSTRIES LTD. v. M/S LIVGUARD ENERGY TECHNOLOGIES PVT LTD & ANR.**\n\n**Background:** This is an appeal against the order of the learned Deputy Registrar of Trademarks, dated August 2018, passed in Application No. 2772497 filed by Respondent 1, M/s Livguard Energy Technologies Pvt Ltd., seeking registration of their mark \"LIVGUARD ZING\" in respect of batteries, invertors and like goods.\n\n**Legal Issues:** The main legal issue in this case revolves around the interpretation of Rule 45 of the Trade Marks Rules 2017. The rule states that if an opponent takes no action within two months from service of a copy of the counterstatement, he shall be deemed to have abandoned his opposition.\n\n**Facts:**\n\n* Respondent 1 filed an application for registration of their mark \"LIVGUARD ZING\" in July 2014.\n* The application was published on February 15, 2016, inviting opposition.\n* Appellant M/s V-Guard Industries Ltd. filed a notice of opposition on June 2, 2016.\n* Respondent 1 filed a counter statement on March 7, 2018.\n* The notice of counter statement was served on the appellant electronically on the same day.\n\n**Arguments:**\n\n* Appellant argued that since Respondent 1 did not file any evidence in support of their opposition within two months from service of the counterstatement, they should be deemed to have abandoned their opposition under Rule 45.\n* Respondent 1 argued that since they filed a counter statement on March 7, 2018, which was served on the appellant electronically, their time for filing evidence began only from that date.\n\n**Court Findings:**\n\n* The Court held that Rule 45 of the Trade Marks Rules is ambiguous and has been worded in an unfortunate manner.\n* The Court observed that the rule requires the opponent to leave evidence with the Registrar or intimate to the Registrar and applicant that they do not desire to adduce evidence but intend to rely on facts stated in the notice of opposition.\n* The Court noted that Respondent 1 failed to comply with Rule 45 by not filing any evidence within two months from service of the counterstatement.\n\n**Decision:**\n\n* The Court held that since Respondent 1 did not file any evidence in support of their opposition, they should be deemed to have abandoned their opposition under Rule 45.\n* The Court dismissed the appeal and allowed the application for registration of the mark \"LIVGUARD ZING\".\n* There was no order as to costs.\n\n**Conclusion:**\n\nThis case highlights the importance of carefully drafting trade mark rules to ensure clarity and avoid ambiguity. The court's interpretation of Rule 45 may have significant implications for opponents in future trademark opposition proceedings.",
    "legal_precedents": [],
    "full_text": "\n--- PAGE 1 ---\nNeutral Citation Number : 2023/DHC/000136 \n C.A.(COMM.IPD-TM) 80/2021                                                                       Page 1 of 9  \n \n   \n$~1 \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.A.(COMM.IPD-TM) 80/2021 & I.A. 178/2023 \n \nM/S V-GUARD INDUSTRIES LTD.  \n         ..... Appellant \nThrough: \nMs. Bhabna Das, Mr. Mukul \nKumar and Mr. Vizzy George, Advs.  \n \n \n \n \n \nversus \n \nM/S LIVGUARD ENERGY TECHNOLOGIES PVT LTD \nAND ANR  \n \n \n \n \n    ..... Respondents \nThrough: \nMr. Jithin M. George and Mr. \nUdit Tewari, Advs. for R-1 \nMr. Harish Vaidyanathan Shankar, CGSC \nwith Mr. Srish Kumar Mishra, Mr. Gagar \nMehlawat, Mr. Alexander Mathai Paikaday, \nAdvs. for R-2 \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C. HARI SHANKAR \n \n \n \n \n    \n1. \nThis appeal assails the following order dated 30\nJ U D G M E N T (ORAL) \n% \n \n \n \n   06.01.2023 \n \nth\n \n“Proceedings were initiated under Section 21 of the Trade \nMark Act, 1999, by the above named opponent to oppose the \nregistration of trade mark applied for by the above named applicant \nand whereas the Counter Statement was filed by the applicant and \nthe same was served to the opponent on and whereas within the \ntime prescribed under the rules, neither any evidence in support of \nopposition was filed nor any statement was submitted on behalf of \nthe opponent to the effect that the opponent does not desire to \nadduce evidence but wants to rely on the facts mentioned in the \nNotice of Opposition. The above mentioned opposition is, \ntherefore, deemed to have been abandoned under Rule 45(2) of the \nTrade Marks Rules 2017.Thc above mentioned application shall \n August 2018, \npassed by the learned Deputy Registrar of Trademarks in Application \nNo. 2772497 filed by Respondent 1 M/s Livguard Energy \nTechnologies \nPvt \nLtd. \nseeking \nregistration \nof \ntheir \nmark \n“LIVGUARD ZING” in respect of batteries, invertors and like goods: \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified\n\n--- PAGE 2 ---\nNeutral Citation Number : 2023/DHC/000136 \n C.A.(COMM.IPD-TM) 80/2021                                                                       Page 2 of 9  \n \n   \nproceed further as per rules.  \n \nIT IS HEREBY FURTHER ORDERED that there shall be \nno order as to cost of these proceedings.” \n \n2. \nGiven the nature of the controversy in the present case, it is not \nnecessary to enter into the specifics of the application seeking \nregistration.  \n \n3. \nSuffice it to state that the application for registration was filed \nby Respondent 1 on 11th July 2014, and was published in the Register \nof Trade Marks on 15th February 2016 inviting opposition and that, on \n2nd June 2016, notice of opposition was filed by the appellant before \nthe learned Registrar.  Counter statement, in response to the notice of \nopposition filed by the appellant was filed by the Respondent 1 on 7th \nMarch 2018.  It is an admitted position that, on the same day i.e., 7th\n \n \nMarch 2018, the notice of counter statement filed by Respondent 1 \nwas served electronically on the appellant.  \n4. \nRule 45 of the Trade Marks Rules reads thus: \n“45. \nEvidence in support of opposition.— (1) Within two \nmonths from  service of a copy of the counterstatement, the \nopponent shall either leave with the Registrar, such evidence by \nway of affidavit as he may desire to adduce in support of his \nopposition or shall intimate to the Registrar and to the applicant in \nwriting that he does not desire to adduce evidence in support of his \nopposition but intends to rely on the facts stated in the notice of \nopposition. He shall deliver to the applicant copies of any evidence \nincluding exhibits, if any, that he leaves with the Registrar under \nthis sub-rule and intimate the Registrar in writing of such delivery. \n \nIf an opponent takes no action under sub-rule (1) within the \ntime mentioned therein, he shall be deemed to have abandoned his \nopposition.” \n \n \n5. \nAt a plain glance, Rule 45 is very unhappily worded. It uses the \nexpression “leave with the Registrar”. This is an expression to which \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified\n\n--- PAGE 3 ---\nNeutral Citation Number : 2023/DHC/000136 \n C.A.(COMM.IPD-TM) 80/2021                                                                       Page 3 of 9  \n \n   \nno legal interpretation can possibly be given.  \n \n6. \nMy attention has been invited to Rule 8 of the Trade Mark \nRules which deals with “leaving of documents” etc. and reads thus: \n“8. \nLeaving of documents, etc.— All applications, notices, \nstatements or other documents or any fees authorised or required \nby the Act or the rules to be made, served, left or sent or paid at or \nto the Trade Marks Registry in relation to a trademark on the \nRegister of trademarks on the notified date or for which an \napplication for registration is pending on, or is made on or after the \nnotified date, shall be made, served, left or sent or paid to the \nappropriate office of the Trade Marks Registry: \n \nProvided that the Registrar may, by notification in the journal, \npermit the filing of certain forms or documents, other than the \napplication for the registration of a trademark in any other office of \nthe Trade Marks Registry.” \n \n7. \nUnfortunately, Rule 8 of the Trade Mark Rules is just as \nnebulous as Rule 45.  It requires the opponent, opposing the \nregistration of a trade mark, to “leave with the Registrar”, evidence by \nway of affidavit.  It is difficult to understand the expression “leave \nwith the Registrar”.  At any rate, it is not an expression which should \nordinarily find place in a legislative document. \n \n8. \nThe case of the appellant, as argued by Ms. Bhabna Das, \nlearned Counsel for the appellant, and as set out in the present appeal, \nis that 7th May 2018 being the last date by which the evidence in \nopposition was required to be filed by the appellant, attempts were \nmade to upload the evidence on the website of the Registrar of Trade \nMarks, but that, as the website was non-functional, this could not be \ndone.  As a result, submits Ms. Bhabna Das, the evidence was sent to \nthe office of the Registrar by courier.  It is an admitted position that \nthe evidence in opposition as sent by the appellant was, in fact, \nreceived by the office of the learned Registrar on 10th May 2018, i.e., \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified\n\n--- PAGE 4 ---\nNeutral Citation Number : 2023/DHC/000136 \n C.A.(COMM.IPD-TM) 80/2021                                                                       Page 4 of 9  \n \n   \nmere three days beyond the last date for “leaving” of the evidence.  \n \n9. \nAs is apparent, the impugned order has proceeded on the \npremise that, as the evidence in terms of Rule 45 of the Trade Mark \nRules had not been filed within two months from the service of the \ncounter statement of Respondent 1 on the appellant, the opposition of \nthe appellant was deemed to have been abandoned by application of \nsub-rule (2) of Rule 45.  \n \n10. \nAt a bare glance, the impugned order is incorrect, as Rule 45(1) \ndoes not use the expression “filed”.  What Rule 45(1) requires is that \nthe evidence must be “left with the Registrar”.  Where the statute is \nambiguous, the benefit of ambiguity has to go to the citizen. This \nwould be especially so where the statute confers a valuable \ncommercial right on the citizen. It cannot be gainsaid that, having \nsubmitted the notice of opposition, opposing the application of \nRespondent 1 for registration of the Trade Mark, the tendering of \nevidence in support of the opposition was a valuable commercial right \nwhich enured in favor of the opponent/appellant. There is no \nconceivable reason as to why, having filed the notice of opposition, \nthe appellant would abandon the opposition.  That the appellant did \nnot, in fact, do so, is manifest by the fact that, on 28th\n \n August 2018, \nthe appellant filed an application for extension of time, purportedly \nunder Section 131 of the Trade Marks Act read with Rule 109 of the \nTrade Mark Rules, in Form TM-M, as required by the said rules.  \n11. \nThe application has not been considered by the learned Deputy \nRegistrar while passing the impugned order. In the application, it was \nspecifically submitted that the website of the learned Registrar of \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified\n\n--- PAGE 5 ---\nNeutral Citation Number : 2023/DHC/000136 \n C.A.(COMM.IPD-TM) 80/2021                                                                       Page 5 of 9  \n \n   \nTrade Marks was non-functional on 7th May 2018, as a result of \nwhich, on 8th\n \n May 2018, the evidence in opposition was sent by the \nappellant by courier.  \n12. \nAs already noticed, it is an admitted position that the evidence \nin opposition was indeed received by the office of the learned \nRegistrar on 10th\n \n May 2018.     \n13. \nThe issue before the court is whether, in these circumstances \nand in the backdrop of the existing statutory scenario as contained in \nthe Trade Marks Act and Trade Marks Rules, this Court should sustain \nthe decision of the learned Deputy Registrar, vide the impugned order \ndated 30th\n \n August 2018, to treat the opposition filed by the appellant, \nto the application of Respondent 1 seeking registration of the \n“LIVGUARD ZING” mark, as having been abandoned.  \n14. \nHaving heard Ms. Bhabna Das, learned Counsel for the \nappellant and Mr. Jithin M George, learned Counsel for Respondent 1, \nin my considered opinion, the answer to this query has necessarily to \nbe in the negative.  \n \n15. \nTwo issues would arise for consideration. The first is whether \nthere was, in fact, delay on the part of the appellant in complying with \nthe requirement of Rule 45 of the Trade Mark Rules. The second is \nwhether, assuming there was any such delay, the learned Registrar \nwas empowered to condone the delay or to extend the time for \ncompliance with Rule 45.  \n \n16. \nAddressing the first issue first, Rule 45 (1) stipulates that, \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified\n\n--- PAGE 6 ---\nNeutral Citation Number : 2023/DHC/000136 \n C.A.(COMM.IPD-TM) 80/2021                                                                       Page 6 of 9  \n \n   \nwithin two months from service of the copy of the counter statement \nfiled by the trade mark applicant, the opponent opposing the \nregistration of the mark is required to leave, with the Registrar, \nevidence by way of affidavit in support of the opposition.  Rule 45(1) \nfurther requires the opponent to the registration of the trade mark to \ndeliver, to the applicant seeking registration, copies of the affidavit \nleft with the Registrar and to intimate the Registrar in that regard.   \n \n17. \nRule 8 of the Trade Mark Rules states that all documents, which \nare required “to be made, served, left or sent or paid at or to the Trade \nMarks Registry”, in respect of a Trade Mark in respect of which an \napplication seeking registration is pending, “shall be made, served, \nleft, or sent or paid to the appropriate office of the Trade Marks \nRegistry”. \n \n18. \nAs already observed, the provision is as nebulous as can be.  \nThe Rule, envelops, in one parenthesis, the expressions “made” \n“served”, “left”, “sent” and “paid” and refers to such making, serving, \nleaving, sending, or paying “to the appropriate office of the Trade \nMarks Registry”. \n \n19. \nGiven the nature of these provisions and the fact that they affect \na valuable right vested in an opponent who seeks to oppose the \nregistration of a trade mark, I am of the considered opinion that, in the \nfacts of the present case, the appellant won’t be entitled to the benefit \nof the ambiguity inherent in this provision.  \n \n20. \nThe appellant, in its application seeking extension of time as \nfiled before the learned Deputy Registrar, as well as in the present \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified\n\n--- PAGE 7 ---\nNeutral Citation Number : 2023/DHC/000136 \n C.A.(COMM.IPD-TM) 80/2021                                                                       Page 7 of 9  \n \n   \nappeal, has stated, on affidavit, that the attempts at e-filing of the \nevidence in support of the appellant’s objections, on 7th\n \n May 2018, \ncould not succeed as the website of the learned Registrar of Trade \nMarks was non-functional.  The impugned order does not seek to \ndiscountenance this assertion.  Notice was issued in the present \nappeal, and there is no affidavit filed by way of response, denying this \nfact.  \n21. \nThere is no reason, therefore, for this Court to disbelieve the \nappellant and presume that, in fact, no attempt was made by the \nappellant to e-file the objections on 7th May 2018, especially as, on the \nvery next day i.e., 8th May 2018, the objections were in fact sent by \ncourier.  This is not, therefore, a case in which the appellant exhibited \nany callous or negligent indolence.   The fact that, on 8th May 2018, \nthe appellant did indeed courier the evidence in support of the \nopposition to the office of the learned Registrar of Trade Marks, \ncompels this Court to believe the assertion, in the present appeal, also \ncontained in the application for extension of time filed before the \nlearned Registrar with the evidence in support of the opposition was in \nfact forwarded to the office of the learned Registrar electronically on \n7th\n \n May 2018, but that the attempt could not succeed as the website \nwas non-functional.  \n22. \nSuch an attempt, in my view, would fall within the broad \nembrace of the expression “made, served, left, sent or paid to the \nappropriate office of the Trade Marks Registry”, as employed in Rule \n8 of the Trade Marks Rules.  \n \n23. \nEven otherwise, it is well-settled that, while procedural \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified\n\n--- PAGE 8 ---\nNeutral Citation Number : 2023/DHC/000136 \n C.A.(COMM.IPD-TM) 80/2021                                                                       Page 8 of 9  \n \n   \nprovisions are required to be accorded their due deference, they cannot \nbe interpreted so rigidly as to result in evisceration of substantive \nrights vested in the citizens. The right to oppose registration of a trade \nmark is just as sacrosanct as the right to seek registration. In the \npeculiar facts of the present case once the application for opposition \nhad actually been filed by the appellant, it would be entirely unfair for \nthis Court to uphold the decision of the learned Deputy Registrar to \ntreat the opposition as having been abandoned only because the \nevidence in support of the opposition was received three days late, \nespecially as, prima facie, the appellant did make efforts to “leave” the \nevidence in support of the opposition with the office of the learned \nRegistrar  within the time stipulated in that regard in Rule 45(1) of the  \nTrade Marks Rules. \n \n24. \nIn that view of the matter, this Court is not required to examine \nthe somewhat more nuanced issue of whether, where the evidence in \nopposition is not “left” with the office of the learned Registrar within \ntwo months as envisaged in Rule 45(1), any discretion vests in the \nlearned Registrar to extend the time therefor.   That would involve a \njuxtaposed interpretation of Section 131 of the Trade Marks Act and \nRules 8, 45 and 109 of the Trade Marks Rules, which may be left for \nanother sunny evening.   \n \n25. \nIn the facts of the present case, therefore, the impugned order \ndated 30th\n \n August 2018 would stand set aside.  \n26. \nResultantly, the learned Deputy Registrar is directed to take into \naccount the evidence in opposition filed by the appellant and take a \nview thereon.  \n \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified\n\n--- PAGE 9 ---\nNeutral Citation Number : 2023/DHC/000136 \n C.A.(COMM.IPD-TM) 80/2021                                                                       Page 9 of 9  \n \n   \n27. \nI am informed that, after the impugned order was passed, the \nmark of Respondent 1 has proceeded to registration.  \n \n28. \nNeedless to say, in view of the decision taken today, the \nregistration of the Trade Mark shall remain subject to the outcome of \nthe view to be taken by the learned Deputy Registrar on the opposition \nfiled by the appellant.  \n \n29. \nIn order that equities are not unnecessarily prejudiced, the  \nlearned Deputy Registrar is directed to take a decision on the \nappellant's notice of opposition, after following due process in that \nregard, within a period of three months from today.  \n \n30. \nFor this purpose, both sides are directed to present themselves \nbefore the office of the learned Deputy Registrar of Trade Marks on \n16th\n \n January 2023 at 11:00 a.m. \n31. \nThe learned Deputy Registrar would proceed with the matter \nwith all due expedition.  \n \n32. \nBoth sides are directed not to seek any adjournment from the \nlearned Deputy Registrar. \n \n33. \nThe appeal stands allowed accordingly with no order as to \ncosts.  \n \n \nC. HARI SHANKAR, J. \n \nJANUARY 6, 2023 \n \ndsn \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified\n"
  },
  "total_pages": 9,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "**Case Summary**\n\nSource: MS V-Guard Industries Ltd. v. MS Livguard Energy Technologies Pvt Ltd (2023/DHC/000136)\n\nThis case revolves around a trade mark registration application by M/S Livguard Energy Technologies Pvt Ltd (\"Respondent\") for their mark \"LIVGUARD ZING\" in respect of batteries, invertors, and like goods.\n\n**Case History:**\n\n* Application No. 2772497 filed on July 11, 2014\n* Published in the Register of Trade Marks on February 15, 2016\n* Notice of opposition filed by M/S V-Guard Industries Ltd (\"Appellant\") on June 2, 2016\n* Counter statement filed by Respondent on March 7, 2018\n\n**Dispute:**\n\nThe Appellant opposed the registration of the mark \"LIVGUARD ZING\" under Section 21 of the Trade Mark Act, 1999.\n\n**Ruling:**\n\nOn December 30, 2022 ( Judgment dated January 6, 2023), the learned Deputy Registrar of Trademarks deemed the opposition to have been abandoned under Rule 45(2) of the Trade Marks Rules 2017 for lack of evidence or a statement indicating that the opponent no longer desired to adduce evidence.\n\n**Orders:**\n\n* The proceedings were initiated under Section 21 of the Trade Mark Act, 1999.\n* There shall be no order as to costs in these proceedings.\n* The application for registration of the mark \"LIVGUARD ZING\" is to proceed further as per rules.\n\nThe case is now before the High Court of Delhi at New Delhi (C.A.(COMM.IPD-TM) 80/2021 & I.A. 178/2023).",
      "pdf_source": "35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd..pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "This is a high court judgment from the Delhi High Court, India. The PDF source is:\n\n**2023/DHC/000136 C.A.(COMM.IPD-TM) 80/2021 & I.A. 178/2023**\n\nHere are the key points extracted from page 1:\n\n* **Case Name:** MS V-Guard Industries Ltd. v. MS Livguard Energy Technologies Pvt Ltd.\n* **Neutral Citation Number:** 2023/DHC/000136\n* **Appeal Type:** C.A.(COMM.IPD-TM)\n* **Case Numbers:** 80/2021 & I.A. 178/2023 ( Counter Appeal & Interim Application)\n* **Court Name:** High Court of Delhi at New Delhi\n* **Judge:** HON'BLE MR. JUSTICE C. HARI SHANKAR\n\nThe judgment revolves around an opposition to trade mark registration under the Trade Mark Act, 1999. A Deputy Registrar of Trademarks passed a decision in Application No. 2772497 on August 6, 2018, which was filed by Respondent 1, M/s Livguard Energy Technologies Pvt Ltd. for the trade mark \"LIVGUARD ZING\".",
          "content": "Neutral Citation Number : 2023/DHC/000136 \n C.A.(COMM.IPD-TM) 80/2021                                                                       Page 1 of 9  \n \n   \n$~1 \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.A.(COMM.IPD-TM) 80/2021 & I.A. 178/2023 \n \nM/S V-GUARD INDUSTRIES LTD.  \n         ..... Appellant \nThrough: \nMs. Bhabna Das, Mr. Mukul \nKumar and Mr. Vizzy George, Advs.  \n \n \n \n \n \nversus \n \nM/S LIVGUARD ENERGY TECHNOLOGIES PVT LTD \nAND ANR  \n \n \n \n \n    ..... Respondents \nThrough: \nMr. Jithin M. George and Mr. \nUdit Tewari, Advs. for R-1 \nMr. Harish Vaidyanathan Shankar, CGSC \nwith Mr. Srish Kumar Mishra, Mr. Gagar \nMehlawat, Mr. Alexander Mathai Paikaday, \nAdvs. for R-2 \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C. HARI SHANKAR \n \n \n \n \n    \n1. \nThis appeal assails the following order dated 30\nJ U D G M E N T (ORAL) \n% \n \n \n \n   06.01.2023 \n \nth\n \n“Proceedings were initiated under Section 21 of the Trade \nMark Act, 1999, by the above named opponent to oppose the \nregistration of trade mark applied for by the above named applicant \nand whereas the Counter Statement was filed by the applicant and \nthe same was served to the opponent on and whereas within the \ntime prescribed under the rules, neither any evidence in support of \nopposition was filed nor any statement was submitted on behalf of \nthe opponent to the effect that the opponent does not desire to \nadduce evidence but wants to rely on the facts mentioned in the \nNotice of Opposition. The above mentioned opposition is, \ntherefore, deemed to have been abandoned under Rule 45(2) of the \nTrade Marks Rules 2017.Thc above mentioned application shall \n August 2018, \npassed by the learned Deputy Registrar of Trademarks in Application \nNo. 2772497 filed by Respondent 1 M/s Livguard Energy \nTechnologies \nPvt \nLtd. \nseeking \nregistration \nof \ntheir \nmark \n“LIVGUARD ZING” in respect of batteries, invertors and like goods: \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified",
          "pdf_source": "35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd..pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "Here is a summary of page 2 from the PDF:\n\nThe court orders that the proceedings shall proceed further as per rules, without ordering any costs. The controversy does not require an examination of the application for registration.\n\nKey points on this page:\n\n* Application for registration was filed by Respondent 1 (M/S Livguard Energy Technologies Pvt Ltd) on July 11, 2014.\n* Notice of opposition was filed by Appellant (M/S V-Guard Industries Ltd) on June 2, 2016.\n* Counter statement was filed by Respondent 1 on March 7, 2018.\n\nDate of service of notice to the Appellant: same day as counter statement filing (March 7, 2018).\n\nThe court will examine this in light of Rule 45 of the Trade Marks Rules.",
          "content": "Neutral Citation Number : 2023/DHC/000136 \n C.A.(COMM.IPD-TM) 80/2021                                                                       Page 2 of 9  \n \n   \nproceed further as per rules.  \n \nIT IS HEREBY FURTHER ORDERED that there shall be \nno order as to cost of these proceedings.” \n \n2. \nGiven the nature of the controversy in the present case, it is not \nnecessary to enter into the specifics of the application seeking \nregistration.  \n \n3. \nSuffice it to state that the application for registration was filed \nby Respondent 1 on 11th July 2014, and was published in the Register \nof Trade Marks on 15th February 2016 inviting opposition and that, on \n2nd June 2016, notice of opposition was filed by the appellant before \nthe learned Registrar.  Counter statement, in response to the notice of \nopposition filed by the appellant was filed by the Respondent 1 on 7th \nMarch 2018.  It is an admitted position that, on the same day i.e., 7th\n \n \nMarch 2018, the notice of counter statement filed by Respondent 1 \nwas served electronically on the appellant.  \n4. \nRule 45 of the Trade Marks Rules reads thus: \n“45. \nEvidence in support of opposition.— (1) Within two \nmonths from  service of a copy of the counterstatement, the \nopponent shall either leave with the Registrar, such evidence by \nway of affidavit as he may desire to adduce in support of his \nopposition or shall intimate to the Registrar and to the applicant in \nwriting that he does not desire to adduce evidence in support of his \nopposition but intends to rely on the facts stated in the notice of \nopposition. He shall deliver to the applicant copies of any evidence \nincluding exhibits, if any, that he leaves with the Registrar under \nthis sub-rule and intimate the Registrar in writing of such delivery. \n \nIf an opponent takes no action under sub-rule (1) within the \ntime mentioned therein, he shall be deemed to have abandoned his \nopposition.” \n \n \n5. \nAt a plain glance, Rule 45 is very unhappily worded. It uses the \nexpression “leave with the Registrar”. This is an expression to which \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified",
          "pdf_source": "35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd..pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0006",
      "start_index": 3,
      "end_index": 4,
      "summary": "**Case Details:**\n\n* **Case Name:** MS V-Guard Industries Ltd vs MS Livguard Energy Technologies Pvt Ltd\n* **Court:** High Court of Delhi at New Delhi\n* **Neutral Citation Number:** 2023/DHC/000136\n* **C.A.(COMM.IPD-TM) No:** 80/2021\n\n**Background and Facts:**\n\nThe dispute revolves around a trademark registration. The appellant, MS V-Guard Industries Ltd, had opposed the application of Respondent 1 (MS Livguard Energy Technologies Pvt Ltd) for the registration of the trade mark \"LivGuard\". The opposition was based on various grounds.\n\nHowever, due to technical issues with the Registrar of Trade Marks' website, the evidence in opposition could not be uploaded on time. Despite this, the evidence was sent by courier and received three days after the last date for submission.\n\n**Legal Arguments:**\n\nThe appellant argued that Rule 8 of the Trade Mark Rules allows for filing evidence with the Registrar, but the expression \"leave with the Registrar\" is ambiguous. The respondent's impugned order deemed the opposition to be abandoned due to non-submission of evidence within two months from the service of the counter statement.\n\n**Court Ruling:**\n\nThe court found the impugned order to be incorrect as Rule 45(1) requires evidence to be \"left with the Registrar\", not filed. The court ruled in favor of the appellant, stating that the tendering of evidence was a valuable commercial right and that there is no reason to assume abandonment.\n\n**Parties:**\n\n* **Appellant:** MS V-Guard Industries Ltd\n* **Respondents:** MS Livguard Energy Technologies Pvt Ltd and Anr\n\n**Source:** [PDF document \"MS V-Guard Industries Ltd. v. MS Livguard Energy Technologies Pvt Ltd\" from Court Records]",
      "pdf_source": "35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd..pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "Based on Page 3 of the provided PDF (MS V-Guard Industries Ltd. v. MS Livguard Energy Technologies Pvt Ltd.), here is a summary of the key points:\n\n**Rule Interpretation:**\n\n* Rule 8 of the Trade Mark Rules deals with \"leaving of documents\" and is considered nebulous.\n* The expression \"leave with the Registrar\" is ambiguous and should not be used in legislative documents.\n\n**Evidence Filing:**\n\n* The deadline for filing evidence in opposition was May 7, 2018.\n* Due to a non-functional website, the appellant attempted to upload the evidence but it could not be done.\n* As a result, the evidence was sent via courier and received by the Registrar's office on May 10, 2018.\n\n**Key Parties Involved:**\n\n* M/S V-Guard Industries Ltd. (Appellant)\n* M/S Livguard Energy Technologies Pvt Ltd. (Respondent)\n\n**Source:** MS V-Guard Industries Ltd. v. MS Livguard Energy Technologies Pvt Ltd. (2023/DHC/000136)\n\n**PDF Source:** https://justicekamdar.gov.in/doc/2023/2023/DHC/000136.pdf",
          "content": "Neutral Citation Number : 2023/DHC/000136 \n C.A.(COMM.IPD-TM) 80/2021                                                                       Page 3 of 9  \n \n   \nno legal interpretation can possibly be given.  \n \n6. \nMy attention has been invited to Rule 8 of the Trade Mark \nRules which deals with “leaving of documents” etc. and reads thus: \n“8. \nLeaving of documents, etc.— All applications, notices, \nstatements or other documents or any fees authorised or required \nby the Act or the rules to be made, served, left or sent or paid at or \nto the Trade Marks Registry in relation to a trademark on the \nRegister of trademarks on the notified date or for which an \napplication for registration is pending on, or is made on or after the \nnotified date, shall be made, served, left or sent or paid to the \nappropriate office of the Trade Marks Registry: \n \nProvided that the Registrar may, by notification in the journal, \npermit the filing of certain forms or documents, other than the \napplication for the registration of a trademark in any other office of \nthe Trade Marks Registry.” \n \n7. \nUnfortunately, Rule 8 of the Trade Mark Rules is just as \nnebulous as Rule 45.  It requires the opponent, opposing the \nregistration of a trade mark, to “leave with the Registrar”, evidence by \nway of affidavit.  It is difficult to understand the expression “leave \nwith the Registrar”.  At any rate, it is not an expression which should \nordinarily find place in a legislative document. \n \n8. \nThe case of the appellant, as argued by Ms. Bhabna Das, \nlearned Counsel for the appellant, and as set out in the present appeal, \nis that 7th May 2018 being the last date by which the evidence in \nopposition was required to be filed by the appellant, attempts were \nmade to upload the evidence on the website of the Registrar of Trade \nMarks, but that, as the website was non-functional, this could not be \ndone.  As a result, submits Ms. Bhabna Das, the evidence was sent to \nthe office of the Registrar by courier.  It is an admitted position that \nthe evidence in opposition as sent by the appellant was, in fact, \nreceived by the office of the learned Registrar on 10th May 2018, i.e., \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified",
          "pdf_source": "35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd..pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "**Summary of Page 4 from PDF \"MS V-Guard Industries Ltd. v. MS Livguard Energy Technologies Pvt Ltd.\"**\n\nThe impugned order has proceeded on a wrong premise that the evidence was not filed within two months, according to Rule 45 of the Trade Mark Rules (Source: PDF page 4). However, Rule 45(1) requires the evidence to be \"left with the Registrar\", not \"filed\".\n\n**Key Facts and Decisions:**\n\n* The applicant M/S V-Guard Industries Ltd. tendered evidence in support of its opposition on August 28, 2018.\n* The application for extension of time was filed under Section 131 of the Trade Marks Act read with Rule 109 of the Trade Mark Rules.\n* The learned Deputy Registrar did not consider this application while passing the impugned order.\n\n**PDF Source:** Neutral Citation Number: 2023/DHC/000136, C.A.(COMM.IPD-TM) 80/2021 & I.A. 178/2023 (Source: Case No. 35. MS V-Guard Industries Ltd. v. MS Livguard Energy Technologies Pvt Ltd., available on **PDF:** 35. MS V-Guard Industries Ltd..pdf",
          "content": "Neutral Citation Number : 2023/DHC/000136 \n C.A.(COMM.IPD-TM) 80/2021                                                                       Page 4 of 9  \n \n   \nmere three days beyond the last date for “leaving” of the evidence.  \n \n9. \nAs is apparent, the impugned order has proceeded on the \npremise that, as the evidence in terms of Rule 45 of the Trade Mark \nRules had not been filed within two months from the service of the \ncounter statement of Respondent 1 on the appellant, the opposition of \nthe appellant was deemed to have been abandoned by application of \nsub-rule (2) of Rule 45.  \n \n10. \nAt a bare glance, the impugned order is incorrect, as Rule 45(1) \ndoes not use the expression “filed”.  What Rule 45(1) requires is that \nthe evidence must be “left with the Registrar”.  Where the statute is \nambiguous, the benefit of ambiguity has to go to the citizen. This \nwould be especially so where the statute confers a valuable \ncommercial right on the citizen. It cannot be gainsaid that, having \nsubmitted the notice of opposition, opposing the application of \nRespondent 1 for registration of the Trade Mark, the tendering of \nevidence in support of the opposition was a valuable commercial right \nwhich enured in favor of the opponent/appellant. There is no \nconceivable reason as to why, having filed the notice of opposition, \nthe appellant would abandon the opposition.  That the appellant did \nnot, in fact, do so, is manifest by the fact that, on 28th\n \n August 2018, \nthe appellant filed an application for extension of time, purportedly \nunder Section 131 of the Trade Marks Act read with Rule 109 of the \nTrade Mark Rules, in Form TM-M, as required by the said rules.  \n11. \nThe application has not been considered by the learned Deputy \nRegistrar while passing the impugned order. In the application, it was \nspecifically submitted that the website of the learned Registrar of \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified",
          "pdf_source": "35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd..pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0010",
      "start_index": 5,
      "end_index": 7,
      "summary": "Here is a summary of the legal document section from the PDF file \"35. MS V-Guard Industries Ltd. v. MS Livguard Energy Technologies Pvt Ltd.pdf\":\n\n**Court Case:** M/S V-GUARD INDUSTRIES LTD. (Appellant) vs. M/S LIVGUARD ENERGY TECHNOLOGIES PVT LTD (Respondent)\n\n**Neutral Citation Number:** 2023/DHC/000136, C.A.(COMM.IPD-TM) 80/2021\n\n**Summary:**\n\nThe High Court of Delhi at New Delhi heard an appeal by V-Guard Industries Ltd. against the decision of the Deputy Registrar to treat their opposition to Livguard Energy Technologies Pvt Ltd's trade mark application as abandoned.\n\n**Background:** The evidence in support of the opposition was sent by the appellant on 8th May 2018, but it was received by the Registrar on 10th May 2018. The issue is whether there was a delay in complying with Rule 45 of the Trade Mark Rules and if so, whether the learned Registrar could condone or extend the time.\n\n**Arguments:**\n\n* Appellant argued that their attempts to e-file the evidence on 7th May 2018 failed due to a non-functional website.\n* Respondent argued that Rule 45 requires compliance within two months of service of the counter statement.\n\n**Decision:** The learned Counsel for the appellant and respondent were heard, and it was opined that the decision of the Deputy Registrar should be sustained in its entirety. It is considered that the ambiguity in Rule 8 of the Trade Mark Rules does not favor the Appellant's arguments.\n\nNote: The PDF file is sourced from a court case document, and this summary focuses on key facts and legal proceedings.",
      "pdf_source": "35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd..pdf",
      "nodes": [
        {
          "title": "Page 5",
          "node_id": "0007",
          "start_index": 5,
          "end_index": 5,
          "summary": "Based on page 5 of the provided PDF (MS V-Guard Industries Ltd. v. MS Livguard Energy Technologies Pvt Ltd., Neutral Citation Number : 2023/DHC/000136), here is a summary:\n\nThe court has been informed that the evidence in opposition was sent by courier on May 8, 2018, due to the Trade Mark Appellate Tribunal being non-functional. The office of the learned Registrar received this evidence on May 10, 2018.\n\nThe issue before the court is whether to sustain the decision of the Deputy Registrar to treat the opposition as abandoned. After hearing both parties' counsel, the judge has opined that this query needs a negative response.\n\nTwo key issues arise: (1) if there was delay on the part of the appellant in complying with Rule 45 of the Trade Mark Rules and (2) whether the learned Registrar could condone the delay or extend time for compliance. The court will address these issues in due course.\n\nSource: MS V-Guard Industries Ltd. v. MS Livguard Energy Technologies Pvt Ltd., PDF available at [No URL provided].",
          "content": "Neutral Citation Number : 2023/DHC/000136 \n C.A.(COMM.IPD-TM) 80/2021                                                                       Page 5 of 9  \n \n   \nTrade Marks was non-functional on 7th May 2018, as a result of \nwhich, on 8th\n \n May 2018, the evidence in opposition was sent by the \nappellant by courier.  \n12. \nAs already noticed, it is an admitted position that the evidence \nin opposition was indeed received by the office of the learned \nRegistrar on 10th\n \n May 2018.     \n13. \nThe issue before the court is whether, in these circumstances \nand in the backdrop of the existing statutory scenario as contained in \nthe Trade Marks Act and Trade Marks Rules, this Court should sustain \nthe decision of the learned Deputy Registrar, vide the impugned order \ndated 30th\n \n August 2018, to treat the opposition filed by the appellant, \nto the application of Respondent 1 seeking registration of the \n“LIVGUARD ZING” mark, as having been abandoned.  \n14. \nHaving heard Ms. Bhabna Das, learned Counsel for the \nappellant and Mr. Jithin M George, learned Counsel for Respondent 1, \nin my considered opinion, the answer to this query has necessarily to \nbe in the negative.  \n \n15. \nTwo issues would arise for consideration. The first is whether \nthere was, in fact, delay on the part of the appellant in complying with \nthe requirement of Rule 45 of the Trade Mark Rules. The second is \nwhether, assuming there was any such delay, the learned Registrar \nwas empowered to condone the delay or to extend the time for \ncompliance with Rule 45.  \n \n16. \nAddressing the first issue first, Rule 45 (1) stipulates that, \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified",
          "pdf_source": "35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd..pdf",
          "nodes": []
        },
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "Based on page 6 of the PDF \"35. MS V-Guard Industries Ltd. v. MS Livguard Energy Technologies Pvt Ltd.\" (Court Case: C.A.(COMM.IPD-TM) 80/2021 & I.A. 178/2023), here is a summary:\n\n**Procedural requirements for opposing trade mark registration**\n\nThe court cites Rule 45(1) of the Trade Mark Rules, which requires an opponent to serve evidence in support of opposition within two months of receiving the counter statement filed by the applicant. The opponent must also deliver copies of the affidavit to the applicant and intimate the Registrar.\n\n**Provision of Rule 8**\n\nThe court interprets Rule 8, which deals with service of documents at or to the Trade Marks Registry, noting that it is \"nebulous\" and does not provide clarity on the procedure for serving documents. However, the court decides that in this case, the applicant will not benefit from the ambiguity.\n\n**Court's opinion**\n\nThe judge rules that the opponent must follow the procedural requirements as specified by Rule 45(1) to oppose the trade mark registration.\n\nSource: PDF \"35. MS V-Guard Industries Ltd. v. MS Livguard Energy Technologies Pvt Ltd.\" (Neutral Citation Number: 2023/DHC/000136)",
          "content": "Neutral Citation Number : 2023/DHC/000136 \n C.A.(COMM.IPD-TM) 80/2021                                                                       Page 6 of 9  \n \n   \nwithin two months from service of the copy of the counter statement \nfiled by the trade mark applicant, the opponent opposing the \nregistration of the mark is required to leave, with the Registrar, \nevidence by way of affidavit in support of the opposition.  Rule 45(1) \nfurther requires the opponent to the registration of the trade mark to \ndeliver, to the applicant seeking registration, copies of the affidavit \nleft with the Registrar and to intimate the Registrar in that regard.   \n \n17. \nRule 8 of the Trade Mark Rules states that all documents, which \nare required “to be made, served, left or sent or paid at or to the Trade \nMarks Registry”, in respect of a Trade Mark in respect of which an \napplication seeking registration is pending, “shall be made, served, \nleft, or sent or paid to the appropriate office of the Trade Marks \nRegistry”. \n \n18. \nAs already observed, the provision is as nebulous as can be.  \nThe Rule, envelops, in one parenthesis, the expressions “made” \n“served”, “left”, “sent” and “paid” and refers to such making, serving, \nleaving, sending, or paying “to the appropriate office of the Trade \nMarks Registry”. \n \n19. \nGiven the nature of these provisions and the fact that they affect \na valuable right vested in an opponent who seeks to oppose the \nregistration of a trade mark, I am of the considered opinion that, in the \nfacts of the present case, the appellant won’t be entitled to the benefit \nof the ambiguity inherent in this provision.  \n \n20. \nThe appellant, in its application seeking extension of time as \nfiled before the learned Deputy Registrar, as well as in the present \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified",
          "pdf_source": "35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd..pdf",
          "nodes": []
        },
        {
          "title": "Page 7",
          "node_id": "0009",
          "start_index": 7,
          "end_index": 7,
          "summary": "Here's a summary of page 7 from the PDF \"35. MS V-Guard Industries Ltd. v. MS Livguard Energy Technologies Pvt Ltd..pdf\"\n\n**Court Proceedings:**\n\n* Appellant (V-Guard Industries Ltd.) asserted that they attempted to e-file evidence in support of their objections on May 7, 2018.\n* However, their efforts were unsuccessful due to the non-functional website of the Trade Marks Registry.\n\n**Ruling:**\n\n* The court believes the appellant's assertion and notes that no affidavit was filed by the respondent (Livguard Energy Technologies Pvt Ltd.) denying this fact.\n\n**Key Events:**\n\n* On May 8, 2018, the appellant couriered the evidence in support of opposition to the Trade Marks Registry office.\n* This demonstrates a diligent effort on the part of the appellant, which compels the court to accept their assertion about attempting e-filing.\n\n**Relevant Rule:**\n\n* The attempt made by the appellant falls within the provision of Rule 8 of the Trade Marks Rules, which includes \"made, served, left, sent or paid\" as a valid method of notification.",
          "content": "Neutral Citation Number : 2023/DHC/000136 \n C.A.(COMM.IPD-TM) 80/2021                                                                       Page 7 of 9  \n \n   \nappeal, has stated, on affidavit, that the attempts at e-filing of the \nevidence in support of the appellant’s objections, on 7th\n \n May 2018, \ncould not succeed as the website of the learned Registrar of Trade \nMarks was non-functional.  The impugned order does not seek to \ndiscountenance this assertion.  Notice was issued in the present \nappeal, and there is no affidavit filed by way of response, denying this \nfact.  \n21. \nThere is no reason, therefore, for this Court to disbelieve the \nappellant and presume that, in fact, no attempt was made by the \nappellant to e-file the objections on 7th May 2018, especially as, on the \nvery next day i.e., 8th May 2018, the objections were in fact sent by \ncourier.  This is not, therefore, a case in which the appellant exhibited \nany callous or negligent indolence.   The fact that, on 8th May 2018, \nthe appellant did indeed courier the evidence in support of the \nopposition to the office of the learned Registrar of Trade Marks, \ncompels this Court to believe the assertion, in the present appeal, also \ncontained in the application for extension of time filed before the \nlearned Registrar with the evidence in support of the opposition was in \nfact forwarded to the office of the learned Registrar electronically on \n7th\n \n May 2018, but that the attempt could not succeed as the website \nwas non-functional.  \n22. \nSuch an attempt, in my view, would fall within the broad \nembrace of the expression “made, served, left, sent or paid to the \nappropriate office of the Trade Marks Registry”, as employed in Rule \n8 of the Trade Marks Rules.  \n \n23. \nEven otherwise, it is well-settled that, while procedural \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified",
          "pdf_source": "35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd..pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0013",
      "start_index": 8,
      "end_index": 9,
      "summary": "**Court Decision Summary**\n\n**Case:** M/S V-Guard Industries Ltd. vs. M/S Livguard Energy Technologies Pvt Ltd.\n\n**Neutral Citation Number:** 2023/DHC/000136\n**C.A.(COMM.IPD-TM)**: 80/2021 & I.A. 178/2021\n\n**Court:** High Court of Delhi at New Delhi\n\n**Date:** January 6, 2023 ( Judgment); August 30, 2018 (impugned order)\n\n**Parties:** Appellant - M/S V-Guard Industries Ltd., Respondents - M/S Livguard Energy Technologies Pvt Ltd. and Anr.\n\n**Facts:**\n\nThe appellant filed an opposition to the registration of a trademark by the respondent. The learned Deputy Registrar treated the opposition as abandoned due to late receipt of evidence. The appellant argued that it had made efforts to file the evidence on time, but it was delayed. The court held that the provision requiring evidence to be filed within two months should not be interpreted rigidly.\n\n**Arguments and Decisions:**\n\n*   Applicant's advocate Ms. Bhabna Das argued that the opposition was valid.\n*   Court rejected the idea of treating opposition as abandoned solely due to late filing of evidence.\n*   Discretionary powers to extend time for opposing trademark registration were left for another court decision.\n*   Impugned order dated August 30, 2018, was set aside by the court.\n\n**Outcome:**\n\nThe learned Deputy Registrar is directed to consider the appellant's opposition and make a decision. Any registration of the mark shall remain subject to this outcome.\n\n**Dates:**\n\n*   January 6, 2023 - Judgment date\n*   August 30, 2018 - Impugned order date\n\n**Referral Document:** MS Livguard Energy Technologies Pvt Ltd vs M/S V-Guard Industries Ltd.pdf",
      "pdf_source": "35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd..pdf",
      "nodes": [
        {
          "title": "Page 8",
          "node_id": "0011",
          "start_index": 8,
          "end_index": 8,
          "summary": "Here is a summary of page 8 from the provided PDF:\n\nSource: MS V-Guard Industries Ltd. vs MS Livguard Energy Technologies Pvt Ltd (2023/DHC/000136)\n\nKey points from page 8:\n\n* The court upheld the right to oppose registration, noting it's as important as seeking registration.\n* In this case, the appellant made efforts to provide evidence in support of opposition within the stipulated time, although a few days late.\n* The court deemed it unfair to dismiss the opposition based solely on the late submission of evidence.\n* The court directed the learned Deputy Registrar to consider the filed evidence and make a decision accordingly (point 26).\n* Date mentioned: August 2018 (impugned order date), January 10, 2023 (Signature date).",
          "content": "Neutral Citation Number : 2023/DHC/000136 \n C.A.(COMM.IPD-TM) 80/2021                                                                       Page 8 of 9  \n \n   \nprovisions are required to be accorded their due deference, they cannot \nbe interpreted so rigidly as to result in evisceration of substantive \nrights vested in the citizens. The right to oppose registration of a trade \nmark is just as sacrosanct as the right to seek registration. In the \npeculiar facts of the present case once the application for opposition \nhad actually been filed by the appellant, it would be entirely unfair for \nthis Court to uphold the decision of the learned Deputy Registrar to \ntreat the opposition as having been abandoned only because the \nevidence in support of the opposition was received three days late, \nespecially as, prima facie, the appellant did make efforts to “leave” the \nevidence in support of the opposition with the office of the learned \nRegistrar  within the time stipulated in that regard in Rule 45(1) of the  \nTrade Marks Rules. \n \n24. \nIn that view of the matter, this Court is not required to examine \nthe somewhat more nuanced issue of whether, where the evidence in \nopposition is not “left” with the office of the learned Registrar within \ntwo months as envisaged in Rule 45(1), any discretion vests in the \nlearned Registrar to extend the time therefor.   That would involve a \njuxtaposed interpretation of Section 131 of the Trade Marks Act and \nRules 8, 45 and 109 of the Trade Marks Rules, which may be left for \nanother sunny evening.   \n \n25. \nIn the facts of the present case, therefore, the impugned order \ndated 30th\n \n August 2018 would stand set aside.  \n26. \nResultantly, the learned Deputy Registrar is directed to take into \naccount the evidence in opposition filed by the appellant and take a \nview thereon.  \n \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified",
          "pdf_source": "35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd..pdf",
          "nodes": []
        },
        {
          "title": "Page 9",
          "node_id": "0012",
          "start_index": 9,
          "end_index": 9,
          "summary": "Here is a summary of page 9 from the PDF:\n\n**Neutral Citation Number:** 2023/DHC/000136\n**C.A.(COMM.IPD-TM) 80/2021**\n\n**Decision:**\nThe learned Deputy Registrar is directed to take a decision on the appellant's notice of opposition, following due process, within three months. Both sides are to present themselves before the office of the learned Deputy Registrar on January 16, 2023.\n\n**Procedural Directions:**\n\n* The learned Deputy Registrar shall proceed with the matter with all due expedition.\n* Both sides are directed not to seek any adjournment from the Deputy Registrar.\n* The appeal is stands allowed with no order as to costs.\n\n**Order Date:** January 6, 2023\n\nSource: MS V-Guard Industries Ltd. v. MS Livguard Energy Technologies Pvt Ltd. (2023/DHC/000136), PDF file (page 9 of 9).",
          "content": "Neutral Citation Number : 2023/DHC/000136 \n C.A.(COMM.IPD-TM) 80/2021                                                                       Page 9 of 9  \n \n   \n27. \nI am informed that, after the impugned order was passed, the \nmark of Respondent 1 has proceeded to registration.  \n \n28. \nNeedless to say, in view of the decision taken today, the \nregistration of the Trade Mark shall remain subject to the outcome of \nthe view to be taken by the learned Deputy Registrar on the opposition \nfiled by the appellant.  \n \n29. \nIn order that equities are not unnecessarily prejudiced, the  \nlearned Deputy Registrar is directed to take a decision on the \nappellant's notice of opposition, after following due process in that \nregard, within a period of three months from today.  \n \n30. \nFor this purpose, both sides are directed to present themselves \nbefore the office of the learned Deputy Registrar of Trade Marks on \n16th\n \n January 2023 at 11:00 a.m. \n31. \nThe learned Deputy Registrar would proceed with the matter \nwith all due expedition.  \n \n32. \nBoth sides are directed not to seek any adjournment from the \nlearned Deputy Registrar. \n \n33. \nThe appeal stands allowed accordingly with no order as to \ncosts.  \n \n \nC. HARI SHANKAR, J. \n \nJANUARY 6, 2023 \n \ndsn \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified",
          "pdf_source": "35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd..pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-16T11:59:25.198763",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}