{
  "doc_name": "36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr",
  "pdf_source": "36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf",
  "metadata": {
    "document_name": "36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr",
    "source_pdf": "36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf",
    "judges": [
      "C. HARI SHANKAR 1."
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "39/2022",
      "39/2022",
      "39/2022",
      "39/2022",
      "39/2022",
      "39/2022",
      "39/2022",
      "39/2022",
      "39/2022",
      "39/2022",
      "179/2023"
    ],
    "dhc_numbers": [
      "2023/DHC/000137",
      "2023/DHC/000137",
      "2023/DHC/000137",
      "2023/DHC/000137",
      "2023/DHC/000137",
      "2023/DHC/000137",
      "2023/DHC/000137",
      "2023/DHC/000137",
      "2023/DHC/000137"
    ],
    "ia_numbers": [],
    "decision_date": "11 July, 2014",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [],
    "defendants": [],
    "appellants": [],
    "respondents": [],
    "plaintiff_advocates": [],
    "defendant_advocates": [],
    "appellant_advocates": [],
    "respondent_advocates": [],
    "damages_claimed": null,
    "damages_awarded": null,
    "key_issues": [
      "Here are the main legal issues extracted from the document:",
      "Abandonment of opposition under Rule 45(2) of the Trade Marks Rules 2017",
      "Deemed abandonment due to failure to adduce evidence in support of opposition within prescribed time frame",
      "Validity of notice of counter statement served electronically on the appellant",
      "Effectiveness of waiver by the opponent if they choose to rely solely on facts stated in the notice of opposition",
      "Interpretation of Rule 45(1) of the Trade Marks Rules regarding submission of evidence and intent to rely on facts stated in the notice of opposition",
      "Timeliness of opposition under Rule 42 of the Trade Marks Rules, which may affect respondent's right to oppose registration",
      "Presumption that applicant has a prima facie valid application for trade mark registration",
      "Burden of proof on the opponent to demonstrate the grounds relied upon for opposition",
      "Whether trade mark \"LIVGUARD ZING\" is likely to be confused with appellant's existing or registered marks"
    ],
    "decision_summary": "**Case Summary: C.A.(COMM.IPD-TM) 39/2022 & I.A. 179/2023**\n\n**Background:**\nThe case involves an appeal by M/S V-Guard Industries Ltd (Appellant) against the order of the Deputy Registrar of Trademarks (Respondent 1) dated August 2018, rejecting their opposition to the registration of a trade mark \"LIVGUARD ZING\" (Trade Mark Application No. 2772497) filed by Livguard Energy Technologies Pvt. Ltd (Respondent 2). The Appellant's opponent was deemed abandoned under Rule 45(2) of the Trade Marks Rules, 2017.\n\n**Legal Issues:**\n\n1. Whether the Respondents' trade mark \"LIVGUARD ZING\" can be registered when there is an ongoing opposition by the Appellant?\n2. Did the Respondents comply with the provisions of Rule 45 of the Trade Marks Rules, 2017?\n3. Was the Appellant's opponent deemed abandoned under Rule 45(2) of the Trade Marks Rules, 2017?\n\n**Arguments:**\n\nAppellant:\n* Argued that the Respondents failed to provide evidence in support of their application for registration.\n* Contended that the Respondent's trade mark \"LIVGUARD ZING\" was similar to their registered trade mark and would cause confusion among consumers.\n\nRespondents (R-1 & R-2):\n* Argued that they complied with Rule 45(2) of the Trade Marks Rules, 2017 by filing a counter statement in response to the Appellant's notice of opposition.\n* Contended that the Appellant's opponent was deemed abandoned due to non-compliance with Rule 45(2).\n\n**Court Findings:**\n\n1. **Mis-construction of Rule 45:** The Court found that Rule 45 is poorly worded, making it unclear how an application for evidence should be filed.\n2. **Non-compliance by Respondents (R-1 & R-2):** Despite serving the counter statement on August 7th, 2018, the respondents failed to provide evidence in support of their trade mark application within the two-month timeframe stipulated under Rule 45(2).\n3. **Deemed Abandonment:** As a result of the respondents' non-compliance with Rule 45(2), their opponent (Appellant) was deemed abandoned under Rule 45.\n\n**Decision:**\nThe Court upheld the decision of the Deputy Registrar of Trademarks and ruled that:\n\n1. The opposition to Respondent 2's trade mark application is deemed abandoned under Rule 45(2).\n2. There shall be no order as to costs in these proceedings.\n\nIn conclusion, this case involved a dispute over the registration of a trade mark \"LIVGUARD ZING\" by Livguard Energy Technologies Pvt. Ltd. The High Court held that the Respondents' non-compliance with Rule 45(2) rendered their opponent (Appellant) abandoned, and therefore, they did not have standing to oppose the Registration of Trade Marks in this case",
    "legal_precedents": [],
    "full_text": "\n--- PAGE 1 ---\nNeutral Citation Number : 2023/DHC/000137 \n C.A.(COMM.IPD-TM) 39/2022  \n                                                       Page 1 of 9  \n \n   \n$~18 \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.A.(COMM.IPD-TM) 39/2022 & I.A. 179/2023 \n \nM/S V-GUARD INDUSTRIES LTD  \n       ..... Appellant \nThrough: \nMs. Babna Das, Mr. Mukul \nKumar and Mr. Vizzy George, Advs. \n \n \n \n \n \nversus \n \n \nTHE REGISTRAR OF TRADEMARKS & ANR.. Respondents \nThrough: \nMr. \nHarish \nVaidyanathan \nShankar, CGSC with Mr. Srish Kumar \nMishra, \nMr. \nGagar \nMehlawat, \nMr. \nAlexander Mathai Paikaday, Advs. for R-1 \nMr. Jithin M. George and Mr. Udit Tewari, \nAdvs. for R-2 \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C. HARI SHANKAR \n \n \n \n    \n1. \nThis appeal assails the following order dated 30\nJ U D G M E N T (ORAL) \n% \n \n \n \n   06.01.2023 \n \nth\n“ \nProceedings were initiated under Section 21 of the Trade \nMark Act, 1999, by the above named opponent to oppose the \nregistration of trade mark applied for by the above named applicant \nand whereas the Counter Statement was filed by the applicant and \nthe same was served to the opponent on and whereas within the \ntime prescribed under the rules, neither any evidence in support of \nopposition was filed nor any statement was submitted on behalf of \nthe opponent to the effect that the opponent does not desire to \nadduce evidence but wants to rely on the facts mentioned in the \nNotice of Opposition. The above mentioned opposition is, \ntherefore, deemed to have been abandoned under Rule 45(2) of the \nTrade Marks Rules 2017.Thc above mentioned application shall \nproceed further as per rules.  \n \n August 2018, \npassed by the learned Deputy Registrar of Trademarks in Application \nNo. 2772497 filed by Respondent 2 M/s Livguard Energy \nTechnologies \nPvt \nLtd. \nseeking \nregistration \nof \ntheir \nmark \n“LIVGUARD ZING” in respect of batteries, invertors and like goods: \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified\n\n--- PAGE 2 ---\nNeutral Citation Number : 2023/DHC/000137 \n C.A.(COMM.IPD-TM) 39/2022  \n                                                       Page 2 of 9  \n \n   \nIT IS HEREBY FURTHER ORDERED that there shall be \nno order as to cost of these proceedings.” \n \n2. \nGiven the nature of the controversy in the present case, it is not \nnecessary to enter into the specifics of the application seeking \nregistration.  \n \n3. \nSuffice it to state that the application for registration was filed \nby Respondent 2 on 11th July 2014, and was published in the Register \nof Trade Marks on 15th February 2016 inviting opposition and that, on \n2nd June 2016, notice of opposition was filed by the appellant before \nthe learned Registrar.  Counter statement, in response to the notice of \nopposition filed by the appellant was filed by the Respondent 2 on 7th \nMarch 2018.  It is an admitted position that, on the same day i.e., 7th\n \n \nMarch 2018, the notice of counter statement filed by Respondent 2 \nwas served electronically on the appellant.  \n4. \nRule 45 of the Trade Marks Rules reads thus: \n“45. \nEvidence in support of opposition.— (1) Within two \nmonths from  service of a copy of the counterstatement, the \nopponent shall either leave with the Registrar, such evidence by \nway of affidavit as he may desire to adduce in support of his \nopposition or shall intimate to the Registrar and to the applicant in \nwriting that he does not desire to adduce evidence in support of his \nopposition but intends to rely on the facts stated in the notice of \nopposition. He shall deliver to the applicant copies of any evidence \nincluding exhibits, if any, that he leaves with the Registrar under \nthis sub-rule and intimate the Registrar in writing of such delivery. \n \nIf an opponent takes no action under sub-rule (1) within the \ntime mentioned therein, he shall be deemed to have abandoned his \nopposition.” \n \n \n5. \nAt a plain glance, Rule 45 is very unhappily worded. It uses the \nexpression “leave with the Registrar”. This is an expression to which \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified\n\n--- PAGE 3 ---\nNeutral Citation Number : 2023/DHC/000137 \n C.A.(COMM.IPD-TM) 39/2022  \n                                                       Page 3 of 9  \n \n   \nno legal interpretation can possibly be given.  \n \n6. \nMy attention has been invited to Rule 8 of the Trade Mark \nRules which deals with “leaving of documents” etc. and reads thus: \n“8. \nLeaving of documents, etc.— All applications, notices, \nstatements or other documents or any fees authorised or required \nby the Act or the rules to be made, served, left or sent or paid at or \nto the Trade Marks Registry in relation to a trademark on the \nRegister of trademarks on the notified date or for which an \napplication for registration is pending on, or is made on or after the \nnotified date, shall be made, served, left or sent or paid to the \nappropriate office of the Trade Marks Registry: \n \nProvided that the Registrar may, by notification in the journal, \npermit the filing of certain forms or documents, other than the \napplication for the registration of a trademark in any other office of \nthe Trade Marks Registry.” \n \n7. \nUnfortunately, Rule 8 of the Trade Mark Rules is just as \nnebulous as Rule 45.  It requires the opponent, opposing the \nregistration of a trade mark, to “leave with the Registrar”, evidence by \nway of affidavit.  It is difficult to understand the expression “leave \nwith the Registrar”.  At any rate, it is not an expression which should \nordinarily find place in a legislative document. \n \n8. \nThe case of the appellant, as argued by Ms. Bhabna Das, \nlearned Counsel for the appellant, and as set out in the present appeal, \nis that 7th May 2018 being the last date by which the evidence in \nopposition was required to be filed by the appellant, attempts were \nmade to upload the evidence on the website of the Registrar of Trade \nMarks, but that, as the website was non-functional, this could not be \ndone.  As a result, submits Ms. Bhabna Das, the evidence was sent to \nthe office of the Registrar by courier.  It is an admitted position that \nthe evidence in opposition as sent by the appellant was, in fact, \nreceived by the office of the learned Registrar on 10th May 2018, i.e., \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified\n\n--- PAGE 4 ---\nNeutral Citation Number : 2023/DHC/000137 \n C.A.(COMM.IPD-TM) 39/2022  \n                                                       Page 4 of 9  \n \n   \nmere three days beyond the last date for “leaving” of the evidence.  \n \n9. \nAs is apparent, the impugned order has proceeded on the \npremise that, as the evidence in terms of Rule 45 of the Trade Mark \nRules had not been filed within two months from the service of the \ncounter statement of Respondent 2 on the appellant, the opposition of \nthe appellant was deemed to have been abandoned by application of \nsub-rule (2) of Rule 45.  \n \n10. \nAt a bare glance, the impugned order is incorrect, as Rule 45(1) \ndoes not use the expression “filed”.  What Rule 45(1) requires is that \nthe evidence must be “left with the Registrar”.  Where the statute is \nambiguous, the benefit of ambiguity has to go to the citizen. This \nwould be especially so where the statute confers a valuable \ncommercial right on the citizen. It cannot be gainsaid that, having \nsubmitted the notice of opposition, opposing the application of \nRespondent 2 for registration of the Trade Mark, the tendering of \nevidence in support of the opposition was a valuable commercial right \nwhich enured in favor of the opponent/appellant. There is no \nconceivable reason as to why, having filed the notice of opposition, \nthe appellant would abandon the opposition.  That the appellant did \nnot, in fact, do so, is manifest by the fact that, on 28th\n \n August 2018, \nthe appellant filed an application for extension of time, purportedly \nunder Section 131 of the Trade Marks Act read with Rule 109 of the \nTrade Mark Rules, in Form TM-M, as required by the said rules.  \n11. \nThe application has not been considered by the learned Deputy \nRegistrar while passing the impugned order. In the application, it was \nspecifically submitted that the website of the learned Registrar of \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified\n\n--- PAGE 5 ---\nNeutral Citation Number : 2023/DHC/000137 \n C.A.(COMM.IPD-TM) 39/2022  \n                                                       Page 5 of 9  \n \n   \nTrade Marks was non-functional on 7th May 2018, as a result of \nwhich, on 8th\n \n May 2018, the evidence in opposition was sent by the \nappellant by courier.  \n12. \nAs already noticed, it is an admitted position that the evidence \nin opposition was indeed received by the office of the learned \nRegistrar on 10th\n \n May 2018.     \n13. \nThe issue before the court is whether, in these circumstances \nand in the backdrop of the existing statutory scenario as contained in \nthe Trade Marks Act and Trade Marks Rules, this Court should sustain \nthe decision of the learned Deputy Registrar, vide the impugned order \ndated 30th\n \n August 2018, to treat the opposition filed by the appellant, \nto the application of Respondent 2 seeking registration of the \n“LIVGUARD ZING” mark, as having been abandoned.  \n14. \nHaving heard Ms. Bhabna Das, learned Counsel for the \nappellant and Mr. Jithin M George, learned Counsel for Respondent 2, \nin my considered opinion, the answer to this query has necessarily to \nbe in the negative.  \n \n15. \nTwo issues would arise for consideration. The first is whether \nthere was, in fact, delay on the part of the appellant in complying with \nthe requirement of Rule 45 of the Trade Mark Rules. The second is \nwhether, assuming there was any such delay, the learned Registrar \nwas empowered to condone the delay or to extend the time for \ncompliance with Rule 45.  \n \n16. \nAddressing the first issue first, Rule 45 (1) stipulates that, \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified\n\n--- PAGE 6 ---\nNeutral Citation Number : 2023/DHC/000137 \n C.A.(COMM.IPD-TM) 39/2022  \n                                                       Page 6 of 9  \n \n   \nwithin two months from service of the copy of the counter statement \nfiled by the trade mark applicant, the opponent opposing the \nregistration of the mark is required to leave, with the Registrar, \nevidence by way of affidavit in support of the opposition.  Rule 45(1) \nfurther requires the opponent to the registration of the trade mark to \ndeliver, to the applicant seeking registration, copies of the affidavit \nleft with the Registrar and to intimate the Registrar in that regard.   \n \n17. \nRule 8 of the Trade Mark Rules states that all documents, which \nare required “to be made, served, left or sent or paid at or to the Trade \nMarks Registry”, in respect of a Trade Mark in respect of which an \napplication seeking registration is pending, “shall be made, served, \nleft, or sent or paid to the appropriate office of the Trade Marks \nRegistry”. \n \n18. \nAs already observed, the provision is as nebulous as can be.  \nThe Rule, envelops, in one parenthesis, the expressions “made” \n“served”, “left”, “sent” and “paid” and refers to such making, serving, \nleaving, sending, or paying “to the appropriate office of the Trade \nMarks Registry”. \n \n19. \nGiven the nature of these provisions and the fact that they affect \na valuable right vested in an opponent who seeks to oppose the \nregistration of a trade mark, I am of the considered opinion that, in the \nfacts of the present case, the appellant won’t be entitled to the benefit \nof the ambiguity inherent in this provision.  \n \n20. \nThe appellant, in its application seeking extension of time as \nfiled before the learned Deputy Registrar, as well as in the present \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified\n\n--- PAGE 7 ---\nNeutral Citation Number : 2023/DHC/000137 \n C.A.(COMM.IPD-TM) 39/2022  \n                                                       Page 7 of 9  \n \n   \nappeal, has stated, on affidavit, that the attempts at e-filing of the \nevidence in support of the appellant’s objections, on 7th\n \n May 2018, \ncould not succeed as the website of the learned Registrar of Trade \nMarks was non-functional.  The impugned order does not seek to \ndiscountenance this assertion.  Notice was issued in the present \nappeal, and there is no affidavit filed by way of response, denying this \nfact.  \n21. \nThere is no reason, therefore, for this Court to disbelieve the \nappellant and presume that, in fact, no attempt was made by the \nappellant to e-file the objections on 7th May 2018, especially as, on the \nvery next day i.e., 8th May 2018, the objections were in fact sent by \ncourier.  This is not, therefore, a case in which the appellant exhibited \nany callous or negligent indolence.   The fact that, on 8th May 2018, \nthe appellant did indeed courier the evidence in support of the \nopposition to the office of the learned Registrar of Trade Marks, \ncompels this Court to believe the assertion, in the present appeal, also \ncontained in the application for extension of time filed before the \nlearned Registrar with the evidence in support of the opposition was in \nfact forwarded to the office of the learned Registrar electronically on \n7th\n \n May 2018, but that the attempt could not succeed as the website \nwas non-functional.  \n22. \nSuch an attempt, in my view, would fall within the broad \nembrace of the expression “made, served, left, sent or paid to the \nappropriate office of the Trade Marks Registry”, as employed in Rule \n8 of the Trade Marks Rules.  \n \n23. \nEven otherwise, it is well-settled that, while procedural \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified\n\n--- PAGE 8 ---\nNeutral Citation Number : 2023/DHC/000137 \n C.A.(COMM.IPD-TM) 39/2022  \n                                                       Page 8 of 9  \n \n   \nprovisions are required to be accorded their due deference, they cannot \nbe interpreted so rigidly as to result in evisceration of substantive \nrights vested in the citizens. The right to oppose registration of a trade \nmark is just as sacrosanct as the right to seek registration. In the \npeculiar facts of the present case once the application for opposition \nhad actually been filed by the appellant, it would be entirely unfair for \nthis Court to uphold the decision of the learned Deputy Registrar to \ntreat the opposition as having been abandoned only because the \nevidence in support of the opposition was received three days late, \nespecially as, prima facie, the appellant did make efforts to “leave” the \nevidence in support of the opposition with the office of the learned \nRegistrar  within the time stipulated in that regard in Rule 45(1) of the  \nTrade Marks Rules. \n \n24. \nIn that view of the matter, this Court is not required to examine \nthe somewhat more nuanced issue of whether, where the evidence in \nopposition is not “left” with the office of the learned Registrar within \ntwo months as envisaged in Rule 45(1), any discretion vests in the \nlearned Registrar to extend the time therefor.   That would involve a \njuxtaposed interpretation of Section 131 of the Trade Marks Act and \nRules 8, 45 and 109 of the Trade Marks Rules, which may be left for \nanother sunny evening.   \n \n25. \nIn the facts of the present case, therefore, the impugned order \ndated 30th\n \n August 2018 would stand set aside.  \n26. \nResultantly, the learned Deputy Registrar is directed to take into \naccount the evidence in opposition filed by the appellant and take a \nview thereon.  \n \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified\n\n--- PAGE 9 ---\nNeutral Citation Number : 2023/DHC/000137 \n C.A.(COMM.IPD-TM) 39/2022  \n                                                       Page 9 of 9  \n \n   \n27. \nI am informed that, after the impugned order was passed, the \nmark of Respondent 2 has proceeded to registration.  \n \n28. \nNeedless to say, in view of the decision taken today, the \nregistration of the Trade Mark shall remain subject to the outcome of \nthe view to be taken by the learned Deputy Registrar on the opposition \nfiled by the appellant.  \n \n29. \nIn order that equities are not unnecessarily prejudiced, the  \nlearned Deputy Registrar is directed to take a decision on the \nappellant's notice of opposition, after following due process in that \nregard, within a period of three months from today.  \n \n30. \nFor this purpose, both sides are directed to present themselves \nbefore the office of the learned Deputy Registrar of Trade Marks on \n16th\n \n January 2023 at 11:00 a.m. \n31. \nThe learned Deputy Registrar would proceed with the matter \nwith all due expedition.  \n \n32. \nBoth sides are directed not to seek any adjournment from the \nlearned Deputy Registrar. \n \n33. \nThe appeal stands allowed accordingly with no order as to \ncosts.  \n \nC. HARI SHANKAR, J. \n \nJANUARY 6, 2023 \n \ndsn \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified\n"
  },
  "total_pages": 9,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "**Case Summary: MS V-Guard Industries Ltd vs The Registrar of Trade Marks & Anr.**\n\n**PDF Source:** [36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf](https://pdfcoffee.com/pdf-to-html/8m6u39w3q0/ms-v-guard-industries-ltd-vs-the-registrar-of-trade-marks--)\n\n**Case Details:**\n\n* **Neutral Citation Number:** 2023/DHC/000137\n* **C.A.(COMM.IPD-TM) 39/2022**: Appeal case number\n* **Date of Order:** 06.01.2023\n\n**Parties:**\n\n* **Appellant (Plaintiff):** M/S V-Guard Industries Ltd.\n\t+ Represented by Ms. Babna Das, Mr. Mukul Kumar, and Mr. Vizzy George\n* **Respondents (Defendants):**\n\t1. The Registrar of Trademarks\n\t2. M/s Livguard Energy Technologies Pvt Ltd. (Respondent 2 or Respondent \"R-2\")\n\n**Background:**\n\nThe appeal was filed against an order of the Deputy Registrar of Trademarks, dismissing the opposition by V-Guard Industries Ltd to the registration of the mark \"LIVGUARD ZING\" by Livguard Energy Technologies Pvt Ltd.\n\n**Facts and Arguments:**\n\n* V-Guard Industries Ltd. opposed the registration of the mark \"LIVGUARD ZING\" in February 2016.\n* The opponent failed to file evidence in support of opposition within two months from service of the counterstatement (Rule 45 of Trade Marks Rules).\n* Therefore, their opposition was deemed abandoned.\n\n**Decision:**\n\nThe appeal was allowed. The court held that since V-Guard Industries Ltd did not file any evidence in support of opposition as required under Rule 45(1) of Trade Marks Rules, their opposition was deemed to have been abandoned",
      "pdf_source": "36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "Here is a summary of page 1 of the PDF:\n\n**Case Details**\n\n* Neutral Citation Number: 2023/DHC/000137\n* C.A.(COMM.IPD-TM) 39/2022 & I.A. 179/2023\n* In the High Court of Delhi at New Delhi\n\n**Parties**\n\n* M/S V-GUARD INDUSTRIES LTD (Appellant)\n\t+ Through: Ms. Babna Das, Mr. Mukul Kumar, and Mr. Vizzy George, Advs.\n* THE REGISTRAR OF TRADEMARKS & ANR (Respondents)\n\t+ Through: Mr. Harish Vaidyanathan Shankar, CGSC\n\n**Background**\n\n* The appeal challenges an order dated 30.06.2023 passed by the learned Deputy Registrar of Trademarks.\n\n**Main Issue**\n\n* Deemed abandonment of opposition proceedings under Rule 45(2) of the Trade Marks Rules 2017.\n\nThe PDF source is: MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf (36).",
          "content": "Neutral Citation Number : 2023/DHC/000137 \n C.A.(COMM.IPD-TM) 39/2022  \n                                                       Page 1 of 9  \n \n   \n$~18 \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.A.(COMM.IPD-TM) 39/2022 & I.A. 179/2023 \n \nM/S V-GUARD INDUSTRIES LTD  \n       ..... Appellant \nThrough: \nMs. Babna Das, Mr. Mukul \nKumar and Mr. Vizzy George, Advs. \n \n \n \n \n \nversus \n \n \nTHE REGISTRAR OF TRADEMARKS & ANR.. Respondents \nThrough: \nMr. \nHarish \nVaidyanathan \nShankar, CGSC with Mr. Srish Kumar \nMishra, \nMr. \nGagar \nMehlawat, \nMr. \nAlexander Mathai Paikaday, Advs. for R-1 \nMr. Jithin M. George and Mr. Udit Tewari, \nAdvs. for R-2 \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C. HARI SHANKAR \n \n \n \n    \n1. \nThis appeal assails the following order dated 30\nJ U D G M E N T (ORAL) \n% \n \n \n \n   06.01.2023 \n \nth\n“ \nProceedings were initiated under Section 21 of the Trade \nMark Act, 1999, by the above named opponent to oppose the \nregistration of trade mark applied for by the above named applicant \nand whereas the Counter Statement was filed by the applicant and \nthe same was served to the opponent on and whereas within the \ntime prescribed under the rules, neither any evidence in support of \nopposition was filed nor any statement was submitted on behalf of \nthe opponent to the effect that the opponent does not desire to \nadduce evidence but wants to rely on the facts mentioned in the \nNotice of Opposition. The above mentioned opposition is, \ntherefore, deemed to have been abandoned under Rule 45(2) of the \nTrade Marks Rules 2017.Thc above mentioned application shall \nproceed further as per rules.  \n \n August 2018, \npassed by the learned Deputy Registrar of Trademarks in Application \nNo. 2772497 filed by Respondent 2 M/s Livguard Energy \nTechnologies \nPvt \nLtd. \nseeking \nregistration \nof \ntheir \nmark \n“LIVGUARD ZING” in respect of batteries, invertors and like goods: \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified",
          "pdf_source": "36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "Here is a summary of page 2 from the provided PDF:\n\nThe High Court of Delhi at New Delhi issued an order in C.A.(COMM.IPD-TM) 39/2022. The court ordered that there shall be no order as to costs in these proceedings.\n\nThe court then briefly discussed the application for registration of a trade mark by Respondent-2, filed on July 11, 2014, and published on February 15, 2016. Notice of opposition was filed by the Appellant (M/S V-Guard Industries Ltd) on June 2, 2016.\n\nThe court then referred to Rule 45 of the Trade Marks Rules, which requires an opponent (in this case, the Appellant) to adduce evidence in support of their opposition within two months from service of a copy of the counter-statement. If no action is taken, the opponent shall be deemed to have abandoned their opposition.\n\nThe source of this information is MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr ( Neutral Citation Number : 2023/DHC/000137 )",
          "content": "Neutral Citation Number : 2023/DHC/000137 \n C.A.(COMM.IPD-TM) 39/2022  \n                                                       Page 2 of 9  \n \n   \nIT IS HEREBY FURTHER ORDERED that there shall be \nno order as to cost of these proceedings.” \n \n2. \nGiven the nature of the controversy in the present case, it is not \nnecessary to enter into the specifics of the application seeking \nregistration.  \n \n3. \nSuffice it to state that the application for registration was filed \nby Respondent 2 on 11th July 2014, and was published in the Register \nof Trade Marks on 15th February 2016 inviting opposition and that, on \n2nd June 2016, notice of opposition was filed by the appellant before \nthe learned Registrar.  Counter statement, in response to the notice of \nopposition filed by the appellant was filed by the Respondent 2 on 7th \nMarch 2018.  It is an admitted position that, on the same day i.e., 7th\n \n \nMarch 2018, the notice of counter statement filed by Respondent 2 \nwas served electronically on the appellant.  \n4. \nRule 45 of the Trade Marks Rules reads thus: \n“45. \nEvidence in support of opposition.— (1) Within two \nmonths from  service of a copy of the counterstatement, the \nopponent shall either leave with the Registrar, such evidence by \nway of affidavit as he may desire to adduce in support of his \nopposition or shall intimate to the Registrar and to the applicant in \nwriting that he does not desire to adduce evidence in support of his \nopposition but intends to rely on the facts stated in the notice of \nopposition. He shall deliver to the applicant copies of any evidence \nincluding exhibits, if any, that he leaves with the Registrar under \nthis sub-rule and intimate the Registrar in writing of such delivery. \n \nIf an opponent takes no action under sub-rule (1) within the \ntime mentioned therein, he shall be deemed to have abandoned his \nopposition.” \n \n \n5. \nAt a plain glance, Rule 45 is very unhappily worded. It uses the \nexpression “leave with the Registrar”. This is an expression to which \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified",
          "pdf_source": "36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0006",
      "start_index": 3,
      "end_index": 4,
      "summary": "**Summary of Section: Background and Facts**\n\nFrom the document MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf (2023/DHC/000137), we have:\n\n**Background:**\nM/S V-GUARD INDUSTRIES LTD, the appellant, filed a notice of opposition against THE REGISTRAR OF TRADEMARKS & ANR, the respondents, on March 1, 2018.\n\n**Facts:**\n\n* The last date for filing evidence in opposition was May 7, 2018.\n* Due to a non-functional website, the appellant attempted to upload evidence but failed. Instead, they sent it via courier on May 9, 2018 (three days beyond the deadline).\n* The evidence was received by the Registry office on May 10, 2018.\n\n**Arguments:**\n\n* The appellant argued that Rule 45(1) of the Trade Mark Rules requires leaving evidence with the Registrar, not filing it.\n* The benefit of ambiguity should go to the citizen, and the statute confers a valuable commercial right on the opponent.\n\n**Decisions:**\nThe impugned order was incorrect as it proceeded on the premise that Rule 45(1) required \"filed\" instead of \"left with the Registrar\".\n\n**Parties:**\n\n* M/S V-GUARD INDUSTRIES LTD (appellant)\n* THE REGISTRAR OF TRADEMARKS & ANR. (respondent)\n\n**Dates:**\nMarch 1, 2018; May 7, 2018; May 9, 2018; May 10, 2018\n\nSource:\nMS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf (2023/DHC/000137)",
      "pdf_source": "36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "Here is a summary of page 3 from the provided PDF (36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf):\n\n**Citation:** 2023/DHC/000137, C.A.(COMM.IPD-TM) 39/2022\n**Subject:** Trade Mark Rules and procedures\n\nThe court discusses two rules mentioned in the case:\n\n1. **Rule 45**: Not specified, but considered unworkable.\n2. **Rule 8 of the Trade Mark Rules**: Deals with \"leaving of documents\" etc. States that applications, notices, statements or other documents shall be made, served, left or sent to the Trade Marks Registry.\n\nThe court finds both rules uncertain and open to interpretation. Specifically, it questions the meaning of \"leave with the Registrar\" in Rule 8.\n\n**Key Facts:**\n\n* The case revolves around a trade mark opposition case.\n* Evidence was required to be filed by May 7, 2018.\n* Due to website issues, evidence was sent via courier on May 10, 2018.\n* It is admitted that the evidence was received by the registrar's office on May 10, 2018.\n\nSource: PDF (36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf)",
          "content": "Neutral Citation Number : 2023/DHC/000137 \n C.A.(COMM.IPD-TM) 39/2022  \n                                                       Page 3 of 9  \n \n   \nno legal interpretation can possibly be given.  \n \n6. \nMy attention has been invited to Rule 8 of the Trade Mark \nRules which deals with “leaving of documents” etc. and reads thus: \n“8. \nLeaving of documents, etc.— All applications, notices, \nstatements or other documents or any fees authorised or required \nby the Act or the rules to be made, served, left or sent or paid at or \nto the Trade Marks Registry in relation to a trademark on the \nRegister of trademarks on the notified date or for which an \napplication for registration is pending on, or is made on or after the \nnotified date, shall be made, served, left or sent or paid to the \nappropriate office of the Trade Marks Registry: \n \nProvided that the Registrar may, by notification in the journal, \npermit the filing of certain forms or documents, other than the \napplication for the registration of a trademark in any other office of \nthe Trade Marks Registry.” \n \n7. \nUnfortunately, Rule 8 of the Trade Mark Rules is just as \nnebulous as Rule 45.  It requires the opponent, opposing the \nregistration of a trade mark, to “leave with the Registrar”, evidence by \nway of affidavit.  It is difficult to understand the expression “leave \nwith the Registrar”.  At any rate, it is not an expression which should \nordinarily find place in a legislative document. \n \n8. \nThe case of the appellant, as argued by Ms. Bhabna Das, \nlearned Counsel for the appellant, and as set out in the present appeal, \nis that 7th May 2018 being the last date by which the evidence in \nopposition was required to be filed by the appellant, attempts were \nmade to upload the evidence on the website of the Registrar of Trade \nMarks, but that, as the website was non-functional, this could not be \ndone.  As a result, submits Ms. Bhabna Das, the evidence was sent to \nthe office of the Registrar by courier.  It is an admitted position that \nthe evidence in opposition as sent by the appellant was, in fact, \nreceived by the office of the learned Registrar on 10th May 2018, i.e., \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified",
          "pdf_source": "36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "Here is a summary of page 4 from the PDF:\n\n**Source:** MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr., C.A.(COMM.IPD-TM) 39/2022, Neutral Citation Number: 2023/DHC/000137 (PDF)\n\n**Key points:**\n\n* The impugned order deemed the appellant's opposition to have been abandoned due to failure to file evidence within two months.\n* Rule 45(1) of the Trade Mark Rules requires the evidence to be \"left with the Registrar\", not filed.\n* This ambiguity is resolved in favor of the citizen, as filing a notice of opposition confers a valuable commercial right.\n* The appellant submitted an application for extension of time on August 28, 2018, but this was not considered by the Deputy Registrar.\n\n**Relevant court documents:**\n\n* C.A.(COMM.IPD-TM) 39/2022\n* I.A. 179/2023",
          "content": "Neutral Citation Number : 2023/DHC/000137 \n C.A.(COMM.IPD-TM) 39/2022  \n                                                       Page 4 of 9  \n \n   \nmere three days beyond the last date for “leaving” of the evidence.  \n \n9. \nAs is apparent, the impugned order has proceeded on the \npremise that, as the evidence in terms of Rule 45 of the Trade Mark \nRules had not been filed within two months from the service of the \ncounter statement of Respondent 2 on the appellant, the opposition of \nthe appellant was deemed to have been abandoned by application of \nsub-rule (2) of Rule 45.  \n \n10. \nAt a bare glance, the impugned order is incorrect, as Rule 45(1) \ndoes not use the expression “filed”.  What Rule 45(1) requires is that \nthe evidence must be “left with the Registrar”.  Where the statute is \nambiguous, the benefit of ambiguity has to go to the citizen. This \nwould be especially so where the statute confers a valuable \ncommercial right on the citizen. It cannot be gainsaid that, having \nsubmitted the notice of opposition, opposing the application of \nRespondent 2 for registration of the Trade Mark, the tendering of \nevidence in support of the opposition was a valuable commercial right \nwhich enured in favor of the opponent/appellant. There is no \nconceivable reason as to why, having filed the notice of opposition, \nthe appellant would abandon the opposition.  That the appellant did \nnot, in fact, do so, is manifest by the fact that, on 28th\n \n August 2018, \nthe appellant filed an application for extension of time, purportedly \nunder Section 131 of the Trade Marks Act read with Rule 109 of the \nTrade Mark Rules, in Form TM-M, as required by the said rules.  \n11. \nThe application has not been considered by the learned Deputy \nRegistrar while passing the impugned order. In the application, it was \nspecifically submitted that the website of the learned Registrar of \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified",
          "pdf_source": "36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0010",
      "start_index": 5,
      "end_index": 7,
      "summary": "**Case Summary:**\n\n**Case Title:** MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.\n\n**Neutral Citation Number:** 2023/DHC/000137 \n\n**Court:** High Court of Delhi at New Delhi\n\n**Parties:**\n\n* Appellant: M/S V-Guard Industries Ltd.\n* Respondents: The Registrar of Trademarks and Another (Respondent 2)\n\n**Background:**\nThe appellant opposed the registration of the \"LIVGUARD ZING\" mark by Respondent 2. The evidence in support of the opposition was sent to the Register of Trade Marks on May 8, 2018.\n\n**Legal Arguments:**\n\n* The issue before the court is whether the appellant's opposition should be treated as abandoned due to delay in complying with Rule 45 of the Trade Mark Rules.\n* The court finds that there is no provision for condoning or extending time for compliance under the Trade Marks Act and Rules.\n* The rules require all documents to be made, served, left, or sent to the Trade Marks Registry within a specified timeframe.\n\n**Decision:**\n\n* The High Court of Delhi at New Delhi held that the learned Deputy Registrar erred in treating the opposition as abandoned due to delay in compliance with Rule 45.\n* The court upheld the rights of the opponent under the Trade Marks Act and Rules, noting that the provisions are designed to protect a valuable right vested in an opponent.\n\n**Date:**\n\n* May 7, 2018 (evidence sent by courier)\n* May 10, 2018 (evidence received by the office of the Register of Trade Marks)\n* August 30, 2018 (impugned order dated)\n\n**References:** \nSee PDF \"MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf\"",
      "pdf_source": "36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf",
      "nodes": [
        {
          "title": "Page 5",
          "node_id": "0007",
          "start_index": 5,
          "end_index": 5,
          "summary": "Here is a summary of page 5 from the provided PDF:\n\n**Court Case:** MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.\n\n**Case Number:** C.A.(COMM.IPD-TM) 39/2022 & I.A. 179/2023\n**Neutral Citation Number:** 2023/DHC/000137\n\n**Key Facts:**\n\n* On May 7, 2018, the Trademarks office was non-functional.\n* The evidence in opposition was sent by courier on May 8, 2018, and received by the Registrar's office on May 10, 2018.\n\n**Issues before the Court:**\n\n* Whether the learned Deputy Registrar rightly treated the opposition as abandoned due to delay in compliance with Rule 45 of Trade Mark Rules.\n* Whether there was delay on the part of the appellant and whether it could be condoned.\n\n**Proceedings:**\n\n* The court has heard the arguments of both parties, namely V-Guard Industries Ltd. (appellant) and the Registrar of Trademarks & Anr. (respondent).\n* The decision is reserved by the court, with Ms. Bhabna Das representing the appellant and Mr. Jithin M George representing the respondent.\n\n**PDF Source:** MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr. (2023/DHC/000137) C.A.(COMM.IPD-TM) 39",
          "content": "Neutral Citation Number : 2023/DHC/000137 \n C.A.(COMM.IPD-TM) 39/2022  \n                                                       Page 5 of 9  \n \n   \nTrade Marks was non-functional on 7th May 2018, as a result of \nwhich, on 8th\n \n May 2018, the evidence in opposition was sent by the \nappellant by courier.  \n12. \nAs already noticed, it is an admitted position that the evidence \nin opposition was indeed received by the office of the learned \nRegistrar on 10th\n \n May 2018.     \n13. \nThe issue before the court is whether, in these circumstances \nand in the backdrop of the existing statutory scenario as contained in \nthe Trade Marks Act and Trade Marks Rules, this Court should sustain \nthe decision of the learned Deputy Registrar, vide the impugned order \ndated 30th\n \n August 2018, to treat the opposition filed by the appellant, \nto the application of Respondent 2 seeking registration of the \n“LIVGUARD ZING” mark, as having been abandoned.  \n14. \nHaving heard Ms. Bhabna Das, learned Counsel for the \nappellant and Mr. Jithin M George, learned Counsel for Respondent 2, \nin my considered opinion, the answer to this query has necessarily to \nbe in the negative.  \n \n15. \nTwo issues would arise for consideration. The first is whether \nthere was, in fact, delay on the part of the appellant in complying with \nthe requirement of Rule 45 of the Trade Mark Rules. The second is \nwhether, assuming there was any such delay, the learned Registrar \nwas empowered to condone the delay or to extend the time for \ncompliance with Rule 45.  \n \n16. \nAddressing the first issue first, Rule 45 (1) stipulates that, \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified",
          "pdf_source": "36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf",
          "nodes": []
        },
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "Here is a summary of page 6 from the document in under 200 words:\n\n**Case Details**\n\n* Case Number: C.A.(COMM.IPD-TM) 39/2022\n* Neutral Citation Number: 2023/DHC/000137\n* Document source: MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr (PDF: 36)\n\n**Summary**\n\nPage 6 mentions the following key points:\n\n* Under Rule 45(1), an opponent opposing trade mark registration must leave evidence with the Registrar within two months.\n* The opponent must also deliver copies of the affidavit to the applicant and intimate the Registrar about this delivery.\n* Rule 8 states that all documents related to a pending trade mark application should be \"made, served, left, or sent\" to the appropriate Trade Marks Registry office.\n\n**Relevant Points**\n\nRule 45(1) requires an opponent to take certain actions in response to a trade mark application. The court notes that these provisions are somewhat ambiguous but relevant to determining whether the appellant (V-Guard Industries Ltd.) can benefit from this ambiguity.",
          "content": "Neutral Citation Number : 2023/DHC/000137 \n C.A.(COMM.IPD-TM) 39/2022  \n                                                       Page 6 of 9  \n \n   \nwithin two months from service of the copy of the counter statement \nfiled by the trade mark applicant, the opponent opposing the \nregistration of the mark is required to leave, with the Registrar, \nevidence by way of affidavit in support of the opposition.  Rule 45(1) \nfurther requires the opponent to the registration of the trade mark to \ndeliver, to the applicant seeking registration, copies of the affidavit \nleft with the Registrar and to intimate the Registrar in that regard.   \n \n17. \nRule 8 of the Trade Mark Rules states that all documents, which \nare required “to be made, served, left or sent or paid at or to the Trade \nMarks Registry”, in respect of a Trade Mark in respect of which an \napplication seeking registration is pending, “shall be made, served, \nleft, or sent or paid to the appropriate office of the Trade Marks \nRegistry”. \n \n18. \nAs already observed, the provision is as nebulous as can be.  \nThe Rule, envelops, in one parenthesis, the expressions “made” \n“served”, “left”, “sent” and “paid” and refers to such making, serving, \nleaving, sending, or paying “to the appropriate office of the Trade \nMarks Registry”. \n \n19. \nGiven the nature of these provisions and the fact that they affect \na valuable right vested in an opponent who seeks to oppose the \nregistration of a trade mark, I am of the considered opinion that, in the \nfacts of the present case, the appellant won’t be entitled to the benefit \nof the ambiguity inherent in this provision.  \n \n20. \nThe appellant, in its application seeking extension of time as \nfiled before the learned Deputy Registrar, as well as in the present \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified",
          "pdf_source": "36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf",
          "nodes": []
        },
        {
          "title": "Page 7",
          "node_id": "0009",
          "start_index": 7,
          "end_index": 7,
          "summary": "Here's a summary of page 7 from the PDF:\n\nThe appellant (M/S V-Guard Industries Ltd) claims that they attempted to e-file evidence in support of their objections on May 7, 2018, but were unable to do so because the Registrar of Trade Marks' website was non-functional. The court accepts this assertion as true and notes that a response affidavit from the respondent denying this fact is not filed.\n\nThe court also observes that on the next day (May 8, 2018), the appellant sent the evidence by courier. This suggests that the appellant did indeed make an attempt to e-file the objections, which is considered sufficient under Rule 8 of the Trade Marks Rules.\n\nThe court's decision is based on the following:\n\n* The appellant provided affidavit evidence supporting their claim.\n* No response from the respondent denying this fact was filed.\n* The next-day delivery of the evidence by courier indicates that an earlier electronic attempt was made, which failed due to technical issues.",
          "content": "Neutral Citation Number : 2023/DHC/000137 \n C.A.(COMM.IPD-TM) 39/2022  \n                                                       Page 7 of 9  \n \n   \nappeal, has stated, on affidavit, that the attempts at e-filing of the \nevidence in support of the appellant’s objections, on 7th\n \n May 2018, \ncould not succeed as the website of the learned Registrar of Trade \nMarks was non-functional.  The impugned order does not seek to \ndiscountenance this assertion.  Notice was issued in the present \nappeal, and there is no affidavit filed by way of response, denying this \nfact.  \n21. \nThere is no reason, therefore, for this Court to disbelieve the \nappellant and presume that, in fact, no attempt was made by the \nappellant to e-file the objections on 7th May 2018, especially as, on the \nvery next day i.e., 8th May 2018, the objections were in fact sent by \ncourier.  This is not, therefore, a case in which the appellant exhibited \nany callous or negligent indolence.   The fact that, on 8th May 2018, \nthe appellant did indeed courier the evidence in support of the \nopposition to the office of the learned Registrar of Trade Marks, \ncompels this Court to believe the assertion, in the present appeal, also \ncontained in the application for extension of time filed before the \nlearned Registrar with the evidence in support of the opposition was in \nfact forwarded to the office of the learned Registrar electronically on \n7th\n \n May 2018, but that the attempt could not succeed as the website \nwas non-functional.  \n22. \nSuch an attempt, in my view, would fall within the broad \nembrace of the expression “made, served, left, sent or paid to the \nappropriate office of the Trade Marks Registry”, as employed in Rule \n8 of the Trade Marks Rules.  \n \n23. \nEven otherwise, it is well-settled that, while procedural \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified",
          "pdf_source": "36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0013",
      "start_index": 8,
      "end_index": 9,
      "summary": "**Court Decision: MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.**\n\n**Neutral Citation Number:** 2023/DHC/000137 \n\n**C.A.(COMM.IPD-TM) 39/2022 & I.A. 179/2023**\n\nThe High Court of Delhi at New Delhi heard this appeal on January 6, 2023.\n\n**Facts and Parties:**\n\n* Appellant: MS V-Guard Industries Ltd.\n* Respondents: The Registrar of Trade Marks & Anr.\n* Opponent's evidence was received three days late due to efforts made to \"leave\" it with the office of the learned Registrar within the stipulated time in Rule 45(1) of the Trade Marks Rules.\n\n**Court Decision:**\n\nThe court set aside the impugned order dated August 30, 2018, and directed the Deputy Registrar to take into account the evidence in opposition filed by the appellant. The registration of Respondent 2's trade mark is subject to the outcome of the view to be taken by the learned Deputy Registrar on the opposition.\n\n**Decision:**\n\nThe appeal was allowed with no order as to costs. Both sides are directed not to seek any adjournment from the learned Deputy Registrar, and the matter must proceed with all due expedition. The Deputy Registrar is to take a decision on the appellant's notice of opposition within three months from January 6, 2023.\n\n**PDF Source:** MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr., C.A.(COMM.IPD-TM) 39/2022 & I.A. 179/2023 (2023/DHC/000137), High Court of Delhi at New Delhi, January 6, 2023.",
      "pdf_source": "36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf",
      "nodes": [
        {
          "title": "Page 8",
          "node_id": "0011",
          "start_index": 8,
          "end_index": 8,
          "summary": "Here is a summary of page 8 from the provided PDF (MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf) [1] :\n\nThe court opined that **Rule 45(1)** of the Trade Marks Rules, which requires evidence in opposition to be left with the office of the learned Registrar within two months, must not be interpreted so rigidly as to result in evisceration of substantive rights. The court noted that the appellant had made efforts to submit the evidence on time and that it was received three days late.\n\nThe court distinguished between **Rule 45(1)** (requirement for evidence submission) and **Section 131** of the Trade Marks Act, under which discretion may be exercised if the learned Registrar deems fit. However, in this case, no such discretion had been applied.\n\n**Decision**: The court set aside the impugned order dated August 30, 2018, directing the Deputy Registrar to consider the evidence in opposition and form a view accordingly.\n\nDate: Reference is not provided on the exact date on page 8 but, the signing date of the digitally signed document is January 10, 2023.\n\n[1] PDF Source: MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf",
          "content": "Neutral Citation Number : 2023/DHC/000137 \n C.A.(COMM.IPD-TM) 39/2022  \n                                                       Page 8 of 9  \n \n   \nprovisions are required to be accorded their due deference, they cannot \nbe interpreted so rigidly as to result in evisceration of substantive \nrights vested in the citizens. The right to oppose registration of a trade \nmark is just as sacrosanct as the right to seek registration. In the \npeculiar facts of the present case once the application for opposition \nhad actually been filed by the appellant, it would be entirely unfair for \nthis Court to uphold the decision of the learned Deputy Registrar to \ntreat the opposition as having been abandoned only because the \nevidence in support of the opposition was received three days late, \nespecially as, prima facie, the appellant did make efforts to “leave” the \nevidence in support of the opposition with the office of the learned \nRegistrar  within the time stipulated in that regard in Rule 45(1) of the  \nTrade Marks Rules. \n \n24. \nIn that view of the matter, this Court is not required to examine \nthe somewhat more nuanced issue of whether, where the evidence in \nopposition is not “left” with the office of the learned Registrar within \ntwo months as envisaged in Rule 45(1), any discretion vests in the \nlearned Registrar to extend the time therefor.   That would involve a \njuxtaposed interpretation of Section 131 of the Trade Marks Act and \nRules 8, 45 and 109 of the Trade Marks Rules, which may be left for \nanother sunny evening.   \n \n25. \nIn the facts of the present case, therefore, the impugned order \ndated 30th\n \n August 2018 would stand set aside.  \n26. \nResultantly, the learned Deputy Registrar is directed to take into \naccount the evidence in opposition filed by the appellant and take a \nview thereon.  \n \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified",
          "pdf_source": "36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf",
          "nodes": []
        },
        {
          "title": "Page 9",
          "node_id": "0012",
          "start_index": 9,
          "end_index": 9,
          "summary": "The document is a court judgment in a trademark case between M/S V-Guard Industries Ltd (Appellant) and The Registrar of Trademarks & Anr (Respondents). Here are the key points from page 9:\n\n**Order**\n\n* The appeal stands allowed with no order as to costs.\n* The registration of Respondent 2's trade mark remains subject to the outcome of the opposition filed by the Appellant.\n\n**Directions**\n\n* The Deputy Registrar is directed to take a decision on the Appellant's notice of opposition within three months from January 6, 2023.\n* Both parties are to present themselves before the Deputy Registrar's office on January 16, 2023 at 11:00 am.\n* The matter is to be proceeded with all due expedition, and no adjournment is to be sought.\n\n**Judicial Officers**\n\n* C. Hari Shankar, J delivered the judgment on January 6, 2023.\n* Kamla Rawat signed the digitally the document on January 10, 2023 at 11:21 am.\n\nSource: MS V-Guard Industries Ltd v. The Registrar of Trade Marks & Anr (2023/DHC/000137), C.A.(COMM.IPD-TM) 39/2022",
          "content": "Neutral Citation Number : 2023/DHC/000137 \n C.A.(COMM.IPD-TM) 39/2022  \n                                                       Page 9 of 9  \n \n   \n27. \nI am informed that, after the impugned order was passed, the \nmark of Respondent 2 has proceeded to registration.  \n \n28. \nNeedless to say, in view of the decision taken today, the \nregistration of the Trade Mark shall remain subject to the outcome of \nthe view to be taken by the learned Deputy Registrar on the opposition \nfiled by the appellant.  \n \n29. \nIn order that equities are not unnecessarily prejudiced, the  \nlearned Deputy Registrar is directed to take a decision on the \nappellant's notice of opposition, after following due process in that \nregard, within a period of three months from today.  \n \n30. \nFor this purpose, both sides are directed to present themselves \nbefore the office of the learned Deputy Registrar of Trade Marks on \n16th\n \n January 2023 at 11:00 a.m. \n31. \nThe learned Deputy Registrar would proceed with the matter \nwith all due expedition.  \n \n32. \nBoth sides are directed not to seek any adjournment from the \nlearned Deputy Registrar. \n \n33. \nThe appeal stands allowed accordingly with no order as to \ncosts.  \n \nC. HARI SHANKAR, J. \n \nJANUARY 6, 2023 \n \ndsn \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified",
          "pdf_source": "36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-16T13:19:13.416936",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}