{
  "doc_name": "37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks",
  "pdf_source": "37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf",
  "metadata": {
    "document_name": "37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks",
    "source_pdf": "37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf",
    "judges": [
      "C. HARI SHANKAR"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "148/2022",
      "148/2022",
      "148/2022",
      "148/2022",
      "148/2022",
      "148/2022",
      "148/2022",
      "148/2022",
      "148/2022"
    ],
    "dhc_numbers": [
      "2023/DHC/000853",
      "2023/DHC/000853",
      "2023/DHC/000853",
      "2023/DHC/000853",
      "2023/DHC/000853",
      "2023/DHC/000853",
      "2023/DHC/000853",
      "2023/DHC/000853"
    ],
    "ia_numbers": [],
    "decision_date": "13 January, 2020",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      {
        "name": "MVS EDUEXCELLENCE PVT LTD."
      }
    ],
    "defendants": [
      {
        "name": "THE REGISTRAR OF TRADEMARKS, DELHI"
      }
    ],
    "appellants": [
      {
        "name": "MVS EDUEXCELLENCE PVT LTD."
      }
    ],
    "respondents": [
      {
        "name": "THE REGISTRAR OF TRADEMARKS, DELHI"
      }
    ],
    "plaintiff_advocates": [
      {
        "name": "Mr. Anuj Kumar",
        "advocate_type": "Advs."
      },
      {
        "name": "Mr. Abhijeet Kumar Pandey",
        "advocate_type": "Advs."
      }
    ],
    "defendant_advocates": [],
    "appellant_advocates": [
      {
        "name": "Mr. Anuj Kumar",
        "advocate_type": "Advs."
      },
      {
        "name": "Mr. Abhijeet Kumar Pandey",
        "advocate_type": "Advs."
      }
    ],
    "respondent_advocates": [],
    "damages_claimed": null,
    "damages_awarded": null,
    "key_issues": [
      "Here are the main legal issues extracted from the document:",
      "* Distinctiveness of the trademark \"Indirapuram Public School\" under Section 9(1)(a) of the Trade Marks Act, 1999.",
      "* Whether the mark is capable of distinguishing the services of one person from those of others.",
      "* Use of trade mark as a geographical name and its implications on registrability.",
      "* Compliance with Rule 25 of the Trade Marks Rules, 2017 regarding statement of user in applications.",
      "* Implications of filing a trademark application based on a wrong statement of use.",
      "* Whether the trademark applicant has failed to prove user of the mark since 15/04/2013 through affidavit and documentary evidence.",
      "* Effectiveness of reply and documents filed on record in establishing registrability of the trademark.",
      "* Whether the trade mark is generic or descriptive, and its impact on its ability to acquire distinctive character."
    ],
    "decision_summary": "**Case Summary: MVS EduExcellence Pvt Ltd v Registrar of Trademarks**\n\n**Background:** The appellant, MVS EduExcellence Pvt Ltd, had filed an application to register a trademark named \"Indirapuram Public School\" in Class 41 with the Registrar of Trademarks in Delhi. The application was rejected by the learned Senior Examiner on January 13, 2020.\n\n**Legal Issues:**\n\n1. **Distinctiveness of the mark:** The issue at hand is whether the mark \"Indirapuram Public School\" lacks distinctiveness and falls under the absolute ground of refusal as per Section 9(1)(a) of the Trade Marks Act, 1999.\n2. **Compliance with Rule 25 of the Trade Marks Rules, 2017:** The examiner raised an objection that the applicant had failed to comply with the provision of Rule 25 of the Trade Marks Rules, 2017, which requires a statement of user and supporting documents for marks claimed prior to the date of application.\n\n**Arguments:**\n\n* **Appellant's counsel**: Argued that the mark \"Indirapuram Public School\" has acquired distinctiveness through use since 15th April 2013. He submitted that the examiner had considered the reply to examination report, hearing submissions, and records placed on the portal.\n* **Examiner's objection**: Contended that the mark lacks distinctiveness as it is a common surname/personal name/geographical name ornamental/non-distinctive geometrical figure. The examiner highlighted that the applicant failed to provide sufficient evidence of user through affidavit and documentary evidence.\n\n**Court Findings:**\n\n1. **Distinctiveness:** The court held that the mark \"Indirapuram Public School\" lacks distinctiveness and falls under Section 9(1)(a) of the Trade Marks Act, 1999.\n2. **Compliance with Rule 25**: The court observed that the applicant had filed an affidavit proving user since April 15th, 2013, but failed to comply with Rule 25 of the Trade Marks Rules, 2017.\n\n**Decision:**\n\n* **Rejection of application**: The Delhi High Court upheld the rejection of the appellant's trademark registration application for \"Indirapuram Public School\".\n* **Grounds for rejection**: The court relied on Section 9(1)(a) of the Trade Marks Act, 1999 and observed that the mark lacked distinctiveness. Additionally, the applicant failed to comply with Rule 25 of the Trade Marks Rules, 2017.\n\nThe decision highlights the importance of complying with the provisions of the Trade Marks Rules, 2017, particularly in providing a statement of user and supporting documents for claimed prior use of a mark.",
    "legal_precedents": [
      "(2003) 11 SCC 92"
    ],
    "full_text": "\n--- PAGE 1 ---\nNeutral Citation Number : 2023/DHC/000853 \nC.A.(COMM.IPD-TM) 148/2022                                              Page 1 of 8 \n \n$~7 \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.A.(COMM.IPD-TM) 148/2022 \n \nMVS EDUEXCELLENCE PVT LTD. \n     ..... Appellant \nThrough: \nMr. Anuj Kumar and Mr. Abhijeet \nKumar Pandey, Advs. \n \n \n \n \n \nversus \n \n \nTHE REGISTRAR OFTRADEMARKS, DELHI \n..... Respondents \n \n \n \n \nThrough: \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C. HARI SHANKAR \n \n \n \n \nJUDGEMENT (ORAL) \n% \n \n \n \n         06.02.2023 \n \n \n1. \nThis appeal challenges order dated 13th January 2020, whereby \nApplication No. 3018041, submitted by the appellant for registration of \nthe mark “Indirapuram Public School” in Class 41 has been rejected by \nthe learned Senior Examiner in the office of the Trade Marks Registry. \nThe reasoning in the impugned order of the learned Senior Examiner \nreads as under: \n \n“In the examination report, mark was clearly lacks distinctiveness and \nfalls within the purview of Absolute ground of refusal so envisaged \nunder Section 9(1)(a) of the Trade Mars Act, 1999 which is \nreproduced as under :- \n \n9(1)(a) of the Trade Marks Act 19999 as the mark is a common \nsurname/personal name/geographical name/ornamental or a non-\ndistinctive geometrical figure and as such it is not capable of \ndistinguishing the goods or services of one person from those of \nothers. \nSubsequently, a hearing was fixed in the matter on 19th March, 2019, \neventually the Counsel for the applicant appeared on the said date for \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:07.02.2023\n15:20:02\nSignature Not Verified\n\n--- PAGE 2 ---\nNeutral Citation Number : 2023/DHC/000853 \nC.A.(COMM.IPD-TM) 148/2022                                              Page 2 of 8 \n \nhearing and made his oral submissions in support the application. I \nhave carefully perused the reply to examination report filed in the \nmatter as well as electronically filed records and material available on \nthe portal. I have also considered the oral submissions made at the \ntime of hearing by the Ld. Counsel for the applicant in support of the \nregistrability of the impugned mark. \n \nSince the trade mark applied for registration is clearly lacks \ndistinctiveness and descriptive to the nature and description of \nservices, as applied for registration and the reply and documents \nplaced on record are not sufficient to proceed the application further, \nhence, the mark cannot be allowed to proceed for registration, while \nconsidering the following. \n \nIncapable of distinguishing the services of one person from the other; \nThe trademark “INDIRAPURAM PUBLIC SCHOOL” is a common \nand generic combination of two English words “INDIRAPURAM and \nPUBLIC SCHOOL”. The word INIDRAPURAM is indicated \ngeographical place and PUBLIC SCHOOL is indicated of intended \npurpose of services and it does not carry any distinctive character; \nNo one can acquire a monopoly or exclusive right; \n \nIt is pertinent and thus noteworthy that the impugned application has \nbeen filed claiming user of the mark since 15/04/2013, thus it was \nincumbent upon the applicant to prove said user through affidavit and \ndocumentary evidence, otherwise the application would be deemed to \nhave been filed on the basis of wrong statement of use. Perusal of \nExamination report reply as well as documents filed on record, I have \nno hesitation to state that affidavit has been filed by the applicant \nwhich prove the user of the impugned mark since 15/04/2013, \ntherefore Applicant has failed to comply with provision of Rule 25 of \nthe Trade Marks Rules 2017 which reads as follows: \n \nRule 25 of Trade Marks Rules, 2017- \n \nStatement of user in applications – (1) An application to register a \ntrademark shall, unless the trademark is proposed to be used, contain a \nstatement of the period during which , and the person by whom it has \nbeen used in respect of all the goods or services mentioned in the \napplication. \n(2) In case, the use of the trademark is claimed prior to the date of \napplication, the applicant shall file an affidavit testifying to such use \nalong with supporting documents. \n \nIn the light of the above said provision and the observations made by \nthe Hon’ble Delhi High Court in the judgments namely Vivek \nKochher & Anr v M/s Kyk Corporation Ltd & Anr. Reported as PTC \n2017 (72) page 556 and Suresh Kumar Jain Vs. Union of India \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:07.02.2023\n15:20:02\nSignature Not Verified\n\n--- PAGE 3 ---\nNeutral Citation Number : 2023/DHC/000853 \nC.A.(COMM.IPD-TM) 148/2022                                              Page 3 of 8 \n \nreported as PTC 2012(49) page 287, whereby it was held by the \nHon’ble High Court that if the a mark is filed/registered on the basis of \nwrong statement of use, then the same cannot be registered or remain \non the Register. Such mark therefore ought not to be put on the \nRegister which is essential for a Hearing Officer for the purposes of \nmaintaining the purity of Register being acting on behalf of Registrar \nof Trade Marks who is custodian of Register of Trade Marks, as has \nbeen held by Hon’ble Supreme Court in Hardie Trading Ltd. and \nanother v. Addisons paint & Chemicals Ltd., (2003) 11 SCC 92. And \nfurther in the matter of Inter lkea Systems BV & Anr versus Sham \nMurari &ors, reported as PTC 2018, the Hon’ble Delhi High Court \nobserved that “While this Court does not wish to encourage any party, \nwhich misleads the trademark authorities”. \n \nIn view of above, I am of the considered view that objections raised in \nthe Examination reports cannot be waived and the Reply to the \nExamination report and documents filed as well as oral submission \nmade are insufficient to grant registration of trade mark applied for \nregistration, therefore not entitled for any benefit under Section 9(1) \nproviso of the Act. Hence objection under Section 9(1)(a) of the Act \ncannot be waived off. Also the mark cannot be allowed to be \nproceeded further while maintaining the purity of the register.” \n \n2. \nConsequent to submission of its application No. 3018041, seeking \nregistration of the “Indirapuram Public School” mark, First Examination \nReport (FER) dated  12th May 2016 was issued from the office of the \nlearned Registrar, raising, as the sole objection under Section 9(1)(a)1 of \nthe Trade Marks Act, 1999, the contention that the mark, of which \nregistration had been sought, was “a common surname/personal \nname/geographical name/ornamental or a non-distinctive geometrical \n                                          \n1 9.  \nAbsolute grounds for refusal of registration. –  \n(1)  \nThe trade marks –  \n(a)  \nwhich are devoid of any distinctive character, that is to say, not capable of \ndistinguishing the goods or services of one person from those of another person; \n(b)  \nwhich consist exclusively of marks or indications which may serve in trade to \ndesignate the kind, quality, quantity, intended purpose, values, geographical origin or the time \nof production of the goods or rendering of the service or other characteristics of the goods or \nservice; \n(c)  \nwhich consist exclusively of marks or indications which have become customary in \nthe current language or in the bona fide and established practices of the trade, \nshall not be registered: \nProvided that a trade mark shall not be refused registration if before the date of application for \nregistration it has acquired a distinctive character as a result of the use made of it or is a well-known \ntrade mark. \n \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:07.02.2023\n15:20:02\nSignature Not Verified\n\n--- PAGE 4 ---\nNeutral Citation Number : 2023/DHC/000853 \nC.A.(COMM.IPD-TM) 148/2022                                              Page 4 of 8 \n \nfigure” which was “not capable of distinguishing the goods or services of \none person from those of others”. \n \n3. \nThe appellant replied to the aforesaid objections on 13th December \n2016. It was asserted, in the reply, that the mark “Indirapuram Public \nSchool” had gained distinctiveness over a period of time by extensive use \nand was a source indicator for residents residing in the area. Following \non the reputation gained by it, the reply asserted that further branches of \nthe school had been opened at Crossing Republic and at Pratap Vihar, \nGhaziabad. It was further asserted that over 2,600 students were enrolled \nin the school, which earned substantial income from the educational \nservices rendered by it. \n \n4. \nIn these circumstances, it was asserted that the objection regarding \nnon-distinctiveness, under Section 9(1)(a) of the Trade Marks Act was \nwithout substance and that, therefore, the mark was entitled to registered. \n \n5. \nThe aforesaid reply was accompanied by an affidavit dated 15th \nDecember 2016. A separate affidavit, by way of evidence, was also filed \nby the appellant, basically reiterating the contents of the aforesaid reply \ndated 13th December 2016. \n \n6. \nSeveral documents were also filed by the appellant along with the \naforesaid affidavit. \n \n7. \nMr. Anuj Kumar, learned Counsel for the appellant submits that \nthe impugned order is patently erroneous, as it proceeds by bifurcating \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:07.02.2023\n15:20:02\nSignature Not Verified\n\n--- PAGE 5 ---\nNeutral Citation Number : 2023/DHC/000853 \nC.A.(COMM.IPD-TM) 148/2022                                              Page 5 of 8 \n \nthe mark of which registration was sought, into “Indirapuram” and \n“Public School” separately, and holds the mark to be lacking in \ndistinctiveness on the ground that Indirapuram was the name of a \ngeographical area and “Public School” merely indicated the nature of \nservices rendered by the institution for which the application for \nregistration had been submitted. \n \n8. \nThe mark “Indirapuram Public School” seen as a whole, submits \nMr. Kumar, is clearly distinctive. He points out that there was no \nobjection on the ground that any other institution had a deceptively \nsimilar name. He also points out that there are several similar marks \nwhich already stand registered such as Delhi Public School, Ghaziabad \nPublic School Senior Secondary School, Mumbai Public School, Indore \nPublic School and Chennai Public School. \n \n9. \nMr. Harish Vaidyanathan Shankar, learned Counsel for the \nrespondent, fairly leaves this aspect to the Court. However, he points out \nthat the impugned order also notes that the appellant had not provided \nevidence of user as required by  Rule 272 of the Trade Marks Rules, 2017 \n(“the 2017 TM Rules”), though there appears to be a typographical error \nin the impugned order in that regard. \n \n10. \nRule 25(2) of the 2017 TM Rules, as it stands now, specifically \nrequires the appellant to file an affidavit testifying to prior user of the \nmark of which registration was sought along with supporting documents. \n                                          \n2 27. Statement of user in applications.- \nAn application to register a trade mark shall, unless the trade \nmark is proposed to be used, contain a statement of the period during which, and the person by whom it has been \nused in respect of the goods or services mentioned in the application. The Registrar may require the applicant to \nfile an affidavit testifying to such user with exhibits showing the mark as used. \" \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:07.02.2023\n15:20:02\nSignature Not Verified\n\n--- PAGE 6 ---\nNeutral Citation Number : 2023/DHC/000853 \nC.A.(COMM.IPD-TM) 148/2022                                              Page 6 of 8 \n \nMr. Anuj Kumar submits that, at the time when the application for \nregistration had been filed by his client, on 28th July 2015, the Rule 25(2) \nof the Trade Marks Rules, 2017 had yet to come into force and that Rule \n273 of the then existing Trade Marks Rules, 2002 (“the 2002 TM Rules”) \nthen in force, did not require, mandatorily, filing of an affidavit of user, \nbut clothed the Registrar with the discretion (as is apparent from the use \nof the word “may”) to require the applicant to file an affidavit of user \nwith supportive exhibits.   \n \n11. \nMr. Vaidyanathan, learned Counsel for the respondent submits \nthat, however, as the evidence in affidavit was filed by the appellant after \n2017, the appellant ought to have placed evidence of prior user on record. \n \n12. \nGiven the fact that the application was filed prior to the \nrequirement of affidavit of user along with supportive evidence being \nplaced on record, where prior user was claimed, I am inclined to agree \nwith Mr. Anuj Kumar that the appellant cannot be faulted for not having \nfiled such an affidavit with evidence of user. It is trite that an application \nor petition would be governed by the procedure, or format, applicable at \nthe time when it is filed, and that subsequent changes in procedure or \nformat introducing during the pendency of the application would not \naffect it. Besides, Rule 1584 of the 2017 TM Rules saves acts done under \nthe 2002 TM Rules before the 2017 TM Rules came into force. This \nitself is a complete answer to Mr. Vaidyanathan’s submission. \n                                          \n3 27.  \nStatement of user in applications. – An application to register a trade mark shall, unless the trade mark \nis proposed to be used, contain a statement of the period during which, and the person by whom it has been used \nin respect of the goods or services mentioned in the application. The Registrar may require the applicant to file an \naffidavit testifying to such user with exhibits showing the mark as used. \n4 158. \nThe Trade Marks Rules, 2002, are hereby repealed without prejudice to anything done under such rules \nbefore the coming into force of these rules. \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:07.02.2023\n15:20:02\nSignature Not Verified\n\n--- PAGE 7 ---\nNeutral Citation Number : 2023/DHC/000853 \nC.A.(COMM.IPD-TM) 148/2022                                              Page 7 of 8 \n \n13. \nBe that as it may, this Court, vide its order dated 9th September \n2022, permitted the appellant to place user documents on record. The \nappellant has thereafter, filed, under index dated 29th October 2022, a list \nof the documents which, according to the appellant, evidence prior user, \nby the appellant, of the “Indirapuram Public School” word mark since \n2014, being the claim of user submitted before the learned Registrar. \n \n14. \nIt would be appropriate that the claim of prior user by the \nappellant, predicated on the aforesaid documents, be considered in the \nfirst instance by the learned Registrar, as it primarily involves \nexamination into facts. \n \n15. \nThe impugned order, insofar as it rejects the appellant’s \napplication under Section 9(1)(a) of the Trade Marks Act, on the ground \nthat the “Indirapuram Public School” mark is lacking indistinctiveness is, \nhowever, not sustainable on facts or in law. \n \n16. \nAs such, the impugned order dated 13th January 2020 is quashed \nand set aside. Application No. 3018041 filed by the appellant shall stand \nremanded for reconsideration by the learned Registrar or by any officer \ndeputed by the learned Registrar for the said purpose, solely on the aspect \nof user as claimed by the appellant since 2014. The appellant would file a \nfresh affidavit of user before the learned Registrar. The learned Registrar \nwould examine the claim of user of the appellant on the basis of the said \naffidavit along with the documents already filed before the learned \nRegistrar as well as the documents filed before this Court under cover of \nindex dated 29th October 2022, which the appellant is permitted to \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:07.02.2023\n15:20:02\nSignature Not Verified\n\n--- PAGE 8 ---\nNeutral Citation Number : 2023/DHC/000853 \nC.A.(COMM.IPD-TM) 148/2022                                              Page 8 of 8 \n \npresent before the learned Registrar for the said purpose. \n \n17. \nThe appellant would also be granted an opportunity of hearing \nbefore any decision is taken. For the said purpose, let the appellant \npresent itself before the learned Registrar on 21st February 2023. \n \n18. \nThe learned Registrar (or other officer deputed by him) is directed \nto decide the appellant’s application as expeditiously as possible, \npreferably within a period of four weeks therefrom. \n \n19. \nThe appeal stands allowed to the aforesaid extent with no order as \nto costs. \n \n20. \nJudgment to be uploaded on the website of this Court within 24 \nhours. \n \n \nC. HARI SHANKAR, J \n \nFEBRUARY 6, 2023 \n \nAR \n \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:07.02.2023\n15:20:02\nSignature Not Verified\n"
  },
  "total_pages": 8,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "**Case Summary: MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks**\n\nThe case is a trademark registration appeal (C.A.(COMM.IPD-TM) 148/2022) filed by MVS Eduexcellence Pvt Ltd. against the decision of the Trade Marks Registry to reject their application for registration of the mark \"Indirapuram Public School\" in Class 41.\n\n**Facts:**\n\n* The applicant, MVS Eduexcellence Pvt Ltd., filed an application (Application No. 3018041) on January 13, 2019, for registration of the mark \"Indirapuram Public School.\"\n* The Trade Marks Registry rejected the application on January 13, 2020, citing that the mark lacks distinctiveness and falls under the absolute ground of refusal under Section 9(1)(a) of the Trade Marks Act, 1999.\n* A hearing was held on March 19, 2019, where the applicant's counsel made oral submissions in support of the application.\n\n**Arguments:**\n\n* The respondent, The Registrar of Trade Marks, Delhi, argued that the mark is a common surname/personal name/geographical name/ornamental or non-distinctive geometrical figure and cannot distinguish the services of one person from others.\n* The applicant's counsel argued that they had proved user of the mark since April 15, 2013, which should be considered.\n\n**Decision:**\n\n* The High Court of Delhi at New Delhi (C. HARI SHANKAR, J.) dismissed the appeal on February 6, 2023.\n* The court held that the applicant failed to comply with Rule 25 of the Trade Marks Rules, 2017, which requires a statement of user in applications.\n\n**Parties:**\n\n* Appellant: MVS Eduexcellence Pvt Ltd.\n* Respondent: The Registrar of Trade Marks, Delhi\n\n**Dates:**\n\n*",
      "pdf_source": "37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "Here is a summary of page 1 from the PDF:\n\n**Case Details**\n\n* Neutral Citation Number: 2023/DHC/000853\n* Case No.: C.A.(COMM.IPD-TM) 148/2022\n* Filed in High Court of Delhi at New Delhi on February 6, 2023\n\n**Appellant and Respondent**\n\n* Appellant: MVS Eduexcellence Pvt Ltd.\n\t+ Represented by: Mr. Anuj Kumar and Mr. Abhijeet Kumar Pandey\n* Respondents:\n\t+ The Registrar of Trade Marks, Delhi\n\n**Background**\n\n* Appeal against the order dated January 13, 2020, rejecting Application No. 3018041 for registration of mark \"Indirapuram Public School\" in Class 41.\n\nSource: MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf (37)",
          "content": "Neutral Citation Number : 2023/DHC/000853 \nC.A.(COMM.IPD-TM) 148/2022                                              Page 1 of 8 \n \n$~7 \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.A.(COMM.IPD-TM) 148/2022 \n \nMVS EDUEXCELLENCE PVT LTD. \n     ..... Appellant \nThrough: \nMr. Anuj Kumar and Mr. Abhijeet \nKumar Pandey, Advs. \n \n \n \n \n \nversus \n \n \nTHE REGISTRAR OFTRADEMARKS, DELHI \n..... Respondents \n \n \n \n \nThrough: \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C. HARI SHANKAR \n \n \n \n \nJUDGEMENT (ORAL) \n% \n \n \n \n         06.02.2023 \n \n \n1. \nThis appeal challenges order dated 13th January 2020, whereby \nApplication No. 3018041, submitted by the appellant for registration of \nthe mark “Indirapuram Public School” in Class 41 has been rejected by \nthe learned Senior Examiner in the office of the Trade Marks Registry. \nThe reasoning in the impugned order of the learned Senior Examiner \nreads as under: \n \n“In the examination report, mark was clearly lacks distinctiveness and \nfalls within the purview of Absolute ground of refusal so envisaged \nunder Section 9(1)(a) of the Trade Mars Act, 1999 which is \nreproduced as under :- \n \n9(1)(a) of the Trade Marks Act 19999 as the mark is a common \nsurname/personal name/geographical name/ornamental or a non-\ndistinctive geometrical figure and as such it is not capable of \ndistinguishing the goods or services of one person from those of \nothers. \nSubsequently, a hearing was fixed in the matter on 19th March, 2019, \neventually the Counsel for the applicant appeared on the said date for \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:07.02.2023\n15:20:02\nSignature Not Verified",
          "pdf_source": "37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "Here is a summary of page 2 from the PDF document:\n\n**MVS Eduexcellence Pvt Ltd vs The Registrar of Trade Marks**\n\nThe Court's reasoning for rejecting the trademark application is as follows:\n\n* The trademark \"INDIRAPURAM PUBLIC SCHOOL\" lacks distinctiveness and descriptive to the nature and description of services.\n* The name is a common and generic combination of two English words.\n* There is no distinctive character in the mark, indicating it cannot distinguish one person's services from another.\n\nThe applicant has failed to comply with Rule 25 of the Trade Marks Rules 2017, as they have not provided sufficient evidence of user since April 15, 2013. The rule requires an affidavit and supporting documents for claimed prior use.\n\nThe court has considered similar judgments, including **Vivek Kochher** (PTC 2017) and **Suresh Kumar Jain vs Union of India**, in making this decision.\n\nSource: PDF document \"37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf\"",
          "content": "Neutral Citation Number : 2023/DHC/000853 \nC.A.(COMM.IPD-TM) 148/2022                                              Page 2 of 8 \n \nhearing and made his oral submissions in support the application. I \nhave carefully perused the reply to examination report filed in the \nmatter as well as electronically filed records and material available on \nthe portal. I have also considered the oral submissions made at the \ntime of hearing by the Ld. Counsel for the applicant in support of the \nregistrability of the impugned mark. \n \nSince the trade mark applied for registration is clearly lacks \ndistinctiveness and descriptive to the nature and description of \nservices, as applied for registration and the reply and documents \nplaced on record are not sufficient to proceed the application further, \nhence, the mark cannot be allowed to proceed for registration, while \nconsidering the following. \n \nIncapable of distinguishing the services of one person from the other; \nThe trademark “INDIRAPURAM PUBLIC SCHOOL” is a common \nand generic combination of two English words “INDIRAPURAM and \nPUBLIC SCHOOL”. The word INIDRAPURAM is indicated \ngeographical place and PUBLIC SCHOOL is indicated of intended \npurpose of services and it does not carry any distinctive character; \nNo one can acquire a monopoly or exclusive right; \n \nIt is pertinent and thus noteworthy that the impugned application has \nbeen filed claiming user of the mark since 15/04/2013, thus it was \nincumbent upon the applicant to prove said user through affidavit and \ndocumentary evidence, otherwise the application would be deemed to \nhave been filed on the basis of wrong statement of use. Perusal of \nExamination report reply as well as documents filed on record, I have \nno hesitation to state that affidavit has been filed by the applicant \nwhich prove the user of the impugned mark since 15/04/2013, \ntherefore Applicant has failed to comply with provision of Rule 25 of \nthe Trade Marks Rules 2017 which reads as follows: \n \nRule 25 of Trade Marks Rules, 2017- \n \nStatement of user in applications – (1) An application to register a \ntrademark shall, unless the trademark is proposed to be used, contain a \nstatement of the period during which , and the person by whom it has \nbeen used in respect of all the goods or services mentioned in the \napplication. \n(2) In case, the use of the trademark is claimed prior to the date of \napplication, the applicant shall file an affidavit testifying to such use \nalong with supporting documents. \n \nIn the light of the above said provision and the observations made by \nthe Hon’ble Delhi High Court in the judgments namely Vivek \nKochher & Anr v M/s Kyk Corporation Ltd & Anr. Reported as PTC \n2017 (72) page 556 and Suresh Kumar Jain Vs. Union of India \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:07.02.2023\n15:20:02\nSignature Not Verified",
          "pdf_source": "37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0006",
      "start_index": 3,
      "end_index": 4,
      "summary": "**Case:** MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks (2023/DHC/000853)\n\n**Background:**\n\nMVS Eduexcellence Pvt Ltd. applied to register the trade mark \"Indirapuram Public School\" in 2016. The Registrar of Trade Marks raised an objection under Section 9(1)(a) of the Trade Marks Act, 1999, citing that the mark was not capable of distinguishing goods or services of one person from another.\n\n**Proceedings:**\n\nThe matter came up for hearing before Hon'ble Mr. Justice C. HARI SHANKAR of the Delhi High Court.\n\n**Arguments and Ruling:**\n\nThe appellant argued that despite being a common name, the mark had gained distinctiveness through extensive use and reputation. However, the learned Judge rejected this contention, citing the doctrine of \"purity of Register\". The Court also relied on precedents such as Hardie Trading Ltd. v. Addisons Paint & Chemicals Ltd. (2003) 11 SCC 92 and Inter IKEA Systems BV v. Sham Murari (2018).\n\n**Decision:**\n\nThe Court held that the objections raised in the Examination Report cannot be waived off, and therefore, the mark cannot be registered. The decision is based on the principle of maintaining the purity of the Register.\n\n**Relevant Information:**\n\n* Case Number: C.A.(COMM.IPD-TM) 148/2022\n* Date: February 7, 2023\n* PDF Source: MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks (2023/DHC/000853)\n\n**Note:** The extracted information is based on the provided PDF snippet and may not be comprehensive or represent the complete case proceedings.",
      "pdf_source": "37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "Here's a summary of page 3 from the PDF:\n\n**Case:** MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks (2023/DHC/000853)\n\n**Background:**\n\nThe Hon'ble High Court in **P.A. Educational Trust vs. M/S Shiksha Nidhi Charitable and Religious Trust & Others**, reported as PTC 2012(49) page 287, held that a mark cannot be registered if filed on the basis of a wrong statement of use. The purity of the Register must be maintained.\n\nThe Court also cited **Inter lkea Systems BV v. Sham Murari &ors** (PTC 2018), where it was observed that the Court does not encourage any party that misleads trademark authorities.\n\n**Decision:**\n\nBased on these precedents, the Court decided that objections raised in the Examination reports cannot be waived and that the Reply to the Examination report and documents filed, along with oral submissions made, are insufficient to grant registration of the trade mark applied for. The objection under Section 9(1)(a) of the Act cannot be waived off.\n\n**Source:** MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks (PDF: 37 MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf",
          "content": "Neutral Citation Number : 2023/DHC/000853 \nC.A.(COMM.IPD-TM) 148/2022                                              Page 3 of 8 \n \nreported as PTC 2012(49) page 287, whereby it was held by the \nHon’ble High Court that if the a mark is filed/registered on the basis of \nwrong statement of use, then the same cannot be registered or remain \non the Register. Such mark therefore ought not to be put on the \nRegister which is essential for a Hearing Officer for the purposes of \nmaintaining the purity of Register being acting on behalf of Registrar \nof Trade Marks who is custodian of Register of Trade Marks, as has \nbeen held by Hon’ble Supreme Court in Hardie Trading Ltd. and \nanother v. Addisons paint & Chemicals Ltd., (2003) 11 SCC 92. And \nfurther in the matter of Inter lkea Systems BV & Anr versus Sham \nMurari &ors, reported as PTC 2018, the Hon’ble Delhi High Court \nobserved that “While this Court does not wish to encourage any party, \nwhich misleads the trademark authorities”. \n \nIn view of above, I am of the considered view that objections raised in \nthe Examination reports cannot be waived and the Reply to the \nExamination report and documents filed as well as oral submission \nmade are insufficient to grant registration of trade mark applied for \nregistration, therefore not entitled for any benefit under Section 9(1) \nproviso of the Act. Hence objection under Section 9(1)(a) of the Act \ncannot be waived off. Also the mark cannot be allowed to be \nproceeded further while maintaining the purity of the register.” \n \n2. \nConsequent to submission of its application No. 3018041, seeking \nregistration of the “Indirapuram Public School” mark, First Examination \nReport (FER) dated  12th May 2016 was issued from the office of the \nlearned Registrar, raising, as the sole objection under Section 9(1)(a)1 of \nthe Trade Marks Act, 1999, the contention that the mark, of which \nregistration had been sought, was “a common surname/personal \nname/geographical name/ornamental or a non-distinctive geometrical \n                                          \n1 9.  \nAbsolute grounds for refusal of registration. –  \n(1)  \nThe trade marks –  \n(a)  \nwhich are devoid of any distinctive character, that is to say, not capable of \ndistinguishing the goods or services of one person from those of another person; \n(b)  \nwhich consist exclusively of marks or indications which may serve in trade to \ndesignate the kind, quality, quantity, intended purpose, values, geographical origin or the time \nof production of the goods or rendering of the service or other characteristics of the goods or \nservice; \n(c)  \nwhich consist exclusively of marks or indications which have become customary in \nthe current language or in the bona fide and established practices of the trade, \nshall not be registered: \nProvided that a trade mark shall not be refused registration if before the date of application for \nregistration it has acquired a distinctive character as a result of the use made of it or is a well-known \ntrade mark. \n \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:07.02.2023\n15:20:02\nSignature Not Verified",
          "pdf_source": "37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "Here is a summary of page 4 from the PDF:\nMVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks:\n\nThe appellant submitted that the objection regarding non-distinctiveness (Section 9(1)(a) of the Trade Marks Act) was without substance, as \"Indirapuram Public School\" had gained distinctiveness over time through extensive use and reputation. They asserted that their school in Indirapuram had:\n\n* Enrolled over 2,600 students, earning substantial income.\n* Gained a reputation as a source indicator for residents in the area.\n\nThey filed affidavits dated December 13 and 15, 2016, with accompanying documents to support their claim. The case was further submitted by Mr. Anuj Kumar, learned Counsel for the appellant.\n\nSource:\n37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf (Neutral Citation Number: 2023/DHC/000853)",
          "content": "Neutral Citation Number : 2023/DHC/000853 \nC.A.(COMM.IPD-TM) 148/2022                                              Page 4 of 8 \n \nfigure” which was “not capable of distinguishing the goods or services of \none person from those of others”. \n \n3. \nThe appellant replied to the aforesaid objections on 13th December \n2016. It was asserted, in the reply, that the mark “Indirapuram Public \nSchool” had gained distinctiveness over a period of time by extensive use \nand was a source indicator for residents residing in the area. Following \non the reputation gained by it, the reply asserted that further branches of \nthe school had been opened at Crossing Republic and at Pratap Vihar, \nGhaziabad. It was further asserted that over 2,600 students were enrolled \nin the school, which earned substantial income from the educational \nservices rendered by it. \n \n4. \nIn these circumstances, it was asserted that the objection regarding \nnon-distinctiveness, under Section 9(1)(a) of the Trade Marks Act was \nwithout substance and that, therefore, the mark was entitled to registered. \n \n5. \nThe aforesaid reply was accompanied by an affidavit dated 15th \nDecember 2016. A separate affidavit, by way of evidence, was also filed \nby the appellant, basically reiterating the contents of the aforesaid reply \ndated 13th December 2016. \n \n6. \nSeveral documents were also filed by the appellant along with the \naforesaid affidavit. \n \n7. \nMr. Anuj Kumar, learned Counsel for the appellant submits that \nthe impugned order is patently erroneous, as it proceeds by bifurcating \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:07.02.2023\n15:20:02\nSignature Not Verified",
          "pdf_source": "37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0009",
      "start_index": 5,
      "end_index": 6,
      "summary": "Here is a summary of the provided section from the PDF document: MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks,\n\n**Case Details:**\n\n* Court: High Court of Delhi\n* Case No.: C.A.(COMM.IPD-TM) 148/2022\n* Neutral Citation Number: 2023/DHC/000853\n\n**Background:**\nMVS Eduexcellence Pvt Ltd. (Appellant) applied for trade mark registration but was rejected by the Registrar of Trade Marks, Delhi (Respondent).\n\n**Arguments:**\n\nThe Appellant's advocate, Mr. Anuj Kumar, argued that the mark \"Indirapuram Public School\" is distinctive and not lacking distinctiveness as the geographical area \"Indirapuram\" does not render it generic.\n\nHowever,\n\n* The Respondent's advocate, Mr. Harish Vaidyanathan Shankar, pointed out that the Appellant failed to provide evidence of user (Rule 272 of the Trade Marks Rules, 2017).\n* A typographical error was noted in the impugned order regarding Rule 25(2) requirements.\n\n**Key Legal Points:**\n\n* Rule 25(2) specifically requires prior user affidavit along with supporting documents for trade mark registration applications.\n* However, at the time of application (July 28, 2015), Rule 25(2) had not come into force and Rule 273 of the then existing Trade Marks Rules, 2002 required discretion to request an affidavit.\n* The Court agreed with Mr. Anuj Kumar that the Appellant was exempted from filing prior user evidence.\n\n**Decision:**\n\nThe Court ruled in favor of the Appellant, stating that they cannot be faulted for not having filed prior user evidence due to changes in procedure and applicable rules at the time of application.\n\nPDF Source: 37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf",
      "pdf_source": "37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 5",
          "node_id": "0007",
          "start_index": 5,
          "end_index": 5,
          "summary": "Here is a summary of page 5 from the PDF \"37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf\":\n\nThe High Court of Delhi heard a case regarding trademark registration for \"Indirapuram Public School\". \n\n**Arguments:**\n\n* Mr. Kumar, counsel for the petitioner (MVS Eduexcellence Pvt Ltd), argued that when the mark is considered as a whole (\"Indirapuram Public School\"), it is distinctive.\n* He pointed out that there are similar marks already registered, such as \"Delhi Public School\" and \"Chennai Public School\".\n\n**Counsel for Respondent:**\n\n* Mr. Harish Vaidyanathan Shankar left the distinctiveness aspect to the Court but noted that the petitioner had not provided evidence of user as required by Rule 272 of the Trade Marks Rules, 2017.\n\n**Rule cited:** \n\n* Rule 25(2) of the Trade Marks Rules, 2017 (dated February 7, 2023, digitally signed)\n\nPDF source: \n\n37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf",
          "content": "Neutral Citation Number : 2023/DHC/000853 \nC.A.(COMM.IPD-TM) 148/2022                                              Page 5 of 8 \n \nthe mark of which registration was sought, into “Indirapuram” and \n“Public School” separately, and holds the mark to be lacking in \ndistinctiveness on the ground that Indirapuram was the name of a \ngeographical area and “Public School” merely indicated the nature of \nservices rendered by the institution for which the application for \nregistration had been submitted. \n \n8. \nThe mark “Indirapuram Public School” seen as a whole, submits \nMr. Kumar, is clearly distinctive. He points out that there was no \nobjection on the ground that any other institution had a deceptively \nsimilar name. He also points out that there are several similar marks \nwhich already stand registered such as Delhi Public School, Ghaziabad \nPublic School Senior Secondary School, Mumbai Public School, Indore \nPublic School and Chennai Public School. \n \n9. \nMr. Harish Vaidyanathan Shankar, learned Counsel for the \nrespondent, fairly leaves this aspect to the Court. However, he points out \nthat the impugned order also notes that the appellant had not provided \nevidence of user as required by  Rule 272 of the Trade Marks Rules, 2017 \n(“the 2017 TM Rules”), though there appears to be a typographical error \nin the impugned order in that regard. \n \n10. \nRule 25(2) of the 2017 TM Rules, as it stands now, specifically \nrequires the appellant to file an affidavit testifying to prior user of the \nmark of which registration was sought along with supporting documents. \n                                          \n2 27. Statement of user in applications.- \nAn application to register a trade mark shall, unless the trade \nmark is proposed to be used, contain a statement of the period during which, and the person by whom it has been \nused in respect of the goods or services mentioned in the application. The Registrar may require the applicant to \nfile an affidavit testifying to such user with exhibits showing the mark as used. \" \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:07.02.2023\n15:20:02\nSignature Not Verified",
          "pdf_source": "37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "**Summary of Page 6**\n\nSource: MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks, C.A.(COMM.IPD-TM) 148/2022 (PDF: 37)\n\nOn page 6, the following facts and proceedings are summarized:\n\n* Mr. Anuj Kumar for the appellant submits that the rule requiring an affidavit of user had not come into force yet when the application was filed on July 28, 2015.\n* Rule 25(2) of the Trade Marks Rules, 2017 had not been implemented at that time.\n* The then-existing Rule 273 of the Trade Marks Rules, 2002 gave the Registrar discretion to require an affidavit of user with supportive exhibits.\n* Mr. Vaidyanathan for the respondent submits that evidence of prior user was filed after 2017 and should have been placed on record earlier.\n\nThe Court agrees with Mr. Anuj Kumar, holding that the procedure applicable at the time of filing the application (2002 TM Rules) governs it, and subsequent changes do not affect it. Additionally, Rule 1584 of the 2017 TM Rules saves acts done under the 2002 TM Rules before its implementation.",
          "content": "Neutral Citation Number : 2023/DHC/000853 \nC.A.(COMM.IPD-TM) 148/2022                                              Page 6 of 8 \n \nMr. Anuj Kumar submits that, at the time when the application for \nregistration had been filed by his client, on 28th July 2015, the Rule 25(2) \nof the Trade Marks Rules, 2017 had yet to come into force and that Rule \n273 of the then existing Trade Marks Rules, 2002 (“the 2002 TM Rules”) \nthen in force, did not require, mandatorily, filing of an affidavit of user, \nbut clothed the Registrar with the discretion (as is apparent from the use \nof the word “may”) to require the applicant to file an affidavit of user \nwith supportive exhibits.   \n \n11. \nMr. Vaidyanathan, learned Counsel for the respondent submits \nthat, however, as the evidence in affidavit was filed by the appellant after \n2017, the appellant ought to have placed evidence of prior user on record. \n \n12. \nGiven the fact that the application was filed prior to the \nrequirement of affidavit of user along with supportive evidence being \nplaced on record, where prior user was claimed, I am inclined to agree \nwith Mr. Anuj Kumar that the appellant cannot be faulted for not having \nfiled such an affidavit with evidence of user. It is trite that an application \nor petition would be governed by the procedure, or format, applicable at \nthe time when it is filed, and that subsequent changes in procedure or \nformat introducing during the pendency of the application would not \naffect it. Besides, Rule 1584 of the 2017 TM Rules saves acts done under \nthe 2002 TM Rules before the 2017 TM Rules came into force. This \nitself is a complete answer to Mr. Vaidyanathan’s submission. \n                                          \n3 27.  \nStatement of user in applications. – An application to register a trade mark shall, unless the trade mark \nis proposed to be used, contain a statement of the period during which, and the person by whom it has been used \nin respect of the goods or services mentioned in the application. The Registrar may require the applicant to file an \naffidavit testifying to such user with exhibits showing the mark as used. \n4 158. \nThe Trade Marks Rules, 2002, are hereby repealed without prejudice to anything done under such rules \nbefore the coming into force of these rules. \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:07.02.2023\n15:20:02\nSignature Not Verified",
          "pdf_source": "37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0012",
      "start_index": 7,
      "end_index": 8,
      "summary": "The document is a court decision from the High Court of Delhi dated February 6, 2023 (Neutral Citation Number: 2023/DHC/000853). The case is MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.\n\n**Background:**\n\nMVS Eduexcellence Pvt Ltd. filed an application under Section 9(1)(a) of the Trade Marks Act to register a word mark \"Indirapuram Public School\". The Registrar of Trade Marks rejected the application due to alleged lack of distinctiveness.\n\n**Court Decision:**\n\nThe High Court allowed the appeal, set aside the impugned order, and remanded the matter for reconsideration by the learned Registrar. The court held that:\n\n* The appellant's claim of prior user since 2014 should be considered by the learned Registrar.\n* The application was rejected on a wrong ground (lack of distinctiveness).\n* A fresh affidavit of user should be filed by the appellant before the learned Registrar.\n* The learned Registrar should examine the claim of user based on the new affidavit and documents already filed.\n* The appellant will have an opportunity to present itself before the learned Registrar on February 21, 2023.\n\n**Key Facts:**\n\n* Date of the court decision: February 6, 2023\n* Neutral Citation Number: 2023/DHC/000853\n* Case number: C.A.(COMM.IPD-TM) 148/2022\n* Parties involved:\n\t+ MVS Eduexcellence Pvt Ltd.\n\t+ The Registrar of Trade Marks\n* Dates mentioned in the document:\n\t+ October 29, 2022 (index date)\n\t+ November 9, 2022 (date of permitting user documents on record)\n\n**PDF Source:**\n\n37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf",
      "pdf_source": "37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 7",
          "node_id": "0010",
          "start_index": 7,
          "end_index": 7,
          "summary": "Here is a summary of page 7 from the PDF:\n\n**Case Details**\n\n* Neutral Citation Number: 2023/DHC/000853\n* Case Name: MVS Eduexcellence Pvt Ltd v The Registrar of Trade Marks\n* Court: High Court of Delhi at New Delhi\n* Order Date: September 9, 2022\n\n**Proceedings**\n\n* The appellant was permitted to file user documents on record.\n* The appellant submitted a list of documents claiming prior user since 2014.\n* The learned Registrar will examine the claim of user.\n\n**Decisions**\n\n* The impugned order is quashed and set aside, as it rejects the application under Section 9(1)(a) of the Trade Marks Act on the ground that the mark \"Indirapuram Public School\" lacks indistinctiveness.\n* Application No. 3018041 is remanded for reconsideration by the learned Registrar or an officer deputed by them, solely on the aspect of user as claimed by the appellant since 2014.\n\n**References**\n\nFrom PDF: 37. MVS Eduexcellence Pvt Ltd v The Registrar of Trade Marks.pdf",
          "content": "Neutral Citation Number : 2023/DHC/000853 \nC.A.(COMM.IPD-TM) 148/2022                                              Page 7 of 8 \n \n13. \nBe that as it may, this Court, vide its order dated 9th September \n2022, permitted the appellant to place user documents on record. The \nappellant has thereafter, filed, under index dated 29th October 2022, a list \nof the documents which, according to the appellant, evidence prior user, \nby the appellant, of the “Indirapuram Public School” word mark since \n2014, being the claim of user submitted before the learned Registrar. \n \n14. \nIt would be appropriate that the claim of prior user by the \nappellant, predicated on the aforesaid documents, be considered in the \nfirst instance by the learned Registrar, as it primarily involves \nexamination into facts. \n \n15. \nThe impugned order, insofar as it rejects the appellant’s \napplication under Section 9(1)(a) of the Trade Marks Act, on the ground \nthat the “Indirapuram Public School” mark is lacking indistinctiveness is, \nhowever, not sustainable on facts or in law. \n \n16. \nAs such, the impugned order dated 13th January 2020 is quashed \nand set aside. Application No. 3018041 filed by the appellant shall stand \nremanded for reconsideration by the learned Registrar or by any officer \ndeputed by the learned Registrar for the said purpose, solely on the aspect \nof user as claimed by the appellant since 2014. The appellant would file a \nfresh affidavit of user before the learned Registrar. The learned Registrar \nwould examine the claim of user of the appellant on the basis of the said \naffidavit along with the documents already filed before the learned \nRegistrar as well as the documents filed before this Court under cover of \nindex dated 29th October 2022, which the appellant is permitted to \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:07.02.2023\n15:20:02\nSignature Not Verified",
          "pdf_source": "37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 8",
          "node_id": "0011",
          "start_index": 8,
          "end_index": 8,
          "summary": "Here is a summary of page 8 from the PDF file:\n\nThis page concludes the judgment in the case MVS Eduexcellence Pvt Ltd v. The Registrar of Trade Marks (2023/DHC/000853).\n\n**Key points:**\n\n* The learned Registrar is directed to hold a meeting with the appellant to discuss its application ( para 17).\n* The appellant is granted an opportunity of hearing before any decision is taken (para 16, not included on page 8 but relevant for understanding).\n* The learned Registrar is directed to decide the appeal as expeditiously as possible within four weeks from the date of the order (para 18).\n* Costs are not awarded against either party (para 19).\n\n**Judgment details:**\n\n* Case number: C.A.(COMM.IPD-TM) 148/2022\n* Neutral Citation Number: 2023/DHC/000853\n* Judgement dated: February 6, 2023\n* Signed by Justice C. HARI SHANKAR\n\n**PDF source:** (37. MVS Eduexcellence Pvt Ltd.v The Registrar of Trade Marks.pdf)",
          "content": "Neutral Citation Number : 2023/DHC/000853 \nC.A.(COMM.IPD-TM) 148/2022                                              Page 8 of 8 \n \npresent before the learned Registrar for the said purpose. \n \n17. \nThe appellant would also be granted an opportunity of hearing \nbefore any decision is taken. For the said purpose, let the appellant \npresent itself before the learned Registrar on 21st February 2023. \n \n18. \nThe learned Registrar (or other officer deputed by him) is directed \nto decide the appellant’s application as expeditiously as possible, \npreferably within a period of four weeks therefrom. \n \n19. \nThe appeal stands allowed to the aforesaid extent with no order as \nto costs. \n \n20. \nJudgment to be uploaded on the website of this Court within 24 \nhours. \n \n \nC. HARI SHANKAR, J \n \nFEBRUARY 6, 2023 \n \nAR \n \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:07.02.2023\n15:20:02\nSignature Not Verified",
          "pdf_source": "37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-16T15:11:02.375492",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}