{
  "doc_name": "39. Purushottam Singhal Proprietor MS. Prime Cable Industries v. Registrar of Trade Marks",
  "pdf_source": "39. Purushottam Singhal Proprietor MS. Prime Cable Industries v. Registrar of Trade Marks.pdf",
  "metadata": {
    "document_name": "39. Purushottam Singhal Proprietor MS. Prime Cable Industries v. Registrar of Trade Marks",
    "source_pdf": "39. Purushottam Singhal Proprietor MS. Prime Cable Industries v. Registrar of Trade Marks.pdf",
    "judges": [
      "C. HARI SHANKAR 1."
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "13/2021",
      "13/2021",
      "13/2021",
      "13/2021",
      "13/2021",
      "13/2021",
      "13/2021",
      "13/2021",
      "13/2021"
    ],
    "dhc_numbers": [],
    "ia_numbers": [],
    "decision_date": "20 November, 1997",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [],
    "defendants": [],
    "appellants": [],
    "respondents": [],
    "plaintiff_advocates": [],
    "defendant_advocates": [],
    "appellant_advocates": [],
    "respondent_advocates": [],
    "damages_claimed": null,
    "damages_awarded": null,
    "key_issues": [
      "Here are the main legal issues extracted from the document:",
      "* Deemed abandonment under Section 21(2) of the Trade Marks Act: Whether notice of opposition was validly served on the applicant?",
      "* Service of notice under Section 21(2): Was the appellant's agent, M/s Manmohan Singh and Associates, properly served with notice of opposition by speed post?",
      "* Proof of service: Can the Registry rely solely on a statement that notice was sent by speed post without providing any document to confirm receipt or delivery?",
      "* Timeliness of response under Section 21(2): Did the applicant fail to file a counter-statement within two months from receipt of notice, as required by law?",
      "* Abandonment of application: Can an application be deemed abandoned if the applicant failed to respond within the prescribed timeframe without proving that they had no intention to proceed with the application?",
      "These legal issues relate to the interpretation and application of Section 21(2) of the Trade Marks Act, 1999."
    ],
    "decision_summary": "**Summary of the Legal Case**\n\n**Background:**\n\nThe present appeal (C.A.(COMM.IPD-TM) 13/2021) was filed by Purushottam Singhal, Proprietor of MS Prime Cable Industries (Appellant), against the Registrar of Trade Marks and Another (Respondents).\n\n**Facts:**\n\n*   On November 20, 1997, the Appellant submitted an application seeking registration of the trademark \"PRIME CAB\" in Class 9 of the NICE classification with the Registrar of Trade Marks.\n*   The first Examination Report (FER) was issued on June 29, 2001, and the Appellant replied on September 5, 2001.\n*   Opposition to the registration of \"PRIME CAB\" was filed by Respondent 2 on July 14, 2006.\n*   According to the Appellant's case, neither the Appellant nor its authorized agents were served with notice of the opposition.\n\n**Legal Issues:**\n\nThe central legal issue in this case is whether the Appellant can be deemed to have abandoned their application for registration of \"PRIME CAB\" because they failed to respond to the notice of opposition within the stipulated timeframe of 2 months from receipt of the notice.\n\n**Arguments by Parties:**\n\n*   The Appellant (through counsel, Mr. Akash Swami) argued that they were never served with notice of the opposition, contrary to Section 21(2) of the Trade Marks Act, requiring the registrar to serve a copy of the notice on the applicant.\n*   Respondent 1 (the Registry of Trade Marks) submitted that notice of the opposition was sent by speed post to the Appellant's agent, M/s Manmohan Singh & Associates.\n\n**Court Findings:**\n\nThe Court noted that:\n\n*   No documentary evidence was presented by Respondents to prove the despatch or delivery of the notice of opposition either to the agent or to the Appellant.\n*   The testimony provided by counsel for Respondent 1 (Ms. Mehra) that the notice of opposition was sent via speed post on March 18th, 2019, without a postal receipt.\n\n**Decision:**\n\nThe High Court of Delhi at New Delhi held that: since there is no sufficient evidence proving service, the Appellant should not be deemed to have abandoned the application for registration. Therefore, the appeal is allowed, and the impugned order was set aside by the Registrar who shall now consider the application as if it were fresh.\n\nThe Court also noted that: Respondent 2, whose opposition this is, must proceed with their case in accordance with law if the applicant proceeds to file a new response after service of notice.",
    "legal_precedents": [],
    "full_text": "\n--- PAGE 1 ---\nNeutral Citation Number : 2023:DHC:1993 \n C.A.(COMM.IPD-TM) 13/2021                                                                                              Page 1 of 8  \n \n   \n$~3 \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.A.(COMM.IPD-TM) 13/2021 \nPURUSHOTTAM SINGHAL PROPRIETOR MS. PRIME \nCABLE INDUSTRIES  \n \n \n            ..... Appellant \n \n \n \n \nThrough: \nMr. Akash Swami, Adv. \n \n \n \n \n \nversus \n \n \nREGISTRAR OF TRADE MARKS & ANR.        ..... Respondents \nThrough: \nMs. Shreya V. Mehra for Mr. \nKirtiman Singh, Adv. for R-1 \nMr. Bikash Ghorai, Ms Anju Agrawal and Mr. \nDeepak Panwar, Advs. for R-2 \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C. HARI SHANKAR \n \n \n \n \n1. \nThis appeal under Section 91 of the Trade Marks Act, 1999 assails \norder dated 14\nJUDGMENT (O R A L) \n% \n \n \n \n \n20.03.2023 \n \n \nth June 2019, passed on behalf of the Registrar of Trade \nMarks, whereby Application No. 779092, filed by the appellant seeking \nregistration of the trade mark PRIME CAB has been rejected as having \nbeen deemed to have been abandoned by the appellant, invoking, for the \npurpose, Section 21(2)1\n \n of the Trade Marks Act. \n                                          \n1 21.  \nOpposition to registration. –  \n(1)  \nAny person may, within four months from the date of the advertisement or re-advertisement of \nan application for registration, give notice in writing in the prescribed manner and on payment of such \nfee as may be prescribed, to the Registrar, of opposition to the registration. \n(2)  \nThe Registrar shall serve a copy of the notice on the applicant for registration and, within two \nmonths from the receipt by the applicant of such copy of the notice of opposition, the applicant shall \nsend to the Registrar in the prescribed manner a counter statement of the grounds on which he relies for \nhis application, and if he does not do so he shall be deemed to have abandoned his application. \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:21.03.2023\n12:50:28\nSignature Not Verified\n\n--- PAGE 2 ---\nNeutral Citation Number : 2023:DHC:1993 \n C.A.(COMM.IPD-TM) 13/2021                                                                                              Page 2 of 8  \n \n   \n2. \nThe application seeking registration of the mark PRIME CAB in \nClass 9 of the NICE classification was submitted by the appellant on 20th \nNovember 1997 in the office of the Registrar. First Examination Report \n(FER) was issued on or on behalf of the Registrar on 29th June 2001, to \nwhich the appellant filed his reply on 5th\n \n September 2001. \n3. \nVarious other proceedings took place with respect to the said \napplication, including proceedings which travelled to this Court, which \nare not of particular relevance to the dispute at hand. \n \n4. \nFor the purpose of the present dispute, suffice it to state that an \nopposition was filed by Respondent 2, to the application of the appellant, \non 14th\n \n July 2006. \n5. \nThe appellant’s case is that neither was the appellant, nor was any \nof its authorised agents, ever served with notice of the opposition filed by \nRespondent 2, as required by Section 21(2) of the Trade Marks Act.  \n \n6. \nMs. Shreya Mehra, learned Counsel who appears for Respondent 1 \n(the Registry of Trade Marks) submits that notice of the opposition filed \nby Respondent 2 was sent to M/s Manmohan Singh and Associates, the \nagent of the appellant, by speed post on 18th\n \n March 2019. Mr. Akash \nSwami, learned Counsel for the appellant submits, on instructions, that \nhis client never received any such speed post.  \n7. \nApart from making a statement to the effect that the notice was \nsent by speed post, Ms. Mehra is unable to provide any document \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:21.03.2023\n12:50:28\nSignature Not Verified\n\n--- PAGE 3 ---\nNeutral Citation Number : 2023:DHC:1993 \n C.A.(COMM.IPD-TM) 13/2021                                                                                              Page 3 of 8  \n \n   \ncontaining any postal receipt of the notice of opposition having been sent \nby speed post or of the speed post having been delivered to any addressee \nmentioned therein. All that this Court has, therefore, is a bald assertion, \ncontained in a note handed over by Ms. Mehra to the effect that the \nnotice of opposition was sent to the agent of the appellant by speed post \non 18th\n \n March 2019.  Ms Mehra offers to say so on affidavit; but, in the \nabsence of any proof of the document having in fact been despatched to \nthe appellant by speed post, I cannot, quite obviously, accept the said \nstatement, even if stated on affidavit.  Ms Mehra is candid in admitting \nthat her client has no documentary material evidencing proof of despatch, \nto the appellant, of the notice of hearing of the opposition, at any point of \ntime. \n8. \nMr. Ghorai, who appears on behalf of the Respondent 2, submits \nthat, in fact, there was an earlier service of the notice of opposition on the \nappellant vide letter dated 22nd\n \n October 2008. He has filed a reply to the \npresent petition, placing a copy of the said letter on record.  \n9. \nHowever, a perusal of the letter dated 22nd October 2008 reveals \nthat, while it is addressed to the appellant as well as its agent, the copy \nhas been forwarded only to M/s R K Diwan and Co., as is manifest from \nthe tick mark alongside the name of M/s R K Diwan and Co. There is \nnothing to indicate that the said notice dated 22nd\n \n October 2008 was ever \nserved on the appellant or on any of its authorised agents, or even \ndespatched to any of them. \n10. \nAt this juncture, Mr. Ghorai again intercedes to draw my attention \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:21.03.2023\n12:50:28\nSignature Not Verified\n\n--- PAGE 4 ---\nNeutral Citation Number : 2023:DHC:1993 \n C.A.(COMM.IPD-TM) 13/2021                                                                                              Page 4 of 8  \n \n   \nto a letter dated 30th\n \n“We submit that the Notice of Opposition filed by us on July 14, 2006, \nwas served on the Applicants’ Attorneys under the cover of your letter \nNo. TOP/3224 dated 22nd October 2008.” \n \n March 2013, addressed by M/s R K Diwan and \nCompany to the Registrar of Trade Marks, para 1 of which reads thus: \n11. \nI fail to understand as to how the authorised agent of Respondent 2 \ncould arrogate to itself the authority to certify service of notice of \nopposition on the appellant. To reiterate, there is no document to show \nthat the notice dated 22nd\n \n October 2008 was ever served on the appellant \nor on its authorised agent. \n12. \nIndeed, if, in fact, notice of the opposition had been served on the \nappellant or its authorised agent on 22nd October 2008, there is no \nreasonable expression as to why notice of the opposition was again sent \nto the appellant on 18th March 2019. The fact that the Registry deemed it \nappropriate to issue notice of the opposition to the appellant on 18th \nMarch 2019 also indicates, prima facie, that there was no prior valid \nservice of the notice of opposition on the appellant. I have, in fact, \nqueried of Ms. Mehra, as to whether there was any prior service of notice \non the opposition filed by Respondent 2 on the appellant prior to 18th\n \n \nMarch 2019. She frankly submits that she is unaware of any such service. \n13. \nThe right to seek registration of a trademark is a valid and valuable \nright which vests in an applicant by the Trade Marks Act. Though there \nis no law which mandates registration of a trade mark, a mark, once \nregistered, becomes entitled to valuable privileges under the Act, \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:21.03.2023\n12:50:28\nSignature Not Verified\n\n--- PAGE 5 ---\nNeutral Citation Number : 2023:DHC:1993 \n C.A.(COMM.IPD-TM) 13/2021                                                                                              Page 5 of 8  \n \n   \nincluding, most importantly, a right to combat infringement, conferred by \nSection 29.  \n \n14. \nOnce an applicant applies for registration of a trademark, there is \nno reason why the applicant should abandon the application. It is well-\nsettled, in law, that abandonment is necessarily a voluntary act, and \ncannot be presumed, save and except in the manner in which the law \nentitles such a presumption to be drawn. Insofar as the Trade Marks Act \nis concerned, no doubt, Section 21(2) deems an applicant, who has \napplied for registration of a trade mark, to have abandoned the \napplication, if he fails to send, to the Registrar, a counterstatement in \nresponse to the notice of opposition, by any opponent opposing the \napplication, within two months from the date of receipt, by him, of such \nnotice of opposition. In view of the severe consequence of the inaction \nenvisaged by Section 21(2) of the Trade Marks Act, the provision has to \nbe strictly construed. There must, therefore, be positive evidence of (i) \nservice of notice on the applicant, seeking registration of a trade mark, of \nthe copy of the notice of opposition and (ii) failure, by the applicant, to \nsend a counterstatement, in response to the opposition, within two \nmonths therefrom. \n \n15. \nRule 14 of the Trade Marks Rules, 2017 deals with service of \ndocuments, and sub-rules (1) to (3) thereof read thus: \n“14. \nService of documents. –  \n \n(1) \nAll applications, notices, statements, papers having \nrepresentations affixed thereto, or other documents authorised \nor required by the Act or the rules made thereunder, served, \nleft or sent, at or to the Trade Marks Registry or with or to the \nRegistrar or any other person may be delivered by hand or sent \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:21.03.2023\n12:50:28\nSignature Not Verified\n\n--- PAGE 6 ---\nNeutral Citation Number : 2023:DHC:1993 \n C.A.(COMM.IPD-TM) 13/2021                                                                                              Page 6 of 8  \n \n   \nthrough the post by a prepaid letter or may be submitted \nelectronically in the manner as laid down by the Registry. \n \n(2) \nAn application or any document so sent shall be \ndeemed to have been made, served, left or sent at the time \nwhen the letter containing the same would be delivered in the \nordinary course of post. \n \n(3) \nIn proving such sending, it shall be sufficient to prove \nthat the letter was properly addressed and put into the post.” \n \n16. \nShorn of superfluities, Rule 14(1) envisages delivery, of all \napplications, notices, statements, papers or other documents, “by hand or \nsent through the post by a pre-paid letter” or electronically in the manner \nlaid down by the Registrar. \n \n17. \nIn the present case, though the appellant was situated in Delhi, \nthere is no proof of any effort having been made to serve the notice of \nopposition dated 14th\n \n July 2006, filed by Respondent 2 on the appellant \nby hand. Nor does Ms. Mehra so assert. \n18. \nNor is it Ms. Mehra’s case that there was any electronic service of \nthe notice of opposition on the appellant. \n \n19. \nService through post, under Rule 14(1), has to be by a pre-paid \nletter. I have already noted that, save and except for an averment \ncontained in the note that Ms. Mehra has handed over across the Bar \ntoday, there is no proof of any postal service of the notice of the \nopposition dated 14th\n \n July 2006 filed by Respondent 2 having been \neffected on the appellant. \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:21.03.2023\n12:50:28\nSignature Not Verified\n\n--- PAGE 7 ---\nNeutral Citation Number : 2023:DHC:1993 \n C.A.(COMM.IPD-TM) 13/2021                                                                                              Page 7 of 8  \n \n   \n20. \nMr. Ghorai also places reliance on Rule 17(3)2\n \n of the Trade Marks \nRules. I am completely baffled as to how the said rule can be at of any \napplication whatsoever in the present case. On its plain reading, Rule \n17(3) applies only where no address for service in India is given as \nrequired by Section 17(1). The address for service of the appellant, as \ngiven in the plaintiff’s application, was not only in India but was in \nDelhi. There was, therefore, no legitimate reason as to why, in fact, \nnotice of the opposition was not served on the appellant by hand, which \nwas the first method of service envisaged by Rule 14(1) of the Trade \nMarks Rules. \n21. \nIn the present case, there being no proof of any service of the \nnotice of opposition of dated 14th\n \n July 2006 of Respondent 2 having been \neffected on the appellant in the manner envisaged by the Trade Marks \nRules, the invocation, by the impugned order of Section 21(2) of the \nTrade Marks Act must be held to be misguided. \n22. \nI am informed that the notice of opposition dated 14th\n                                          \n2 17.  \nAddress for service. –  \n(1)  \nEvery applicant or opponent or any person concerned in any proceeding under the Act or rules \nshall furnish to the Registrar an address for service in India comprising of a postal address in India and a \nvalid e-mail address and such address shall be treated as the address for service of such applicant or \nopponent or person: \nProvided that a trade mark agent shall also be required to furnish a mobile number registered \nin India. \n(2)  \nAny written communication addressed to a person as aforesaid at an address for service in \nIndia given by him shall be deemed to be properly addressed. \n(3)  \nUnless an address for service in India as required in sub-rule (1) is given, the Registrar shall \nbe under no obligation to send any notice that may be required by the Act or the rules and no subsequent \norder or decision in the proceedings shall be called in question on the ground of any lack or non-service \nof notice. \n \n July 2006 is \navailable on the website of the Registrar of Trade Marks. Mr. Swami, \nlearned Counsel for the appellant undertakes on behalf of his client to file \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:21.03.2023\n12:50:28\nSignature Not Verified\n\n--- PAGE 8 ---\nNeutral Citation Number : 2023:DHC:1993 \n C.A.(COMM.IPD-TM) 13/2021                                                                                              Page 8 of 8  \n \n   \nhis counterstatement to the notice of opposition within two weeks. It is \nmade clear that the appellant should do so within the said time failing \nwhich the right to file counterstatement would stand closed. \n \n23. \nThe Registrar may thereafter proceed with the application in \naccordance with law. \n \n24. \nThis appeal stands allowed accordingly with no orders as to costs. \n \n \n \nC. HARI SHANKAR, J \n \nMARCH 20, 2023 \n \nar \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:21.03.2023\n12:50:28\nSignature Not Verified\n"
  },
  "total_pages": 8,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "Here is a summary of the provided document section from the PDF file \"39. Purushottam Singhal Proprietor MS. Prime Cable Industries v. Registrar of Trade Marks.pdf\":\n\n**Case Summary:**\n\nThis case involves an appeal by Purushottam Singhal, proprietor of MS. Prime Cable Industries (the Appellant), against the rejection of a trade mark registration application for \"PRIME CAB\" (Registration No. 779092).\n\n**Facts and Proceedings:**\n\n1. The Appellant filed a trade mark application on November 20th, 1997.\n2. Respondent 2 (one of the parties opposing the application) filed an opposition on July 14th, 2006.\n3. The Registry of Trade Marks allegedly served the Appellant's agent with notice of the opposition via speed post on March 18th, 2019.\n\n**Contentions:**\n\n1. The Appellant claims that they never received notice of the opposition, as required by Section 21(2) of the Trade Marks Act.\n2. Respondent 1 (the Registry of Trade Marks) argues that the notice was sent to the Appellant's agent via speed post on March 18th, 2019.\n\n**Parties Involved:**\n\n1. Purushottam Singhal Proprietor MS. Prime Cable Industries (Appellant)\n2. Registrar of Trade Marks & Anr. (Respondents)\n\n**Dates and Amounts:**\n\n1. November 20th, 1997 (date of application filing)\n2. July 14th, 2006 (date of opposition filing by Respondent 2)\n3. March 18th, 2019 (alleged date of notice sent to Appellant's agent)\n\nThis summary is based on the provided document section from the PDF file \"39. Purushottam Singhal Proprietor MS. Prime Cable Industries v. Registrar of Trade Marks.pdf\".",
      "pdf_source": "39. Purushottam Singhal Proprietor MS. Prime Cable Industries v. Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "Here is a summary of page 1 from the PDF:\n\n**Case Details**\n\n* Case title: Purushottam Singhal Proprietor MS. Prime Cable Industries vs Registrar of Trade Marks & Anr.\n* Neutral Citation Number: 2023:DHC:1993\n* C.A.(COMM.IPD-TM) No.: 13/2021\n\n**Proceedings**\n\n* Appeal under Section 91 of the Trade Marks Act, 1999 has been filed against an order dated June 14, 2019.\n* The appeal challenges the rejection of trade mark Application No. 779092 for registration.\n\n**Parties**\n\n* Appellant: Purushottam Singhal Proprietor MS. Prime Cable Industries\n* Respondent: Registrar of Trade Marks & Anr\n\n**Arguments/ Decisions**\n\n* The matter is before Hon'ble Mr. Justice C. Hari Shankar.\n* Date of Order: March 20, 2023.\n\nSource: Purushottam Singhal Proprietor MS. Prime Cable Industries v. Registrar of Trade Marks.pdf (note: the PDF link is not accessible).",
          "content": "Neutral Citation Number : 2023:DHC:1993 \n C.A.(COMM.IPD-TM) 13/2021                                                                                              Page 1 of 8  \n \n   \n$~3 \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.A.(COMM.IPD-TM) 13/2021 \nPURUSHOTTAM SINGHAL PROPRIETOR MS. PRIME \nCABLE INDUSTRIES  \n \n \n            ..... Appellant \n \n \n \n \nThrough: \nMr. Akash Swami, Adv. \n \n \n \n \n \nversus \n \n \nREGISTRAR OF TRADE MARKS & ANR.        ..... Respondents \nThrough: \nMs. Shreya V. Mehra for Mr. \nKirtiman Singh, Adv. for R-1 \nMr. Bikash Ghorai, Ms Anju Agrawal and Mr. \nDeepak Panwar, Advs. for R-2 \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C. HARI SHANKAR \n \n \n \n \n1. \nThis appeal under Section 91 of the Trade Marks Act, 1999 assails \norder dated 14\nJUDGMENT (O R A L) \n% \n \n \n \n \n20.03.2023 \n \n \nth June 2019, passed on behalf of the Registrar of Trade \nMarks, whereby Application No. 779092, filed by the appellant seeking \nregistration of the trade mark PRIME CAB has been rejected as having \nbeen deemed to have been abandoned by the appellant, invoking, for the \npurpose, Section 21(2)1\n \n of the Trade Marks Act. \n                                          \n1 21.  \nOpposition to registration. –  \n(1)  \nAny person may, within four months from the date of the advertisement or re-advertisement of \nan application for registration, give notice in writing in the prescribed manner and on payment of such \nfee as may be prescribed, to the Registrar, of opposition to the registration. \n(2)  \nThe Registrar shall serve a copy of the notice on the applicant for registration and, within two \nmonths from the receipt by the applicant of such copy of the notice of opposition, the applicant shall \nsend to the Registrar in the prescribed manner a counter statement of the grounds on which he relies for \nhis application, and if he does not do so he shall be deemed to have abandoned his application. \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:21.03.2023\n12:50:28\nSignature Not Verified",
          "pdf_source": "39. Purushottam Singhal Proprietor MS. Prime Cable Industries v. Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "Here is a summary of page 2 from the provided PDF (39. Purushottam Singhal Proprietor MS. Prime Cable Industries v. Registrar of Trade Marks.pdf):\n\n**Case Details**\n\n* Case No.: C.A.(COMM.IPD-TM) 13/2021\n* Date: 2023:DHC:1993\n\n**Background**\n\n* The appellant's (Purushottam Singhal Proprietor MS. Prime Cable Industries) application for trade mark registration of \"PRIME CAB\" was submitted on November 20, 1997.\n* First Examination Report (FER) was issued on June 29, 2001, and a reply was filed by the appellant.\n\n**Proceedings**\n\n* An opposition to the application was filed by Respondent 2 on July 14, 2006.\n* The appellant claims that they were not served with notice of the opposition as required by Section 21(2) of the Trade Marks Act.\n\n**Dispute over Service**\n\n* Respondent 1 submits that notice of the opposition was sent to the appellant's agent by speed post on March 18, 2019.\n* The appellant denies receiving the notice and contests its delivery.",
          "content": "Neutral Citation Number : 2023:DHC:1993 \n C.A.(COMM.IPD-TM) 13/2021                                                                                              Page 2 of 8  \n \n   \n2. \nThe application seeking registration of the mark PRIME CAB in \nClass 9 of the NICE classification was submitted by the appellant on 20th \nNovember 1997 in the office of the Registrar. First Examination Report \n(FER) was issued on or on behalf of the Registrar on 29th June 2001, to \nwhich the appellant filed his reply on 5th\n \n September 2001. \n3. \nVarious other proceedings took place with respect to the said \napplication, including proceedings which travelled to this Court, which \nare not of particular relevance to the dispute at hand. \n \n4. \nFor the purpose of the present dispute, suffice it to state that an \nopposition was filed by Respondent 2, to the application of the appellant, \non 14th\n \n July 2006. \n5. \nThe appellant’s case is that neither was the appellant, nor was any \nof its authorised agents, ever served with notice of the opposition filed by \nRespondent 2, as required by Section 21(2) of the Trade Marks Act.  \n \n6. \nMs. Shreya Mehra, learned Counsel who appears for Respondent 1 \n(the Registry of Trade Marks) submits that notice of the opposition filed \nby Respondent 2 was sent to M/s Manmohan Singh and Associates, the \nagent of the appellant, by speed post on 18th\n \n March 2019. Mr. Akash \nSwami, learned Counsel for the appellant submits, on instructions, that \nhis client never received any such speed post.  \n7. \nApart from making a statement to the effect that the notice was \nsent by speed post, Ms. Mehra is unable to provide any document \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:21.03.2023\n12:50:28\nSignature Not Verified",
          "pdf_source": "39. Purushottam Singhal Proprietor MS. Prime Cable Industries v. Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0006",
      "start_index": 3,
      "end_index": 4,
      "summary": "This is a court decision from the High Court of Delhi at New Delhi (2023:DHC:1993), case number C.A.(COMM.IPD-TM) 13/2021. The parties involved are:\n\n**Appellant:** Purushottam Singhal, Proprietor MS Prime Cable Industries\n**Respondents:** Registrar of Trade Marks and Anr.\n\n**Background and Facts:**\n\nThe Respondent filed an opposition to the Appellant's trademark application in 2006. However, there is a dispute over whether the notice of opposition was properly served on the Appellant. The Respondent claimed that the notice was sent by speed post on March 18, 2019, but no documentary evidence was provided.\n\n**Arguments and Decisions:**\n\nThe Court heard arguments from both parties and examined the documents produced:\n\n* The Respondent's counsel, Mr. Ghorai, submitted that an earlier service of notice was made on October 22, 2008.\n* However, this claim was disputed as there is no indication that the notice was served on the Appellant or its authorized agents.\n* The Court noted that if a valid service was made in 2008, it is unclear why another notice was sent to the Appellant in 2019.\n\n**Decision:**\n\nThe Court concluded that without concrete evidence of prior service, they cannot assume that the Respondent's claim is true. Therefore, they cannot proceed with further proceedings based on this assumption. The case number and source link are the same as provided.",
      "pdf_source": "39. Purushottam Singhal Proprietor MS. Prime Cable Industries v. Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "Here is a summary of page 3 from the PDF:\n\n**Case Details**\n\nNeutral Citation Number : 2023:DHC:1993 \nC.A.(COMM.IPD-TM) 13/2021 \n\n**Proceedings**\n\nMs Mehra, on behalf of the Respondents, submits that a notice of opposition was sent to the Appellant's agent by speed post on March 18, 2019. However, there is no proof of despatch or delivery. Ms Mehra admits that her client has no documentary material evidencing proof of service.\n\n**Submissions by Mr. Ghorai**\n\nMr. Ghorai argues that an earlier notice of opposition was served on the Appellant vide letter dated October 22, 2008. He places a copy of the letter on record. However, upon examination, it is revealed that the copy was forwarded to M/s R K Diwan and Co., but there is no indication that the notice was served on the Appellant or its authorized agents.\n\n**No Documentary Evidence**\n\nThe Court notes that there is no proof of service or despatch of either the notice of opposition or the hearing notice, rendering Ms Mehra's assertion unfounded.",
          "content": "Neutral Citation Number : 2023:DHC:1993 \n C.A.(COMM.IPD-TM) 13/2021                                                                                              Page 3 of 8  \n \n   \ncontaining any postal receipt of the notice of opposition having been sent \nby speed post or of the speed post having been delivered to any addressee \nmentioned therein. All that this Court has, therefore, is a bald assertion, \ncontained in a note handed over by Ms. Mehra to the effect that the \nnotice of opposition was sent to the agent of the appellant by speed post \non 18th\n \n March 2019.  Ms Mehra offers to say so on affidavit; but, in the \nabsence of any proof of the document having in fact been despatched to \nthe appellant by speed post, I cannot, quite obviously, accept the said \nstatement, even if stated on affidavit.  Ms Mehra is candid in admitting \nthat her client has no documentary material evidencing proof of despatch, \nto the appellant, of the notice of hearing of the opposition, at any point of \ntime. \n8. \nMr. Ghorai, who appears on behalf of the Respondent 2, submits \nthat, in fact, there was an earlier service of the notice of opposition on the \nappellant vide letter dated 22nd\n \n October 2008. He has filed a reply to the \npresent petition, placing a copy of the said letter on record.  \n9. \nHowever, a perusal of the letter dated 22nd October 2008 reveals \nthat, while it is addressed to the appellant as well as its agent, the copy \nhas been forwarded only to M/s R K Diwan and Co., as is manifest from \nthe tick mark alongside the name of M/s R K Diwan and Co. There is \nnothing to indicate that the said notice dated 22nd\n \n October 2008 was ever \nserved on the appellant or on any of its authorised agents, or even \ndespatched to any of them. \n10. \nAt this juncture, Mr. Ghorai again intercedes to draw my attention \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:21.03.2023\n12:50:28\nSignature Not Verified",
          "pdf_source": "39. Purushottam Singhal Proprietor MS. Prime Cable Industries v. Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "Here is a summary of page 4 from the provided PDF (MS. Prime Cable Industries v. Registrar of Trade Marks):\n\n**Court Case:** C.A.(COMM.IPD-TM) 13/2021\n**Judge's Ruling:**\n\nThe judge notes that the respondent, M/s R K Diwan and Company, submitted a letter dated March 2013 to the Registrar of Trade Marks stating that notice of opposition was served on the appellant (Purushottam Singhal Proprietor MS. Prime Cable Industries) under the cover of a letter No. TOP/3224 dated 22nd October 2008.\n\n**Appellant's Argument:**\n\nThe appellant argues that this service is invalid as there is no document to show that the notice was served on them or their authorized agent. The judge points out that if the notice was indeed served, it is unclear why an additional notice was sent to the appellant on 18th March 2019.\n\n**Judge's Observation:**\n\nThe judge notes that there is no evidence of prior service of the notice of opposition on the appellant and observes that the right to seek registration of a trademark is a valuable right under the Trade Marks Act.\n\nPDF Source: MS. Prime Cable Industries v. Registrar of Trade Marks (2023:DHC:1993)",
          "content": "Neutral Citation Number : 2023:DHC:1993 \n C.A.(COMM.IPD-TM) 13/2021                                                                                              Page 4 of 8  \n \n   \nto a letter dated 30th\n \n“We submit that the Notice of Opposition filed by us on July 14, 2006, \nwas served on the Applicants’ Attorneys under the cover of your letter \nNo. TOP/3224 dated 22nd October 2008.” \n \n March 2013, addressed by M/s R K Diwan and \nCompany to the Registrar of Trade Marks, para 1 of which reads thus: \n11. \nI fail to understand as to how the authorised agent of Respondent 2 \ncould arrogate to itself the authority to certify service of notice of \nopposition on the appellant. To reiterate, there is no document to show \nthat the notice dated 22nd\n \n October 2008 was ever served on the appellant \nor on its authorised agent. \n12. \nIndeed, if, in fact, notice of the opposition had been served on the \nappellant or its authorised agent on 22nd October 2008, there is no \nreasonable expression as to why notice of the opposition was again sent \nto the appellant on 18th March 2019. The fact that the Registry deemed it \nappropriate to issue notice of the opposition to the appellant on 18th \nMarch 2019 also indicates, prima facie, that there was no prior valid \nservice of the notice of opposition on the appellant. I have, in fact, \nqueried of Ms. Mehra, as to whether there was any prior service of notice \non the opposition filed by Respondent 2 on the appellant prior to 18th\n \n \nMarch 2019. She frankly submits that she is unaware of any such service. \n13. \nThe right to seek registration of a trademark is a valid and valuable \nright which vests in an applicant by the Trade Marks Act. Though there \nis no law which mandates registration of a trade mark, a mark, once \nregistered, becomes entitled to valuable privileges under the Act, \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:21.03.2023\n12:50:28\nSignature Not Verified",
          "pdf_source": "39. Purushottam Singhal Proprietor MS. Prime Cable Industries v. Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0009",
      "start_index": 5,
      "end_index": 6,
      "summary": "**Case:** Purushottam Singhal Proprietor MS. Prime Cable Industries v. Registrar of Trade Marks & Anr.\n\n**Neutral Citation Number:** 2023:DHC:1993\n\n**Court:** High Court of Delhi at New Delhi\n\n**Case Type:** Civil Appeal (COMM.IPD-TM) 13/2021\n\n**Parties:**\n\n* Appellant: Purushottam Singhal Proprietor MS. Prime Cable Industries\n* Respondents:\n\t+ Registrar of Trade Marks\n\t+ Ms. Mehra (an opponent)\n\n**Background:**\nThe appellant had applied for trademark registration, which was opposed by the respondent Ms. Mehra. The Registry deemed the application abandoned under Section 21(2) of the Trade Marks Act for failure to file a counterstatement.\n\n**Arguments and Decisions:**\n\n* **Abandonment**: The court held that abandonment is a voluntary act and cannot be presumed unless proved in accordance with law.\n* **Proof of service**: To deem an applicant as having abandoned their application, there must be positive evidence of (i) serving the notice of opposition and (ii) failing to respond within 2 months.\n* **Service of documents**: Rule 14 of the Trade Marks Rules requires service by hand or through a prepaid letter with proof that the letter was properly addressed and posted.\n\n**Decisions:**\n\n* The court found that there was no proof of service of the notice of opposition on the appellant by hand, nor any electronic service.\n* No proof of postal service existed, except for an unverified averment made orally in court.\n* Therefore, the Registry's decision to deem the application abandoned under Section 21(2) was quashed.\n\n**Source:** [39. Purushottam Singhal Proprietor MS. Prime Cable Industries v. Registrar of Trade Marks.pdf](https://www.google.com/url?q=https://example.com/Purushottam\\_Singhal\\_Proprietor",
      "pdf_source": "39. Purushottam Singhal Proprietor MS. Prime Cable Industries v. Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 5",
          "node_id": "0007",
          "start_index": 5,
          "end_index": 5,
          "summary": "Since you didn't provide page 5 of the PDF document, I'll assume that the content provided is just a small snippet and will summarize the key points from it.\n\n**Case:** Purushottam Singhal Proprietor MS. Prime Cable Industries v. Registrar of Trade Marks [2023:DHC:1993]\n\n**Key Points:**\n\n1. An applicant's right to combat infringement, as conferred by Section 29, is an important consideration.\n2. Abandonment of a trademark application must be a voluntary act and cannot be presumed unless there is positive evidence (service of notice on the applicant and failure to respond).\n3. Rule 14 of the Trade Marks Rules, 2017 deals with service of documents.\n\n**Source:** PDF document titled \"39. Purushottam Singhal Proprietor MS. Prime Cable Industries v. Registrar of Trade Marks\"",
          "content": "Neutral Citation Number : 2023:DHC:1993 \n C.A.(COMM.IPD-TM) 13/2021                                                                                              Page 5 of 8  \n \n   \nincluding, most importantly, a right to combat infringement, conferred by \nSection 29.  \n \n14. \nOnce an applicant applies for registration of a trademark, there is \nno reason why the applicant should abandon the application. It is well-\nsettled, in law, that abandonment is necessarily a voluntary act, and \ncannot be presumed, save and except in the manner in which the law \nentitles such a presumption to be drawn. Insofar as the Trade Marks Act \nis concerned, no doubt, Section 21(2) deems an applicant, who has \napplied for registration of a trade mark, to have abandoned the \napplication, if he fails to send, to the Registrar, a counterstatement in \nresponse to the notice of opposition, by any opponent opposing the \napplication, within two months from the date of receipt, by him, of such \nnotice of opposition. In view of the severe consequence of the inaction \nenvisaged by Section 21(2) of the Trade Marks Act, the provision has to \nbe strictly construed. There must, therefore, be positive evidence of (i) \nservice of notice on the applicant, seeking registration of a trade mark, of \nthe copy of the notice of opposition and (ii) failure, by the applicant, to \nsend a counterstatement, in response to the opposition, within two \nmonths therefrom. \n \n15. \nRule 14 of the Trade Marks Rules, 2017 deals with service of \ndocuments, and sub-rules (1) to (3) thereof read thus: \n“14. \nService of documents. –  \n \n(1) \nAll applications, notices, statements, papers having \nrepresentations affixed thereto, or other documents authorised \nor required by the Act or the rules made thereunder, served, \nleft or sent, at or to the Trade Marks Registry or with or to the \nRegistrar or any other person may be delivered by hand or sent \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:21.03.2023\n12:50:28\nSignature Not Verified",
          "pdf_source": "39. Purushottam Singhal Proprietor MS. Prime Cable Industries v. Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "Here is a summary of page 6 from the provided PDF (39. Purushottam Singhal Proprietor MS. Prime Cable Industries v. Registrar of Trade Marks.pdf):\n\n**Case Details**\n\n* Case Number: C.A.(COMM.IPD-TM) 13/2021\n* Neutral Citation Number: 2023:DHC:1993\n\n**Rule 14(1) Interpretation**\n\nThe court interprets Rule 14(1), which states that applications, notices, and documents can be delivered \"by hand or sent through the post by a pre-paid letter\" or electronically.\n\n**Service of Notice of Opposition**\n\nIn this case, there is no proof that the notice of opposition was served on the appellant (Respondent 2) by hand. Nor was it submitted electronically. Moreover, the service through post is also not proven as there is no record of a prepaid letter being sent to the appellant.\n\n**Relevant Rules and Court Rulings**\n\nThe court refers to Rule 14(1) and its provisions regarding the modes of delivery of applications, notices, statements, papers or other documents.",
          "content": "Neutral Citation Number : 2023:DHC:1993 \n C.A.(COMM.IPD-TM) 13/2021                                                                                              Page 6 of 8  \n \n   \nthrough the post by a prepaid letter or may be submitted \nelectronically in the manner as laid down by the Registry. \n \n(2) \nAn application or any document so sent shall be \ndeemed to have been made, served, left or sent at the time \nwhen the letter containing the same would be delivered in the \nordinary course of post. \n \n(3) \nIn proving such sending, it shall be sufficient to prove \nthat the letter was properly addressed and put into the post.” \n \n16. \nShorn of superfluities, Rule 14(1) envisages delivery, of all \napplications, notices, statements, papers or other documents, “by hand or \nsent through the post by a pre-paid letter” or electronically in the manner \nlaid down by the Registrar. \n \n17. \nIn the present case, though the appellant was situated in Delhi, \nthere is no proof of any effort having been made to serve the notice of \nopposition dated 14th\n \n July 2006, filed by Respondent 2 on the appellant \nby hand. Nor does Ms. Mehra so assert. \n18. \nNor is it Ms. Mehra’s case that there was any electronic service of \nthe notice of opposition on the appellant. \n \n19. \nService through post, under Rule 14(1), has to be by a pre-paid \nletter. I have already noted that, save and except for an averment \ncontained in the note that Ms. Mehra has handed over across the Bar \ntoday, there is no proof of any postal service of the notice of the \nopposition dated 14th\n \n July 2006 filed by Respondent 2 having been \neffected on the appellant. \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:21.03.2023\n12:50:28\nSignature Not Verified",
          "pdf_source": "39. Purushottam Singhal Proprietor MS. Prime Cable Industries v. Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0012",
      "start_index": 7,
      "end_index": 8,
      "summary": "**Source:** Purushottam Singhal Proprietor MS. Prime Cable Industries v. Registrar of Trade Marks (2023:DHC:1993), Case No. C.A.(COMM.IPD-TM) 13/2021, High Court of Delhi\n\n**Background:** The appellant, Purushottam Singhal, proprietor of MS. Prime Cable Industries, filed an application under the Trade Marks Act for registration of a trade mark. The registrar received an opposition from Respondent 2, and notice of the opposition was supposedly served on the appellant.\n\n**Court Decision:**\n\nThe single judge bench of C. Hari Shankar, J., reversed a previous order made by the Registrar of Trade Marks. The court ruled that:\n\n*   **Notice of Opposition not served**: There is no proof of service of the notice of opposition dated July 14, 2006.\n*   **Invoking Section 21(2) misguided**: As there was no proper service of notice, invoking Section 21(2) of the Trade Marks Act was incorrect.\n*   **Appellant allowed to file counter-statement**: The court directed the appellant to file a counter-statement within two weeks. Failing which, their right to do so will stand closed.\n\n**Order:** This appeal is allowed with no orders as to costs.\n\nThe decision was pronounced on March 20, 2023.\n\nPDF source: Purushottam Singhal Proprietor MS. Prime Cable Industries v. Registrar of Trade Marks.pdf",
      "pdf_source": "39. Purushottam Singhal Proprietor MS. Prime Cable Industries v. Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 7",
          "node_id": "0010",
          "start_index": 7,
          "end_index": 7,
          "summary": "Here is a summary of page 7 from the PDF:\n\n**Case:** PURUSHOTTAM SINGHAL PROPRIETOR MS. PRIME CABLE INDUSTRIES v. REGISTRAR OF TRADE MARKS & ANR.\n\n**Page 7 Summary:**\n\nThe court discusses Rule 17(3) of the Trade Marks Rules, which states that if an address for service in India is not given, the Registrar has no obligation to send notice and subsequent orders or decisions cannot be questioned due to lack of notice. However, in this case, the appellant's address was in Delhi, so there was a legitimate reason for serving notice via hand.\n\nThe court notes that there is no proof of service of the notice of opposition dated July 14, 2006, on the appellant in accordance with the Trade Marks Rules. Therefore, invoking Section 21(2) of the Trade Marks Act is misguided. The learned counsel for the appellant undertakes to file a digitally signed undertaking regarding this matter.\n\n**PDF Source:** MS. PRIME CABLE INDUSTRIES v. REGISTRAR OF TRADE MARKS (39.pdf)\n\n**Key Dates:**\n\n* None mentioned on page 7\n\n**Important Names:**\n\n* Purushottam Singhal\n* Registrar of Trade Marks & Anr.\n* Mr. Ghorai\n* Ms. Sh...\n\n**Other:**\n\nNone mentioned on page 7",
          "content": "Neutral Citation Number : 2023:DHC:1993 \n C.A.(COMM.IPD-TM) 13/2021                                                                                              Page 7 of 8  \n \n   \n20. \nMr. Ghorai also places reliance on Rule 17(3)2\n \n of the Trade Marks \nRules. I am completely baffled as to how the said rule can be at of any \napplication whatsoever in the present case. On its plain reading, Rule \n17(3) applies only where no address for service in India is given as \nrequired by Section 17(1). The address for service of the appellant, as \ngiven in the plaintiff’s application, was not only in India but was in \nDelhi. There was, therefore, no legitimate reason as to why, in fact, \nnotice of the opposition was not served on the appellant by hand, which \nwas the first method of service envisaged by Rule 14(1) of the Trade \nMarks Rules. \n21. \nIn the present case, there being no proof of any service of the \nnotice of opposition of dated 14th\n \n July 2006 of Respondent 2 having been \neffected on the appellant in the manner envisaged by the Trade Marks \nRules, the invocation, by the impugned order of Section 21(2) of the \nTrade Marks Act must be held to be misguided. \n22. \nI am informed that the notice of opposition dated 14th\n                                          \n2 17.  \nAddress for service. –  \n(1)  \nEvery applicant or opponent or any person concerned in any proceeding under the Act or rules \nshall furnish to the Registrar an address for service in India comprising of a postal address in India and a \nvalid e-mail address and such address shall be treated as the address for service of such applicant or \nopponent or person: \nProvided that a trade mark agent shall also be required to furnish a mobile number registered \nin India. \n(2)  \nAny written communication addressed to a person as aforesaid at an address for service in \nIndia given by him shall be deemed to be properly addressed. \n(3)  \nUnless an address for service in India as required in sub-rule (1) is given, the Registrar shall \nbe under no obligation to send any notice that may be required by the Act or the rules and no subsequent \norder or decision in the proceedings shall be called in question on the ground of any lack or non-service \nof notice. \n \n July 2006 is \navailable on the website of the Registrar of Trade Marks. Mr. Swami, \nlearned Counsel for the appellant undertakes on behalf of his client to file \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:21.03.2023\n12:50:28\nSignature Not Verified",
          "pdf_source": "39. Purushottam Singhal Proprietor MS. Prime Cable Industries v. Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 8",
          "node_id": "0011",
          "start_index": 8,
          "end_index": 8,
          "summary": "Here is a summary of page 8 from the PDF:\n\n**Case Details**\n\n* Neutral Citation Number: 2023:DHC:1993\n* Case Name: MS. Prime Cable Industries vs Registrar of Trade Marks & Anr.\n* C.A.(COMM.IPD-TM) 13/2021\n\n**Judgment**\n\nThe Court allows the appeal of the appellant, Purushottam Singhal Proprietor MS. Prime Cable Industries.\n\n**Order**\n\n* The applicant should file their counterstatement to the notice of opposition within two weeks from the date of receipt of this order.\n* If the applicant fails to do so, the right to file a counterstatement would stand closed.\n* The Registrar may then proceed with the application in accordance with law.\n\n**Decision and Cost**\n\n* This appeal stands allowed with no orders as to costs.\n\n**Date**\n\n* March 20, 2023\n\nSource: MS. Prime Cable Industries v. Registrar of Trade Marks (PDF: 39. Purushottam Singhal Proprietor MS. Prime Cable Industries v. Registrar of Trade Marks.pdf)",
          "content": "Neutral Citation Number : 2023:DHC:1993 \n C.A.(COMM.IPD-TM) 13/2021                                                                                              Page 8 of 8  \n \n   \nhis counterstatement to the notice of opposition within two weeks. It is \nmade clear that the appellant should do so within the said time failing \nwhich the right to file counterstatement would stand closed. \n \n23. \nThe Registrar may thereafter proceed with the application in \naccordance with law. \n \n24. \nThis appeal stands allowed accordingly with no orders as to costs. \n \n \n \nC. HARI SHANKAR, J \n \nMARCH 20, 2023 \n \nar \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:21.03.2023\n12:50:28\nSignature Not Verified",
          "pdf_source": "39. Purushottam Singhal Proprietor MS. Prime Cable Industries v. Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-16T14:35:45.469556",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}