{
  "doc_name": "4. Alpha vs Alpha",
  "pdf_source": "4. Alpha vs Alpha.pdf",
  "metadata": {
    "document_name": "4. Alpha vs Alpha",
    "source_pdf": "4. Alpha vs Alpha.pdf",
    "judges": [
      "AMIT BANSAL"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [],
    "dhc_numbers": [],
    "ia_numbers": [],
    "decision_date": "17 March, 2023",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [],
    "defendants": [],
    "appellants": [],
    "respondents": [],
    "plaintiff_advocates": [],
    "defendant_advocates": [],
    "appellant_advocates": [],
    "respondent_advocates": [],
    "damages_claimed": "988,145,000",
    "damages_awarded": null,
    "key_issues": [
      "Here are the key legal issues extracted from the document:",
      "• Cancellation of trademark registration under Sections 57 and 125 of the Trademarks Act, 1999.",
      "• Infringement of petitioner's registered trademark ALPHA for real estate services in Class 36.",
      "• Likelihood of confusion between impugned mark and petitioner's trademark due to similar color scheme and prominent display of word \"ALPHA\".",
      "• Malafide intentions of respondent no.1 company in adopting a trade name that is too similar to the petitioner's trademark, considering the incorporation of the company by ex-employees before their resignation.",
      "• Passing off: Whether respondent no.1 has passed off its business as that of the petitioner by using a similar trademark and misrepresenting its connection with the petitioner.",
      "• Dilution of goodwill and reputation of the petitioner's mark due to the impugned registration.",
      "• Priority of use and reputation in respect of the mark ALPHA.",
      "• Validity of respondent no.1's trademark registration under the Trademarks Act, 1999."
    ],
    "decision_summary": "**Comprehensive Summary of Case: Alpha Corp Development Private Limited v. Alpha Integrated Management Services Pvt. Ltd.**\n\n**Background:**\n\nAlpha Corp Development Private Limited (Petitioner) is engaged in the business of real estate development and facility management services since 2003. The company has successfully delivered several projects under the mark \"ALPHA\" and acquired significant goodwill and reputation.\n\nIn 2015, the ex-employees of Petitioner's subsidiary company incorporated Alpha Integrated Management Services Pvt. Ltd. (Respondent No.1), which later filed a trademark application for the mark (\"impugned mark\") in respect of similar services as that of Petitioner.\n\n**Legal Issues:**\n\nThe case revolves around Section 57 and 125 of the Trademarks Act, 1999, which deals with rectification of trademarks. The Petitioner sought the cancellation/removal of the impugned mark, alleging:\n\n1. **Prior Rights:** The Petitioner claimed prior rights in the name \"ALPHA\" through its registrations (1483826 and 1483827) on September 1, 2006.\n2. **Malafides:** The Respondent No.1 was allegedly incorporated by ex-employees of the Petitioner's subsidiary company, which exhibited malafide intentions.\n3. **Similarity:** The impugned mark resembles the Petitioner's marks in terms of color scheme, font, and overall appearance.\n\n**Arguments:**\n\nPetitioner's arguments:\n\n*   Prior rights in the name \"ALPHA\" existed before Respondent No.1 applied for registration of the impugned mark.\n*   Malafides on part of Respondent No.1 are evident from its incorporation by ex-employees of Petitioner's subsidiary company.\n*   Similarity between the impugned mark and Petitioner's marks raises trademark infringement concerns.\n\nRespondent No.1 did not attend the hearing, making their arguments unavailable.\n\n**Court Findings:**\n\nThe court held that:\n\n1.  **Prior Rights:** The court acknowledged the Petitioner's prior rights in the name \"ALPHA,\" citing its earlier registrations.\n2.  **Malafides:** The court inferred malafide intentions on part of Respondent No.1 from their suspicious circumstances and Respondent No.1's failure to appear before the court.\n3.  **Similarity:** The court noted resemblance between the impugned mark and Petitioner's marks, specifically in terms of color scheme and overall appearance.\n\n**Decision:**\n\nConsidering the findings above, the Court ordered:\n\n*   Cancellation/removal of registration number 3187803 for the impugned mark.\n*   A warning to Respondent No.1 that further malafide activities would be dealt with strictly.\n\nIn conclusion, this case involved a dispute over trademark registration and infringement claims. The court thoroughly examined prior rights, malafides, and similarity between marks before rendering its decision.",
    "legal_precedents": [],
    "full_text": "\n--- PAGE 1 ---\n2023:DHC:1982 \n \nC.O. (COMM.IPD-TM) 393/2022                                              Page 1 of 7 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n% \n \n \n \n \n \nDate of Decision : 17th March, 2023 \n \n+  \n \n \n \nC.O. (COMM.IPD-TM) 393/2022 \n \n \nALPHA CORP DEVELOPMENT PRIVATE  \nLIMITED  \n \n \n \n \n \n..... Petitioner \nThrough: \nMr. Sagar Chandra, Ms.Srijan Uppal, \nMr. Abhishek Bhati and Ms.Anisha \nRoy, Advocates. \n \n \n \n \nversus \n \n \nALPHA INTEGRATED MANAGEMENT  \nSERVICES PVT. LTD. AND ANR.  \n \n..... Respondents \n \n \n \n \nThrough: \nNone. \n \nCORAM: \n \nHON'BLE MR. JUSTICE AMIT BANSAL \nAMIT BANSAL, J. (Oral) \n1. \nThe present rectification petition has been filed on behalf of the \npetitioner seeking cancellation/removal of the trademark bearing registration \nnumber 3187803 and registered in the name of respondent no.1 in respect of \nreal estate services in Class 36 under Sections 57 and 125 of the Trademarks \nAct, 1999 (hereinafter ‘Act’).  \nCase set up by the petitioner \n2. \nThe case set up by the petitioner in the petition is as follows:  \n2.1 \nThe petitioner, Alpha Corp Development Private Limited, is engaged \nin the business of real estate development including development of \nmalls, hotels, townships, multiplexes and complexes and provides \nfacility management services such as maintenance, building \nautomation, security services among others, since 2003. \n2.2 \nThe petitioner is the registered proprietor of the mark ALPHA \nthrough its predecessor-in-interest, M/s Grandeur Estates Private \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.03.2023 18:55:18\nSignature Not Verified\n\n--- PAGE 2 ---\n2023:DHC:1982 \n \nC.O. (COMM.IPD-TM) 393/2022                                              Page 2 of 7 \n \nLimited, bearing registration no. 1483826 and 1483827 in Classes 36 \nand 37 of the Act. Several other registrations have also been obtained \nby the petitioner in respect of the mark ALPHA and its formative \nmarks. The earliest registration was granted on 1st September, 2006.  \n2.3 \nThe petitioner has successfully delivered several real estate projects \nunder the mark ALPHA, such as Alpha International City, Karnal \n(Haryana), \nAlpha \nInternational \nCity, \nFatehabad \n(Haryana), \nGurgaonOne-84 among others.  \n2.4 \nThe petitioner has also won several real estate awards and accolades \nover the years. Due to long and extensive use of the mark ALPHA, \nthe petitioner has acquired vast goodwill and reputation. The annual \nsales of the petitioner in the year 2018 amounted to Rs. 988,145,000/- \nand the petitioner has also incurred expenditure of Rs.6,241,000/- \ntowards advertisement and promotions in the said year.  \n2.5 \nThe respondent no.1 has obtained registration of the mark \n \n(hereinafter ‘impugned mark’ ) in respect of similar services as that of \nthe petitioner, in the name of the respondent no.1 under application \nno. 3187803 in Class 36 of the Act. The letter 'A' and the word \nALPHA in the impugned mark are written in black colour, which \nshows the intention of the respondent no. 1 to give prominence to the \nmark ALPHA in the impugned mark. The colour scheme adopted by \nthe respondent no.1 for the impugned mark is also similar to that of \nthe petitioner’s ALPHA marks.  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.03.2023 18:55:18\nSignature Not Verified\n\n--- PAGE 3 ---\n2023:DHC:1982 \n \nC.O. (COMM.IPD-TM) 393/2022                                              Page 3 of 7 \n \n2.6 \nThe malafides of the respondent no.l is evident from the fact that the \nrespondent no.l company was incorporated by the ex-employees of \nthe petitioner and its subsidiary company, Alpha G: Corp \nManagement Services Pvt. Ltd., on 23rd July, 2015, which is prior to \nthe date of resignation of the said employees. The said employees had \ncomplete access to the records and data of the petitioner and its \nsubsidiary company. \n2.7 \nPublic caution notices were published by the petitioner's subsidiary \ncompany in various newspapers when it came to know that its ex-\nemployees had incorporated a new company with confusingly similar \nname for providing identical services of facility management. \nThereafter, the respondent no.1 filed a defamation complaint before \nTis Hazari Courts, New Delhi. Against the summoning order dated \n14th May, 2016 passed in the aforementioned defamation complaint, \nthe petitioner filed a CRL.M.C. No.297/2017 before this Court, which \nis pending adjudication.  \n2.8 \nThe petitioner filed an application being SRN G43969063 dated 6th \nFebruary, 2017 before Ministry of Corporate Affairs (MCA) under \nSection 16 of the Companies Act, 2013 seeking a direction to the \nrespondent no. 1 to rectify its deceptively similar/identical trade \nname. The Regional Director, MCA held that the trade name of the \nrespondent no.1 closely resembles the name of the subsidiary \ncompany of the petitioner and directed them to change the name of \ntheir company vide order dated 1st August, 2017.  \n2.9 \nThe impugned mark was published in the Trade Mark Journal on 18th \nSeptember, 2017. However, the respondent no. 1 concealed the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.03.2023 18:55:18\nSignature Not Verified\n\n--- PAGE 4 ---\n2023:DHC:1982 \n \nC.O. (COMM.IPD-TM) 393/2022                                              Page 4 of 7 \n \nfactum of passing of the aforementioned order by the Regional \nDirector regarding change of name of the respondent no.1 company. \n2.10 The respondent no.l has challenged the aforesaid order of the \nRegional Director by filing a Writ Petition Civil No. 24380/2017 \nbefore High Court of Punjab and Haryana, which is presently pending \nadjudication. However, the High Court of Punjab and Haryana vide \norder dated 30th October, 2017 has stayed the operation of the order \ndated 1st August, 2017 passed by the Regional Director. \n2.11 The impugned mark has been adopted by the respondent no. 1 with \nthe sole intention of riding on the goodwill of the petitioner and to \ncreate confusion in the minds of the public and trade channel. \n2.12 Accordingly, the present rectification has been filed by the petitioner.  \nProceedings in the petition \n3. \n Notice in the present petition was issued by the Intellectual Property \nAppellate Board (IPAB) on 1st November, 2018. However, the respondent \nno.1 failed to appear before IPAB despite service. The respondent no.1 was \nproceeded against ex parte on 21st January, 2020. Thereafter, the present \nrectification got transferred to this Court after coming into effect of \nTribunals Reforms Act, 2022 and the Court notice was issued to the \nrespondent no.1 by this Court on 28th March, 2022. However, none appeared \non behalf of the respondent no.1 despite service. \n4. \nIt was noted in the order dated 23rd January, 2023 that the respondent \nno.1 has changed its corporate name from ‘Alpha Integrated Management \nService Private Limited to ‘Abante Integrated Management Services Private \nLimited’. Further, on 15th February, 2023, the counsel for the petitioner \nhanded over fresh trademark registrations granted in favour of the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.03.2023 18:55:18\nSignature Not Verified\n\n--- PAGE 5 ---\n2023:DHC:1982 \n \nC.O. (COMM.IPD-TM) 393/2022                                              Page 5 of 7 \n \nrespondent no.1 in respect of the marks \n(logo)  , \n(device) \nand ‘ABANTE’ (word). The court notice was also issued to the respondent \nno.1 including through attorney, who applied for the aforesaid registrations \non his behalf on the said date. Court notice was duly served on the \nrespondent no.1’s attorney. Despite service, none has appeared on behalf of \nthe respondent no.1. Nor any reply/counter-statement has been filed on \nbehalf of the respondent no.1. It is indicative of the fact that the respondent \nno.1 is not interested in pursuing the present petition, as it has already \nchanged its trademark and its corporate name.  \nAnalysis and Findings \n5. \n I have heard the counsels for the parties and perused the record of the \ncase.  \n6. \n In order to determine whether the trademark of the respondent no.1 is \nidentical to the trademark of the petitioner, it would be apposite to refer to \nthe two competing trademarks, as set out below:  \nRespondent no.1’s Trademark \nPetitioner’s Trademarks \n \n  ALPHA \n  \n \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.03.2023 18:55:18\nSignature Not Verified\n\n--- PAGE 6 ---\n2023:DHC:1982 \n \nC.O. (COMM.IPD-TM) 393/2022                                              Page 6 of 7 \n \n7. \nIt is pertinent to note that the prominent and essential feature of the \nimpugned mark is ‘ALPHA’, which is identical and deceptively similar to \nthe petitioner's mark ‘ALPHA’ and its other formative marks in respect of \nsimilar services. Therefore, the registration of the impugned mark is in \ncontravention of Section 11(1) of the Act.  \n8. \nThe respondent no. 1 was well aware of the petitioner's mark ALPHA \nsince respondent no. 1 was incorporated by ex-employees of the petitioner. \nThere can be no plausible reason for the respondent no. 1 to have chosen an \nidentical and a deceptively similar mark as that of the petitioner's mark for \nidentical goods. Clearly, the adoption of the mark by the respondent no.1 is \ndishonest and therefore, the respondent no.1 is not entitled to the benefit of \nSection 12 of the Act.  \n9. \nFrom the facts detailed above, it is clear that the petitioner is the \nproprietor of the impugned mark. The respondent no.1 cannot claim to be \nthe proprietor of the impugned trademark as there is nothing to show as to \nhow the impugned trademark has been adopted by the respondent no.1. \nTherefore, the application for registration of the impugned trademark is in \ncontravention of Section 18(1) of the Act. Further, the respondent no.1 is \nalso not entitled to the benefit of Section 11(4) of the Act as the petitioner \nhas not consented to the use of the impugned mark by the respondent no.1. \n10. \nThe grant of registration of the impugned trademark by the respondent \nno.2 is against the principles of Section 11(3)(a) of the Act, as there is no \ndispute that the petitioner is the prior user of the impugned trademark since \n2003 in India. Due to such a long, continuous and extensive use, the \nimpugned mark is solely associated with the petitioner. Therefore, the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.03.2023 18:55:18\nSignature Not Verified\n\n--- PAGE 7 ---\n2023:DHC:1982 \n \nC.O. (COMM.IPD-TM) 393/2022                                              Page 7 of 7 \n \nregistration of the impugned trademark should have been refused by the \nrespondent no.2. \n11. \nIn view of the discussion above, it is clear that the impugned \ntrademark has been adopted by the respondent no.1 dishonestly to trade \nupon the established goodwill and reputation of the petitioner and to project \nitself to be associated with the petitioner. The nature of the impugned \ntrademark is such that it will deceive the public and create confusion as \nregards the source of the goods manufactured and sold under the impugned \ntrademark.  \n12. \nAccordingly, the present petition is allowed and the impugned \ntrademark registered under trademark application no. 3187803 in the name \nof the respondent no.1 in Class 36 is removed from the Register of Trade \nMarks.  \n13. \n A copy of the order be sent to the respondents through e-mail. The \nRegistry is directed to supply a copy of the present order to the Trademark \nRegistry, at e-mail - llc-ipo@gov.in for compliance.  \n \n \n \nAMIT BANSAL, J \nMARCH 17, 2023 \nsr \n \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.03.2023 18:55:18\nSignature Not Verified\n"
  },
  "total_pages": 7,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "**Case Details**\n\nSource: ALPHA vs ALPHA.pdf (PDF file)\n\n**Case Overview**\n\nA rectification petition was filed by Alpha Corp Development Private Limited (petitioner) against Alpha Integrated Management Services PVT. LTD. and ANR. (respondents) in the High Court of Delhi (2023:DHC:1982) on March 17, 2023.\n\n**Parties Involved**\n\n* Petitioner: Alpha Corp Development Private Limited\n\t+ Represented by Mr. Sagar Chandra, Ms.Srijan Uppal, Mr. Abhishek Bhati, and Ms.Anisha Roy\n* Respondents:\n\t+ Alpha Integrated Management Services PVT. LTD.\n\t+ ANR.\n\n**Case Set Up**\n\nThe petitioner sought the cancellation/removal of trademark registration number 3187803 in respect of real estate services in Class 36 under Sections 57 and 125 of the Trademarks Act, 1999.\n\n**Facts and Arguments**\n\n* Petitioner is a registered proprietor of the mark ALPHA (registration no. 1483826 and 1483827) since 2003.\n* The petitioner has multiple other registrations for the mark ALPHA and its formative marks since September 1, 2006.\n* Respondent No.1 obtained registration of the impugned mark in Class 36 on the same services as the petitioner.\n\n**Decisions and Amounts**\n\n* The annual sales of the petitioner in 2018 were Rs. 988,145,000/-, with a promotion expenditure of Rs. 6,241,000/-.\n* No decision on the case was mentioned in this section.",
      "pdf_source": "4. Alpha vs Alpha.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "Here's a summary of page 1 of the PDF \"Alpha vs Alpha.pdf\" (2023:DHC:1982):\n\n**Case Details**\n\n* Case No.: C.O. (COMM.IPD-TM) 393/2022\n* Date of Decision: 17th March, 2023\n* Court: High Court of Delhi at New Delhi\n\n**Parties**\n\n* Petitioner: Alpha Corp Development Private Limited\n\t+ Through: Mr. Sagar Chandra, Ms.Srijan Uppal, Mr. Abhishek Bhati, and Ms.Anisha Roy (Advocates)\n* Respondents:\n\t+ Alpha Integrated Management Services PVT. LTD.\n\t+ ANR. (None represented)\n\n**Issue**\n\n* Rectification petition seeking cancellation/removal of trademark registration number 3187803 in the name of respondent no.1 under Sections 57 and 125 of the Trademarks Act, 1999.\n\nSource: Page 1 of PDF \"Alpha vs Alpha.pdf\"",
          "content": "2023:DHC:1982 \n \nC.O. (COMM.IPD-TM) 393/2022                                              Page 1 of 7 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n% \n \n \n \n \n \nDate of Decision : 17th March, 2023 \n \n+  \n \n \n \nC.O. (COMM.IPD-TM) 393/2022 \n \n \nALPHA CORP DEVELOPMENT PRIVATE  \nLIMITED  \n \n \n \n \n \n..... Petitioner \nThrough: \nMr. Sagar Chandra, Ms.Srijan Uppal, \nMr. Abhishek Bhati and Ms.Anisha \nRoy, Advocates. \n \n \n \n \nversus \n \n \nALPHA INTEGRATED MANAGEMENT  \nSERVICES PVT. LTD. AND ANR.  \n \n..... Respondents \n \n \n \n \nThrough: \nNone. \n \nCORAM: \n \nHON'BLE MR. JUSTICE AMIT BANSAL \nAMIT BANSAL, J. (Oral) \n1. \nThe present rectification petition has been filed on behalf of the \npetitioner seeking cancellation/removal of the trademark bearing registration \nnumber 3187803 and registered in the name of respondent no.1 in respect of \nreal estate services in Class 36 under Sections 57 and 125 of the Trademarks \nAct, 1999 (hereinafter ‘Act’).  \nCase set up by the petitioner \n2. \nThe case set up by the petitioner in the petition is as follows:  \n2.1 \nThe petitioner, Alpha Corp Development Private Limited, is engaged \nin the business of real estate development including development of \nmalls, hotels, townships, multiplexes and complexes and provides \nfacility management services such as maintenance, building \nautomation, security services among others, since 2003. \n2.2 \nThe petitioner is the registered proprietor of the mark ALPHA \nthrough its predecessor-in-interest, M/s Grandeur Estates Private \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.03.2023 18:55:18\nSignature Not Verified",
          "pdf_source": "4. Alpha vs Alpha.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "Based on page 2 of PDF: 4. Alpha vs Alpha.pdf, here's a summary:\n\nThe petitioner, ALPHA CORP DEVELOPMENT PRIVATE LIMITED (Alpha Corp), has been using the mark \"ALPHA\" since 2006, with various registrations in Classes 36 and 37 of the Act. They have successfully completed several real estate projects, including Alpha International City in Karnal and GurgaonOne-84. The petitioner has won numerous awards and accumulated goodwill over time.\n\nIn the year 2018, their annual sales were Rs. 988,145,000/-. They also spent Rs. 6,241,000/- on advertising and promotions. Respondent No.1, ALPHA INTEGRATED MANAGEMENT SERVICES PVT. LTD., obtained a registration for the mark \"\" in Class 36 of the Act, with a similar color scheme to Alpha Corp's marks.\n\nKey dates: September 1, 2006 (earliest registration), March 17, 2023 (date of decision).\nLegal facts:\n\n* Registration no.:1483826 and 1483827\n* Application No.: 3187803",
          "content": "2023:DHC:1982 \n \nC.O. (COMM.IPD-TM) 393/2022                                              Page 2 of 7 \n \nLimited, bearing registration no. 1483826 and 1483827 in Classes 36 \nand 37 of the Act. Several other registrations have also been obtained \nby the petitioner in respect of the mark ALPHA and its formative \nmarks. The earliest registration was granted on 1st September, 2006.  \n2.3 \nThe petitioner has successfully delivered several real estate projects \nunder the mark ALPHA, such as Alpha International City, Karnal \n(Haryana), \nAlpha \nInternational \nCity, \nFatehabad \n(Haryana), \nGurgaonOne-84 among others.  \n2.4 \nThe petitioner has also won several real estate awards and accolades \nover the years. Due to long and extensive use of the mark ALPHA, \nthe petitioner has acquired vast goodwill and reputation. The annual \nsales of the petitioner in the year 2018 amounted to Rs. 988,145,000/- \nand the petitioner has also incurred expenditure of Rs.6,241,000/- \ntowards advertisement and promotions in the said year.  \n2.5 \nThe respondent no.1 has obtained registration of the mark \n \n(hereinafter ‘impugned mark’ ) in respect of similar services as that of \nthe petitioner, in the name of the respondent no.1 under application \nno. 3187803 in Class 36 of the Act. The letter 'A' and the word \nALPHA in the impugned mark are written in black colour, which \nshows the intention of the respondent no. 1 to give prominence to the \nmark ALPHA in the impugned mark. The colour scheme adopted by \nthe respondent no.1 for the impugned mark is also similar to that of \nthe petitioner’s ALPHA marks.  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.03.2023 18:55:18\nSignature Not Verified",
          "pdf_source": "4. Alpha vs Alpha.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0005",
      "start_index": 3,
      "end_index": 3,
      "summary": "**C.O. (COMM.IPD-TM) 393/2022**\n\nThis is a High Court of Delhi case where **Alpha Corp Development Private Limited (Petitioner)** filed a complaint against **Alpha Integrated Management Services PVT. LTD. and ANR. (Respondent no.1)**.\n\n**Background and Facts:**\n\n* The respondent was incorporated in 2015 by ex-employees of the petitioner's subsidiary company, with access to its records and data.\n* Public caution notices were published by the subordinate companies when they learned about the new company's similar name for facility management services.\n* The respondent filed a defamation complaint in 2016 against the summoning order, which is pending before this Court.\n\n**Key Events:**\n\n1. On February 6, 2017, the petitioner filed an application under Section 16 of the Companies Act, 2013 to direct the respondent no.1 to rectify its deceptively similar/identical trade name.\n2. The Regional Director, MCA held that the trade name closely resembles the subsidiary company's name and directed the respondent to change it on August 1, 2017.\n3. The impugned mark was published in the Trade Mark Journal on September 18, 2017.\n\n**Reference:**\nPDF Source: **Alpha vs Alpha.pdf**, Context: 2023:DHC:1982 (Source not confirmed)",
      "pdf_source": "4. Alpha vs Alpha.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "Here is a summary of page 3:\n\n**PDF Source:** Alpha vs Alpha.pdf (2023:DHC:1982)\n\n**Legal Facts and Proceedings:**\n\n* The respondent company was incorporated by ex-employees of the petitioner on July 23, 2015.\n* Public caution notices were published by the petitioner's subsidiary company to warn against a new company with a similar name.\n* A defamation complaint was filed by the respondent, leading to a CRL.M.C. case (No.297/2017) in Delhi High Court.\n* The petitioner applied to the Ministry of Corporate Affairs under Section 16 of the Companies Act, 2013, seeking directions to change the respondent's deceptively similar trade name.\n\n**Directions and Orders:**\n\n* Regional Director, MCA ordered the respondent to change their company's trade name due to resemblance with the petitioner's subsidiary company's name on August 1, 2017.\n* The impugned mark was published in the Trade Mark Journal on September 18, 2017.\n\nNote: This summary is under 200 words.",
          "content": "2023:DHC:1982 \n \nC.O. (COMM.IPD-TM) 393/2022                                              Page 3 of 7 \n \n2.6 \nThe malafides of the respondent no.l is evident from the fact that the \nrespondent no.l company was incorporated by the ex-employees of \nthe petitioner and its subsidiary company, Alpha G: Corp \nManagement Services Pvt. Ltd., on 23rd July, 2015, which is prior to \nthe date of resignation of the said employees. The said employees had \ncomplete access to the records and data of the petitioner and its \nsubsidiary company. \n2.7 \nPublic caution notices were published by the petitioner's subsidiary \ncompany in various newspapers when it came to know that its ex-\nemployees had incorporated a new company with confusingly similar \nname for providing identical services of facility management. \nThereafter, the respondent no.1 filed a defamation complaint before \nTis Hazari Courts, New Delhi. Against the summoning order dated \n14th May, 2016 passed in the aforementioned defamation complaint, \nthe petitioner filed a CRL.M.C. No.297/2017 before this Court, which \nis pending adjudication.  \n2.8 \nThe petitioner filed an application being SRN G43969063 dated 6th \nFebruary, 2017 before Ministry of Corporate Affairs (MCA) under \nSection 16 of the Companies Act, 2013 seeking a direction to the \nrespondent no. 1 to rectify its deceptively similar/identical trade \nname. The Regional Director, MCA held that the trade name of the \nrespondent no.1 closely resembles the name of the subsidiary \ncompany of the petitioner and directed them to change the name of \ntheir company vide order dated 1st August, 2017.  \n2.9 \nThe impugned mark was published in the Trade Mark Journal on 18th \nSeptember, 2017. However, the respondent no. 1 concealed the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.03.2023 18:55:18\nSignature Not Verified",
          "pdf_source": "4. Alpha vs Alpha.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0009",
      "start_index": 4,
      "end_index": 6,
      "summary": "**Law Case Summary:** Alpha Corp Development Private Limited vs Alpha Integrated Management Services PVT. LTD.\n\n**PDF Source:** 2023:DHC:1982 (Case No.: C.O. (COMM.IPD-TM) 393/2022)\n\n**Key Facts and Decisions:**\n\n* The Petitioner, Alpha Corp Development Private Limited, applied for a rectification of trademark to cancel the mark adopted by Respondent No.1, Alpha Integrated Management Services PVT. LTD.\n* The Respondent No.1 has changed its corporate name from 'Alpha' to 'Abante' and registered trademarks in respect of various marks including 'ABANTE'.\n* Notice was issued to the Respondent No.1, who failed to appear despite service.\n* The Court found that the prominent feature of the impugned mark is 'ALPHA', which is identical and deceptively similar to the Petitioner's mark 'ALPHA' and its other formative marks.\n\n**Court Decisions:**\n\n* It was decided that the registration of the impugned mark is a contravention of Section 11(1) of the Act.\n* The Court found no plausible reason for the Respondent No.1 to have chosen an identical and deceptively similar mark as that of the Petitioner's mark.\n\n**Parties and Dates:**\n\n* Parties involved: Alpha Corp Development Private Limited (Petitioner), Alpha Integrated Management Services PVT. LTD. (Respondent No.1)\n* Filing Date of Writ Petition Civil No. 24380/2017 by Respondent No.1: 07 July, 2017\n* Date of Decision: 17th March, 2023\n\n**Amounts/Monies:**\n\n* No amounts mentioned in the PDF source.\n\nNote that this summary aims to capture only key aspects and does not encompass all details or analyses in the original document.",
      "pdf_source": "4. Alpha vs Alpha.pdf",
      "nodes": [
        {
          "title": "Page 4",
          "node_id": "0006",
          "start_index": 4,
          "end_index": 4,
          "summary": "Here is a summary of page 4 from \"Alpha vs Alpha.pdf\" (2023:DHC:1982):\n\n**Proceedings in the petition**\n\n* Notice was issued by IPAB on November 1, 2018, but respondent no.1 failed to appear.\n* Respondent no.1 was proceeded against ex parte on January 21, 2020.\n* The rectification case got transferred to this Court after Tribunals Reforms Act, 2022 came into effect.\n* A court notice was issued to respondent no.1 on March 28, 2022, but they failed to appear despite service.\n\n**New developments**\n\n* It was noted that respondent no.1 has changed its corporate name from 'Alpha Integrated Management Service Private Limited' to 'Abante Integrated Management Services Private Limited'.\n* On February 15, 2023, the petitioner's counsel handed over fresh trademark registrations granted in favor of the petitioner.\n\nSource: \"Alpha vs Alpha.pdf\" (2023:DHC:1982)",
          "content": "2023:DHC:1982 \n \nC.O. (COMM.IPD-TM) 393/2022                                              Page 4 of 7 \n \nfactum of passing of the aforementioned order by the Regional \nDirector regarding change of name of the respondent no.1 company. \n2.10 The respondent no.l has challenged the aforesaid order of the \nRegional Director by filing a Writ Petition Civil No. 24380/2017 \nbefore High Court of Punjab and Haryana, which is presently pending \nadjudication. However, the High Court of Punjab and Haryana vide \norder dated 30th October, 2017 has stayed the operation of the order \ndated 1st August, 2017 passed by the Regional Director. \n2.11 The impugned mark has been adopted by the respondent no. 1 with \nthe sole intention of riding on the goodwill of the petitioner and to \ncreate confusion in the minds of the public and trade channel. \n2.12 Accordingly, the present rectification has been filed by the petitioner.  \nProceedings in the petition \n3. \n Notice in the present petition was issued by the Intellectual Property \nAppellate Board (IPAB) on 1st November, 2018. However, the respondent \nno.1 failed to appear before IPAB despite service. The respondent no.1 was \nproceeded against ex parte on 21st January, 2020. Thereafter, the present \nrectification got transferred to this Court after coming into effect of \nTribunals Reforms Act, 2022 and the Court notice was issued to the \nrespondent no.1 by this Court on 28th March, 2022. However, none appeared \non behalf of the respondent no.1 despite service. \n4. \nIt was noted in the order dated 23rd January, 2023 that the respondent \nno.1 has changed its corporate name from ‘Alpha Integrated Management \nService Private Limited to ‘Abante Integrated Management Services Private \nLimited’. Further, on 15th February, 2023, the counsel for the petitioner \nhanded over fresh trademark registrations granted in favour of the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.03.2023 18:55:18\nSignature Not Verified",
          "pdf_source": "4. Alpha vs Alpha.pdf",
          "nodes": []
        },
        {
          "title": "Page 5",
          "node_id": "0007",
          "start_index": 5,
          "end_index": 5,
          "summary": "Here is a summary of page 5 of the PDF \"Alpha vs Alpha.pdf\" (Source: PDF - \"Alpha vs Alpha.pdf\"), based on the provided content:\n\n**Page 5 Summary**\n\n* The court issued a notice to Respondent No.1 for trademark infringement, specifically regarding the marks: (logo), (device), and 'ABANTE' (word).\n* The notice was served on Respondent No.1's attorney, but none appeared on behalf of the respondent, nor was any reply filed.\n* This suggests that Respondent No.1 is not interested in pursuing the petition, as it has already changed its trademark and corporate name.\n\n**Analysis**\n\nThe court will determine whether the trademark of Respondent No.1 is identical to that of Petitioner's. To do this, they will refer to the competing trademarks listed below:\n\n* Respondent No.1's Trademark: ALPHA\n* Petitioner's Trademarks: \n  * (logo)\n  * (device)\n\nThis summary focuses on legal facts and proceedings, as required.",
          "content": "2023:DHC:1982 \n \nC.O. (COMM.IPD-TM) 393/2022                                              Page 5 of 7 \n \nrespondent no.1 in respect of the marks \n(logo)  , \n(device) \nand ‘ABANTE’ (word). The court notice was also issued to the respondent \nno.1 including through attorney, who applied for the aforesaid registrations \non his behalf on the said date. Court notice was duly served on the \nrespondent no.1’s attorney. Despite service, none has appeared on behalf of \nthe respondent no.1. Nor any reply/counter-statement has been filed on \nbehalf of the respondent no.1. It is indicative of the fact that the respondent \nno.1 is not interested in pursuing the present petition, as it has already \nchanged its trademark and its corporate name.  \nAnalysis and Findings \n5. \n I have heard the counsels for the parties and perused the record of the \ncase.  \n6. \n In order to determine whether the trademark of the respondent no.1 is \nidentical to the trademark of the petitioner, it would be apposite to refer to \nthe two competing trademarks, as set out below:  \nRespondent no.1’s Trademark \nPetitioner’s Trademarks \n \n  ALPHA \n  \n \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.03.2023 18:55:18\nSignature Not Verified",
          "pdf_source": "4. Alpha vs Alpha.pdf",
          "nodes": []
        },
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "Based on page 6 of the PDF \"Alpha vs Alpha.pdf\" (Source: 2023:DHC:1982), here is a summary of the key legal facts, proceedings, arguments, decisions, dates, names, and amounts:\n\n**Summary**\n\nThe petitioner, Alpha Corp Development Private Limited, challenged the registration of the respondent's trademark, which the court found to be deceptively similar to the petitioner's mark \"ALPHA\" and its variants. The court held that the respondent had knowingly adopted an identical mark without any plausible reason, indicating dishonesty.\n\n**Legal Findings**\n\n* Contravention of Section 11(1) of the Trademarks Act: registration of impugned mark without consent of the prior user.\n* Contravention of Section 18(1): respondent not authorized to use the impugned mark.\n* Denial of benefit under Section 12: respondent's adoption of impugned mark was dishonest.\n* Grant of registration against principles of Section 11(3)(a): petitioner was prior user since 2003.\n\n**Names and Dates**\n\n* Petitioner: Alpha Corp Development Private Limited\n* Respondent No.1: Alpha Integrated Management Services Pvt. Ltd.\n* Date: 17th March, 2023",
          "content": "2023:DHC:1982 \n \nC.O. (COMM.IPD-TM) 393/2022                                              Page 6 of 7 \n \n7. \nIt is pertinent to note that the prominent and essential feature of the \nimpugned mark is ‘ALPHA’, which is identical and deceptively similar to \nthe petitioner's mark ‘ALPHA’ and its other formative marks in respect of \nsimilar services. Therefore, the registration of the impugned mark is in \ncontravention of Section 11(1) of the Act.  \n8. \nThe respondent no. 1 was well aware of the petitioner's mark ALPHA \nsince respondent no. 1 was incorporated by ex-employees of the petitioner. \nThere can be no plausible reason for the respondent no. 1 to have chosen an \nidentical and a deceptively similar mark as that of the petitioner's mark for \nidentical goods. Clearly, the adoption of the mark by the respondent no.1 is \ndishonest and therefore, the respondent no.1 is not entitled to the benefit of \nSection 12 of the Act.  \n9. \nFrom the facts detailed above, it is clear that the petitioner is the \nproprietor of the impugned mark. The respondent no.1 cannot claim to be \nthe proprietor of the impugned trademark as there is nothing to show as to \nhow the impugned trademark has been adopted by the respondent no.1. \nTherefore, the application for registration of the impugned trademark is in \ncontravention of Section 18(1) of the Act. Further, the respondent no.1 is \nalso not entitled to the benefit of Section 11(4) of the Act as the petitioner \nhas not consented to the use of the impugned mark by the respondent no.1. \n10. \nThe grant of registration of the impugned trademark by the respondent \nno.2 is against the principles of Section 11(3)(a) of the Act, as there is no \ndispute that the petitioner is the prior user of the impugned trademark since \n2003 in India. Due to such a long, continuous and extensive use, the \nimpugned mark is solely associated with the petitioner. Therefore, the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.03.2023 18:55:18\nSignature Not Verified",
          "pdf_source": "4. Alpha vs Alpha.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0011",
      "start_index": 7,
      "end_index": 7,
      "summary": "**Summary of Court Decision**\n\nThe document is a court decision from the High Court of Delhi at New Delhi (2023:DHC:1982), specifically **C.O. (COMM.IPD-TM) 393/2022**, dated March 17, 2023.\n\n**Parties Involved**\n\n* Petitioner: ALPHA CORP DEVELOPMENT PRIVATE LIMITED\n* Respondents:\n\t+ ALPHA INTEGRATED MANAGEMENT SERVICES PVT. LTD. (#1)\n\t+ Anr. (unknown party #2)\n\n**Facts and Argument**\n\nThe petitioner alleged that respondent #1 adopted a trademark dishonestly to trade upon the established goodwill and reputation of the petitioner, creating confusion about the source of goods.\n\n**Court Decision**\n\n* The court held that registration of the impugned trademark should have been refused by the respondent #2.\n* The nature of the impugned trademark was deemed deceiving and capable of creating confusion regarding its source.\n* **Result:** The present petition is allowed, and the impugned trademark (application no. 3187803 in Class 36) is removed from the Register of Trade Marks.\n\n**Orders and Directions**\n\n* A copy of the order is to be sent to respondents through e-mail.\n* The Registry is directed to supply a copy of the present order to the Trademark Registry at **llc-ipo@gov.in** for compliance.\n\nSource: Alpha vs Alpha.pdf (Page 1-7 of 7, Court Decision section)",
      "pdf_source": "4. Alpha vs Alpha.pdf",
      "nodes": [
        {
          "title": "Page 7",
          "node_id": "0010",
          "start_index": 7,
          "end_index": 7,
          "summary": "Here is a summary of page 7 from the provided PDF \"Alpha vs Alpha.pdf\":\n\nThis is not an actual page content but an order of the court. I will summarize relevant points:\n\n**Court Order:**\n\nC.O. (COMM.IPD-TM) 393/2022, dated March 17, 2023\n\nPetitioner: ALPHA CORP DEVELOPMENT PRIVATE LIMITED\nRespondent: ALPHA INTEGRATED MANAGEMENT SERVICES PVT. LTD.\n\n**Decision:**\n\nThe court allowed the petition and removed the impugned trademark registered under application no. 3187803 in Class 36.\n\n**Rationale:**\n\nThe trademark was adopted dishonestly to trade on petitioner's goodwill, reputation, and project an association with the petitioner. The trademark would deceive the public and create confusion regarding its source.\n\n**Order:**\n\nA copy of the order is to be sent to respondents through email, and a copy is to be supplied to the Trademark Registry (llc-ipo@gov.in).\n\nPDF Source: 2023:DHC:1982, Alpha vs Alpha.pdf",
          "content": "2023:DHC:1982 \n \nC.O. (COMM.IPD-TM) 393/2022                                              Page 7 of 7 \n \nregistration of the impugned trademark should have been refused by the \nrespondent no.2. \n11. \nIn view of the discussion above, it is clear that the impugned \ntrademark has been adopted by the respondent no.1 dishonestly to trade \nupon the established goodwill and reputation of the petitioner and to project \nitself to be associated with the petitioner. The nature of the impugned \ntrademark is such that it will deceive the public and create confusion as \nregards the source of the goods manufactured and sold under the impugned \ntrademark.  \n12. \nAccordingly, the present petition is allowed and the impugned \ntrademark registered under trademark application no. 3187803 in the name \nof the respondent no.1 in Class 36 is removed from the Register of Trade \nMarks.  \n13. \n A copy of the order be sent to the respondents through e-mail. The \nRegistry is directed to supply a copy of the present order to the Trademark \nRegistry, at e-mail - llc-ipo@gov.in for compliance.  \n \n \n \nAMIT BANSAL, J \nMARCH 17, 2023 \nsr \n \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.03.2023 18:55:18\nSignature Not Verified",
          "pdf_source": "4. Alpha vs Alpha.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-16T15:23:29.316226",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}