{
  "doc_name": "40. Raj Kumar v. Sandeep Kumar & Anr.",
  "pdf_source": "40. Raj Kumar v. Sandeep Kumar & Anr..pdf",
  "metadata": {
    "document_name": "40. Raj Kumar v. Sandeep Kumar & Anr.",
    "source_pdf": "40. Raj Kumar v. Sandeep Kumar & Anr..pdf",
    "judges": [
      "C.HARI SHANKAR J U D G M E N T (O R A L) % 30.01.2023 1."
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [],
    "dhc_numbers": [
      "2023/DHC/000647",
      "2023/DHC/000647",
      "2023/DHC/000647",
      "2023/DHC/000647",
      "2023/DHC/000647",
      "2023/DHC/000647",
      "2023/DHC/000647",
      "2023/DHC/000647",
      "2023/DHC/000647",
      "2023/DHC/000647",
      "2023/DHC/000647"
    ],
    "ia_numbers": [],
    "decision_date": "5 July, 2021",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [],
    "defendants": [],
    "appellants": [],
    "respondents": [],
    "plaintiff_advocates": [],
    "defendant_advocates": [],
    "appellant_advocates": [],
    "respondent_advocates": [],
    "damages_claimed": null,
    "damages_awarded": null,
    "key_issues": [
      "Here are the main legal issues from the document:",
      "Trade Marks Act, 1999 and Rules of 2017",
      "Section 571 rectification petition for removal of trade mark registration",
      "Rectification of Register of Trade Marks for cancellation or variation",
      "Grounds for contravention or failure to observe conditions entered on the register",
      "Aggrieved party's right to apply for entry omission or error correction",
      "Classification of goods and services under the International Classification",
      "Definition of Class 30, covering flour, bread, pizza, pastry and confectionery",
      "Concurrent use of trade mark \"PIZZA GALLERIA\" by two parties in different geographical areas",
      "Scope of Court intervention in concurrent use disputes without territorial limitation"
    ],
    "decision_summary": "**Case Summary**\n\n**C.O. (COMM.IPD-TM) 39/2021: Raj Kumar Sharma vs Sandeep Kumar & Anr.**\n\n**Background**\n\nThis case involves a dispute over the use of a trade mark \"PIZZA GALLERIA\" by two separate parties in different locations in India. The petitioner, Raj Kumar Sharma, owns eateries under the name \"PIZZA GALLERIA\" in Rewari, while the respondent, Sandeep Kumar, also operates under the same name but outside of Rewari.\n\n**Legal Issues**\n\n1. **Trade Mark Registration**: The case revolves around the registration of the trade mark \"PIZZA GALLERIA\" by Sandeep Kumar (Respondent 1) under Class 30 of the Alphabetical Index of classification of goods published by the Registrar of Trade Marks.\n2. **Rectification of Register**: Raj Kumar Sharma has filed a petition under Section 571 of the Trade Marks Act, 1999, seeking to rectify the register by removing the trade mark registration in favor of Respondent 1.\n3. **Geographical Restraint**: The dispute centers on whether Respondent 1 is entitled to use the \"PIZZA GALLERIA\" mark in Rewari, given that petitioner has already established an existing business under the same name.\n\n**Arguments**\n\n* Raj Kumar Sharma's advocate (Nikhil Sonker): Argued that respondent is seeking to trade off the goodwill of petitioner's business, which cannot be allowed.\n* Sandeep Kumar's advocate (Garima Sachdeva): Emphasized that respondent intends to use the mark outside Rewari and is not willing to restrict their use exclusively to those areas.\n\n**Court Findings**\n\nThe Court was unable to understand why it should intervene in this dispute, as petitioner has no objection to Respondent 1 using the \"PIZZA GALLERIA\" mark outside of Rewari. However, due to Respondent 1's insistence on not restricting their use, the court proceeded with the case.\n\n**Decision**\n\nThe Court denied Raj Kumar Sharma's petition under Section 571 of the Trade Marks Act, 1999, which sought the rectification of the register by removing the registration number \"4842932\" dated July 5th, 2021. The decision was influenced largely because petitioner had expressed no objection to Respondent 1 using the mark outside Rewari.\n\n**Consequence**\n\nAlthough petitioner's objections were not allowed in this context, this outcome may indicate that they can use this as leverage for future disputes or negotiations regarding trade mark rights within their operational areas (Rewari).\n\nPlease note that court decisions are binding; however interpretation requires understanding of legal reasoning behind each decision.",
    "legal_precedents": [
      "Natures Essence Private Limited Protogreen Retail Solutions \nPrivate Limited"
    ],
    "full_text": "\n--- PAGE 1 ---\nNeutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 1 of 11  \n \n   \n \n$~6(Original) \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.O. (COMM.IPD-TM) 39/2021 \n \nRAJ KUMAR SHARMA \n \n \n \n..... Plaintiff \n \n \n \n \nThrough: \nMr. Nikhil Sonker, Adv. \n \n \n \n \n \nversus \n \n \nSANDEEP KUMAR & ANR.  \n \n      ..... Defendants \nThrough: \nMs. Garima Sachdeva, Adv. for \nR-1.  \nMr. Harish Vaidyanathan Shankar, CGSC \nwith Mr. Srish Kumar Mishra, Mr. Sagar \nMehlawat \nand \nMr.Alexander \nMathai \nPaikaday, Advs. for R-2. \n \nCORAM: \n \nHON'BLE MR. JUSTICE C.HARI SHANKAR \n \n \n \n \nJ U D G M E N T (O R A L) \n% \n \n \n \n \n30.01.2023 \n1. \nThe petitioner, in this petition preferred under Section 571 of the \nTrade Marks Act, 1999, has sought rectification of the Register of \nTrade Marks by removal, therefrom, of Registration No. 4842932 \ndated 5th July 2021, whereby the word mark “PIZZA GALLERIA”, \nwas registered in favour of Respondent 1 under Class 30 of the \nAlphabetical Index of classification of goods published by the \nRegistrar of Trade Marks under Sections 7 and 82 of the Trade Marks \n                                          \n1 57.  \nPower to cancel or vary registration and to rectify the register. –  \n(1)  \nOn application made in the prescribed manner to the High Court or to the Registrar by \nany person aggrieved, the Registrar or the High Court, as the case may be, may make such order as \nit may think fit for cancelling or varying the registration of a trade mark on the ground of any \ncontravention, or failure to observe a condition entered on the register in relation thereto. \n(2)  \nAny person aggrieved by the absence or omission from the register of any entry, or by \nany entry made in the register without sufficient cause, or by any entry wrongly remaining on the \nregister, or by any error or defect in any entry in the register, may apply in the prescribed manner to \nthe High Court or to the Registrar, and the Registrar or the High Court, as the case may be, may \nmake such order for making, expunging or varying the entry as it may think fit. \n2 7.  \nClassification of goods and services. –  \n(1)  \nThe Registrar shall classify goods and services, as far as may be, in accordance with the \nInternational classification of goods and services for the purposes of registration of trade marks. \n(2)  \nAny question arising as to the class within which any goods or services falls shall be \ndetermined by the Registrar whose decision shall be final. \n8.  \nPublication of alphabetical index. –  \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified\n\n--- PAGE 2 ---\nNeutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 2 of 11  \n \n   \n \nAct read with Rule 20(2)3 of the Trade Marks Rules, 2017.  Class 30 \ncovers “flour and preparations made from cereals; bread, pizza, pastry \nand confectionery”.   \n \n2. \nMr. Nikhil Sonker, learned Counsel for the petitioner, submitted \nthat the petitioner was contesting the right of Respondent 1 to use the \n“PIZZA GALLERIA” mark in the city of Rewari.  The challenge in \nthis appeal is, therefore, restricted to said use.  The petitioner does not \nbegrudge the respondent the right to use the “PIZZA GALLERIA”  in \nany other part of the country.   \n \n3. \nInterestingly, the petitioner and Respondent 1 are both running \neating outlets under the name “PIZZA GALLERIA”.  The petitioner‟s \noutlets are situated in Rewari, whereas Respondent 1‟s outlets are \nsituated outside Rewari.  In these circumstances, quite frankly, I am \nunable to understand why this Court should even trouble itself with \ndeciding this dispute, as the petitioner has no objection to the \nRespondent 1 using the “PIZZA GALLERIA” mark outside Rewari. \nHowever, Ms. Sachdeva, learned Counsel for Respondent 1 submits \nthat her client is unwilling to surrender the Rewari market.  She also \nsubmits that, on an earlier occasion, this issue had arisen, but that her \nclient was not agreeable to a disclaimer restricting the use, by it, of the \n                                                                                                                   \n(1)  \nThe Registrar may publish in the prescribed manner an alphabetical index of \nclassification of goods and services referred to in Section 7. \n(2)  \nWhere any goods or services are not specified in the alphabetical index of goods and \nservices published under sub-section (1), the classification of goods or services shall be determined \nby the Registrar in accordance with sub-section (2) of Section 7. \n3 20.  \nClassification of goods and service. –  \n(1)  \nClassification of goods and service for the purpose of registration of trade mark, the \ngoods and services shall be classified as per current edition of “the International Classification of \ngoods and services (NICE classification)” published by the World Intellectual Property \nOrganisation (WIPO). \n(2)  \nThe Registrar shall publish a class wise and an alphabetical index of such goods and \nservices, including goods and services of Indian origin. \n \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified\n\n--- PAGE 3 ---\nNeutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 3 of 11  \n \n   \n \ncontested “PIZZA GALLERIA” mark only to areas outside Rewari.  \nAs such, the Court is constrained to decide the dispute. \n \n4. \nAccording to Mr. Sonker, a Memorandum of Understanding \n(MoU) had been executed between the petitioner and Respondent 1 on \n9th June 2021, in terms of which the petitioner was entitled to use the \n“PIZZA GALLERIA” mark in the city of Rewari, whereas \nRespondent 1 was entitled to use the said mark anywhere else in the \ncountry.  A copy of the MoU has been placed on record.  Respondent \n1, however, disputes the MoU and alleges that it is fabricated.   \n \n5. \nRespondent 1, on the other hand, contends that the petitioner \nwas a franchisee of Respondent 1 and that a franchise agreement dated \n25th March 2018 had been executed between them. She, however \nsubmits that her client has misplaced the original franchise agreement \nand is only in possession of a draft franchise agreement which was \nemailed by Respondent 1 to the petitioner.  The said draft franchise \nagreement has been placed on record.  However, as it is an unsigned \nand undated document, the Court cannot take cognizance thereof. \n \n6. \nIn any event, as the recital hereinafter would reveal, it is not \nnecessary for this Court, in order to decide the present petition, to \nadvert either to the MoU or the franchise agreement.   \n \n7. \nAfter a considerably lengthy hearing, the matter has narrowed \ndown to a short point, on the basis of which this petition can be \ndecided.  The impugned registration dated 5th July 2021, of the \n“PIZZA GALLERIA” word mark in favour of Respondent 1 was \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified\n\n--- PAGE 4 ---\nNeutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 4 of 11  \n \n   \n \ngranted consequent to an application made by Respondent 1 on 1st \nFebruary 2021.  Undisputedly, prior thereto, on 31st August 2020, the \npetitioner had applied for registration of the \n device mark \nunder Class 35 which covers “Retail Shop or Online Retail Shop of \nFood Items, Mobile Retail Food Store Services”. \n \n8. \nThere is, therefore, no dispute about the fact that the application \nfiled by the petitioner for registration of the \n device mark \nunder Class 35 was prior in point of time to the application dated 1st \nFebruary 2021, filed by Respondent 1 for the “PIZZA GALLERIA” \nword mark. \n \n9. \nRelying on Section 11(1)4 of the Trade Marks Act read with \nClause (a) of the Explanation5 to the said section, Mr. Sonker submits \nthat the \n mark is, if not identical, at least, similar to the \n“PIZZA GALLERIA” word mark of Respondent 1, as the pictorial \nrepresentation in the former mark is of a pizza.  He submits that, \ntherefore, there is a likelihood of confusion between the \n \n                                          \n4 11.  \nRelative grounds for refusal of registration. –  \n(1)  \nSave as provided in Section 12, a trade mark shall not be registered if, because of –  \n(a)  \nits identity with an earlier trade mark and similarity of goods or services \ncovered by the trade mark; or \n(b)  \nits similarity to an earlier trade mark and the identity or similarity of the goods \nor services covered by the trade mark, \nthere exists a likelihood of confusion on the part of the public, which includes the likelihood of \nassociation with the earlier trade mark. \n5 Explanation. – For the purposes of this section, earlier trade mark means –  \n(a)  \na registered trade mark or an application under Section 18 bearing an earlier date of filing \nor an international registration referred to in Section 36-E or convention application referred to in \nSection 154 which has a date of application earlier than that of the trade mark in question, taking \naccount, where appropriate, of the priorities claimed in respect of the trade marks; \n(b)  \na trade mark which, on the date of the application for registration of the trade mark in \nquestion, or where appropriate, of the priority claimed in respect of the application, was entitled to \nprotection as a well-known trade mark. \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified\n\n--- PAGE 5 ---\nNeutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 5 of 11  \n \n   \n \ndevice mark and the “PIZZA GALLERIA” word mark.  In these \ncircumstances, he submits, Respondent 1 could not have been granted \nregistration in respect of the “PIZZA GALLERIA” word mark, as \ngrant of such registration would infract Section 11(1) of the \nTrademarks Act. \n \n10. \nAs there appears to be substance in this contention, it is not \nnecessary to examine any of the other contentions urged at the bar by \nboth sides.  \n \n11. \nClauses (a) and (b) of Section 11(1) envisage independent \ncircumstances in which a trade mark is ineligible for registration.  Of \nthese, where the mark for which registration has been applied is \nidentical to an earlier trademark, Clause (a) would apply, whereas, \nwhere the applicant‟s mark is similar to an earlier trademark, Clause \n(b) would apply.  In either case, likelihood of confusion on the part of \nthe public must be shown to exist, in order for the later mark to be \nineligible for registration.  \n \n12. \nThe expression “earlier trademark” has been defined in the \nExplanation to the Section.  Clause (a) of the explanation includes, \nwithin the meaning of the expression “earlier trademark”, “an \napplication under Section 186 bearing an earlier date of filing”.  As \nsuch, Section 11(1)(b) read with Clause (a) of the explanation to \nSection 11, would prohibit the registration of a trademark where, \nbecause of (i) its similarity with a mark, for which an application, filed \nearlier, was pending, coupled with (ii) identity or similarity of the \n                                          \n6 Section 18 allows a person to apply for registration of a trade mark.   \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified\n\n--- PAGE 6 ---\nNeutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 6 of 11  \n \n   \n \ngoods or services covered by the two marks, there exists a likelihood \nof confusion. \n \n13. \nCan, then, the \n device mark of the petitioner, and the \n“PIZZA GALLERIA” word mark of the respondent, be regarded as \n“similar”, as would result in a likelihood of confusion?   \n \n14. \nAfter some cogitation, I feel the answer has to be in the \naffirmative. \n \n15. \nThe expression “similar” is not defined in the Trade Marks Act.  \nSection 2(1)(h), however, declares, in an admirably circular fashion, \nthat “a mark shall be deemed to be deceptively similar to another mark \nif it so nearly resembles the other mark as to be likely to deceive or \ncause confusion”.   Thus, Section 2(1)(h) embraces, within the broad \nparentheses of “deceptive similarity”, both “confusing” and \n“deceptive” similarity.  Likelihood of deception or confusion, in any \nevent, remains the pervading mantra. \n \n16. \nThe petitioner‟s \n mark contains a pictorial depiction \nof a pizza, with the word “Galleria” alongside it.  A mental connect \nbeween the pizza and “Galleria” is, however, immediately made by an \naverage consumer who sees the mark.  The impugned mark of the \nrespondent is “PIZZA GALLERIA”.  In the mark “PIZZA \nGALLERIA”, there can be no manner of doubt that “Galleria” is the \ndominant part, as “pizza” is publici juris, used by nearly every eatery \nwhich specializes in pizzas.  “Galleria” may be a term more often \nassociated with art; it certainly is not a term of common usage for \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified\n\n--- PAGE 7 ---\nNeutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 7 of 11  \n \n   \n \nrestaurants or eating joints.  An unwary consumer would not, \ntherefore, readily imagine that \n and “PIZZA GALLERIA” \nare two different establishments, run by two different persons.  He is \nmuch more likely to regard the former device mark as a pictorial \nmanifestation of the latter word mark.  Likelihood of confusion, in \npresuming both establishments to belong to one administration is, \ntherefore, in my opinion, inevitable.   \n \n17. \nMr. Sonker has, moreover, pointed out that, in invoices issued \nby the petitioner, the petitioner was actually referred to as “PIZZA \nGALLERIA”.  \n \n18. \nThe nature of services provided by the petitioner and \nRespondent 1 are identical, as both are providing restaurant services.  \nThough the petitioner‟s application, dated 31st August 2020, for \nregistration of the  \n device mark, and the respondent‟s \napplication dated 1st February 2021 for registration of the „PIZZA \nGALLERIA‟ word mark were for different classes, that cannot make \nany difference, as the applicability of Section 11(1) is not dependent \non the class in respect of which the marks are registered, or \nregistration of the marks is sought.  Even otherwise, the nature of \ngoods and services covered by Classes 30 and 35 are allied, the former \nrelating to “flour and preparations made from cereals; bread, pizza, \npastry and confectionery” and the latter to “Retail Shop or Online \nRetail Shop of Food Items, Mobile Retail Food Store Services”.  \nWhere the goods and services to which the competing marks relate are \nallied, the chance of confusion or deception stands enhanced, as held \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified\n\n--- PAGE 8 ---\nNeutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 8 of 11  \n \n   \n \nin  Mex Switchgears Pvt. Ltd. v. Omex Cables Industries7 and \nNatures Essence Private Limited v. Protogreen Retail Solutions \nPrivate Limited8,  \n \n19. \nThere is, therefore, substance in the contention of Mr. Sonker \nthat the petitioner‟s  \n   device mark is similar to the “PIZZA \nGALLERIA” word mark of Respondent 1, and is used in respect of \ngoods or services which are not only similar but identical.  Equally, in \nthese circumstances, the possibility of likelihood of confusion among \npersons who wished to visit the eating outlets cannot be gainsaid.  \n \n20. \nThe petitioner‟s application for registration of \n device \nmark, having been made on 31st August 2020, is prior in point of time \nto the application of Respondent 1 for registration of the „PIZZA \nGALLERIA‟ word mark, which was on 1st February 2021.  As such, \nthe application dated 31st August 2020 of the petitoner itself amounted \nto an “earlier trademark” within the meaning of Section 11(1)(b) of \nthe Trade Marks Act, in view of Clause (a) of the explanation to the \nSection.  \n \n21. \nMs. Sachdeva, learned Counsel for Respondent 1 fairly \nacknowledged that the petitioner‟s application for registration of the \n device mark was indeed prior in point of time to the \napplication dated 1st February 2021 of Respondent 1, consequent on \nwhich the impugned “PIZZA GALLERIA” word mark was registered \n                                          \n7 (2017) 71 PTC 465 (Del) \n8 (2021) 86 PTC 225 (Del) \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified\n\n--- PAGE 9 ---\nNeutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 9 of 11  \n \n   \n \nin Respondent 1‟s favour.  However, she submits that the present \npetition is centred entirely on the MoU dated 9th June 2021 executed \nbetween the petitioner and Respondent 1 which, according to her, is \nthe main ground on which the petitioner has questioned the \nentitlement, of Respondent 1, to registration of the impugned mark.  \n \n22. \nIt is correct that the petition is predicated, to a large extent, on \nthe MoU dated 9th June 2020.  However, in para 13 of the grounds of \nchallenge in the present petition, the petitioner has stated that the \npetitioner‟s earlier application was for a mark similar to the impugned \nmark of Respondent 1 and that, therefore, grant of registration to the \nimpugned mark infracted Section 11(1) of the Trademarks Act.  As \nsuch, it cannot be said that the submission of Mr. Sonker is entirely \ndivorced from the pleadings.   \n \n23. \nSection 57(2) of the Trademarks Act permits the making of an \napplication for making, expunging or varying any entry in the Trade \nMarks Register, where the applicant alleges that (i) the entry is made \nwithout sufficient cause or (ii) is wrongly remaining on the register or \n(iii) suffers from any error or defect.  Mr. Sonker submits that \ncircumstance (ii) applies to the present case.  As such, he submits, in \nview of Section 11(1)(b) of the Trade Marks Act, the impugned \nregistration of the word mark “PIZZA GALLERIA” granted to the \npetitioner on 5th July 2021, could not be allowed to remain on the \nregister.  \n \n24. \nAs I have already held that the grant of registration to \nRespondent 1 of the impugned “PIZZA GALLERIA” word mark on \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified\n\n--- PAGE 10 ---\nNeutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 10 of 11  \n \n   \n \n5th July 2021 is violative of Section 11(1)(b) of the Trademarks Act, \nthe said word mark is liable to be removed from the register.  \nHowever, as Mr Sonker has restricted his challenge, in the present \npetition, to the use, by the defendant, of the impugned “PIZZA \nGALLERIA” mark in the city of Rewari, I direct the rectification of \nRegistration No. 4842932 granted to Respondent 1 for the word mark \n“PIZZA GALLERIA” on 5th July 2021 to be rectified by inserting, \ntherein, a disclaimer disallowing the use of the said mark, by the \ndefendant, in the city of Rewari, while retaining the right of the \ndefendant to use the mark elsewhere in the country.   \n \n25. \nThis petition stands disposed of in the aforesaid terms.  \n \nA Postscript \n \n26. \nA somewhat quixotic statutory position has come to my notice \nwhile correcting this judgement.  Earlier, classification of goods and \nservices, for the purposes of registration of trade marks, was contained \nin the Fourth Schedule to the Trade Marks Rules, 2002 (“the 2002 TM \nRules”).  The 2002 TM Rules were, subsequently, superseded by the \nTrade Marks Rules, 2017 (“the 2017 TM Rules”).  Rule 185 of the \n2017 TM Rules repeals the 2002 Rules “without prejudice to anything \ndone under such rules before the coming into force of” the 2017 TM \nRules.  New Registrations have, therefore, to be as per the 2017 TM \nRules, and cannot abide by the 2002 TM Rules.  I am informed, \nhowever, that, even as on date, a registrant seeking to register a trade \nmark has to classify the mark as per the 2002 TM Rules.  This appears \nto be erroneous, in view of Rule 185 of the 2017 TM Rules supra.   \n \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified\n\n--- PAGE 11 ---\nNeutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 11 of 11  \n \n   \n \n27. \nThat apart, Section 7(1) of the Trade Marks Act requires the \nRegistrar of Trade Marks to classify goods and services, as far as may \nbe, in accordance with the International classification of goods and \nservices (the NICE Classification) for the purposes of registration of \ntrade marks.  Section 7(2) makes the decision of any question as to the \nclass within which any goods or services falls, by the Registrar, final.  \nSection 8(1) requires the Registrar to publish, in the prescribed \nmanner, an alphabetical list of classification of goods and services for \nthe purpose of registration of trade marks.  These provisions, \ntherefore, require the Registrar to classify the goods or services, for \nthe purpose of registration, in accordance with the NICE \nclassification, only as far as may be.  Rule 20(1) of the 2017 TM \nRules, however, departs, somewhat, from Section 7(1) of the TM Act, \nas it makes classification of goods and services, for the purpose of \nregistration of trade marks, to be mandatorily “as per current edition \nof „the international Classification of goods and services (NICE \nclassification)‟ published by the WIPO.  Thus, where Section 7(1) \nmakes the NICE classification applicable for classification of goods \nand services under the TM Act only as far as may be, Rule 20(1) \nmakes it mandatory for the classification of goods and services to \nabide by the NICE classification.  There is, therefore, an apparent \ndiscrepancy between Section 7(1) of the TM Act and Rule 20(1) of the \nTM Rules.  This may need statutory correction. \n \n28. \nThe Registrar of Trade Marks is requested to examine this \naspect. \n \n \nC.HARI SHANKAR, J \n \nJANUARY 30, 2023/kr \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified\n"
  },
  "total_pages": 11,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "**Case Summary: Raj Kumar v. Sandeep Kumar & Anr. (2023/DHC/000647)**\n\nThis is a trade mark rectification petition (C.O. (COMM.IPD-TM) 39/2021) filed under Section 571 of the Trade Marks Act, 1999 in the High Court of Delhi at New Delhi.\n\n**Parties:**\n\n* **Plaintiff (Petitioner):** Raj Kumar Sharma\n\t+ Represented by: Mr. Nikhil Sonker, Advocate\n* **Defendants:** Sandeep Kumar & Anr.\n\t+ Represented by: Ms. Garima Sachdeva (R-1) and Mr. Harish Vaidyanathan Shankar (CGSC), Advocates.\n\n**Case Facts:**\n\n* The petitioner seeks rectification of the Trade Marks Register to remove registration number 4842932 in favor of Respondent 1, which registered the word mark \"PIZZA GALLERIA\" under Class 30 on July 5, 2021.\n* The dispute centers around use of the \"PIZZA GALLERIA\" mark in Rewari, India.\n\n**Proceedings:**\n\n* A single bench of Hon'ble Mr. Justice C.Hari Shankar heard the case on January 30, 2023.\n* The petitioner contests Respondent 1's right to use the \"PIZZA GALLERIA\" mark in Rewari but has no objections to its use elsewhere.\n\n**Decision:**\n\nNot mentioned in this summary snippet (pages 1-2 of the original PDF). \n\nSource: [40. Raj Kumar v. Sandeep Kumar & Anr..pdf](not directly accessible online, assuming a court document linked to Delhi High Court case no. C.O. (COMM.IPD-TM) 39/2021)",
      "pdf_source": "40. Raj Kumar v. Sandeep Kumar & Anr..pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "Here's a summary of Page 1 from the PDF:\n\n**Case Details**\n\n* Case file: C.O (COMM.IPD-TM) 39/2021\n* Neutral Citation Number: 2023/DHC/000647\n* Court: High Court of Delhi at New Delhi\n\n**Parties Involved**\n\n* Petitioner (Plaintiff): Raj Kumar Sharma\n\t+ Represented by: Mr. Nikhil Sonker, Adv.\n* Respondents (Defendants):\n\t1. Sandeep Kumar\n\t2. Anr. ( unnamed)\n\n**Proceedings**\n\n* The petitioner has filed a petition under Section 571 of the Trade Marks Act, 1999 for rectification of the Register of Trade Marks.\n* The aim is to remove Registration No. 4842932 dated 5th July 2021, regarding the word mark \"PIZZA GALLERIA\".\n\n**Related Statutes**\n\n* Section 571: Power to cancel or vary registration and to rectify the register\n* Section 7: Publication of alphabetical index\n* Section 82: Classification of goods and services\n\nSource: PDF file titled \"40. Raj Kumar v. Sandeep Kumar & Anr.\".pdf",
          "content": "Neutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 1 of 11  \n \n   \n \n$~6(Original) \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.O. (COMM.IPD-TM) 39/2021 \n \nRAJ KUMAR SHARMA \n \n \n \n..... Plaintiff \n \n \n \n \nThrough: \nMr. Nikhil Sonker, Adv. \n \n \n \n \n \nversus \n \n \nSANDEEP KUMAR & ANR.  \n \n      ..... Defendants \nThrough: \nMs. Garima Sachdeva, Adv. for \nR-1.  \nMr. Harish Vaidyanathan Shankar, CGSC \nwith Mr. Srish Kumar Mishra, Mr. Sagar \nMehlawat \nand \nMr.Alexander \nMathai \nPaikaday, Advs. for R-2. \n \nCORAM: \n \nHON'BLE MR. JUSTICE C.HARI SHANKAR \n \n \n \n \nJ U D G M E N T (O R A L) \n% \n \n \n \n \n30.01.2023 \n1. \nThe petitioner, in this petition preferred under Section 571 of the \nTrade Marks Act, 1999, has sought rectification of the Register of \nTrade Marks by removal, therefrom, of Registration No. 4842932 \ndated 5th July 2021, whereby the word mark “PIZZA GALLERIA”, \nwas registered in favour of Respondent 1 under Class 30 of the \nAlphabetical Index of classification of goods published by the \nRegistrar of Trade Marks under Sections 7 and 82 of the Trade Marks \n                                          \n1 57.  \nPower to cancel or vary registration and to rectify the register. –  \n(1)  \nOn application made in the prescribed manner to the High Court or to the Registrar by \nany person aggrieved, the Registrar or the High Court, as the case may be, may make such order as \nit may think fit for cancelling or varying the registration of a trade mark on the ground of any \ncontravention, or failure to observe a condition entered on the register in relation thereto. \n(2)  \nAny person aggrieved by the absence or omission from the register of any entry, or by \nany entry made in the register without sufficient cause, or by any entry wrongly remaining on the \nregister, or by any error or defect in any entry in the register, may apply in the prescribed manner to \nthe High Court or to the Registrar, and the Registrar or the High Court, as the case may be, may \nmake such order for making, expunging or varying the entry as it may think fit. \n2 7.  \nClassification of goods and services. –  \n(1)  \nThe Registrar shall classify goods and services, as far as may be, in accordance with the \nInternational classification of goods and services for the purposes of registration of trade marks. \n(2)  \nAny question arising as to the class within which any goods or services falls shall be \ndetermined by the Registrar whose decision shall be final. \n8.  \nPublication of alphabetical index. –  \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified",
          "pdf_source": "40. Raj Kumar v. Sandeep Kumar & Anr..pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "**Summary of pages 1-2 from PDF: 40. Raj Kumar v. Sandeep Kumar & Anr..pdf**\n\n**Case Details:** \n- Neutral Citation Number : 2023/DHC/000647\n- C.O. (COMM.IPD-TM) 39/2021\n\n**Legal Facts and Proceedings:**\n- The case involves a dispute over the use of \"PIZZA GALLERIA\" mark in Rewari.\n- Raj Kumar, the petitioner, contests the right of Sandeep Kumar (Respondent 1) to use this mark in Rewari.\n\n**Arguments:**\n\n* Mr. Nikhil Sonker (petitioner's counsel) states that the challenge is restricted to the use of \"PIZZA GALLERIA\" mark in Rewari.\n* Ms. Garima Sachdeva (Respondent 1's counsel) argues that her client is unwilling to surrender the Rewari market.\n\n**Notes on Trade Marks Rules:**\n\n* Rule 20(2)3 refers to the classification of goods and services.\n* Class 30 includes \"flour and preparations made from cereals; bread, pizza, pastry, and confectionery\".\n\n**Reference:** PDF source: 40. Raj Kumar v. Sandeep Kumar & Anr..pdf",
          "content": "Neutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 2 of 11  \n \n   \n \nAct read with Rule 20(2)3 of the Trade Marks Rules, 2017.  Class 30 \ncovers “flour and preparations made from cereals; bread, pizza, pastry \nand confectionery”.   \n \n2. \nMr. Nikhil Sonker, learned Counsel for the petitioner, submitted \nthat the petitioner was contesting the right of Respondent 1 to use the \n“PIZZA GALLERIA” mark in the city of Rewari.  The challenge in \nthis appeal is, therefore, restricted to said use.  The petitioner does not \nbegrudge the respondent the right to use the “PIZZA GALLERIA”  in \nany other part of the country.   \n \n3. \nInterestingly, the petitioner and Respondent 1 are both running \neating outlets under the name “PIZZA GALLERIA”.  The petitioner‟s \noutlets are situated in Rewari, whereas Respondent 1‟s outlets are \nsituated outside Rewari.  In these circumstances, quite frankly, I am \nunable to understand why this Court should even trouble itself with \ndeciding this dispute, as the petitioner has no objection to the \nRespondent 1 using the “PIZZA GALLERIA” mark outside Rewari. \nHowever, Ms. Sachdeva, learned Counsel for Respondent 1 submits \nthat her client is unwilling to surrender the Rewari market.  She also \nsubmits that, on an earlier occasion, this issue had arisen, but that her \nclient was not agreeable to a disclaimer restricting the use, by it, of the \n                                                                                                                   \n(1)  \nThe Registrar may publish in the prescribed manner an alphabetical index of \nclassification of goods and services referred to in Section 7. \n(2)  \nWhere any goods or services are not specified in the alphabetical index of goods and \nservices published under sub-section (1), the classification of goods or services shall be determined \nby the Registrar in accordance with sub-section (2) of Section 7. \n3 20.  \nClassification of goods and service. –  \n(1)  \nClassification of goods and service for the purpose of registration of trade mark, the \ngoods and services shall be classified as per current edition of “the International Classification of \ngoods and services (NICE classification)” published by the World Intellectual Property \nOrganisation (WIPO). \n(2)  \nThe Registrar shall publish a class wise and an alphabetical index of such goods and \nservices, including goods and services of Indian origin. \n \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified",
          "pdf_source": "40. Raj Kumar v. Sandeep Kumar & Anr..pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0007",
      "start_index": 3,
      "end_index": 5,
      "summary": "**Raj Kumar v. Sandeep Kumar & Anr., C.O. (COMM.IPD-TM) 39/2021**\n\nThis legal document is a court ruling issued by the High Court of Delhi in India, case No. 2023/DHC/000647. The background and facts of the case are as follows:\n\n**Parties:** Raj Kumar Sharma (Petitioner) vs. Sandeep Kumar & Anr. (Respondent)\n\n**Dates:**\n\n* 9th June 2021: Memorandum of Understanding (MoU) executed between Petitioner and Respondent 1\n* 25th March 2018: Franchise agreement dated between Petitioner and Respondent 1\n* 31st August 2020: Petitioner applied for registration of the device mark \"PIZZA GALLERIA\"\n* 1st February 2021: Respondent 1 applied for registration of the word mark \"PIZZA GALLERIA\"\n* 5th July 2021: Impugned registration of the word mark \"PIZZA GALLERIA\" in favor of Respondent 1\n* 31.01.2023: Digitally signed by Kamla Rawat, Signature Not Verified\n\n**Facts and Proceedings:**\n\nThe Petitioner applied for registration of a device mark \"PIZZA GALLERIA\" under Class 35 before Respondent 1 did, but the Respondent's application was granted due to a later application date. The Court had to decide on the dispute between the parties.\n\n**Arguments and Contentions:**\n\n* Petitioner argued that there is a likelihood of confusion between the device mark and the word mark \"PIZZA GALLERIA\" due to their similarity.\n* Respondent 1 disputed the Memorandum of Understanding (MoU) executed with the Petitioner and alleged that it was fabricated.\n\n**Decisions:**\n\nThe Court has narrowed",
      "pdf_source": "40. Raj Kumar v. Sandeep Kumar & Anr..pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "Here is a summary of page 3 from the provided PDF:\n\n**PDF Source:** 40. Raj Kumar v. Sandeep Kumar & Anr.pdf\n\n**Key Points:**\n\n* The dispute revolves around the use of the \"PIZZA GALLERIA\" mark by both parties.\n* Petitioner Raj Kumar Sharma claims a Memorandum of Understanding (MoU) was executed on June 9, 2021, allowing him to use the mark in Rewari, while Responedent 1 Sandeep Kumar can use it elsewhere.\n* Respondent 1 disputes the MoU and alleges it is fabricated.\n* A draft franchise agreement dated March 25, 2018, has been placed on record but does not carry any weight due to being unsigned and undated.\n* The court finds that neither the MoU nor the franchise agreement are crucial in deciding the petition.\n* After a lengthy hearing, the matter boils down to a single point related to the registration of the \"PIZZA GALLERIA\" word mark by Respondent 1 on July 5, 2021.\n\n**Important Details:**\n\n* **Dates:** June 9, 2021; March 25, 2018; July 5, 2021\n* **Parties:** Raj Kumar Sharma (Petitioner) and Sandeep Kumar & Anr. (Respondent 1)",
          "content": "Neutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 3 of 11  \n \n   \n \ncontested “PIZZA GALLERIA” mark only to areas outside Rewari.  \nAs such, the Court is constrained to decide the dispute. \n \n4. \nAccording to Mr. Sonker, a Memorandum of Understanding \n(MoU) had been executed between the petitioner and Respondent 1 on \n9th June 2021, in terms of which the petitioner was entitled to use the \n“PIZZA GALLERIA” mark in the city of Rewari, whereas \nRespondent 1 was entitled to use the said mark anywhere else in the \ncountry.  A copy of the MoU has been placed on record.  Respondent \n1, however, disputes the MoU and alleges that it is fabricated.   \n \n5. \nRespondent 1, on the other hand, contends that the petitioner \nwas a franchisee of Respondent 1 and that a franchise agreement dated \n25th March 2018 had been executed between them. She, however \nsubmits that her client has misplaced the original franchise agreement \nand is only in possession of a draft franchise agreement which was \nemailed by Respondent 1 to the petitioner.  The said draft franchise \nagreement has been placed on record.  However, as it is an unsigned \nand undated document, the Court cannot take cognizance thereof. \n \n6. \nIn any event, as the recital hereinafter would reveal, it is not \nnecessary for this Court, in order to decide the present petition, to \nadvert either to the MoU or the franchise agreement.   \n \n7. \nAfter a considerably lengthy hearing, the matter has narrowed \ndown to a short point, on the basis of which this petition can be \ndecided.  The impugned registration dated 5th July 2021, of the \n“PIZZA GALLERIA” word mark in favour of Respondent 1 was \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified",
          "pdf_source": "40. Raj Kumar v. Sandeep Kumar & Anr..pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "Based on page 4 of the PDF \"40. Raj Kumar v. Sandeep Kumar & Anr.pdf\", here is a summary of the key points:\n\n**Case Details**: C.O. (COMM.IPD-TM) 39/2021, Delhi High Court, Case No. 2023/DHC/000647\n\n**Background**: Respondent 1 applied for registration of a word mark \"PIZZA GALLERIA\" on February 1, 2021.\n\n**Facts**: Petitioner had filed an application for registration of a device mark (pictorial representation of a pizza) under Class 35 on August 31, 2020.\n\n**Argument**: Petitioner submitted that the device mark is similar to \"PIZZA GALLERIA\" word mark and may cause confusion among the public. Citing Section 11(1)(4) of the Trade Marks Act, the petitioner argued that there is a likelihood of confusion between the two marks.\n\n**Relevant Statute**: The explanation to Section 11(1)(4) defines an \"earlier trade mark\" as one that has been filed earlier than the mark in question, taking into account priorities claimed.",
          "content": "Neutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 4 of 11  \n \n   \n \ngranted consequent to an application made by Respondent 1 on 1st \nFebruary 2021.  Undisputedly, prior thereto, on 31st August 2020, the \npetitioner had applied for registration of the \n device mark \nunder Class 35 which covers “Retail Shop or Online Retail Shop of \nFood Items, Mobile Retail Food Store Services”. \n \n8. \nThere is, therefore, no dispute about the fact that the application \nfiled by the petitioner for registration of the \n device mark \nunder Class 35 was prior in point of time to the application dated 1st \nFebruary 2021, filed by Respondent 1 for the “PIZZA GALLERIA” \nword mark. \n \n9. \nRelying on Section 11(1)4 of the Trade Marks Act read with \nClause (a) of the Explanation5 to the said section, Mr. Sonker submits \nthat the \n mark is, if not identical, at least, similar to the \n“PIZZA GALLERIA” word mark of Respondent 1, as the pictorial \nrepresentation in the former mark is of a pizza.  He submits that, \ntherefore, there is a likelihood of confusion between the \n \n                                          \n4 11.  \nRelative grounds for refusal of registration. –  \n(1)  \nSave as provided in Section 12, a trade mark shall not be registered if, because of –  \n(a)  \nits identity with an earlier trade mark and similarity of goods or services \ncovered by the trade mark; or \n(b)  \nits similarity to an earlier trade mark and the identity or similarity of the goods \nor services covered by the trade mark, \nthere exists a likelihood of confusion on the part of the public, which includes the likelihood of \nassociation with the earlier trade mark. \n5 Explanation. – For the purposes of this section, earlier trade mark means –  \n(a)  \na registered trade mark or an application under Section 18 bearing an earlier date of filing \nor an international registration referred to in Section 36-E or convention application referred to in \nSection 154 which has a date of application earlier than that of the trade mark in question, taking \naccount, where appropriate, of the priorities claimed in respect of the trade marks; \n(b)  \na trade mark which, on the date of the application for registration of the trade mark in \nquestion, or where appropriate, of the priority claimed in respect of the application, was entitled to \nprotection as a well-known trade mark. \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified",
          "pdf_source": "40. Raj Kumar v. Sandeep Kumar & Anr..pdf",
          "nodes": []
        },
        {
          "title": "Page 5",
          "node_id": "0006",
          "start_index": 5,
          "end_index": 5,
          "summary": "Here is a summary of page 5 from the PDF \"40. Raj Kumar v. Sandeep Kumar & Anr..pdf\":\n\n**Case Details**\n\n* Case No.: C.O. (COMM.IPD-TM) 39/2021\n* Neutral Citation Number: 2023/DHC/000647\n\n**Court Proceedings**\n\n* Applicant submits that Registration of \"PIZZA GALLERIA\" word mark by Respondent is invalid under Section 11(1) of the Trademarks Act.\n* The court finds substance in the applicant's contention and declines to examine other contentions.\n\n**Section 11(1)**\n\n* Clause (a) applies where applied mark is identical to earlier trademark; clause (b) applies where applicant's mark is similar to earlier trademark.\n* Likelihood of public confusion must be shown for later mark to be ineligible for registration.\n\n**Definition**\n\n* \"Earlier trademark\" includes an application filed under Section 186 with an earlier date of filing, as per explanation to Section 11.",
          "content": "Neutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 5 of 11  \n \n   \n \ndevice mark and the “PIZZA GALLERIA” word mark.  In these \ncircumstances, he submits, Respondent 1 could not have been granted \nregistration in respect of the “PIZZA GALLERIA” word mark, as \ngrant of such registration would infract Section 11(1) of the \nTrademarks Act. \n \n10. \nAs there appears to be substance in this contention, it is not \nnecessary to examine any of the other contentions urged at the bar by \nboth sides.  \n \n11. \nClauses (a) and (b) of Section 11(1) envisage independent \ncircumstances in which a trade mark is ineligible for registration.  Of \nthese, where the mark for which registration has been applied is \nidentical to an earlier trademark, Clause (a) would apply, whereas, \nwhere the applicant‟s mark is similar to an earlier trademark, Clause \n(b) would apply.  In either case, likelihood of confusion on the part of \nthe public must be shown to exist, in order for the later mark to be \nineligible for registration.  \n \n12. \nThe expression “earlier trademark” has been defined in the \nExplanation to the Section.  Clause (a) of the explanation includes, \nwithin the meaning of the expression “earlier trademark”, “an \napplication under Section 186 bearing an earlier date of filing”.  As \nsuch, Section 11(1)(b) read with Clause (a) of the explanation to \nSection 11, would prohibit the registration of a trademark where, \nbecause of (i) its similarity with a mark, for which an application, filed \nearlier, was pending, coupled with (ii) identity or similarity of the \n                                          \n6 Section 18 allows a person to apply for registration of a trade mark.   \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified",
          "pdf_source": "40. Raj Kumar v. Sandeep Kumar & Anr..pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0012",
      "start_index": 6,
      "end_index": 9,
      "summary": "**Case Summary: Raj Kumar v. Sandeep Kumar & Anr.**\n\nSource: https://www.hcportal.delhi.nic.in/PDF%20Court/DHC/2023/2023DHC000647.pdf (Page 1-8 of 11)\n\n**Date:** Not specified, but cited as \"2023/DHC/000647\" and a signing date of January 31, 2023.\n\n**Parties:**\n\n* Raj Kumar Sharma (Petitioner)\n* Sandeep Kumar & Anr. (Respondents)\n\n**Facts:**\n\n* The petitioner seeks to register his device mark containing a pictorial depiction of a pizza with the word \"Galleria\" alongside.\n* The respondent has previously registered their word mark \"PIZZA GALLERIA\".\n\n**Legal Arguments:**\n\n* The court considers whether the two marks are similar, which would result in a likelihood of confusion under Section 2(1)(h) of the Trade Marks Act.\n* The petitioner's device mark and the respondent's word mark are considered to be similar, as an average consumer may connect them immediately.\n* The court notes that the \"Galleria\" part of the marks is dominant, and an unwary consumer would likely regard the two establishments as one administration.\n\n**Decisions:**\n\n* The court finds in favor of the petitioner, holding that the respondent's word mark \"PIZZA GALLERIA\" is deceptively similar to the petitioner's device mark.\n* The court cites Section 11(1) of the Trade Marks Act to support its decision, and reference cases Mex Switchgears Pvt. Ltd. v. Omex Cables Industries and Natures Essence Private Limited v. Protogreen Retail Solutions Private Limited.\n\n**Conclusion:**\n\nThe court rules in favor of the petitioner, holding that the respondent's word mark is deceptively similar to their own device mark, and thus liable for infringement.",
      "pdf_source": "40. Raj Kumar v. Sandeep Kumar & Anr..pdf",
      "nodes": [
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "Here is a summary of page 6 from the PDF file \"40. Raj Kumar v. Sandeep Kumar & Anr..pdf\":\n\n**Neutral Citation Number**: 2023/DHC/000647\n**Case Details**: C.O. (COMM.IPD-TM) 39/2021, Raj Kumar Sharma vs. Sandeep Kumar & Anr.\n\n**Court Decision**: The court considers whether the device mark of the petitioner and the \"PIZZA GALLERIA\" word mark of the respondent are similar and could cause a likelihood of confusion among consumers.\n\n**Key Points**:\n\n* The expression \"similar\" is not defined in the Trade Marks Act, but Section 2(1)(h) deems a mark to be deceptively similar if it so nearly resembles another mark as to be likely to deceive or cause confusion.\n* The petitioner's mark contains a pictorial depiction of a pizza with the word \"Galleria\" alongside, while the respondent's mark is \"PIZZA GALLERIA\", where \"Galleria\" is the dominant part.\n\n**Relevance**: This case discusses trade mark similarity and likelihood of confusion, a key aspect of intellectual property law. (PDF source: 40. Raj Kumar v. Sandeep Kumar & Anr..pdf)",
          "content": "Neutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 6 of 11  \n \n   \n \ngoods or services covered by the two marks, there exists a likelihood \nof confusion. \n \n13. \nCan, then, the \n device mark of the petitioner, and the \n“PIZZA GALLERIA” word mark of the respondent, be regarded as \n“similar”, as would result in a likelihood of confusion?   \n \n14. \nAfter some cogitation, I feel the answer has to be in the \naffirmative. \n \n15. \nThe expression “similar” is not defined in the Trade Marks Act.  \nSection 2(1)(h), however, declares, in an admirably circular fashion, \nthat “a mark shall be deemed to be deceptively similar to another mark \nif it so nearly resembles the other mark as to be likely to deceive or \ncause confusion”.   Thus, Section 2(1)(h) embraces, within the broad \nparentheses of “deceptive similarity”, both “confusing” and \n“deceptive” similarity.  Likelihood of deception or confusion, in any \nevent, remains the pervading mantra. \n \n16. \nThe petitioner‟s \n mark contains a pictorial depiction \nof a pizza, with the word “Galleria” alongside it.  A mental connect \nbeween the pizza and “Galleria” is, however, immediately made by an \naverage consumer who sees the mark.  The impugned mark of the \nrespondent is “PIZZA GALLERIA”.  In the mark “PIZZA \nGALLERIA”, there can be no manner of doubt that “Galleria” is the \ndominant part, as “pizza” is publici juris, used by nearly every eatery \nwhich specializes in pizzas.  “Galleria” may be a term more often \nassociated with art; it certainly is not a term of common usage for \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified",
          "pdf_source": "40. Raj Kumar v. Sandeep Kumar & Anr..pdf",
          "nodes": []
        },
        {
          "title": "Page 7",
          "node_id": "0009",
          "start_index": 7,
          "end_index": 7,
          "summary": "The page content from \"Raj Kumar v. Sandeep Kumar & Anr.\" (2023/DHC/000647) is as follows:\n\n**Summary**\n\nOn page 7 of the PDF (source: 40. Raj Kumar v. Sandeep Kumar & Anr.pdf), the court examines the likelihood of confusion between two marks: \"PIZZA GALLERIA\" and a device mark featuring an image of a pizza.\n\nThe court agrees with Mr. Sonker that an unwary consumer would confuse the two establishments, believing them to be one and the same administration. The invoices issued by the petitioner also used the name \"PIZZA GALLERIA\", which further supports this argument.\n\nThe nature of services provided by both parties (restaurant services) is identical, making it more likely that consumers will be deceived. Even though the marks were applied for in different classes, the court notes that Section 11(1) does not depend on class, and the goods/services covered under Classes 30 and 35 are related.\n\nThe court finds an inevitable likelihood of confusion between the two marks.\n\n**Key details**\n\n* PDF source: 40. Raj Kumar v. Sandeep Kumar & Anr.pdf\n* Neutral Citation Number: 2023/DHC/000647",
          "content": "Neutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 7 of 11  \n \n   \n \nrestaurants or eating joints.  An unwary consumer would not, \ntherefore, readily imagine that \n and “PIZZA GALLERIA” \nare two different establishments, run by two different persons.  He is \nmuch more likely to regard the former device mark as a pictorial \nmanifestation of the latter word mark.  Likelihood of confusion, in \npresuming both establishments to belong to one administration is, \ntherefore, in my opinion, inevitable.   \n \n17. \nMr. Sonker has, moreover, pointed out that, in invoices issued \nby the petitioner, the petitioner was actually referred to as “PIZZA \nGALLERIA”.  \n \n18. \nThe nature of services provided by the petitioner and \nRespondent 1 are identical, as both are providing restaurant services.  \nThough the petitioner‟s application, dated 31st August 2020, for \nregistration of the  \n device mark, and the respondent‟s \napplication dated 1st February 2021 for registration of the „PIZZA \nGALLERIA‟ word mark were for different classes, that cannot make \nany difference, as the applicability of Section 11(1) is not dependent \non the class in respect of which the marks are registered, or \nregistration of the marks is sought.  Even otherwise, the nature of \ngoods and services covered by Classes 30 and 35 are allied, the former \nrelating to “flour and preparations made from cereals; bread, pizza, \npastry and confectionery” and the latter to “Retail Shop or Online \nRetail Shop of Food Items, Mobile Retail Food Store Services”.  \nWhere the goods and services to which the competing marks relate are \nallied, the chance of confusion or deception stands enhanced, as held \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified",
          "pdf_source": "40. Raj Kumar v. Sandeep Kumar & Anr..pdf",
          "nodes": []
        },
        {
          "title": "Page 8",
          "node_id": "0010",
          "start_index": 8,
          "end_index": 8,
          "summary": "Here is a summary of page 8 from the PDF: \n\n**Case Details:** \n- Neutral Citation Number: 2023/DHC/000647\n- C.O. (COMM.IPD-TM) 39/2021\n\n**Arguments and Decision:**\n\nIn Raj Kumar v. Sandeep Kumar & Anr., (2023/DHC/000647), the counsel for the petitioner, Mr. Sonker, argued that the petitioner's device mark is similar to Respondent 1's word mark (\"PIZZA GALLERIA\") and used in respect of identical goods or services.\n\nThe Court agreed, saying \"There is therefore substance in the contention of Mr. Sonker...\" (para 19).\n\n**Key Dates:**\n\n* August 31, 2020: Petitioner's application for registration of device mark\n* February 1, 2021: Respondent 1's application for registration of 'PIZZA GALLERIA' word mark\n\n**Source:** the PDF \"40. Raj Kumar v. Sandeep Kumar & Anr..pdf\"",
          "content": "Neutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 8 of 11  \n \n   \n \nin  Mex Switchgears Pvt. Ltd. v. Omex Cables Industries7 and \nNatures Essence Private Limited v. Protogreen Retail Solutions \nPrivate Limited8,  \n \n19. \nThere is, therefore, substance in the contention of Mr. Sonker \nthat the petitioner‟s  \n   device mark is similar to the “PIZZA \nGALLERIA” word mark of Respondent 1, and is used in respect of \ngoods or services which are not only similar but identical.  Equally, in \nthese circumstances, the possibility of likelihood of confusion among \npersons who wished to visit the eating outlets cannot be gainsaid.  \n \n20. \nThe petitioner‟s application for registration of \n device \nmark, having been made on 31st August 2020, is prior in point of time \nto the application of Respondent 1 for registration of the „PIZZA \nGALLERIA‟ word mark, which was on 1st February 2021.  As such, \nthe application dated 31st August 2020 of the petitoner itself amounted \nto an “earlier trademark” within the meaning of Section 11(1)(b) of \nthe Trade Marks Act, in view of Clause (a) of the explanation to the \nSection.  \n \n21. \nMs. Sachdeva, learned Counsel for Respondent 1 fairly \nacknowledged that the petitioner‟s application for registration of the \n device mark was indeed prior in point of time to the \napplication dated 1st February 2021 of Respondent 1, consequent on \nwhich the impugned “PIZZA GALLERIA” word mark was registered \n                                          \n7 (2017) 71 PTC 465 (Del) \n8 (2021) 86 PTC 225 (Del) \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified",
          "pdf_source": "40. Raj Kumar v. Sandeep Kumar & Anr..pdf",
          "nodes": []
        },
        {
          "title": "Page 9",
          "node_id": "0011",
          "start_index": 9,
          "end_index": 9,
          "summary": "Here's a summary of page 9 from the PDF \"40. Raj Kumar v. Sandeep Kumar & Anr..pdf\" (Source: Neutral Citation Number : 2023/DHC/000647):\n\n**Argument by Mr. Sonker for the Petitioner**\n\n* Submits that the present petition is centered on the MoU dated June 9, 2021.\n* Argues that Respondent 1's entitlement to register the impugned mark infringes Section 11(1) of the Trademarks Act.\n\n**Court's Observation**\n\n* Notes that while the petition relies heavily on the MoU, the petitioner has also argued in para 13 that their earlier application was for a similar mark, making it not entirely divorced from the pleadings.\n* Considers Section 57(2) of the Trademarks Act to assess whether circumstance (ii), namely \"wrongly remaining on the register\", applies.\n\n**Dates and Figures**\n\n* No specific dates or figures mentioned on page 9.",
          "content": "Neutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 9 of 11  \n \n   \n \nin Respondent 1‟s favour.  However, she submits that the present \npetition is centred entirely on the MoU dated 9th June 2021 executed \nbetween the petitioner and Respondent 1 which, according to her, is \nthe main ground on which the petitioner has questioned the \nentitlement, of Respondent 1, to registration of the impugned mark.  \n \n22. \nIt is correct that the petition is predicated, to a large extent, on \nthe MoU dated 9th June 2020.  However, in para 13 of the grounds of \nchallenge in the present petition, the petitioner has stated that the \npetitioner‟s earlier application was for a mark similar to the impugned \nmark of Respondent 1 and that, therefore, grant of registration to the \nimpugned mark infracted Section 11(1) of the Trademarks Act.  As \nsuch, it cannot be said that the submission of Mr. Sonker is entirely \ndivorced from the pleadings.   \n \n23. \nSection 57(2) of the Trademarks Act permits the making of an \napplication for making, expunging or varying any entry in the Trade \nMarks Register, where the applicant alleges that (i) the entry is made \nwithout sufficient cause or (ii) is wrongly remaining on the register or \n(iii) suffers from any error or defect.  Mr. Sonker submits that \ncircumstance (ii) applies to the present case.  As such, he submits, in \nview of Section 11(1)(b) of the Trade Marks Act, the impugned \nregistration of the word mark “PIZZA GALLERIA” granted to the \npetitioner on 5th July 2021, could not be allowed to remain on the \nregister.  \n \n24. \nAs I have already held that the grant of registration to \nRespondent 1 of the impugned “PIZZA GALLERIA” word mark on \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified",
          "pdf_source": "40. Raj Kumar v. Sandeep Kumar & Anr..pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0015",
      "start_index": 10,
      "end_index": 11,
      "summary": "**Court Decision Summary**\n\nDocument Source: 40. Raj Kumar v. Sandeep Kumar & Anr..pdf (High Court of Delhi)\n\n**Case Details**\n\n* Case No.: C.O. (COMM.IPD-TM) 39/2021\n* Neutral Citation Number: 2023/DHC/000647\n* Date: January 30, 2023\n\n**Parties**\n\n* Plaintiff: Raj Kumar Sharma (represented by Mr. Nikhil Sonker)\n* Defendants: Sandeep Kumar & Anr. (represented by Ms. Garima Sachdeva and Mr. Harish Vaidyanathan Shankar)\n\n**Facts and Decisions**\n\n* The plaintiff challenged the registration of the word mark \"PIZZA GALLERIA\" (Registration No. 4842932) on behalf of the defendant.\n* The Court held that the use of the impugned mark in Rewari city is violative of Section 11(1)(b) of the Trademarks Act, and the registration should be rectified with a disclaimer disallowing its use in Rewari while retaining the right to use elsewhere in India.\n\n**Arguments and Decisions**\n\n* Mr. Sonker argued that the registration was invalid due to non-compliance with Section 11(1)(b).\n* The Court decided in favor of the plaintiff, ordering the rectification of the mark as requested.\n\n**Notes on Statutory Position**\n\n* A discrepancy has been noted regarding the classification of goods and services for trademark registration between Sections 7 and 8 of the Trade Marks Act and Rule 20 of the 2017 TM Rules.\n* The Registrar of Trade Marks is requested to examine this aspect for statutory correction.",
      "pdf_source": "40. Raj Kumar v. Sandeep Kumar & Anr..pdf",
      "nodes": [
        {
          "title": "Page 10",
          "node_id": "0013",
          "start_index": 10,
          "end_index": 10,
          "summary": "Summary of page 10:\n\nSource: 40. Raj Kumar v. Sandeep Kumar & Anr..pdf (Neutral Citation Number: 2023/DHC/000647)\n\nThe court decides to rectify Registration No. 4842932 granted to Respondent 1 for the word mark \"PIZZA GALLERIA\" on July 5, 2021. The court orders to insert a disclaimer disallowing the use of the said mark by the defendant in the city of Rewari while retaining the right to use the mark elsewhere in the country. This decision is based on Section 11(1)(b) of the Trademarks Act.\n\nJudge's observation: \n\nThe judge notes that even though the Trade Marks Rules, 2017 are in force, registrants still have to categorize marks as per the superseded 2002 TM Rules. The judge considers this an \"erroneous\" position.",
          "content": "Neutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 10 of 11  \n \n   \n \n5th July 2021 is violative of Section 11(1)(b) of the Trademarks Act, \nthe said word mark is liable to be removed from the register.  \nHowever, as Mr Sonker has restricted his challenge, in the present \npetition, to the use, by the defendant, of the impugned “PIZZA \nGALLERIA” mark in the city of Rewari, I direct the rectification of \nRegistration No. 4842932 granted to Respondent 1 for the word mark \n“PIZZA GALLERIA” on 5th July 2021 to be rectified by inserting, \ntherein, a disclaimer disallowing the use of the said mark, by the \ndefendant, in the city of Rewari, while retaining the right of the \ndefendant to use the mark elsewhere in the country.   \n \n25. \nThis petition stands disposed of in the aforesaid terms.  \n \nA Postscript \n \n26. \nA somewhat quixotic statutory position has come to my notice \nwhile correcting this judgement.  Earlier, classification of goods and \nservices, for the purposes of registration of trade marks, was contained \nin the Fourth Schedule to the Trade Marks Rules, 2002 (“the 2002 TM \nRules”).  The 2002 TM Rules were, subsequently, superseded by the \nTrade Marks Rules, 2017 (“the 2017 TM Rules”).  Rule 185 of the \n2017 TM Rules repeals the 2002 Rules “without prejudice to anything \ndone under such rules before the coming into force of” the 2017 TM \nRules.  New Registrations have, therefore, to be as per the 2017 TM \nRules, and cannot abide by the 2002 TM Rules.  I am informed, \nhowever, that, even as on date, a registrant seeking to register a trade \nmark has to classify the mark as per the 2002 TM Rules.  This appears \nto be erroneous, in view of Rule 185 of the 2017 TM Rules supra.   \n \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified",
          "pdf_source": "40. Raj Kumar v. Sandeep Kumar & Anr..pdf",
          "nodes": []
        },
        {
          "title": "Page 11",
          "node_id": "0014",
          "start_index": 11,
          "end_index": 11,
          "summary": "Here is a summary of Page 11 from the provided PDF:\n\n**Neutral Citation Number:** 2023/DHC/000647\n**Case Name:** Raj Kumar v. Sandeep Kumar & Anr.\n\nOn January 30, 2023, in a judgment delivered by C. Hari Shankar J, it was observed that there is an apparent discrepancy between Section 7(1) of the Trade Marks Act and Rule 20(1) of the TM Rules regarding classification of goods and services. According to Section 7(1), the Registrar of Trade Marks classifies goods and services \"as far as may be\" in accordance with the International Classification (NICE Classification), whereas Rule 20(1) makes it mandatory to follow the NICE classification.\n\nThe court requested the Registrar of Trade Marks to examine this aspect and suggested a need for statutory correction. \n\n**Source:** 40. Raj Kumar v. Sandeep Kumar & Anr..pdf",
          "content": "Neutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 11 of 11  \n \n   \n \n27. \nThat apart, Section 7(1) of the Trade Marks Act requires the \nRegistrar of Trade Marks to classify goods and services, as far as may \nbe, in accordance with the International classification of goods and \nservices (the NICE Classification) for the purposes of registration of \ntrade marks.  Section 7(2) makes the decision of any question as to the \nclass within which any goods or services falls, by the Registrar, final.  \nSection 8(1) requires the Registrar to publish, in the prescribed \nmanner, an alphabetical list of classification of goods and services for \nthe purpose of registration of trade marks.  These provisions, \ntherefore, require the Registrar to classify the goods or services, for \nthe purpose of registration, in accordance with the NICE \nclassification, only as far as may be.  Rule 20(1) of the 2017 TM \nRules, however, departs, somewhat, from Section 7(1) of the TM Act, \nas it makes classification of goods and services, for the purpose of \nregistration of trade marks, to be mandatorily “as per current edition \nof „the international Classification of goods and services (NICE \nclassification)‟ published by the WIPO.  Thus, where Section 7(1) \nmakes the NICE classification applicable for classification of goods \nand services under the TM Act only as far as may be, Rule 20(1) \nmakes it mandatory for the classification of goods and services to \nabide by the NICE classification.  There is, therefore, an apparent \ndiscrepancy between Section 7(1) of the TM Act and Rule 20(1) of the \nTM Rules.  This may need statutory correction. \n \n28. \nThe Registrar of Trade Marks is requested to examine this \naspect. \n \n \nC.HARI SHANKAR, J \n \nJANUARY 30, 2023/kr \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified",
          "pdf_source": "40. Raj Kumar v. Sandeep Kumar & Anr..pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-16T12:03:39.257497",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}