{
  "doc_name": "43. Twentieth Century Fox Film Corporation v. The Registrar",
  "pdf_source": "43. Twentieth Century Fox Film Corporation v. The Registrar.pdf",
  "metadata": {
    "document_name": "43. Twentieth Century Fox Film Corporation v. The Registrar",
    "source_pdf": "43. Twentieth Century Fox Film Corporation v. The Registrar.pdf",
    "judges": [
      "C.HARI SHANKAR"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "162/2022",
      "162/2022",
      "162/2022",
      "162/2022",
      "162/2022",
      "162/2022",
      "162/2022",
      "162/2022",
      "162/2022",
      "21666/2022",
      "21667/2022"
    ],
    "dhc_numbers": [
      "2023/DHC/001444",
      "2023/DHC/001444",
      "2023/DHC/001444",
      "2023/DHC/001444",
      "2023/DHC/001444",
      "2023/DHC/001444",
      "2023/DHC/001444",
      "2023/DHC/001444"
    ],
    "ia_numbers": [],
    "decision_date": "13 September, 2022",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      "Twentieth Century Fox Film Corporation"
    ],
    "defendants": [
      "The Registrar"
    ],
    "appellants": [
      "Twentieth Century Fox Film Corporation"
    ],
    "respondents": [
      "The Registrar"
    ],
    "plaintiff_advocates": [],
    "defendant_advocates": [
      {
        "advocate_name": "Mr. Harish Vaidyanathan Shankar",
        "advocate_description": "CGSC with Mr. R. M. Tripathi, Govt. Pleader"
      }
    ],
    "appellant_advocates": [
      {
        "advocate_name": "Mr. Prithvi Singh",
        "advocate_description": ""
      }
    ],
    "respondent_advocates": [
      {
        "advocate_name": "Mr. Harish Vaidyanathan Shankar",
        "advocate_description": "CGSC with Mr. R. M. Tripathi, Govt. Pleader"
      }
    ],
    "damages_claimed": null,
    "damages_awarded": null,
    "key_issues": [
      "Here are the main legal issues extracted from the document:",
      "Depictive similarity between trademarks under Section 11(1) of the Trade Marks Act, 1999.",
      "Renewal and abandonment of registered marks under Section 25(3) of the Trade Marks Act, 1999.",
      "Visual and phonetic distinctness of trademarks under Section 17 of the Trade Marks Act, 1999.",
      "Likelihood of confusion between rival marks under Section 11(1) of the Trade Marks Act, 1999.",
      "Requirement to consider trademark as a whole under Section 17 of the Trade Marks Act, 1999.",
      "Distinction between goods and services registered in favour of different parties under Section 11(1) of the Trade Marks Act, 1999.",
      "Admissibility of evidence in trade mark proceedings under Order XLI Rule 27 of the CPC.",
      "Power to pass order exparte or without notice to other party under Section 151 of the CPC."
    ],
    "decision_summary": "Here is a comprehensive summary of the case:\n\n**Background:**\n\nThe appellant, Twentieth Century Fox Film Corporation (TCF), filed an application for registration of a trademark mark in Class 14, consisting of various goods such as jewelry, clocks, keychains, and watches. The office of the Trade Marks Registry issued a First Examination Report (FER) objecting to the registration of the proposed mark under Section 11(1) of the Trade Marks Act, 1999, on the ground that it was deceptively similar to two earlier marks: \n\n registered in favor of Mr. A. Shrivinasan and \n\n registered in favor of Mr. Avathar Varatharajan.\n\n**Legal Issues:**\n\nThe main legal issue in this case is whether the proposed mark is deceptively similar to the cited marks, and hence, should be refused registration under Section 11(1) of the Trade Marks Act, 1999.\n\n**Arguments:**\n\nThe appellant (TCF) contended that:\n\n*   The appellant's mark was phonetically and visually distinct from the cited \n\n    mark.\n*   The overall impression conveyed by the two marks was completely different, and there was no likelihood of confusion.\n*   Section 17 of the Trade Marks Act required the rival marks to be seen as a whole, without vivisecting the marks into their individual components.\n*   The goods in respect of which the cited markwas registered were also different from the goods in respect of which the appellant sought registration of its mark.\n\n**Court Findings:**\n\nThe Senior Examiner rejected the appellant's defense and disallowed registration of the appellant's mark under Section 11(1)1 of the Trade Marks Act on the ground that it was visually and phonetically similar to the cited \n\n mark.\n\n**Decision:**\n\nAggrieved by the decision, TCF appealed to the High Court of Delhi (HCD). The HCD analyzed the similarity between the two marks and held that:\n\n*   While there may be visual similarity between the two marks, there is no evidence to show a likelihood of confusion.\n*   Section 17 of the Trade Marks Act requires consideration of the marks as a whole, rather than analyzing individual components.\n*   The goods in respect of which both marks are used are different, and registration should not be refused solely on this ground.\n\n**Conclusion:**\n\nBased on these findings, the HCD set aside the appeal and restored the appellant's mark for registration.\n\nNote that the judgment was passed orally and is available digitally signed by SUNIL SINGH NEGI on 28th February 2023.",
    "legal_precedents": [
      "AIR 1960 SC 142"
    ],
    "full_text": "\n--- PAGE 1 ---\nNeutral Citation Number : 2023/DHC/001444 \n C.A.(COMM.IPD-TM) 162/2022                                                                                           Page 1 of 8  \n \n   \n$~2 \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.A.(COMM.IPD-TM) 162/2022, I.A. 21666/2022 (Section 151 of \nthe CPC) and I.A. 21667/2022 (Order XLI Rule 27 of the CPC) \n \n \nTWENTIETH CENTURY FOX \nFILM CORPORATION  \n \n \n \n..... Appellant \n \n \n \n \nThrough: \nMr. Prithvi Singh, Adv. \n \n \n \n \n \nversus \n \n \nTHE REGISTRAR \n \n \n \n       \n..... Respondent \nThrough: \nMr. Harish Vaidyanathan Shankar, \nCGSC with Mr. R. M. Tripathi, Govt. Pleader \n \nCORAM: \n \nHON'BLE MR. JUSTICE C.HARI SHANKAR \n \n \n \n \nJUDGMENT (ORAL) \n% \n \n \n \n         27.02.2023 \n \n \n1. \nThis appeal under Section 91 of the Trade Marks Act assails order \ndated 13th September 2022, passed by the Senior Examiner of Trade \nMarks in the office of the Trade Marks Registry, New Delhi, rejecting \nApplication No. 4280126 submitted by the appellant for registration of \nthe \n mark, in Class 14, for ―Alarm clocks; bracelets; busts of \nprecious metal; charms; clocks; earrings; jewellery; jewellery cases of \nprecious metal; jewellery boxes not of precious metal; jewellery chains; \ndecorative key fobs; key chains; key rings; lapel pins; neck chains; \nnecklaces; necktie fasteners; nonmonetary coins; ornamental lapel pins; \npendants; rings; stop watches; tie clips; tie fasteners; tie tacks; wall \nclocks; watch bands; watch cases; watch chains; watch straps; watches; \nwedding bands; wrist watches on proposed to be used basis‖. \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:28.02.2023\n15:39:40\nSignature Not Verified\n\n--- PAGE 2 ---\nNeutral Citation Number : 2023/DHC/001444 \n C.A.(COMM.IPD-TM) 162/2022                                                                                           Page 2 of 8  \n \n   \n2. \nConsequent to submission of the aforesaid application by the \nappellant, the office of the trademark Registry issued First Examination \nReport (FER) dated 25th September 2019, objecting to the registration of \nthe proposed mark under Section 11(1) of the Trade Marks Act, 1999, on \nthe ground that it was deceptively similar to two earlier marks.  The two \nmarks which were cited were (i) \n, registered in favour of Mr. \nA. Shrivinasan and (ii) \n, registered in favour of Mr. Avathar \nVaratharajan. \n \n3. \nOf these two marks, the former mark was not renewed and, \naccordingly, was deemed to be statutorily abandoned under Section 25(3) \nof the Trade Marks Act. \n \n4. \nThe appellant, in its reply dated 19th October 2019 to the FER, \nsubmitted that (i) the appellant’s mark was phonetically and visually \ndistinct from the cited \n mark, (ii) the overall impression \nconveyed by the two marks was completely different and there was, \ntherefore, no likelihood of confusion, (iii) Section 17 of the Trade Marks \nAct required the rival marks to be seen as a whole, without vivisecting \nthe marks into their individual components, (iv)  the goods in respect of \nwhich the cited \n was registered were also different from \nthe goods in respect of which the appellant sought registration of its \nmark. \n \n5. \nMr. Prithvi Singh, learned Counsel for the appellant submits, \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:28.02.2023\n15:39:40\nSignature Not Verified\n\n--- PAGE 3 ---\nNeutral Citation Number : 2023/DHC/001444 \n C.A.(COMM.IPD-TM) 162/2022                                                                                           Page 3 of 8  \n \n   \nmoreover, that the goods in respect of which the registration of the \nappellant’s mark was sought were essentially towards promotion of the \nmovie AVATAR which was released in December 2022. \n \n6. \nThe Senior Examiner, by the impugned order dated 13th September \n2022, rejected the aforesaid defence put up by the appellant and \ndisallowed registration of the appellant’s mark under Section 11(1)1 of \nthe Trade Marks Act on the ground that it was visually and phonetically \nsimilar to the cited \nmark. \n \n7. \nAggrieved thereby, the appellant has approached this Court by \nmeans of the present appeal. \n \n8. \nI have heard Mr. Prithvi Singh, learned Counsel for the appellant \nand Mr. Harish Vaidyanathan Shankar, learned Counsel for the \nrespondent at some length. \n \n9. \nThe only ground on which registration of the \nmark of \nthe appellant has been refused, is that it is deceptively similar to the \n mark registered in favour of Mr. Avathar Varatharajan and \nthat the similarity was likely to result in confusion. \n                                          \n1 11.  \nRelative grounds for refusal of registration. –  \n(1)  \nSave as provided in Section 12, a trade mark shall not be registered if, because of— \n(a)  \nits identity with an earlier trade mark and similarity of goods or services covered by \nthe trade mark; or \n(b)  \nits similarity to an earlier trade mark and the identity or similarity of the goods or \nservices covered by the trade mark, \nthere exists a likelihood of confusion on the part of the public, which includes the likelihood of \nassociation with the earlier trade mark. \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:28.02.2023\n15:39:40\nSignature Not Verified\n\n--- PAGE 4 ---\nNeutral Citation Number : 2023/DHC/001444 \n C.A.(COMM.IPD-TM) 162/2022                                                                                           Page 4 of 8  \n \n   \n \n10. \nIt is clear, from a bare reading of Section 11(1) that mere identity \nor similarity of the mark of which registration is sought, and the earlier \nmark, is not sufficient as a ground to reject the application seeking \nregistration. Section 11(1) has two clauses. Clause (a) envisages a \nsituation in which applicant’s mark is identical to the earlier trademark \nand registration is sought in respect of similar goods and services.  \nClause (b) envisages a situation in which the applicant’s mark is similar \nto an earlier trade mark and the goods and services covered by the two \nmarks are identical or similar.  In either case, a third condition is required \nto be satisfied, which is that, owing to the identity or similarity between \nthe applicant’s mark and the cited mark, and the identity of similarity \nbetween the goods covered under two marks, there exists a likelihood of \nconfusion on the part of the public, which would include a likelihood of \nassociation with the earlier trade mark.  \n \n11. \nIn examining sustainability of the objections raised in the FER, the \nSenior Examiner was required, therefore, to assess whether (i) the \nappellant’s mark was identical or similar to the earlier cited mark \n, (ii) whether the goods and services covered by the two \nmarks were identical or similar and (iii) whether, because of these \nfactors, a likelihood of confusion on the part of the public existed. \n \n12. \nApplying these tests to the case at hand, the position that emerges \nis, as I find, thus: \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:28.02.2023\n15:39:40\nSignature Not Verified\n\n--- PAGE 5 ---\nNeutral Citation Number : 2023/DHC/001444 \n C.A.(COMM.IPD-TM) 162/2022                                                                                           Page 5 of 8  \n \n   \n(i) \nIt cannot be said that the applicant’s \n mark is \nidentical or similar to the cited \n mark.  No doubt, the \ntwo marks are phonetically similar and, perhaps, even identical. \nHowever, mere phonetic similarity is insufficient to render the \nmarks identical or similar within the meaning of Section 11(1).  \nThe identity or similarity has to be such as would result in \nlikelihood of confusion on the part of the public.   \n \n(ii) \nThe cited \n consists of the word ―AVATHAR‖ \nin English and Tamil, with the sketch of the face of a lady \nalongside.  It is the composite mark, as such, which has been \nregistered.  When comparing marks for the purpose of assessing \ninfringement, Section 172 of the Trade Marks Act specifically \nproscribes vivisection of marks into its individual components, and \nholds that where a mark is registered as a whole, exclusivity is \nconferred on the whole mark, and not on individual parts thereof.  \nIt is this very claim to exclusivity in the earlier mark, and the \npossibility of confusion, were the two marks to be simultaneously \nregistered, that forms the foundation of the proscription against \nregistration found in Section 11(1).  The possibility of confusion \n                                          \n2 17.  \nEffect of registration of parts of a mark. –  \n(1)  \nWhen a trade mark consists of several matters, its registration shall confer on the proprietor \nexclusive right to the use of the trade mark taken as a whole. \n(2)  \nNotwithstanding anything contained in sub-section (1), when a trade mark –  \n(a)  \ncontains any part –  \n(i)  \nwhich is not the subject of a separate application by the proprietor for \nregistration as a trade mark; or \n(ii)  \nwhich is not separately registered by the proprietor as a trade mark; or \n(b)  \ncontains any matter which is common to the trade or is otherwise of a non-\ndistinctive character, \nthe registration thereof shall not confer any exclusive right in the matter forming only a part of the \nwhole of the trade mark so registered. \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:28.02.2023\n15:39:40\nSignature Not Verified\n\n--- PAGE 6 ---\nNeutral Citation Number : 2023/DHC/001444 \n C.A.(COMM.IPD-TM) 162/2022                                                                                           Page 6 of 8  \n \n   \nhas, in either case, to be viewed from the perspective of the same \nmythical gentleman of average intelligence and imperfect \nrecollection, first invoked by the Supreme Court in Corn Products \nRefining Co. v. Shangrila Food Products Ltd3.  The impression, \ncreated on the ―mind’s eye‖ of such a gentleman is of the entire \nearlier mark, seen as a whole.  The principle that composite marks \nare to be compared as a whole, unless individual parts thereof are \nregistered separately, is a thread that runs through the Trade Marks \nAct.  One cannot, therefore, extract, from the cited \n \nmark, only the word ―AVATHAR‖ in order to compare it with the \nappellant’s \nmark.  The marks are to be compared as a \nwhole. \n \n(iii) Viewed thus, it is clear that there is no similarity between \nthe \ncited \n \nmark \nand \nthe \nappellant’s \nmark, except the phonetic similarity between the \nwords ―AVATHAR‖ and ―AVATAR‖.  The cited \n \nmark contains the sketch of a lady as well as the word \n―AVATHAR‖ written both in English and Tamil.  These features \nare completely absent in the appellant’s \n mark.  No \nperson of average intelligence and imperfect recollection would, \ntherefore, confuse the cited \nmark with the appellant’s \n mark.  It is extremely unlikely that the average \n                                          \n3 AIR 1960 SC 142 \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:28.02.2023\n15:39:40\nSignature Not Verified\n\n--- PAGE 7 ---\nNeutral Citation Number : 2023/DHC/001444 \n C.A.(COMM.IPD-TM) 162/2022                                                                                           Page 7 of 8  \n \n   \nconsumer would regard \n as merely an avatar4 of \n.  \n \n(iv) \nThe Court is of the opinion that the Senior Examiner erred \nin \nmerely \nemphasising \nthe \nphonetic \nsimilarity \nbetween \n―AVATHAR‖ and ―AVATAR‖, without recognising the fact that \nthe cited \n mark was a composite device mark \ncontaining a sketch, as well as the word AVATHAR written in two \nlanguages, compositely registered, with no registration of its \nindividual parts or elements.  The marks, to reiterate, were required \nto be compared as a whole and, when so compared, they cannot be \ntreated as similar, much less identical. \n \n13. \nIn that view of the matter, it is not necessary for this Court to enter \ninto the exercise of comparing the goods or classes in respect of which \nregistration was sought, as identity or similarity of the marks and identity \nor similarity of the goods are required to be cumulatively satisfied for \neither of clauses (a) and (b) of Section 11(1) to apply, the conjunctive \nlink, in each clause, being ―and‖, not ―or‖. If the competing marks are \nneither identical nor similar, therefore, no occasion arises to compare the \ngoods or services in respect of which the marks are registered, or \nproposed to be registered.   \n \n14. \nMoreover, and at the cost of repetition, in view of the difference \nbetween the two marks, there was no likelihood of confusion, on the part \n                                          \n4 ―Incarnation‖, in vernacular \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:28.02.2023\n15:39:40\nSignature Not Verified\n\n--- PAGE 8 ---\nNeutral Citation Number : 2023/DHC/001444 \n C.A.(COMM.IPD-TM) 162/2022                                                                                           Page 8 of 8  \n \n   \nof the public, between them.  The third requirement of Section 11(1) is \nalso, therefore, not satisfied. \n \n15. \nI am, therefore, of the considered opinion that the Senior Examiner \nhas erred in rejecting the appellant’s application. \n \n16. \nThe impugned order dated 13th September 2022 is, therefore, \nquashed and set aside. \n \n17. \nAs appellant’s mark was never advertised, having been rejected at \nan initial stage, the Registrar is directed to advertise the mark and \nproceed thereafter in accordance with law. \n \n18. \nThe appeal stands allowed in the aforesaid terms.  \n \n19. \nMiscellaneous applications do not survive for consideration and \nstand disposed of. \n \n20. \nLet this order be uploaded on the website of this Court within 24 \nhours. \n \n \nC. HARI SHANKAR, J \nFEBRUARY 27, 2023 \nrb \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:28.02.2023\n15:39:40\nSignature Not Verified\n"
  },
  "total_pages": 8,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "Here is a summary of the document:\n\n**Case Details**\n\n* **Case Name:** Twentieth Century Fox Film Corporation v. The Registrar\n* **Case Number:** C.A.(COMM.IPD-TM) 162/2022, I.A. 21666/2022 and I.A. 21667/2022\n* **Neutral Citation Number:** 2023/DHC/001444\n* **Court:** High Court of Delhi at New Delhi\n\n**Parties**\n\n* **Appellant:** Twentieth Century Fox Film Corporation (represented by Mr. Prithvi Singh)\n* **Respondent:** The Registrar (represented by Mr. Harish Vaidyanathan Shankar and Mr. R.M. Tripathi)\n\n**Background**\n\nThe appellant, Twentieth Century Fox Film Corporation, applied to register a trade mark for various goods such as jewelry, watches, and accessories in Class 14.\n\n**First Examination Report (FER)**\n\n* The FER was issued by the Trade Marks Registry on September 25, 2019, objecting to registration of the proposed mark under Section 11(1) of the Trade Marks Act 1999.\n* The objection was based on alleged deceptively similar marks registered in favor of Mr. A. Shrivinasan and Mr. Avathar Varatharajan.\n\n**Proceedings**\n\n* The appellant submitted a reply to the FER on October 19, 2019, arguing that their mark was phonetically and visually distinct from the cited marks and that there was no likelihood of confusion.\n* The appeal under Section 91 of the Trade Marks Act assailed an order dated September 13, 2022, passed by the Senior Examiner of Trade Marks rejecting the application.\n\n**Judgment**\n\nA judgment (oral) was pronounced on February 27, 2023, but details are not available.",
      "pdf_source": "43. Twentieth Century Fox Film Corporation v. The Registrar.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "**PDF Source:** 43. Twentieth Century Fox Film Corporation v. The Registrar.pdf\n\n**Summary:**\n\nC.A.(COMM.IPD-TM) No.162/2022 was filed by Twentieth Century Fox Film Corporation (Appellant) against The Registrar (Respondent). The Appellant sought to register a trademark for various goods, including jewelry and clocks, under Class 14.\n\n**Key Points:**\n\n* Section 91 of the Trade Marks Act governs this appeal.\n* Order dated September 13, 2022, was passed by Senior Examiner of Trade Marks in the office of the Trade Marks Registry, New Delhi, rejecting Application No. 4280126 for trademark registration.\n* The Appellant is appealing against the rejection order to register its proposed mark for use on various goods in Class 14.\n\n**Proceedings:**\n\n* C.A.(COMM.IPD-TM) No.162/2022 was filed by Twentieth Century Fox Film Corporation (Appellant).\n* I.A.21666/2022 and I.A.21667/2022 were also mentioned, involving amendments to CPC (Code of Civil Procedure).\n\n**Notable Dates:**\n\n* Order dated September 13, 2022: Rejection order passed by Senior Examiner of Trade Marks.\n* February 27, 2023: Judgement was delivered orally by HON'BLE MR. JUSTICE C.HARI SHANKAR.\n\n**Parties:**\n\n* Twentieth Century",
          "content": "Neutral Citation Number : 2023/DHC/001444 \n C.A.(COMM.IPD-TM) 162/2022                                                                                           Page 1 of 8  \n \n   \n$~2 \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.A.(COMM.IPD-TM) 162/2022, I.A. 21666/2022 (Section 151 of \nthe CPC) and I.A. 21667/2022 (Order XLI Rule 27 of the CPC) \n \n \nTWENTIETH CENTURY FOX \nFILM CORPORATION  \n \n \n \n..... Appellant \n \n \n \n \nThrough: \nMr. Prithvi Singh, Adv. \n \n \n \n \n \nversus \n \n \nTHE REGISTRAR \n \n \n \n       \n..... Respondent \nThrough: \nMr. Harish Vaidyanathan Shankar, \nCGSC with Mr. R. M. Tripathi, Govt. Pleader \n \nCORAM: \n \nHON'BLE MR. JUSTICE C.HARI SHANKAR \n \n \n \n \nJUDGMENT (ORAL) \n% \n \n \n \n         27.02.2023 \n \n \n1. \nThis appeal under Section 91 of the Trade Marks Act assails order \ndated 13th September 2022, passed by the Senior Examiner of Trade \nMarks in the office of the Trade Marks Registry, New Delhi, rejecting \nApplication No. 4280126 submitted by the appellant for registration of \nthe \n mark, in Class 14, for ―Alarm clocks; bracelets; busts of \nprecious metal; charms; clocks; earrings; jewellery; jewellery cases of \nprecious metal; jewellery boxes not of precious metal; jewellery chains; \ndecorative key fobs; key chains; key rings; lapel pins; neck chains; \nnecklaces; necktie fasteners; nonmonetary coins; ornamental lapel pins; \npendants; rings; stop watches; tie clips; tie fasteners; tie tacks; wall \nclocks; watch bands; watch cases; watch chains; watch straps; watches; \nwedding bands; wrist watches on proposed to be used basis‖. \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:28.02.2023\n15:39:40\nSignature Not Verified",
          "pdf_source": "43. Twentieth Century Fox Film Corporation v. The Registrar.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "Here is a summary of page 2 from the PDF:\n\n**Document:** Twentieth Century Fox Film Corporation v. The Registrar.pdf (Neutral Citation Number: 2023/DHC/001444)\n\n**Summary:**\n\nAfter the appellant, Twentieth Century Fox Film Corporation, submitted an application for trademark registration, the office of the trademark Registry issued a First Examination Report (FER) dated September 25, 2019, objecting to the registration due to deceptively similar marks.\n\nThe cited marks were:\n\n1. (registered in favor of Mr. A. Shrivinasan)\n2. (registered in favor of Mr. Avathar Varatharajan)\n\nHowever, the former mark was not renewed and was deemed statutorily abandoned under Section 25(3) of the Trade Marks Act.\n\nThe appellant submitted a reply dated October 19, 2019, arguing that its mark is phonetically and visually distinct from the cited marks, with no likelihood of confusion. The appellant also argued that Section 17 of the Trade Marks Act requires considering rival marks as a whole, without dissecting them into individual components.\n\n**Key Dates:** September 25, 2019 (FER), October 19, 2019 (appellant's reply)",
          "content": "Neutral Citation Number : 2023/DHC/001444 \n C.A.(COMM.IPD-TM) 162/2022                                                                                           Page 2 of 8  \n \n   \n2. \nConsequent to submission of the aforesaid application by the \nappellant, the office of the trademark Registry issued First Examination \nReport (FER) dated 25th September 2019, objecting to the registration of \nthe proposed mark under Section 11(1) of the Trade Marks Act, 1999, on \nthe ground that it was deceptively similar to two earlier marks.  The two \nmarks which were cited were (i) \n, registered in favour of Mr. \nA. Shrivinasan and (ii) \n, registered in favour of Mr. Avathar \nVaratharajan. \n \n3. \nOf these two marks, the former mark was not renewed and, \naccordingly, was deemed to be statutorily abandoned under Section 25(3) \nof the Trade Marks Act. \n \n4. \nThe appellant, in its reply dated 19th October 2019 to the FER, \nsubmitted that (i) the appellant’s mark was phonetically and visually \ndistinct from the cited \n mark, (ii) the overall impression \nconveyed by the two marks was completely different and there was, \ntherefore, no likelihood of confusion, (iii) Section 17 of the Trade Marks \nAct required the rival marks to be seen as a whole, without vivisecting \nthe marks into their individual components, (iv)  the goods in respect of \nwhich the cited \n was registered were also different from \nthe goods in respect of which the appellant sought registration of its \nmark. \n \n5. \nMr. Prithvi Singh, learned Counsel for the appellant submits, \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:28.02.2023\n15:39:40\nSignature Not Verified",
          "pdf_source": "43. Twentieth Century Fox Film Corporation v. The Registrar.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0006",
      "start_index": 3,
      "end_index": 4,
      "summary": "**Court Case Summary**\n\n**Case Details:**\n\n* Neutral Citation Number: 2023/DHC/001444\n* C.A.(COMM.IPD-TM) 162/2022 (High Court of Delhi at New Delhi)\n* Parties:\n\t+ Twentieth Century Fox Film Corporation (Appellant)\n\t+ Mr. Avathar Varatharajan and others (Respondents)\n\n**Background:**\n\nThe appeal was filed by Twentieth Century Fox Film Corporation against the rejection of their trademark application for \"Avatar\" by the Senior Examiner under Section 11(1) of the Trade Marks Act.\n\n**Key Facts:**\n\n* The goods in question were promotional materials for the movie AVATAR, released in December 2022.\n* The Senior Examiner rejected the application on grounds that the mark was deceptively similar to an existing trademark.\n\n**Arguments and Decisions:**\n\n* The Appellant argued that the registration of their mark should not be refused as it is not required to prove identity or similarity between the marks alone, but rather a likelihood of confusion among the public.\n* The High Court held that the Senior Examiner must assess three conditions:\n\t1. Whether the marks are identical or similar\n\t2. Whether the goods and services covered by the two marks are identical or similar\n\t3. Whether there is a likelihood of confusion on the part of the public\n* The Court found that only one condition was examined by the Senior Examiner, regarding the similarity between the marks.\n\n**Source:**\n\n43. Twentieth Century Fox Film Corporation v. The Registrar (2023/DHC/001444)",
      "pdf_source": "43. Twentieth Century Fox Film Corporation v. The Registrar.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "**Summary of page 3 of PDF \"43. Twentieth Century Fox Film Corporation v. The Registrar\"](https://example.com/pdf/43.Twentieth.Century.Fox.Film.Corporation.v.The.Registrar.pdf)\n\nThe case is **C.A.(COMM.IPD-TM) 162/2022**, with a Neutral Citation Number of **2023/DHC/001444**. The appellant, Twentieth Century Fox Film Corporation, sought registration for a trade mark related to the movie \"Avatar\", released in December 2022. However, the Senior Examiner rejected their application under Section 11(1) of the Trade Marks Act on grounds of deceptively similarity with an existing trademark.\n\nThe arguments presented by the appellant centered around the fact that their goods were essentially promotional material for the movie and thus distinct from the cited mark. The issue at hand is whether registration of the mark would result in confusion among the public.\n\n**Key dates and parties involved:**\n\n* December 2022: Release of the movie \"Avatar\"\n* September 13, 2022: Senior Examiner's impugned order rejecting the appellant's application\n* February 28, 2023: Hearing by the court\n* Mr. Prithvi Singh (appellant's counsel)\n* Mr. Harish Vaidyanathan Shankar (respondent's counsel)",
          "content": "Neutral Citation Number : 2023/DHC/001444 \n C.A.(COMM.IPD-TM) 162/2022                                                                                           Page 3 of 8  \n \n   \nmoreover, that the goods in respect of which the registration of the \nappellant’s mark was sought were essentially towards promotion of the \nmovie AVATAR which was released in December 2022. \n \n6. \nThe Senior Examiner, by the impugned order dated 13th September \n2022, rejected the aforesaid defence put up by the appellant and \ndisallowed registration of the appellant’s mark under Section 11(1)1 of \nthe Trade Marks Act on the ground that it was visually and phonetically \nsimilar to the cited \nmark. \n \n7. \nAggrieved thereby, the appellant has approached this Court by \nmeans of the present appeal. \n \n8. \nI have heard Mr. Prithvi Singh, learned Counsel for the appellant \nand Mr. Harish Vaidyanathan Shankar, learned Counsel for the \nrespondent at some length. \n \n9. \nThe only ground on which registration of the \nmark of \nthe appellant has been refused, is that it is deceptively similar to the \n mark registered in favour of Mr. Avathar Varatharajan and \nthat the similarity was likely to result in confusion. \n                                          \n1 11.  \nRelative grounds for refusal of registration. –  \n(1)  \nSave as provided in Section 12, a trade mark shall not be registered if, because of— \n(a)  \nits identity with an earlier trade mark and similarity of goods or services covered by \nthe trade mark; or \n(b)  \nits similarity to an earlier trade mark and the identity or similarity of the goods or \nservices covered by the trade mark, \nthere exists a likelihood of confusion on the part of the public, which includes the likelihood of \nassociation with the earlier trade mark. \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:28.02.2023\n15:39:40\nSignature Not Verified",
          "pdf_source": "43. Twentieth Century Fox Film Corporation v. The Registrar.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "Here is a summary of page 4 from the PDF \"43. Twentieth Century Fox Film Corporation v. The Registrar.pdf\":\n\nThe court is examining an application for trademark registration by Twentieth Century Fox Film Corporation (Appellant). In assessing the objection raised in the Registrar's Examination Report (FER), the Senior Examiner must determine:\n\n1. Whether the Appellant's mark is identical or similar to the earlier cited mark.\n2. Whether the goods and services covered by the two marks are identical or similar.\n3. Whether, due to these factors, a likelihood of confusion on the part of the public exists.\n\nThe court applies these tests and concludes that:\n\n* The Appellant's mark is not necessarily \"similar\" to the earlier citied mark (Section 11(1) clause b).\n* To reject the application, a requirement of \"identity or similarity between the goods covered under two marks\" must be met.\n* A likelihood of confusion on the part of the public is required.\n\nSource: pdf file \"43. Twentieth Century Fox Film Corporation v. The Registrar.pdf\" ( Neutral Citation Number : 2023/DHC/001444).",
          "content": "Neutral Citation Number : 2023/DHC/001444 \n C.A.(COMM.IPD-TM) 162/2022                                                                                           Page 4 of 8  \n \n   \n \n10. \nIt is clear, from a bare reading of Section 11(1) that mere identity \nor similarity of the mark of which registration is sought, and the earlier \nmark, is not sufficient as a ground to reject the application seeking \nregistration. Section 11(1) has two clauses. Clause (a) envisages a \nsituation in which applicant’s mark is identical to the earlier trademark \nand registration is sought in respect of similar goods and services.  \nClause (b) envisages a situation in which the applicant’s mark is similar \nto an earlier trade mark and the goods and services covered by the two \nmarks are identical or similar.  In either case, a third condition is required \nto be satisfied, which is that, owing to the identity or similarity between \nthe applicant’s mark and the cited mark, and the identity of similarity \nbetween the goods covered under two marks, there exists a likelihood of \nconfusion on the part of the public, which would include a likelihood of \nassociation with the earlier trade mark.  \n \n11. \nIn examining sustainability of the objections raised in the FER, the \nSenior Examiner was required, therefore, to assess whether (i) the \nappellant’s mark was identical or similar to the earlier cited mark \n, (ii) whether the goods and services covered by the two \nmarks were identical or similar and (iii) whether, because of these \nfactors, a likelihood of confusion on the part of the public existed. \n \n12. \nApplying these tests to the case at hand, the position that emerges \nis, as I find, thus: \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:28.02.2023\n15:39:40\nSignature Not Verified",
          "pdf_source": "43. Twentieth Century Fox Film Corporation v. The Registrar.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0009",
      "start_index": 5,
      "end_index": 6,
      "summary": "The document is a High Court of Delhi at New Delhi judgment in the case Twentieth Century Fox Film Corporation v. The Registrar, dated March 8, 2023 (Neutral Citation Number: 2023/DHC/001444).\n\n**Legal Proceeding:** C.A.(COMM.IPD-TM) 162/2022\n\n**Parties:** \n\n* Appellant: Twentieth Century Fox Film Corporation\n* Respondent: The Registrar (not specified)\n\n**Arguments:**\n\nThe respondent applied to register the trademark \"AVATAR\" under Section 11(1) of the Trade Marks Act, but the application was opposed by the appellant. The court examined whether there is similarity between the marks.\n\n**Court's Decision:** \n\n* The court held that mere phonetic similarity between two marks is insufficient for a finding of similarity within the meaning of Section 11(1).\n* It cannot be inferred from Section 172 of the Trade Marks Act that registration of individual components (such as words) grants exclusivity if registered together.\n* The court applied the principle of comparing composite marks as a whole, rather than dissecting them into their individual components.\n\n**Key Findings:**\n\n* No similarity between the cited mark and the appellant's AVATAR except for phonetic similarity between the words AVATHAR and AVATAR.\n* The cited mark includes a sketch of a lady and the word AVATHAR in English and Tamil, while the appellant's mark does not contain these features.\n\n**References:**\n\nCorn Products Refining Co. v. Shangrila Food Products Ltd (Supreme Court judgment)\n\nThe PDF source is \"43. Twentieth Century Fox Film Corporation v. The Registrar.pdf\"",
      "pdf_source": "43. Twentieth Century Fox Film Corporation v. The Registrar.pdf",
      "nodes": [
        {
          "title": "Page 5",
          "node_id": "0007",
          "start_index": 5,
          "end_index": 5,
          "summary": "Here's a summary of page 5 from the PDF:\n\n**Case:** Twentieth Century Fox Film Corporation v. The Registrar\n\n**Court:** High Court of Delhi at New Delhi\n\n**Case Number:** C.A.(COMM.IPD-TM) 162/2022\n\n**Page Number:** 5 of 8 (from PDF: 43. Twentieth Century Fox Film Corporation v. The Registrar.pdf)\n\nThe court discusses the issue of infringement under Section 11(1) of the Trade Marks Act. It is argued that:\n\n* The applicant's mark cannot be said to be identical or similar to the cited mark, solely based on phonetic similarity.\n* Mere phonetic similarity does not establish identity or similarity between marks.\n* The cited mark consists of a composite whole (English and Tamil words with a sketch) which has been registered as such. Section 172 prohibits dissecting marks into individual components for comparison.\n\nThe court is referring to Section 17(1) of the Trade Marks Act, which states that registration confers exclusive right to use the trade mark \"taken as a whole\". \n\n**Note**: The PDF source: Twentieth Century Fox Film Corporation v. The Registrar.pdf",
          "content": "Neutral Citation Number : 2023/DHC/001444 \n C.A.(COMM.IPD-TM) 162/2022                                                                                           Page 5 of 8  \n \n   \n(i) \nIt cannot be said that the applicant’s \n mark is \nidentical or similar to the cited \n mark.  No doubt, the \ntwo marks are phonetically similar and, perhaps, even identical. \nHowever, mere phonetic similarity is insufficient to render the \nmarks identical or similar within the meaning of Section 11(1).  \nThe identity or similarity has to be such as would result in \nlikelihood of confusion on the part of the public.   \n \n(ii) \nThe cited \n consists of the word ―AVATHAR‖ \nin English and Tamil, with the sketch of the face of a lady \nalongside.  It is the composite mark, as such, which has been \nregistered.  When comparing marks for the purpose of assessing \ninfringement, Section 172 of the Trade Marks Act specifically \nproscribes vivisection of marks into its individual components, and \nholds that where a mark is registered as a whole, exclusivity is \nconferred on the whole mark, and not on individual parts thereof.  \nIt is this very claim to exclusivity in the earlier mark, and the \npossibility of confusion, were the two marks to be simultaneously \nregistered, that forms the foundation of the proscription against \nregistration found in Section 11(1).  The possibility of confusion \n                                          \n2 17.  \nEffect of registration of parts of a mark. –  \n(1)  \nWhen a trade mark consists of several matters, its registration shall confer on the proprietor \nexclusive right to the use of the trade mark taken as a whole. \n(2)  \nNotwithstanding anything contained in sub-section (1), when a trade mark –  \n(a)  \ncontains any part –  \n(i)  \nwhich is not the subject of a separate application by the proprietor for \nregistration as a trade mark; or \n(ii)  \nwhich is not separately registered by the proprietor as a trade mark; or \n(b)  \ncontains any matter which is common to the trade or is otherwise of a non-\ndistinctive character, \nthe registration thereof shall not confer any exclusive right in the matter forming only a part of the \nwhole of the trade mark so registered. \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:28.02.2023\n15:39:40\nSignature Not Verified",
          "pdf_source": "43. Twentieth Century Fox Film Corporation v. The Registrar.pdf",
          "nodes": []
        },
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "This summary focuses on legal facts from page 6 of the PDF file \"43. Twentieth Century Fox Film Corporation v. The Registrar.pdf\" ( Neutral Citation Number : 2023/DHC/001444 C.A.(COMM.IPD-TM) 162/2022).\n\nThe Delhi High Court considers the comparison between the appellant's mark (AVATAR) and a cited trademark that contains \"AVATHAR\", with additional features.\n\nKey legal facts:\n\n* Composite marks are compared as a whole unless individual parts are registered separately.\n* Citing Corn Products Refining Co. v. Shangrila Food Products Ltd (AIR 1960 SC 142), the court emphasizes the importance of considering the impression created on the \"mind's eye\" of an average person.\n* The marks are distinct, with no similarity except for phonetic similarity between \"AVATHAR\" and \"AVATAR\".\n* The cited trademark contains additional features (a lady sketch and text in English and Tamil) not present in the appellant's mark.\n\nThe court concludes that it is unlikely for an average person to confuse the cited mark with the appellant's mark.",
          "content": "Neutral Citation Number : 2023/DHC/001444 \n C.A.(COMM.IPD-TM) 162/2022                                                                                           Page 6 of 8  \n \n   \nhas, in either case, to be viewed from the perspective of the same \nmythical gentleman of average intelligence and imperfect \nrecollection, first invoked by the Supreme Court in Corn Products \nRefining Co. v. Shangrila Food Products Ltd3.  The impression, \ncreated on the ―mind’s eye‖ of such a gentleman is of the entire \nearlier mark, seen as a whole.  The principle that composite marks \nare to be compared as a whole, unless individual parts thereof are \nregistered separately, is a thread that runs through the Trade Marks \nAct.  One cannot, therefore, extract, from the cited \n \nmark, only the word ―AVATHAR‖ in order to compare it with the \nappellant’s \nmark.  The marks are to be compared as a \nwhole. \n \n(iii) Viewed thus, it is clear that there is no similarity between \nthe \ncited \n \nmark \nand \nthe \nappellant’s \nmark, except the phonetic similarity between the \nwords ―AVATHAR‖ and ―AVATAR‖.  The cited \n \nmark contains the sketch of a lady as well as the word \n―AVATHAR‖ written both in English and Tamil.  These features \nare completely absent in the appellant’s \n mark.  No \nperson of average intelligence and imperfect recollection would, \ntherefore, confuse the cited \nmark with the appellant’s \n mark.  It is extremely unlikely that the average \n                                          \n3 AIR 1960 SC 142 \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:28.02.2023\n15:39:40\nSignature Not Verified",
          "pdf_source": "43. Twentieth Century Fox Film Corporation v. The Registrar.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0012",
      "start_index": 7,
      "end_index": 8,
      "summary": "Here is a summary of the court decision from the provided PDF:\n\n**Case Details**\n\n* Case No.: C.A.(COMM.IPD-TM) 162/2022\n* Court: High Court of Delhi at New Delhi\n* Date: February 27, 2023\n* Neutral Citation Number: 2023/DHC/001444\n\n**Parties**\n\n* Appellant: Twentieth Century Fox Film Corporation (Fox)\n* Respondent: Not Provided (TH...)\n\n**Background**\n\n* Fox applied to register the trademark \"AVATHAR\" for class 9 and 41 goods/services.\n* The Registrar rejected the application, citing similarity with the registered mark \"AVATAR\".\n\n**Arguments**\n\n* Fox argued that the marks are not similar, as \"AVATHAR\" is a composite device mark with a sketch and two languages, whereas \"AVATAR\" is a single word.\n* Fox contended that the Senior Examiner erred in comparing only the phonetic similarity between the marks.\n\n**Decision**\n\n* The Court held that the Senior Examiner erred in rejecting the application.\n* The Court quashed and set aside the impugned order dated September 13, 2022.\n* The Court directed the Registrar to advertise Fox's mark and proceed with the registration process.\n* Fox's appeal was allowed.\n\n**Ruling**\n\n* The Court found that the marks \"AVATHAR\" and \"AVATAR\" are not similar, and therefore, there is no likelihood of confusion among consumers.\n* There is no mention of any amounts or financial disputes in the decision.",
      "pdf_source": "43. Twentieth Century Fox Film Corporation v. The Registrar.pdf",
      "nodes": [
        {
          "title": "Page 7",
          "node_id": "0010",
          "start_index": 7,
          "end_index": 7,
          "summary": "**Summary of Page 7**\n\nIn the High Court of Delhi at New Delhi case **C.A.(COMM.IPD-TM) 162/2022**, Twentieth Century Fox Film Corporation v. The Registrar (2023/DHC/001444), on page 7, the court deliberates on the similarity between two trademarks:\n\n* \"AVATAR\"\n* \"AVATHAR\"\n\n**Key Points**\n\n* The Senior Examiner erred in emphasizing phonetic similarity without considering the marks as a whole.\n* The marks are composite device marks with a sketch and word(s) written in multiple languages, making them distinct.\n* Identity or similarity of the marks is required for Section 11(1) to apply; since the marks are not similar, there's no need to compare goods or services.\n* No likelihood of confusion exists between the two trademarks.\n\n**PDF Source**: 43. Twentieth Century Fox Film Corporation v. The Registrar.pdf",
          "content": "Neutral Citation Number : 2023/DHC/001444 \n C.A.(COMM.IPD-TM) 162/2022                                                                                           Page 7 of 8  \n \n   \nconsumer would regard \n as merely an avatar4 of \n.  \n \n(iv) \nThe Court is of the opinion that the Senior Examiner erred \nin \nmerely \nemphasising \nthe \nphonetic \nsimilarity \nbetween \n―AVATHAR‖ and ―AVATAR‖, without recognising the fact that \nthe cited \n mark was a composite device mark \ncontaining a sketch, as well as the word AVATHAR written in two \nlanguages, compositely registered, with no registration of its \nindividual parts or elements.  The marks, to reiterate, were required \nto be compared as a whole and, when so compared, they cannot be \ntreated as similar, much less identical. \n \n13. \nIn that view of the matter, it is not necessary for this Court to enter \ninto the exercise of comparing the goods or classes in respect of which \nregistration was sought, as identity or similarity of the marks and identity \nor similarity of the goods are required to be cumulatively satisfied for \neither of clauses (a) and (b) of Section 11(1) to apply, the conjunctive \nlink, in each clause, being ―and‖, not ―or‖. If the competing marks are \nneither identical nor similar, therefore, no occasion arises to compare the \ngoods or services in respect of which the marks are registered, or \nproposed to be registered.   \n \n14. \nMoreover, and at the cost of repetition, in view of the difference \nbetween the two marks, there was no likelihood of confusion, on the part \n                                          \n4 ―Incarnation‖, in vernacular \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:28.02.2023\n15:39:40\nSignature Not Verified",
          "pdf_source": "43. Twentieth Century Fox Film Corporation v. The Registrar.pdf",
          "nodes": []
        },
        {
          "title": "Page 8",
          "node_id": "0011",
          "start_index": 8,
          "end_index": 8,
          "summary": "Here is a summary of page 8 of the PDF file (Source: Twentieth Century Fox Film Corporation v. The Registrar.pdf):\n\n**Case Details**\n\n* Neutral Citation Number: 2023/DHC/001444\n* C.A.(COMM.IPD-TM) 162/2022\n* Appeal Hearing Date: February 27, 2023\n\n**Judgment and Decision**\n\nThe court allowed the appeal, quashing and setting aside the impugned order dated September 13, 2022. The Senior Examiner had erred in rejecting the appellant's application.\n\n* The decision held that the requirements of Section 11(1) were not satisfied, specifically clause (i) which requires a genuine intention to use an unregistered trademark.\n* The court directed the Registrar to advertise the mark and proceed further as per law.\n* The appeal was allowed in terms mentioned above.\n* Miscellaneous applications did not survive for consideration and were disposed of.\n\n**Key Players**\n\n* C. HARI SHANKAR, J - Presiding Judge\n* SUNIL SINGH NEGI - Digitally Signed the order\n\nNote: The focus of this summary is on legal facts, proceedings, arguments, decisions, dates, names, and amounts. It remains under 200 words and mentions the PDF source.",
          "content": "Neutral Citation Number : 2023/DHC/001444 \n C.A.(COMM.IPD-TM) 162/2022                                                                                           Page 8 of 8  \n \n   \nof the public, between them.  The third requirement of Section 11(1) is \nalso, therefore, not satisfied. \n \n15. \nI am, therefore, of the considered opinion that the Senior Examiner \nhas erred in rejecting the appellant’s application. \n \n16. \nThe impugned order dated 13th September 2022 is, therefore, \nquashed and set aside. \n \n17. \nAs appellant’s mark was never advertised, having been rejected at \nan initial stage, the Registrar is directed to advertise the mark and \nproceed thereafter in accordance with law. \n \n18. \nThe appeal stands allowed in the aforesaid terms.  \n \n19. \nMiscellaneous applications do not survive for consideration and \nstand disposed of. \n \n20. \nLet this order be uploaded on the website of this Court within 24 \nhours. \n \n \nC. HARI SHANKAR, J \nFEBRUARY 27, 2023 \nrb \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:28.02.2023\n15:39:40\nSignature Not Verified",
          "pdf_source": "43. Twentieth Century Fox Film Corporation v. The Registrar.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-16T14:39:27.166513",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}