{
  "doc_name": "48. Vinod Kumar v. Intellectual Property Appellate Board & Ors",
  "pdf_source": "48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf",
  "metadata": {
    "document_name": "48. Vinod Kumar v. Intellectual Property Appellate Board & Ors",
    "source_pdf": "48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf",
    "judges": [
      "C.HARI SHANKAR"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "310/2020",
      "310/2020",
      "310/2020",
      "310/2020",
      "310/2020",
      "310/2020"
    ],
    "dhc_numbers": [
      "2022/DHC/005508",
      "2022/DHC/005508",
      "2022/DHC/005508",
      "2022/DHC/005508",
      "2022/DHC/005508",
      "2022/DHC/005508"
    ],
    "ia_numbers": [],
    "decision_date": "30 December, 2020",
    "order_date": null,
    "case_type": "Civil",
    "subject_matter": null,
    "plaintiffs": [],
    "defendants": [],
    "appellants": [],
    "respondents": [],
    "plaintiff_advocates": [],
    "defendant_advocates": [],
    "appellant_advocates": [],
    "respondent_advocates": [],
    "damages_claimed": "5,000",
    "damages_awarded": null,
    "key_issues": [
      "Here are the main legal issues:",
      "Appropriateness of rejecting adjournment request due to perceived misrepresentation by counsel",
      "Legal framework for handling adjournment requests in intellectual property disputes",
      "Procedural propriety of imposing costs and depositing with PM Cares fund as a condition for pursuing appeal",
      "Scope of powers of Intellectual Property Appellate Board in rectification petitions",
      "Respect for constitutional right to legal representation and due process",
      "Misrepresentation, fraud, and deception by counsel before the IPAB",
      "Responsibility of counsel and clients for ensuring accuracy and truthfulness of representations",
      "Power of courts and tribunals to penalize unprofessional or unethical behavior by advocates",
      "Implications of reporting counsel's conduct to Bar Council"
    ],
    "decision_summary": "**Case Summary:**\n\n**Case Details:**\n\n*   Case No.: W.P.(C)-IPD 50/2021 & CM APPL. 7338/2021\n*   Court: High Court of Delhi at New Delhi\n*   Date of Judgment: December 12, 2022\n*   Judge: Hon'ble Mr. Justice C.Hari Shankar\n\n**Background:**\n\nThis writ petition was filed under Article 226 of the Constitution of India to challenge an order dated 30th December 2020 passed by the Intellectual Property Appellate Board (IPAB) in Rectification Petitions ORA/108/2020/TM/DEL and ORA/117/2020/TM/DEL. The petitioners were Respondent 1 before IPAB, and Respondent 2 was the appellant.\n\n**Legal Issues:**\n\nThe legal issues in this case revolved around the dismissal of an adjournment application filed by Respondent 1 before IPAB. The learned IPAB had rejected the adjournment request and dismissed it with costs for alleged false representations made by Counsel Suwarn Rajan Chauhan (Enrollment No.D/667/2000) & Akshay Srivastava (Enrollment No.D/1967/2008).\n\n**Arguments:**\n\nRespondent 2's counsel argued that the adjournment application was dismissed unreasonably and in contravention of the principles of natural justice. They also claimed that Counsel Suwarn Rajan Chauhan & Akshay Srivastava's representations were genuine.\n\nIn contrast, the petitioner's counsel contended that the allegations levelled against them and their failure to attend IPAB hearings on December 29th, 2020.\n\n**Court Findings:**\n\nThe court found that Counsel Suwarn Rajan Chauhan & Akshay Srivastava have not shown any legitimate reason for not attending the hearing on 30th December. The fact also showed that they had made misleading statements before IPAB.\n\nMoreover, the decision of taking action against them to Bar Council of India was seen to be correct as per the court.\n\n**Decision:**\n\nThe Court held that the learned IPAB's order dismissing the adjournment application with costs was sustainable in law. The decision of referring the matter to the Bar Council was also upheld by the court.\n\nCourt orders for costs of Rs.5,000/- to Counsel Suwarn Rajan Chauhan and Akshay Srivastava be paid via a PM Cares fund deposit slip by January 7th, 2021. If not complied with, their names would be reported to Bar Council India",
    "legal_precedents": [
      "India Chandra \nGovind Ji",
      "(2000) 8 SCC 532"
    ],
    "full_text": "\n--- PAGE 1 ---\nNeutral Citation Number :2022/DHC/005508 \nCS(COMM) 310/2020                                                                                               Page 1 of 6 \n \n$~ 20(Original) \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n \n+  \nW.P.(C)-IPD 50/2021 & CM APPL. 7338/2021 \n \nVINOD KUMAR  \n \n \n \n         ..... Petitioner \n \n \n \n \nThrough: \nMr. Prince Arora, Adv. \n \n \n \n \n \nversus \n \nINTELLECTUAL PROPERTY APPELLATE BOARD AND \nORS  \n \n \n \n \n \n    ..... Respondents \nThrough: \nMr. Siddharth Bambha and Ms. \nSucharu Garg, Advs for R 3 \n \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C.HARI SHANKAR \n \n \n \n \nJUDGMENT(O R A L) \n% \n \n \n \n \n12.12.2022 \n \n1. \nThis writ petition, under Article 226 of the Constitution of India, \nassails order dated 30th December 2020 passed by the learned Intellectual \nProperty Appellate Board (the learned IPAB) in Rectification Petitions \nORA/108/2020/TM/DEL and ORA/117/2020/TM/DEL (FK Bearing \nGroup Co. Ltd. v. Vinod Kumar & Anr.) The petitioner was Respondent \n1 before the learned IPAB and Respondent 2 herein was the appellant. \nThe rectification petitions were, therefore, instituted by Respondent 2 \nagainst the petitioner. \n \n2. \nThe impugned order allows the rectifications petitions filed by \nRespondent 2 on merits. \n \n3. \nBefore the learned IPAB, the petitioner had sought an \nadjournment. The adjournment was rejected by the learned IPAB. Para 3 \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n15:36:20\nSignature Not Verified\n\n--- PAGE 2 ---\nNeutral Citation Number :2022/DHC/005508 \nCS(COMM) 310/2020                                                                                               Page 2 of 6 \n \nof the impugned order dated 30th December 2020, which deals with the \nsaid request, reads thus: \n \n“There is no representation on behalf of the Respondent No.1 at this \nand on the last few hearings and the matter today came up for final \nhearing of the on 29th December 2020; there was an adjournment \npetition filed by the Respondent No.1 and one counsel Mr. Abhilash \nGupta (Enrollment No.D/3897/2019) on behalf of Suwarn Rajan \nChauhan \n(Enrollment \nNo.D/667/2000) \n& \nAkshay \nSrivastava \n(Enrollment No.D/1967/2008) represented and informed the counsel's \noffice is closed due to covid-19 and the employees are isolated to their \nresidences and the main arguing counsel is also directed to be in self-\nquarantine \ntill \n01-01-2021; \nthe \nRespondent \nin \nadjournment \npetition/Rectification Applicant filed its counter and annexed the \nFacebook page of the Mr. Akshay Srivastava who is lead counsel in \nthe matter. In the said Facebook page of Mr. Akshay Srivastava the \nstatus is updated has been travelling for a holiday since 24.12.2020 to \nTirupati, Rameswaram, Maduria and the last activity shown on his \nFacebook account is that he was at Marina Beach, Chennai on \n27.12.2020 screen shots of his Facebook profile clearly exhibited the \nsame. In light of the same it is falsely represented before this Board \nthat the main counsel is in quarantine while it has been shown to us \nthrough the Facebook postings that the said Counsel is on a holiday, \nwe have no reason not to believe the said representation by the \nRespondent/Rectification Applicant pointing out through the Facebook \nprintouts. It is a matter of regret that such irresponsible false \nrepresentations are made before this Board. This sought of \nmisrepresentations are unwarranted and does not go well with the bar \nand bench, we may be constrained to report this sought of reckless \nsubmissions to the Bar Council. Since a deliberate wrong irresponsible \nrepresentation has been before us with an intent to secure an \nadjournment in the matter the said Adjournment application is being \ndismissed with costs of Rs.5,000/ -. The same may be deposited with \nPM Cares fund at the earliest not before 07th January 2021 and the \ndeposit slip be filed with this Board failing which we shall report to \nBar Council of India to take appropriate action against the said \ncounsels Suwarn Rajan Chauhan (Enrollment No.D/667/2000) & \nAkshay Srivastava (Enrollment No.D/1967/2008).” \n \n4. \nThe learned IPAB proceeded to pass directions against learned \nCounsel for having, as it thought, made false averments before it with \nrespect to availability of learned Counsel.  It has also awarded costs and \nhas referred the matter to the Bar Council of India in the event of failure \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n15:36:20\nSignature Not Verified\n\n--- PAGE 3 ---\nNeutral Citation Number :2022/DHC/005508 \nCS(COMM) 310/2020                                                                                               Page 3 of 6 \n \nto pay the costs imposed. \n \n5. \nIn the present petition, this Court, vide order dated 23rd February \n2021, directed the learned Counsel who had been appearing in the matter \nbefore the learned IPAB to file individual affidavits, explaining their \nfailure to be present before the learned IPAB on 30th December 2020. \n \n6. \nThree learned Counsel were appearing on behalf of Respondent 1 \nbefore the learned IPAB, namely Abhilash Gupta, Akshay Srivastava and \nSuwarn Rajan Chauhan. As is apparent from para 3 of the impugned \norder, the learned IPAB proceeded on the premise that Akshay Srivastava \nwas the lead Counsel. Save and except a statement to the said effect \nhaving been made by learned Counsel for Respondent 2, there appears to \nbe no justification for the learned IPAB’s presumption that Akshay \nSrivastava was the lead Counsel in the matter. \n \n7. \nBefore this Court, it has been submitted that the arguing Counsel \nbefore the learned IPAB was Suwarn Rajan Chauhan who was indeed \nunder quarantine and expired on 30th April 2021. \n \n8. \nThis Court has also seen some of the earlier orders passed by the \nlearned IPAB in the said proceedings in which it does appear that Suwarn \nRajan Chauhan was principally appearing on behalf of the petitioner. \n \n9. \nIn that view of the matter, this Court is unable to sustain the \nimpugned order, insofar as it refused to adjourn the matter on the premise \nthat Akshay Srivastava was the lead Counsel and that he was at Chennai \non the date when the matter was taken up. \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n15:36:20\nSignature Not Verified\n\n--- PAGE 4 ---\nNeutral Citation Number :2022/DHC/005508 \nCS(COMM) 310/2020                                                                                               Page 4 of 6 \n \n \n10. \nEven otherwise, in my considered opinion, before taking an \nadverse view against the Counsel on the basis of a Facebook post, and \nreferring the matter to the Bar Council of India, the learned IPAB ought, \nat the very least, to have given an opportunity to the Counsel to explain \nthe circumstances. Postings on Facebook cannot be treated as \ndeterminative of the location of a person at a particular point of time, at \nleast by a Court. Even if a Court is to take an adverse view in that regard, \nthe Counsel ought to be given an opportunity to explain the position \nbefore such a view is taken. This Court is of the concerned opinion that \nthe learned IPAB was needlessly strict in imposing costs and referring \nthe matter to the Bar Council of India in such circumstances. \n \n11. \nIn view of the fact that Suwarn Rajan Chauhan was indeed \nquarantined at the relevant time and expired, unfortunately, thereafter, \nthis Court is not entering into any of the other aspects of the matter \nregarding non-absence of Counsel on behalf of the petitioner on 30th \nDecember 2020. \n \n12. \nSo far as the earlier adjournments taken by the petitioner, if any, \nare concerned, the matter stands covered by the following passage from \nthe judgment of the Supreme Court in State Bank of India v. Chandra \nGovind Ji1: \n \n“7. \nIn ascertaining whether a party had reasonable \nopportunity to put forward his case or not, one should not \nordinarily go beyond the date on which adjournment is \nsought for. The earlier adjournment, if any, granted would \ncertainly be for reasonable grounds and that aspect need not \n                                          \n1 (2000) 8 SCC 532 \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n15:36:20\nSignature Not Verified\n\n--- PAGE 5 ---\nNeutral Citation Number :2022/DHC/005508 \nCS(COMM) 310/2020                                                                                               Page 5 of 6 \n \nbe once again examined if on the date on which adjournment \nis sought for the party concerned has a reasonable ground. \nThe mere fact that in the past adjournments had been sought \nfor would not be of any materiality. If the adjournment had \nbeen sought for on flimsy grounds the same would have been \nrejected. Therefore, in our view, the High Court as well as the \nlearned District Judge and the Rent Controller have all \nmissed the essence of the matter.” \n \n13. \nIn view of the aforesaid discussion, the impugned order dated 30th \nDecember 2020 is quashed and set aside. The rectification petitions filed \nby Respondent 2 shall stand restored for re-hearing.  \n \n14. \nInasmuch as the learned IPAB has subsequently been abolished, \nthe rectification petitions would have to be heard by this Court. The \nRegistry is directed to register the rectification petitions under the \nappropriate nomenclature and list them before the Court on 23rd February \n2023 for hearing and disposal. Let the record from the learned IPAB be \nalso requisitioned prior to the said date. \n \n15. \nFor the purpose of registration, the Respondent 2 is directed to \nplace on record a photocopy of the entire record along with an \nappropriate affidavit under Section 65-B of the Evidence Act, 1872. \nRespondent 2 undertakes to provide the registry with the entire record of \nthe rectification petitions filed before the learned IPAB within a period of \nfour weeks. On the said record being provided the rectification petitions \nwould be numbered and registered before this Court and listed before the \nCourt for disposal on 23rd February 2023. \n \n16. \nMr. Siddharth Bamba learned Counsel for Respondent 2 points out \nthat, Respondent 2 was enjoying interim relief vide order dated 10th July \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n15:36:20\nSignature Not Verified\n\n--- PAGE 6 ---\nNeutral Citation Number :2022/DHC/005508 \nCS(COMM) 310/2020                                                                                               Page 6 of 6 \n \n2020 passed by the learned IPAB which was in force till the passing of \nthe impugned order dated 30th December 2020. \n \n17. \nAs the impugned order, which is in favour of Respondent 2, has \nbeen quashed only on the ground of violation of the principles of natural \njustice, Respondent 2 would be entitled to be restored to the position in \nwhich it was at the time of its passing. \n \n18. \nAs such, the order dated 10th July 2020 passed by the learned \nIPAB shall stand restored and remain in operation till this Court decides \nthe two rectification petitions. \n \n19. \nList the rectification petitions, duly registered, for hearing and \ndisposal on 23rd February 2023. \n \n20. \nThis writ petition stands allowed accordingly.  No costs. \n \n \n \nC.HARI SHANKAR, J \n \nDECEMBER 12, 2022/AR \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n15:36:20\nSignature Not Verified\n"
  },
  "total_pages": 6,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "The document is a High Court of Delhi at New Delhi judgment in a writ petition (W.P.(C)-IPD 50/2021) filed by Vinod Kumar against Intellectual Property Appellate Board & Ors.\n\n**Case Details:**\n\n* Case No.: W.P.(C)-IPD 50/2021 & CM APPL. 7338/2021\n* Neutral Citation Number: 2022/DHC/005508\n* Court: High Court of Delhi at New Delhi\n* Date of Judgment: December 12, 2022\n\n**Parties:**\n\n* Petitioner: Vinod Kumar (represented by Mr. Prince Arora, Adv.)\n* Respondents:\n\t+ Intellectual Property Appellate Board and Ors.\n\t+ FK Bearing Group Co. Ltd. (represented by Mr. Siddharth Bambha and Ms. Sucharu Garg, Advs for R 3)\n\n**Proceedings:**\n\n* The writ petition challenges an order dated December 30, 2020, passed by the Intellectual Property Appellate Board (IPAB) in Rectification Petitions ORA/108/2020/TM/DEL and ORA/117/2020/TM/DEL.\n* Vinod Kumar was a respondent before the IPAB and FK Bearing Group Co. Ltd. was the appellant, who filed rectification petitions against him.\n\n**Judgment:**\n\n* The High Court allowed the writ petition and set aside the order of the IPAB dated December 30, 2020.\n* The IPAB had dismissed Vinod Kumar's adjournment application with costs of ₹5,000 due to alleged misrepresentation by his counsels about being in quarantine.\n\n**Source:** 48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf (PDF source)",
      "pdf_source": "48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "Here is a summary of page 1 of the PDF document:\n\n**Case Details**\n\n* Case Title: Vinod Kumar v. Intellectual Property Appellate Board & Ors.\n* Neutral Citation Number: 2022/DHC/005508\n* Court: High Court of Delhi at New Delhi\n* Writ Petition No.: W.P.(C)-IPD 50/2021\n\n**Parties**\n\n* Petitioner: Vinod Kumar (through Mr. Prince Arora, Adv.)\n* Respondents:\n\t+ Intellectual Property Appellate Board (through no one)\n\t+ ORS (represented by Mr. Siddharth Bambha and Ms. Sucharu Garg)\n\n**Proceedings**\n\n* The writ petition assails an order dated December 30, 2020 passed by the learned Intellectual Property Appellate Board.\n* The petitioner was Respondent 1 before the IPAB, while Respondent 2 was the appellant.\n* The rectification petitions filed by Respondent 2 were allowed on merits.\n\n**Source**\n\nPDF: Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf (48th page).",
          "content": "Neutral Citation Number :2022/DHC/005508 \nCS(COMM) 310/2020                                                                                               Page 1 of 6 \n \n$~ 20(Original) \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n \n+  \nW.P.(C)-IPD 50/2021 & CM APPL. 7338/2021 \n \nVINOD KUMAR  \n \n \n \n         ..... Petitioner \n \n \n \n \nThrough: \nMr. Prince Arora, Adv. \n \n \n \n \n \nversus \n \nINTELLECTUAL PROPERTY APPELLATE BOARD AND \nORS  \n \n \n \n \n \n    ..... Respondents \nThrough: \nMr. Siddharth Bambha and Ms. \nSucharu Garg, Advs for R 3 \n \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C.HARI SHANKAR \n \n \n \n \nJUDGMENT(O R A L) \n% \n \n \n \n \n12.12.2022 \n \n1. \nThis writ petition, under Article 226 of the Constitution of India, \nassails order dated 30th December 2020 passed by the learned Intellectual \nProperty Appellate Board (the learned IPAB) in Rectification Petitions \nORA/108/2020/TM/DEL and ORA/117/2020/TM/DEL (FK Bearing \nGroup Co. Ltd. v. Vinod Kumar & Anr.) The petitioner was Respondent \n1 before the learned IPAB and Respondent 2 herein was the appellant. \nThe rectification petitions were, therefore, instituted by Respondent 2 \nagainst the petitioner. \n \n2. \nThe impugned order allows the rectifications petitions filed by \nRespondent 2 on merits. \n \n3. \nBefore the learned IPAB, the petitioner had sought an \nadjournment. The adjournment was rejected by the learned IPAB. Para 3 \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n15:36:20\nSignature Not Verified",
          "pdf_source": "48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "Here is a summary of page 2 from the PDF: \"48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf\"\n\nOn December 30, 2020, the Intellectual Property Appellate Board (IPAB) passed an order dismissing an adjournment application filed by Respondent No.1 with costs of Rs.5,000/-. The IPAB found that the counsel representing Respondent No.1 had falsely represented that he was in self-quarantine due to COVID-19 when in fact he was on a holiday.\n\nThe IPAB noted that the counsels' office was closed due to COVID-19 and employees were isolated at home, but screen shots from Facebook showed that the main counsel, Akshay Srivastava, had been traveling for a holiday since December 24, 2020. The IPAB criticized the irresponsible false representation and warned of reporting it to the Bar Council if costs were not deposited within a specified timeframe.\n\nKey facts:\n\n* Date: December 30, 2020\n* Amount: Rs.5,000/- (costs)\n* Parties: Respondent No.1, Suwarn Rajan Chauhan, Akshay Srivastava\n\nSource: \"48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf\"",
          "content": "Neutral Citation Number :2022/DHC/005508 \nCS(COMM) 310/2020                                                                                               Page 2 of 6 \n \nof the impugned order dated 30th December 2020, which deals with the \nsaid request, reads thus: \n \n“There is no representation on behalf of the Respondent No.1 at this \nand on the last few hearings and the matter today came up for final \nhearing of the on 29th December 2020; there was an adjournment \npetition filed by the Respondent No.1 and one counsel Mr. Abhilash \nGupta (Enrollment No.D/3897/2019) on behalf of Suwarn Rajan \nChauhan \n(Enrollment \nNo.D/667/2000) \n& \nAkshay \nSrivastava \n(Enrollment No.D/1967/2008) represented and informed the counsel's \noffice is closed due to covid-19 and the employees are isolated to their \nresidences and the main arguing counsel is also directed to be in self-\nquarantine \ntill \n01-01-2021; \nthe \nRespondent \nin \nadjournment \npetition/Rectification Applicant filed its counter and annexed the \nFacebook page of the Mr. Akshay Srivastava who is lead counsel in \nthe matter. In the said Facebook page of Mr. Akshay Srivastava the \nstatus is updated has been travelling for a holiday since 24.12.2020 to \nTirupati, Rameswaram, Maduria and the last activity shown on his \nFacebook account is that he was at Marina Beach, Chennai on \n27.12.2020 screen shots of his Facebook profile clearly exhibited the \nsame. In light of the same it is falsely represented before this Board \nthat the main counsel is in quarantine while it has been shown to us \nthrough the Facebook postings that the said Counsel is on a holiday, \nwe have no reason not to believe the said representation by the \nRespondent/Rectification Applicant pointing out through the Facebook \nprintouts. It is a matter of regret that such irresponsible false \nrepresentations are made before this Board. This sought of \nmisrepresentations are unwarranted and does not go well with the bar \nand bench, we may be constrained to report this sought of reckless \nsubmissions to the Bar Council. Since a deliberate wrong irresponsible \nrepresentation has been before us with an intent to secure an \nadjournment in the matter the said Adjournment application is being \ndismissed with costs of Rs.5,000/ -. The same may be deposited with \nPM Cares fund at the earliest not before 07th January 2021 and the \ndeposit slip be filed with this Board failing which we shall report to \nBar Council of India to take appropriate action against the said \ncounsels Suwarn Rajan Chauhan (Enrollment No.D/667/2000) & \nAkshay Srivastava (Enrollment No.D/1967/2008).” \n \n4. \nThe learned IPAB proceeded to pass directions against learned \nCounsel for having, as it thought, made false averments before it with \nrespect to availability of learned Counsel.  It has also awarded costs and \nhas referred the matter to the Bar Council of India in the event of failure \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n15:36:20\nSignature Not Verified",
          "pdf_source": "48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0005",
      "start_index": 3,
      "end_index": 3,
      "summary": "Here is a summary of the provided document section from Vinod Kumar v. Intellectual Property Appellate Board & Ors (2022/DHC/005508 CS(COMM) 310/2020), focusing on legal proceedings, facts, arguments, decisions, parties, dates, and amounts:\n\n**Background and Facts:**\n\nThe Delhi High Court at New Delhi heard a petition by Vinod Kumar against the Intellectual Property Appellate Board (IPAB). The case concerned costs imposed after an adjournment was refused by IPAB.\n\n**Key Parties:**\n\n* Petitioner: Vinod Kumar\n* Respondents:\n\t+ Intellectual Property Appellate Board (IPAB)\n\t+ Other respondents not specified\n\n**Key Dates:**\n\n* 23rd February 2021: High Court directed individual affidavits to be filed explaining the failure to appear before IPAB on 30th December 2020.\n* 30th December 2020: Alleged non-appearance of counsel for Respondent 1 before IPAB.\n* 30th April 2021: Death of Suwarn Rajan Chauhan, who was allegedly under quarantine.\n\n**Court Decision:**\n\nThe High Court did not sustain the impugned order by IPAB that refused to adjourn the matter on the premise that Akshay Srivastava was the lead Counsel and he was at Chennai when the matter was taken up. The decision was influenced by evidence showing Suwarn Rajan Chauhan was mainly appearing for Vinod Kumar.\n\n**Significance:**\n\nThe decision implies that costs imposed after an adjournment was refused may be revisable or could have been avoided depending on circumstances, such as the death of a key counsel.\n\nSource: Vinod Kumar v. Intellectual Property Appellate Board & Ors (2022/DHC/005508 CS(COMM) 310/2020).",
      "pdf_source": "48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "Here's a summary of Page 3 from PDF:\n\n48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf\n\n**Case Details**\n\n* Case Number: W.P.(C)-IPD 50/2021\n* Neutral Citation Number: 2022/DHC/005508\n\n**Proceedings**\n\n* Petitioner Vinod Kumar challenged an order of the Intellectual Property Appellate Board (IPAB).\n* The IPAB assumed that Akshay Srivastava was the lead counsel, which is disputed.\n* Counsel for Respondent 1 submitted that Suwarn Rajan Chauhan was the arguing counsel before IPAB and was under quarantine when the matter was taken up.\n\n**Arguments**\n\n* No justification for IPAB's presumption that Akshay Srivastava was the lead counsel.\n* Suwarn Rajan Chauhan was indeed the principal appearing counsel on behalf of the petitioner.\n\n**Decision**\n\n* The Court is unable to sustain the impugned order, which refused to adjourn the matter based on Akshay Srivastava's non-availability.\n\n**References**\n\n* Order dated 23rd February 2021\n* Earlier orders passed by IPAB",
          "content": "Neutral Citation Number :2022/DHC/005508 \nCS(COMM) 310/2020                                                                                               Page 3 of 6 \n \nto pay the costs imposed. \n \n5. \nIn the present petition, this Court, vide order dated 23rd February \n2021, directed the learned Counsel who had been appearing in the matter \nbefore the learned IPAB to file individual affidavits, explaining their \nfailure to be present before the learned IPAB on 30th December 2020. \n \n6. \nThree learned Counsel were appearing on behalf of Respondent 1 \nbefore the learned IPAB, namely Abhilash Gupta, Akshay Srivastava and \nSuwarn Rajan Chauhan. As is apparent from para 3 of the impugned \norder, the learned IPAB proceeded on the premise that Akshay Srivastava \nwas the lead Counsel. Save and except a statement to the said effect \nhaving been made by learned Counsel for Respondent 2, there appears to \nbe no justification for the learned IPAB’s presumption that Akshay \nSrivastava was the lead Counsel in the matter. \n \n7. \nBefore this Court, it has been submitted that the arguing Counsel \nbefore the learned IPAB was Suwarn Rajan Chauhan who was indeed \nunder quarantine and expired on 30th April 2021. \n \n8. \nThis Court has also seen some of the earlier orders passed by the \nlearned IPAB in the said proceedings in which it does appear that Suwarn \nRajan Chauhan was principally appearing on behalf of the petitioner. \n \n9. \nIn that view of the matter, this Court is unable to sustain the \nimpugned order, insofar as it refused to adjourn the matter on the premise \nthat Akshay Srivastava was the lead Counsel and that he was at Chennai \non the date when the matter was taken up. \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n15:36:20\nSignature Not Verified",
          "pdf_source": "48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0009",
      "start_index": 4,
      "end_index": 6,
      "summary": "**Document:** Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf (48)\n\nThe judgment was delivered by the High Court of Delhi in the matter of CS(COMM) 310/2020.\n\n**Facts and Parties:**\n\n* The petitioner, Vinod Kumar, challenged an order passed by the Intellectual Property Appellate Board (IPAB).\n* Respondent 1 is IPAB, while Respondent 2 is the Registrar of Geographical Indications of India.\n* The dispute relates to a rectification petition filed before the IPAB.\n\n**Legal Proceedings:**\n\n* The matter was listed in WP(C)-IPD 50/2021 and CM APPL. 7338/2021.\n* An order dated December 30, 2020, was challenged by the petitioner.\n\n**Arguments and Decisions:**\n\n* The Court held that IPAB was needlessly strict in imposing costs and referring the matter to the Bar Council of India after a counsel's Facebook post.\n* The court noted that postings on social media cannot be determinative of someone's location at a particular point in time, without an opportunity for explanation.\n* The impugned order dated December 30, 2020, was quashed and set aside.\n* The rectification petitions filed by Respondent 2 stand restored for re-hearing.\n\n**Dates and Amounts:**\n\n* None mentioned\n\n**Judgment:**\n\nThe Court's judgment was delivered on [not specified] in the matter of CS(COMM) 310/2020.",
      "pdf_source": "48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf",
      "nodes": [
        {
          "title": "Page 4",
          "node_id": "0006",
          "start_index": 4,
          "end_index": 4,
          "summary": "Here is a summary of page 4 from the provided PDF (Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf):\n\n**Decisions and Rulings**\n\n* The Court finds that the IPAB acted needlessly strict in imposing costs and referring the matter to the Bar Council of India.\n* Counsel should be given an opportunity to explain their position before adverse views are taken based on social media posts.\n\n**Judgment**\n\n* Suwarn Rajan Chauhan, who was supposed to appear as Counsel, was indeed quarantined at the relevant time and unfortunately passed away afterwards.\n* The Court chooses not to consider the absence of Counsel on December 30, 2020.\n\n**Legal Precedent**\n\n* The decision to not grant earlier adjournments is covered by a Supreme Court judgment (State Bank of India v. Chandra Govind Ji), which states that one should not ordinarily go beyond the date on which an adjournment is sought.\n\n**PDF Source:** Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf ( Neutral Citation Number :2022/DHC/005508 )",
          "content": "Neutral Citation Number :2022/DHC/005508 \nCS(COMM) 310/2020                                                                                               Page 4 of 6 \n \n \n10. \nEven otherwise, in my considered opinion, before taking an \nadverse view against the Counsel on the basis of a Facebook post, and \nreferring the matter to the Bar Council of India, the learned IPAB ought, \nat the very least, to have given an opportunity to the Counsel to explain \nthe circumstances. Postings on Facebook cannot be treated as \ndeterminative of the location of a person at a particular point of time, at \nleast by a Court. Even if a Court is to take an adverse view in that regard, \nthe Counsel ought to be given an opportunity to explain the position \nbefore such a view is taken. This Court is of the concerned opinion that \nthe learned IPAB was needlessly strict in imposing costs and referring \nthe matter to the Bar Council of India in such circumstances. \n \n11. \nIn view of the fact that Suwarn Rajan Chauhan was indeed \nquarantined at the relevant time and expired, unfortunately, thereafter, \nthis Court is not entering into any of the other aspects of the matter \nregarding non-absence of Counsel on behalf of the petitioner on 30th \nDecember 2020. \n \n12. \nSo far as the earlier adjournments taken by the petitioner, if any, \nare concerned, the matter stands covered by the following passage from \nthe judgment of the Supreme Court in State Bank of India v. Chandra \nGovind Ji1: \n \n“7. \nIn ascertaining whether a party had reasonable \nopportunity to put forward his case or not, one should not \nordinarily go beyond the date on which adjournment is \nsought for. The earlier adjournment, if any, granted would \ncertainly be for reasonable grounds and that aspect need not \n                                          \n1 (2000) 8 SCC 532 \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n15:36:20\nSignature Not Verified",
          "pdf_source": "48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf",
          "nodes": []
        },
        {
          "title": "Page 5",
          "node_id": "0007",
          "start_index": 5,
          "end_index": 5,
          "summary": "Here is a summary of page 5 from the PDF document:\n\nThe Delhi High Court sets aside the impugned order dated December 30, 2020, which dismissed rectification petitions filed by Respondent 2 (appellant). The court directs that these petitions be reheard and restored for further consideration.\n\nIn considering whether to grant adjournments, the court emphasizes that the focus should be on determining if a party has reasonable grounds for seeking an adjournment. Past instances of seeking adjournments are not determinative, but rather the specific circumstances of each case. \n\nThe court's decision is as follows:\n\n* The impugned order dated 30th December 2020 is quashed and set aside.\n* The rectification petitions filed by Respondent 2 shall be re-heard before the High Court.\n\nSource: Vinod Kumar v. Intellectual Property Appellate Board & Ors (PDF: 48, page 5)",
          "content": "Neutral Citation Number :2022/DHC/005508 \nCS(COMM) 310/2020                                                                                               Page 5 of 6 \n \nbe once again examined if on the date on which adjournment \nis sought for the party concerned has a reasonable ground. \nThe mere fact that in the past adjournments had been sought \nfor would not be of any materiality. If the adjournment had \nbeen sought for on flimsy grounds the same would have been \nrejected. Therefore, in our view, the High Court as well as the \nlearned District Judge and the Rent Controller have all \nmissed the essence of the matter.” \n \n13. \nIn view of the aforesaid discussion, the impugned order dated 30th \nDecember 2020 is quashed and set aside. The rectification petitions filed \nby Respondent 2 shall stand restored for re-hearing.  \n \n14. \nInasmuch as the learned IPAB has subsequently been abolished, \nthe rectification petitions would have to be heard by this Court. The \nRegistry is directed to register the rectification petitions under the \nappropriate nomenclature and list them before the Court on 23rd February \n2023 for hearing and disposal. Let the record from the learned IPAB be \nalso requisitioned prior to the said date. \n \n15. \nFor the purpose of registration, the Respondent 2 is directed to \nplace on record a photocopy of the entire record along with an \nappropriate affidavit under Section 65-B of the Evidence Act, 1872. \nRespondent 2 undertakes to provide the registry with the entire record of \nthe rectification petitions filed before the learned IPAB within a period of \nfour weeks. On the said record being provided the rectification petitions \nwould be numbered and registered before this Court and listed before the \nCourt for disposal on 23rd February 2023. \n \n16. \nMr. Siddharth Bamba learned Counsel for Respondent 2 points out \nthat, Respondent 2 was enjoying interim relief vide order dated 10th July \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n15:36:20\nSignature Not Verified",
          "pdf_source": "48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf",
          "nodes": []
        },
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "Here is a summary of page 6 from the PDF document \"48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf\":\n\n**Legal Facts and Proceedings:**\n\n* The Court is considering the writ petition (W.P.(C)-IPD 50/2021) filed by Vinod Kumar against the IPAB and others.\n* A previous order dated July 10, 2020 was passed by the learned IPAB, which has been quashed due to a violation of natural justice principles.\n\n**Court's Decision:**\n\n* The Court quashes the impugned order dated December 30, 2020 in favor of Respondent 2.\n* Respondent 2 is restored to its position at the time of passing of the July 10, 2020 order.\n* The July 10, 2020 order is restored and remains in operation till the Court decides on two rectification petitions.\n\n**Court's Orders:**\n\n* List the rectification petitions for hearing and disposal on February 23, 2023.\n* The writ petition is allowed, with no costs ordered.\n\n**Document Source:** PDF file \"48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf\" (Neutral Citation Number: 2022/DHC/005508) obtained from a legal database.",
          "content": "Neutral Citation Number :2022/DHC/005508 \nCS(COMM) 310/2020                                                                                               Page 6 of 6 \n \n2020 passed by the learned IPAB which was in force till the passing of \nthe impugned order dated 30th December 2020. \n \n17. \nAs the impugned order, which is in favour of Respondent 2, has \nbeen quashed only on the ground of violation of the principles of natural \njustice, Respondent 2 would be entitled to be restored to the position in \nwhich it was at the time of its passing. \n \n18. \nAs such, the order dated 10th July 2020 passed by the learned \nIPAB shall stand restored and remain in operation till this Court decides \nthe two rectification petitions. \n \n19. \nList the rectification petitions, duly registered, for hearing and \ndisposal on 23rd February 2023. \n \n20. \nThis writ petition stands allowed accordingly.  No costs. \n \n \n \nC.HARI SHANKAR, J \n \nDECEMBER 12, 2022/AR \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n15:36:20\nSignature Not Verified",
          "pdf_source": "48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0010",
      "start_index": 7,
      "end_index": 6,
      "summary": "Section 'Court Decision' from 48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf - No extractable content",
      "pdf_source": "48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf",
      "nodes": []
    }
  ],
  "created_at": "2025-07-16T15:01:58.267384",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}