{
  "doc_name": "5. Vinod agarwal vs Meera Devi",
  "pdf_source": "5. Vinod agarwal vs Meera Devi.pdf",
  "metadata": {
    "document_name": "5. Vinod agarwal vs Meera Devi",
    "source_pdf": "5. Vinod agarwal vs Meera Devi.pdf",
    "judges": [
      "AMIT BANSAL"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "41/2022",
      "41/2022",
      "41/2022",
      "41/2022",
      "41/2022",
      "41/2022",
      "2106/2022"
    ],
    "dhc_numbers": [
      "2023/DHC/001820",
      "2023/DHC/001820",
      "2023/DHC/001820",
      "2023/DHC/001820",
      "2023/DHC/001820"
    ],
    "ia_numbers": [],
    "decision_date": "10 March, 2023",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      "VINOD AGGARWAL TRADING AS VANEET SALES CORPORATION"
    ],
    "defendants": [
      "MEERA DEVI & ANR."
    ],
    "appellants": [
      "VINOD AGGARWAL TRADING AS VANEET SALES CORPORATION"
    ],
    "respondents": [
      "MEERA DEVI & ANR."
    ],
    "plaintiff_advocates": [
      "Ms. Purva Chugh and Ms. Sonia Sharma"
    ],
    "defendant_advocates": [],
    "appellant_advocates": [
      "Ms. Purva Chugh and Ms. Sonia Sharma"
    ],
    "respondent_advocates": [],
    "damages_claimed": "11,300",
    "damages_awarded": null,
    "key_issues": [
      "Here are the 5-10 key legal issues:",
      "trademark infringement",
      "deceptive similarity between trademarks",
      "copyright infringement of artistic work",
      "opposition to trademark registration and abandonment of application",
      "unfair competition laws",
      "competing business interests and unfair advantage",
      "misuse of registered trademark",
      "passing off claim",
      "breach of undertaking by Raghupati Maurya"
    ],
    "decision_summary": "**Background**\n\nThe case arises out of a trademark dispute between Vinod Aggarwal Trading as Vaneet Sales Corporation (the petitioner) and Meera Devi & Anr. (the respondents). The petitioner, a business engaged in manufacturing and trading tobacco products since 1990, claims to own the trademark \"LAL BIHARI CHAAP\" which is registered in Class 34. The respondent, Mrs. Meera Devi, had filed an application for registration of the trademark \"BAL BIHARI SUPER\" with the Trademark Registry.\n\n**Legal Issues**\n\nThe petitioner filed a civil original trademark rectification petition seeking cancellation/removal of the impugned trademark \"BAL BIHAR SUPER\" (word per se), registered under no.4256368 in Class 34, on grounds of deceptively similar trade marks/trade dress and infringement of the petitioner's prior trademarks.\n\n**Arguments**\n\n1. The petitioner argued that their business has been in existence since 1990, with valid and subsisting trademark registrations for \"LAL BIHARI CHAAP\" in Class 34.\n2. The petitioner claimed that approximately 85% of their turnover comes from the mark \"LAL BIHARI CHAAP\".\n3. They alleged that Mr. Raghupati Maurya, a competitor, was selling tobacco products under deceptively similar trademarks and had applied for registration of his trademark \"LAL BAHAR CHHAAP\".\n4. The petitioner claimed to have suffered financial losses due to the alleged actions of Mr. Raghupati Maurya.\n5. They argued that Mrs. Meera Devi was an associate or a beneficiary of Mr. Raghupati Maurya's actions, and therefore, is also liable.\n\n**Court Findings**\n\n1. The Hon'ble Judge observed that the present petition had been wrongly numbered as an appeal and directed the Registry to re-number it as a civil original trademark rectification petition.\n2. The judge noted that the petitioner has a strong case of trademark infringement against Mr. Raghupati Maurya, including evidence of his use of deceptively similar trademarks, sale of infringing goods, and admission to using the petitioner's trademark/similar marks.\n\n**Decision**\n\nThe Hon'ble Judge allowed the petition, cancelling/registering removal of the impugned trade mark \"BAL BIHAR SUPER\" (word per se) in Class 34 registered under no.4256368 in the name of respondent no.1 due to deceptively similar trademark/trade dress and infringement of the petitioner's prior trademarks.\n\n**Court Ruling:**\n\n\"The court hereby cancels/registering removals of the impugned trade mark 'BAL BIHAR SUPER' (word per se) registered under no.4256368 in Class 34, upon finding deceptively similar trademarks/trade dress and infringement by the petitioner's prior trademarks.\"",
    "legal_precedents": [],
    "full_text": "\n--- PAGE 1 ---\n2023/DHC/001820 \n \nC.A.(COMM.IPD-TM) 41/2022                                                                                       Page 1 of 5 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n \n% \n \n \n \n                 Date of decision: 10th March, 2023 \n \n+  \nC.A.(COMM.IPD-TM) 41/2022 and I.A. 2106/2022 (for stay) \n \nVINOD AGGARWAL TRADING AS VANEET SALES \nCORPORATION  \n \n \n \n \n..... Appellant \nThrough: \nMs. Purva Chugh and Ms. Sonia \nSharma, Advocates. \n \n \n \n \n \nversus \n \n \nMEERA DEVI & ANR.  \n \n \n \n..... Respondents \n \n \n \n \nThrough: \nNone. \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE AMIT BANSAL \n \n \n \n \n \nJUDGMENT \n \nAMIT BANSAL, J. (Oral) \n1. \nThe present petition is a civil original trademark rectification petition \nand has been wrongly numbered as an appeal.  Accordingly, the Registry is \ndirected to re-number the present petition as a civil original trademark \nrectification petition.   \n2. \nThe present petition has been filed seeking cancellation/removal of \nthe impugned trademark ‘BAL BIHAR SUPER’ (word per se), registered \nunder no.4256368 in Class 34 in the name of the respondent no.1, from the \nRegister of Trade Marks. \n3. \nBriefly, the case set up in the petition is that the petitioner is engaged \nin the business of manufacturing and trading all kinds of unmanufactured \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:14.03.2023 15:05:52\nSignature Not Verified\n\n--- PAGE 2 ---\n2023/DHC/001820 \n \nC.A.(COMM.IPD-TM) 41/2022                                                                                       Page 2 of 5 \n \ntobacco/tobacco since the year 1990. The petitioner also has many \nregistrations of the trademark/label ‘LAL BIHARI CHAAP’ in Class 34, \ndetails of which are given in paragraph 5 of the petition. All the aforesaid \ntrademark registrations are valid and subsisting. The petitioner owns the \ncopyright of the artistic work in the ‘LAL BIHARI CHAAP’ labels.  \n4. \nThe petitioner has also filed its sales turnover in respect of its \nproducts from the financial year 1989-90 to 2020- 21. The turnover of the \npetitioner in the year 2007-08 was around Rs.11,300/-, whereas the turnover \nin the financial year 2020-21 was around Rs.1,82,45,136. It is claimed that \napproximately 85% of the turnover is from the mark ‘LAL BIHARI \nCHAAP’.  \n5. \nSometime in September, 2018 the petitioner came across tobacco \nproducts bearing the trade mark ‘LAL BAHAR CHHAAP’, being \nmanufactured by M/s Shriram Maurya Enterprise. On inquiry it came to \nknow that one Mr. Raghupati Maurya was selling the tobacco products \nunder a deceptively similar trademark, packaging/trade dress and has also \napplied for the registration of said trademark/label ‘LAL BAHAR \nCHHAAP’ with the Trademark Registry under application no.3822767 \ndated 3rd May, 2018, on a proposed to be used basis. The petitioner opposed \nthe registration of the aforesaid mark by filing opposition on 16th October, \n2018, which was not contested by Mr. Raghupati Maurya and therefore, \nresulted in the abandonment of his application. \n6. \nThereafter, the petitioner made a complaint through his dealer, Mr. \nSushil Gupta at Uttam Nagar Police Station and the matter was amicably \ncompromised by Mr. Raghupati Maurya due to the intervention of a local \npolice. Mr. Raghupati Maurya admitted to using the trademark similar to the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:14.03.2023 15:05:52\nSignature Not Verified\n\n--- PAGE 3 ---\n2023/DHC/001820 \n \nC.A.(COMM.IPD-TM) 41/2022                                                                                       Page 3 of 5 \n \npetitioner's trademark/label ‘LAL BIHARI CHAAP’ and on 28th September, \n2018 gave an undertaking to not manufacture and/or sell the tobacco \nproducts bearing a similar trade mark/trade dress as that of the petitioner. \nMr. Raghupati Maurya also willingly handed over the infringing goods and \nlabels available at the premises over to the dealer of the petitioner. \n7. \nOn 10th October, 2018, not even two weeks after giving the said \nundertaking, Mr. Raghupati Maurya filed yet another similar trademark \napplication for trademark/label ‘BAL BAHAR CHHAP GOLD’ on a \nproposed to be used basis, which was again opposed by the petitioner and is \npending before the Trade Marks Registry. \n8. \nSometime in April 2021, the petitioner came across the application \nno.4777955 of the respondent no.1, Mrs. Meera Devi, who is the wife of Mr. \nRaghupati Maurya for registration of the trademark ‘BAL BIHARI SUPER’ \n(device) claiming user since 5th August, 2019. The petitioner opposed the \nregistration of the aforesaid trademark by filing opposition on 27th April, \n2021.  \n9. \nThe aforesaid application was associated with the word mark ‘BAL \nBIHARI SUPER’ registered under application no.4256368 dated 5th August, \n2019 in the name of the respondent no.1, on a proposed to be used basis.  \n10. \nAccordingly, the petitioner has filed the present petition.  \nPROCEEDINGS IN THE CASE \n11. \nNotice in the petition was issued on 8th February, 2022.  \n12. \nThe order dated 9th November, 2022 passed by the Joint Registrar \nrecords that the respondent no.1 refused to receive the notice issued and \nhence, the respondent no.1 was deemed to have been served. None appeared \non behalf of the respondent no.1 on 22nd December, 2022 and 27th February, \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:14.03.2023 15:05:52\nSignature Not Verified\n\n--- PAGE 4 ---\n2023/DHC/001820 \n \nC.A.(COMM.IPD-TM) 41/2022                                                                                       Page 4 of 5 \n \n2023 also. Despite granting an opportunity to file reply, the respondent no.1 \nhas failed to rebut the case of the petitioner. It is indicative of the fact that \nthe respondent no.1 has nothing substantial to urge, by way of a response to \nthe averments in the petition. \nANALYSIS AND FINDINGS \n13. \nI have heard the counsel for the petitioner and perused the record of \nthe case.  \n14. \nFrom the facts detailed above, it is evident that Mr. Raghupati Maurya \nand Mrs. Meera Devi (respondent no.1), who are husband and wife, are \ncolluding with each other. Together, both of them have filed four trademark \napplications which are similar to the registered trademarks of the petitioner. \nThree of the aforesaid applications have been filed after acknowledging the \nrights of the petitioner and giving an undertaking to not use the trademark \n‘LAL BIHARI CHAAP’ or other similar marks. In order to get over the said \nundertaking, Mr. Raghupati Maurya started filing applications in the name \nof his wife, the respondent no.1. \n15. \nThe adoption and the use of the impugned mark ‘BAL BIHARI \nSUPER’ by the respondent no.1, which is very similar to the trademark \n‘LAL BIHARI CHAAP’ of the petitioner, is likely to create confusion in the \nmarket. Not only is the trademark of the respondent no.1 similar to the \ntrademark of the plaintiff but the nature of the goods of the petitioner and \nthe respondent no.1 are identical i.e., tobacco related products falling in \nClass 34.  It is clear that the adoption of the said mark by the respondent \nno.1 is with the sole purpose of trading upon the goodwill and reputation of \nthe petitioner. The mark of the respondent no.1 is also likely to deceive \nunwary consumers of their association with the petitioner. Therefore, the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:14.03.2023 15:05:52\nSignature Not Verified\n\n--- PAGE 5 ---\n2023/DHC/001820 \n \nC.A.(COMM.IPD-TM) 41/2022                                                                                       Page 5 of 5 \n \naforesaid registration in favour of the respondent no.1 could not have been \ngranted in terms of Section 11 of the Trade Marks Act, 1999 (hereinafter \n‘the Act’) \n16. \nThe adoption of the trademark ‘BAL BIIHARI SUPER’ by the \nrespondent no.1 is dishonest, as is evident from the acknowledgment of the \npetitioner’s right in the trademark/label ‘LAL BIHARI CHAAP’ by the \nhusband of the respondent no.1 and an undertaking to not use marks similar \nto those of the petitioner. Therefore, the respondent no.1 is not entitled to the \nbenefit of Section 12 of the Act.  \n17. \nThe petitioner is the prior adopter and continuous and exclusive user \nof the said trademark in respect of unmanufactured tobacco/tobacco since \n12th February, 1990. Therefore, the trademark registered in favour of the \nrespondent no.1 is liable to be cancelled in terms of Section 57 of the Act. \n18. \nThe impugned registration under no.4256368 in Class 34 remains on \nthe Register of Trade Marks without sufficient cause.  \n19. \nAccordingly, the present petition is allowed and the trademark \nregistered under application no.4256368 in the name of the respondent no.1 \nin Class 34 is removed from the Register of Trade Marks.   \n20. \nPending application also stands disposed of.    \n21. \nThe Registry is directed to supply a copy of the present order to the \nTrademark Registry, at e-mail - llc-ipo@gov.in for compliance. \n \n \nAMIT BANSAL, J. \nMARCH 10, 2023 \nat \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:14.03.2023 15:05:52\nSignature Not Verified\n"
  },
  "total_pages": 5,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0002",
      "start_index": 1,
      "end_index": 1,
      "summary": "Here is a summary of the legal document within 300 words:\n\n**Case Details**\n\n* Case Number: 2023/DHC/001820\n* Date of Decision: 10th March, 2023\n* Court: High Court of Delhi at New Delhi\n\n**Parties**\n\n* Vinod Aggarwal Trading as Vaneet Sales Corporation (Appellant)\n* Meera Devi & Anr. (Respondents)\n\n**Proceedings**\n\nThe Appellant has filed a civil original trademark rectification petition seeking cancellation/removal of the registered trademark 'BAL BIHAR SUPER' (word per se) under no.4256368 in Class 34 in the name of Respondent No.1.\n\n**Arguments and Decision**\n\nThe Court notes that the present petition was wrongly numbered as an appeal and directs the Registry to re-number it as a civil original trademark rectification petition.\n\nThe Appellant contends that they are engaged in the business of manufacturing and trading unmanufactured tobacco products and that the impugned trademark is deceptively similar to their own trademarks, which is likely to cause confusion among consumers.\n\nThe Court decides to re-number the petition and allows the Appellant to proceed with their rectification plea. However, no further details are provided about the arguments or decisions made by the Court in this context.\n\n**PDF Source**\n\nSource: Vinod Aggarwal vs Meera Devi (2023/DHC/001820) - PDF file \"5. Vinod agarwal vs Meera Devi.pdf\"",
      "pdf_source": "5. Vinod agarwal vs Meera Devi.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "Here is a summary of page 1 from the PDF \"5. Vinod Agarwal vs Meera Devi.pdf\" within the 200-word limit:\n\n**Case Details:**\n\n* Case Number: 2023/DHC/001820\n* C.A.(COMM.IPD-TM) 41/2022 and I.A. 2106/2022 (for stay)\n* Date of Decision: 10th March, 2023\n\n**Parties:**\n\n* Petitioner: Vinod Aggarwal Trading as Vaneet Sales Corporation\n\t+ Advocates: Ms. Purva Chugh and Ms. Sonia Sharma\n* Respondents:\n\t1. Meera Devi\n\t2. Anr (mentioned, but no other details provided)\n\n**Court Proceeding:**\n\n* The Registry is directed to re-number the present petition from an appeal to a civil original trademark rectification petition.\n* Judgment delivered orally by Amit Bansal, J.\n\nNote: This summary focuses on legal facts, proceedings, and parties involved. Let me know if you'd like me to expand on any of these points or clarify any details!",
          "content": "2023/DHC/001820 \n \nC.A.(COMM.IPD-TM) 41/2022                                                                                       Page 1 of 5 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n \n% \n \n \n \n                 Date of decision: 10th March, 2023 \n \n+  \nC.A.(COMM.IPD-TM) 41/2022 and I.A. 2106/2022 (for stay) \n \nVINOD AGGARWAL TRADING AS VANEET SALES \nCORPORATION  \n \n \n \n \n..... Appellant \nThrough: \nMs. Purva Chugh and Ms. Sonia \nSharma, Advocates. \n \n \n \n \n \nversus \n \n \nMEERA DEVI & ANR.  \n \n \n \n..... Respondents \n \n \n \n \nThrough: \nNone. \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE AMIT BANSAL \n \n \n \n \n \nJUDGMENT \n \nAMIT BANSAL, J. (Oral) \n1. \nThe present petition is a civil original trademark rectification petition \nand has been wrongly numbered as an appeal.  Accordingly, the Registry is \ndirected to re-number the present petition as a civil original trademark \nrectification petition.   \n2. \nThe present petition has been filed seeking cancellation/removal of \nthe impugned trademark ‘BAL BIHAR SUPER’ (word per se), registered \nunder no.4256368 in Class 34 in the name of the respondent no.1, from the \nRegister of Trade Marks. \n3. \nBriefly, the case set up in the petition is that the petitioner is engaged \nin the business of manufacturing and trading all kinds of unmanufactured \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:14.03.2023 15:05:52\nSignature Not Verified",
          "pdf_source": "5. Vinod agarwal vs Meera Devi.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Facts and Arguments",
      "node_id": "0006",
      "start_index": 2,
      "end_index": 4,
      "summary": "**Vinod Aggarwal vs Meera Devi (2023/DHC/001820)**\n\n**PDF Source:** 5. Vinod agarwal vs Meera Devi.pdf\n\n**Case Overview:**\n\nThe case involves a trademark dispute between Vinod Aggarwal, trading as Vaneet Sales Corporation, and Meera Devi, wife of Raghupati Maurya, over the use of similar trademarks for tobacco products.\n\n**Facts:**\n\n* Vinod Aggarwal has been using the trademark \"LAL BIHARI CHAAP\" since 1990 and owns various registrations.\n* In September 2018, Aggarwal discovered that Raghupati Maurya was manufacturing tobacco products with a deceptively similar trademark, \"LAL BAHAR CHHAAP.\"\n* Aggarwal opposed the registration of this mark and later filed a complaint against Maurya at the Uttam Nagar Police Station.\n* The matter was compromised, but not before Maurya filed another trademark application for \"BAL BAHAR CHHAP GOLD,\" which is still pending.\n\n**Legal Proceedings:**\n\n* Notice in the petition was issued on February 8, 2022.\n* On November 9, 2022, the Joint Registrar recorded that Meera Devi refused to receive the notice and was deemed served.\n* None appeared for Meera Devi on December 22, 2022, or February 27, 2023.\n\n**Amounts and Dates:**\n\n* Aggarwal's sales turnover increased from Rs. 11,300 in 2007-08 to Rs. 1,82,45,136 in 2020-21.\n* The application for trademark registration of \"BAL BIHARI SUPER\" was filed on August 5, 2019.\n\n**Parties:**\n\n* Vinod Aggarwal, trading as Vaneet Sales Corporation (Appellant)\n* Meera Devi",
      "pdf_source": "5. Vinod agarwal vs Meera Devi.pdf",
      "nodes": [
        {
          "title": "Page 2",
          "node_id": "0003",
          "start_index": 2,
          "end_index": 2,
          "summary": "Here's a summary of page 2 from the PDF:\n\n**Source:** 5. Vinod Agarwal vs Meera Devi.pdf (2023/DHC/001820, C.A.(COMM.IPD-TM) 41/2022)\n\n**Key Points:**\n\n* The petitioner, Vinod Aggarwal, has been in the business of manufacturing and selling tobacco products since 1990.\n* He has multiple trademark registrations for \"LAL BIHARI CHAAP\" in Class 34 and owns the copyright for the artistic work.\n* In 2007-08, his turnover was around Rs.11,300, but by 2020-21, it increased to around Rs.1,82,45,136 (85% of which comes from \"LAL BIHARI CHAAP\").\n* In September 2018, he discovered tobacco products bearing a similar trademark (\"LAL BAHAR CHHAAP\") being manufactured by M/s Shriram Maurya Enterprise.\n* He opposed the registration of this mark and eventually Mr. Raghupati Maurya withdrew his application on May 3, 2018.\n\n**Dates:**\n\n* May 3, 2018 (application for trademark/label \"LAL BAHAR CHHAAP\" was filed)\n* October 16, 2018 (petitioner opposed the registration of this mark)\n\n**Amounts:**\n\n* Rs.11,300 (turnover",
          "content": "2023/DHC/001820 \n \nC.A.(COMM.IPD-TM) 41/2022                                                                                       Page 2 of 5 \n \ntobacco/tobacco since the year 1990. The petitioner also has many \nregistrations of the trademark/label ‘LAL BIHARI CHAAP’ in Class 34, \ndetails of which are given in paragraph 5 of the petition. All the aforesaid \ntrademark registrations are valid and subsisting. The petitioner owns the \ncopyright of the artistic work in the ‘LAL BIHARI CHAAP’ labels.  \n4. \nThe petitioner has also filed its sales turnover in respect of its \nproducts from the financial year 1989-90 to 2020- 21. The turnover of the \npetitioner in the year 2007-08 was around Rs.11,300/-, whereas the turnover \nin the financial year 2020-21 was around Rs.1,82,45,136. It is claimed that \napproximately 85% of the turnover is from the mark ‘LAL BIHARI \nCHAAP’.  \n5. \nSometime in September, 2018 the petitioner came across tobacco \nproducts bearing the trade mark ‘LAL BAHAR CHHAAP’, being \nmanufactured by M/s Shriram Maurya Enterprise. On inquiry it came to \nknow that one Mr. Raghupati Maurya was selling the tobacco products \nunder a deceptively similar trademark, packaging/trade dress and has also \napplied for the registration of said trademark/label ‘LAL BAHAR \nCHHAAP’ with the Trademark Registry under application no.3822767 \ndated 3rd May, 2018, on a proposed to be used basis. The petitioner opposed \nthe registration of the aforesaid mark by filing opposition on 16th October, \n2018, which was not contested by Mr. Raghupati Maurya and therefore, \nresulted in the abandonment of his application. \n6. \nThereafter, the petitioner made a complaint through his dealer, Mr. \nSushil Gupta at Uttam Nagar Police Station and the matter was amicably \ncompromised by Mr. Raghupati Maurya due to the intervention of a local \npolice. Mr. Raghupati Maurya admitted to using the trademark similar to the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:14.03.2023 15:05:52\nSignature Not Verified",
          "pdf_source": "5. Vinod agarwal vs Meera Devi.pdf",
          "nodes": []
        },
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "**Case Details:** Vinod Aggarwal vs Meera Devi (C.A.(COMM.IPD-TM) 41/2022)\n\n**PDF Source:** 5. Vinod agarwal vs Meera Devi.pdf\n\n**Summary:**\n\n* On September 28, 2018, Raghupati Maurya (Respondent's husband) undertook to not manufacture and/or sell tobacco products bearing a similar trademark/trade dress as the Petitioner.\n* Just two weeks later, on October 10, 2018, Raghupati Maurya filed another trademark application for 'BAL BAHAR CHHAP GOLD'.\n* In April 2021, the Petitioner opposed registration of Respondent Meera Devi's trademark 'BAL BIHARI SUPER' (device), claiming user since August 5, 2019.\n* Notice in the petition was issued on February 8, 2022. Respondent refused to receive the notice and was deemed served.\n* The Joint Registrar passed an order dated November 9, 2022, which was recorded for the court's reference.\n\n**Key Players:**\n\n* Vinod Aggarwal (Trading as Vaneet Sales Corporation) - Petitioner\n* Meera Devi - Respondent\n* Raghupati Maurya - Respondent's husband\n\n**Dates and Proceedings:**\n\n* September 28, 2018: Undertaking given by Raghupati Ma",
          "content": "2023/DHC/001820 \n \nC.A.(COMM.IPD-TM) 41/2022                                                                                       Page 3 of 5 \n \npetitioner's trademark/label ‘LAL BIHARI CHAAP’ and on 28th September, \n2018 gave an undertaking to not manufacture and/or sell the tobacco \nproducts bearing a similar trade mark/trade dress as that of the petitioner. \nMr. Raghupati Maurya also willingly handed over the infringing goods and \nlabels available at the premises over to the dealer of the petitioner. \n7. \nOn 10th October, 2018, not even two weeks after giving the said \nundertaking, Mr. Raghupati Maurya filed yet another similar trademark \napplication for trademark/label ‘BAL BAHAR CHHAP GOLD’ on a \nproposed to be used basis, which was again opposed by the petitioner and is \npending before the Trade Marks Registry. \n8. \nSometime in April 2021, the petitioner came across the application \nno.4777955 of the respondent no.1, Mrs. Meera Devi, who is the wife of Mr. \nRaghupati Maurya for registration of the trademark ‘BAL BIHARI SUPER’ \n(device) claiming user since 5th August, 2019. The petitioner opposed the \nregistration of the aforesaid trademark by filing opposition on 27th April, \n2021.  \n9. \nThe aforesaid application was associated with the word mark ‘BAL \nBIHARI SUPER’ registered under application no.4256368 dated 5th August, \n2019 in the name of the respondent no.1, on a proposed to be used basis.  \n10. \nAccordingly, the petitioner has filed the present petition.  \nPROCEEDINGS IN THE CASE \n11. \nNotice in the petition was issued on 8th February, 2022.  \n12. \nThe order dated 9th November, 2022 passed by the Joint Registrar \nrecords that the respondent no.1 refused to receive the notice issued and \nhence, the respondent no.1 was deemed to have been served. None appeared \non behalf of the respondent no.1 on 22nd December, 2022 and 27th February, \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:14.03.2023 15:05:52\nSignature Not Verified",
          "pdf_source": "5. Vinod agarwal vs Meera Devi.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "Here is a summary of page 4 from the provided PDF:\n\n**Case Details**\n\n* Case Number: C.A.(COMM.IPD-TM) 41/2022\n* I.A. Number: 2106/2022 (for stay)\n* Date of Decision: 10th March, 2023\n\n**Summary**\n\nThe respondent no. 1 (Meera Devi) failed to rebut the petitioner's case despite being granted an opportunity to file a reply. The Court observes that Meera Devi has nothing substantial to urge against the averments in the petition.\n\n**Findings**\n\n* Mr. Raghupati Maurya and Mrs. Meera Devi (respondent no. 1) are colluding with each other.\n* They filed four trademark applications similar to the petitioner's registered trademarks.\n* The adoption of the impugned mark \"BAL BIHARI SUPER\" by respondent no. 1 is likely to create confusion in the market and deceive unwary consumers into associating it with the petitioner.\n\n**Source**: 2023/DHC/001820, Vinod Agarwal vs Meera Devi (PDF provided)",
          "content": "2023/DHC/001820 \n \nC.A.(COMM.IPD-TM) 41/2022                                                                                       Page 4 of 5 \n \n2023 also. Despite granting an opportunity to file reply, the respondent no.1 \nhas failed to rebut the case of the petitioner. It is indicative of the fact that \nthe respondent no.1 has nothing substantial to urge, by way of a response to \nthe averments in the petition. \nANALYSIS AND FINDINGS \n13. \nI have heard the counsel for the petitioner and perused the record of \nthe case.  \n14. \nFrom the facts detailed above, it is evident that Mr. Raghupati Maurya \nand Mrs. Meera Devi (respondent no.1), who are husband and wife, are \ncolluding with each other. Together, both of them have filed four trademark \napplications which are similar to the registered trademarks of the petitioner. \nThree of the aforesaid applications have been filed after acknowledging the \nrights of the petitioner and giving an undertaking to not use the trademark \n‘LAL BIHARI CHAAP’ or other similar marks. In order to get over the said \nundertaking, Mr. Raghupati Maurya started filing applications in the name \nof his wife, the respondent no.1. \n15. \nThe adoption and the use of the impugned mark ‘BAL BIHARI \nSUPER’ by the respondent no.1, which is very similar to the trademark \n‘LAL BIHARI CHAAP’ of the petitioner, is likely to create confusion in the \nmarket. Not only is the trademark of the respondent no.1 similar to the \ntrademark of the plaintiff but the nature of the goods of the petitioner and \nthe respondent no.1 are identical i.e., tobacco related products falling in \nClass 34.  It is clear that the adoption of the said mark by the respondent \nno.1 is with the sole purpose of trading upon the goodwill and reputation of \nthe petitioner. The mark of the respondent no.1 is also likely to deceive \nunwary consumers of their association with the petitioner. Therefore, the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:14.03.2023 15:05:52\nSignature Not Verified",
          "pdf_source": "5. Vinod agarwal vs Meera Devi.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Decision and Orders",
      "node_id": "0008",
      "start_index": 5,
      "end_index": 5,
      "summary": "**Case Summary:** Vinod Aggarwal vs Meera Devi (2023/DHC/001820)\n\n**Court:** High Court of Delhi at New Delhi\n\n**Decision Date:** March 10, 2023\n\n**Case Number:** C.A.(COMM.IPD-TM) 41/2022 and I.A. 2106/2022 (for stay)\n\n**Parties:**\n\n* Vinod Aggarwal (Vaneet Sales Corporation) - Appellant\n* Meera Devi - Respondent\n\n**Background:** The case involves trademark disputes over the registration of \"BAL BIIHARI SUPER\" by Meera Devi, which is allegedly similar to Vinod Aggarwal's registered trademark \"LAL BIHARI CHAAP\".\n\n**Facts:**\n\n* Vinod Aggarwal has been using the trademark \"LAL BIHARI CHAAP\" since February 12, 1990.\n* The husband of Meera Devi had acknowledged the petitioner's right to the trademark and undertaken not to use similar marks.\n\n**Arguments:**\n\n* Meera Devi claims she adopted the trademark \"BAL BIIHARI SUPER\" in good faith, but her adoption is considered dishonest by the court.\n* Section 11 of the Trade Marks Act, 1999 prohibits registration if the mark would deceive or cause confusion among consumers. The court finds that Meera Devi's adoption violates this section.\n\n**Decisions:**\n\n* The trademark registered in favor of Meera Devi (application no.4256368) is liable to be canceled under Section 57 of the Act.\n* The petition is allowed, and the trademark is removed from the Register of Trade Marks.\n* Pending application IA No.2106/2022 stands disposed of.\n\n**Outcome:**\n\nThe court finds in favor of Vinod Aggarwal (Vaneet Sales Corporation) and cancels Meera Devi's registered trademark \"BAL BIIHARI",
      "pdf_source": "5. Vinod agarwal vs Meera Devi.pdf",
      "nodes": [
        {
          "title": "Page 5",
          "node_id": "0007",
          "start_index": 5,
          "end_index": 5,
          "summary": "**Source:** Vinod Agarwal vs Meera Devi (2023/DHC/001820), PDF: 5. Vinod agarwal vs Meera Devi.pdf\n\n**Summary:**\n\n* Vinod Aggarwal, trading as Vaneet Sales Corporation, filed a petition against Meera Devi for trademark infringement.\n* The High Court of Delhi at New Delhi heard the case on March 10, 2023 (Judge Amit Bansal).\n* Key findings:\n\t+ Registration of trademark \"BAL BIIHARI SUPER\" in favor of respondent no.1 was improper under Section 11 of the Trade Marks Act, 1999.\n\t+ Respondent no.1's adoption of the trademark was dishonest due to acknowledgment of petitioner's right and undertaking not to use similar marks.\n* Decision:\n\t+ Petitioner is prior adopter and continuous user of trademark \"LAL BIHARI CHAAP\" (Class 34) since February 12, 1990.\n\t+ Trademark registered in favor of respondent no.1 ( Registration No. 4256368) stands cancelled under Section 57 of the Act.\n* Order:\n\t+ Mark is removed from Register of Trade Marks.\n\t+ Pending application stands disposed of.",
          "content": "2023/DHC/001820 \n \nC.A.(COMM.IPD-TM) 41/2022                                                                                       Page 5 of 5 \n \naforesaid registration in favour of the respondent no.1 could not have been \ngranted in terms of Section 11 of the Trade Marks Act, 1999 (hereinafter \n‘the Act’) \n16. \nThe adoption of the trademark ‘BAL BIIHARI SUPER’ by the \nrespondent no.1 is dishonest, as is evident from the acknowledgment of the \npetitioner’s right in the trademark/label ‘LAL BIHARI CHAAP’ by the \nhusband of the respondent no.1 and an undertaking to not use marks similar \nto those of the petitioner. Therefore, the respondent no.1 is not entitled to the \nbenefit of Section 12 of the Act.  \n17. \nThe petitioner is the prior adopter and continuous and exclusive user \nof the said trademark in respect of unmanufactured tobacco/tobacco since \n12th February, 1990. Therefore, the trademark registered in favour of the \nrespondent no.1 is liable to be cancelled in terms of Section 57 of the Act. \n18. \nThe impugned registration under no.4256368 in Class 34 remains on \nthe Register of Trade Marks without sufficient cause.  \n19. \nAccordingly, the present petition is allowed and the trademark \nregistered under application no.4256368 in the name of the respondent no.1 \nin Class 34 is removed from the Register of Trade Marks.   \n20. \nPending application also stands disposed of.    \n21. \nThe Registry is directed to supply a copy of the present order to the \nTrademark Registry, at e-mail - llc-ipo@gov.in for compliance. \n \n \nAMIT BANSAL, J. \nMARCH 10, 2023 \nat \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:14.03.2023 15:05:52\nSignature Not Verified",
          "pdf_source": "5. Vinod agarwal vs Meera Devi.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-16T15:20:10.770204",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}