{
  "doc_name": "8. NRI Taxi vs Registrar",
  "pdf_source": "8. NRI Taxi vs Registrar.pdf",
  "metadata": {
    "document_name": "8. NRI Taxi vs Registrar",
    "source_pdf": "8. NRI Taxi vs Registrar.pdf",
    "judges": [
      "AMIT BANSAL"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "114/2022",
      "114/2022",
      "114/2022",
      "114/2022",
      "114/2022",
      "114/2022",
      "114/2022",
      "6209/2022"
    ],
    "dhc_numbers": [
      "2023/DHC/000578",
      "2023/DHC/000578",
      "2023/DHC/000578",
      "2023/DHC/000578",
      "2023/DHC/000578"
    ],
    "ia_numbers": [],
    "decision_date": "25 January, 2023",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      "NRI TAXI SERVICE PVT. LTD."
    ],
    "defendants": [
      "REGISTRAR OF TRADE MARKS, DELHI"
    ],
    "appellants": [
      "NRI TAXI SERVICE PVT. LTD."
    ],
    "respondents": [
      "REGISTRAR OF TRADE MARKS, DELHI"
    ],
    "plaintiff_advocates": [
      {
        "name": "Dr. Amit George",
        "co-advocates": [
          "Mr. Rishabh Dheer",
          "Ms. Manmeet Kaur Sareen"
        ]
      }
    ],
    "defendant_advocates": [
      {
        "name": "Harish Vaidyanathan Shankar, CGSC",
        "co-advocates": [
          "Mr. Srish Kumar Mishra",
          "Mr. Sagar Melaywat",
          "Mr.Alexander Mathai Paikaday"
        ]
      }
    ],
    "appellant_advocates": [
      {
        "name": "Dr. Amit George with Mr. Rishabh Dheer and Ms. Manmeet Kaur Sareen"
      }
    ],
    "respondent_advocates": [
      {
        "name": "Mr. Harish Vaidyanathan Shankar, CGSC",
        "co-advocates": [
          "Mr. Srish Kumar Mishra",
          "Mr. Sagar Melaywat",
          "Mr.Alexander Mathai Paikaday"
        ]
      }
    ],
    "damages_claimed": null,
    "damages_awarded": null,
    "key_issues": [
      "Here are the main legal issues extracted from the document:",
      "* Whether the subject trademark is laudatory and objectionable in terms of Section 9(1)(b) of the Trade Marks Act, 1999.",
      "* Whether the subject trademark is distinctive and can be registered under the Trade Marks Act, 1999.",
      "* Whether the appellant has made exclusive proprietorship claims on any descriptive elements of the mark, which would result in rejection of the application.",
      "* Whether the Senior Examiner of Trade Marks, Delhi was correct in rejecting the trademark application based on the examination report dated 21st June, 2017.",
      "* Whether the impugned order dated 5th August, 2020 is reasonable and justifiable under the Trade Marks Act, 1999.",
      "* Applicability of Section 9(1)(b) of the Trade Marks Act, 1999 to the subject trademark.",
      "* Whether the subject trademark can be termed as a unique combination of words that satisfies the distinctiveness requirement.",
      "* Relevance of the Division Bench judgment in Mohd. Rafiq v. Modi Sugar Mills Ltd., 1971 SCC OnLine Del 190 to the present case.",
      "* Interpretation of Section 91 of the Trade Marks Act, 1999 and its applicability to the present appeal."
    ],
    "decision_summary": "Here is a comprehensive summary of the case:\n\n**Background:**\n\nThe present appeal was filed by NRI Taxi Service Pvt. Ltd. (hereinafter referred to as \"appellant\") under Section 91 of the Trade Marks Act, 1999 against an order dated 5th August, 2020 passed by the Senior Examiner of Trade Marks, Delhi rejecting their trademark application for registration of a device mark ' (hereinafter referred to as \"subject trademark\") in Class 39.\n\n**Legal Issues:**\n\nThe primary issue in this case was whether the subject trademark is laudatory and objectionable under Section 9(1)(b) of the Trade Marks Act, 1999.\n\n**Arguments:**\n\nThe appellant submitted that the subject trademark cannot be termed as laudatory and relied on the judgment of the Division Bench in Mohd. Rafiq v. Modi Sugar Mills Ltd. (1971 SCC OnLine Del 190). They argued that the impugned order did not give any reasons or justifications to justify the rejection of their trademark application.\n\n**Court Findings:**\n\nAfter hearing the counsel for both parties and perusing the record, the court agreed with the submission of the appellant that there is nothing laudatory about the subject trademark. The court noted that no reasons or justifications were given in the impugned order as to how the subject trademark amounts to being laudatory.\n\n**Decision:**\n\nBased on the arguments and analysis, the court set aside the impugned order dated 5th August, 2020 passed by the Senior Examiner of Trade Marks, Delhi rejecting the appellant's trademark application. The court granted exemption for filing the original/certified/translated copies of any documents on which the appellant may seek to place reliance within four weeks from the date of the judgment.\n\n**Result:**\n\nThe appeal was allowed, and the impugned order was set aside.",
    "legal_precedents": [
      "Rafiq Modi Sugar Mills Ltd"
    ],
    "full_text": "\n--- PAGE 1 ---\n                                       2023/DHC/000578 \nC.A.(COMM.IPD-TM) 114/2022                                                                                                                         Page 1 of 5 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n% \n \n \n \n                 Date of decision: 25th January, 2023. \n \n+  \n \n \nC.A.(COMM.IPD-TM) 114/2022   \n \n \nNRI TAXI SERVICE PVT. LTD. \n \n \n..... Appellant \nThrough: \nDr. Amit George with Mr. Rishabh \nDheer and Ms. Manmeet Kaur \nSareen, Advocates. \n \n \n \n \n \nversus \n \n \nREGISTRAR OF TRADE MARKS, DELHI \n..... Respondent \nThrough: \nMr. Harish Vaidyanathan Shankar, \nCGSC with Mr. Srish Kumar Mishra, \nMr. \nSagar \nMehlawat \nand \nMr.Alexander \nMathai \nPaikaday, \nAdvocates. \n \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \n \n \n \n \nJUDGMENT \nAMIT BANSAL, J. (Oral) \n \nI.A. 6209/2022 (for exemption) \n1. \nSubject to the appellant filing the original/certified/translated copies \nof any documents on which the appellant may seek to place reliance, within \nfour weeks from today, exemption is granted for the present. \n2. \nThe application is disposed of. \nC.A.(COMM.IPD-TM) 114/2022  \n3. \nThe present appeal filed by the appellant under Section 91 of the \nTrade Marks Act, 1999 impugns the order dated 5th August, 2020 passed by \nSigned By:SAKSHI\nRAMOLA\nSigning Date:01.26.2023\n21:41:13\nSignature Not Verified\n\n--- PAGE 2 ---\n                                       2023/DHC/000578 \nC.A.(COMM.IPD-TM) 114/2022                                                                                                                         Page 2 of 5 \n \nthe Senior Examiner of Trade Marks, Delhi whereby the trademark \napplication of the applicant bearing no.3547956 for registration of the device \nmark '\n' (hereinafter ‘subject trademark’) in Class 39 has been \nrejected on the ground that the subject trademark is laudatory and \nobjectionable in terms of Section 9(1)(b) of the Trade Marks Act, 1999 \n(hereinafter referred to as ‘the Act’).  \n4. \nThe details of the appellant’s trade mark application are as under: \nMark \nApplication \nno. \nApplication \nDate \nClass \nApplicant \n \n \n \n3547956 \n12.05.2017 \n39 \nNRI TAXI \nSERVICE \nPRIVATE \nLIMITED \n \nBRIEF FACTS \n5. \nBrief facts necessary for deciding the present appeal are as follows: \ni. \nOn 12th May, 2017, the appellant filed a trademark registration \napplication for registration of the subject trademark in class 39. \nii. \nOn 21st June, 2017, an Examination Report was sent by the \nTrademark Registry raising objection under Section 9(1)(b) of the \nAct. \niii. \nOn 13th July, 2017, the appellant filed a reply to the aforesaid \nExamination Report giving detailed submissions stating that, inter \nSigned By:SAKSHI\nRAMOLA\nSigning Date:01.26.2023\n21:41:13\nSignature Not Verified\n\n--- PAGE 3 ---\n                                       2023/DHC/000578 \nC.A.(COMM.IPD-TM) 114/2022                                                                                                                         Page 3 of 5 \n \nalia, the subject trademark is a unique combination of words and is \ntherefore, distinctive. \niv. \nIt was further stated that exclusivity was being claimed on the subject \ntrademark as a whole and no exclusive proprietorship was being \nclaimed on any of the descriptive elements of the mark. \nv. \nOn 5th October, 2019, a hearing notice was sent to the appellant and \nthe hearing took place on 4th December, 2019. On 29th November, \n2019, the appellant filed additional documents for the hearing. \nvi. \nVide impugned order dated 5th August, 2020, the appellant’s \napplication for registration of the subject trademark was rejected. \n6. \nCounsel appearing on behalf of the appellant submits that the subject \ntrademark cannot by any stretch of imagination be termed as laudatory. He \nplaces reliance on the judgment of the Division Bench in Mohd. Rafiq v. \nModi Sugar Mills Ltd., 1971 SCC OnLine Del 190. \nANALYSIS AND FINDINGS \n7. \nI have heard the counsels for the parties and perused the record. \n8. \nI am in agreement with the submission of the appellant that there is \nnothing laudatory about the subject trademark. In any event, no reasons or \njustifications have been given in the impugned order as to how the aforesaid \ntrademark amounts to being laudatory. \n9. \nCounsel for the appellant has correctly placed reliance on the \njudgment in Mohd. Rafiq (supra), the relevant observations of which are set \nout below: \n“We are unable to accede to the contention that the word “SUN” \nused in respect of the lanterns manufactured by the respondent is a \nlaudatory term having reference to the character and quality of those \nSigned By:SAKSHI\nRAMOLA\nSigning Date:01.26.2023\n21:41:13\nSignature Not Verified\n\n--- PAGE 4 ---\n                                       2023/DHC/000578 \nC.A.(COMM.IPD-TM) 114/2022                                                                                                                         Page 4 of 5 \n \nlanterns. It is no doubt true that the rays of sun dispel darkness and \nlanterns too are used for dispelling darkness, it does not follow from \nthat that the use of trade mark “SUN” for the lanterns has reference \nto the character and quality, of those lanterns. The reference to the \ncharacter and quality, in our opinion, should be direct and plain and \nnot remote and far-fetched. Likewise, the word, which is sought to be \nconstrued as laudatory, should have obvious significant of praise, and \nnot one out of which an inference of praise has to be spelt out by a \nlaboured process. Sun is the body which is the gravitational centre \nand source of light and heat to our planetary system. The element of \npraise is neither self evident in the word “SUN” nor can the said \nword be considered to be descriptive of the character or quality of the \nlanterns. A contrary view must necessarily result in stretching the \nconnotation of the word “sun” to limits which, in our opinion, are \nimpermissible. We, therefore, find it difficult to hold that the word \n“sun” is inherently incapable of being distinctive of the lanterns \nmanufactured by the respondent. In the matter of The Eastmen \nPhotographic Materials Company, Limited and The Comptroller-\nGeneral of Patents, Designs and Trade Marks, 1898 A.C. 571 (5), the \nHouse of Lords held that the word “Solio” when used in respect of \nphotographic paper was capable of registration as a trade mark. The \ncontention that the word indicated the character or quality of the \ngoods was repelled.” \n \n  \n10. \nThe subject trademark in the present case is a device mark, which is \nsought to be registered as a whole. The subject trademark is not a word mark \nsimpliciter but a stylized device containing the text 'NRI Taxi' overlayed on \na blue background with a partial outline of a side profile of a car. The same \nis required to be assessed as a whole. Further, the subject trademark is \nneither descriptive nor generic in respect of the services it is being used for.  \n11. \nIn view of the above, the impugned order dated 5th August, 2022 \nrefusing registration of the Trademark Application No.3547956 is \nunsustainable and is accordingly, set aside. \nSigned By:SAKSHI\nRAMOLA\nSigning Date:01.26.2023\n21:41:13\nSignature Not Verified\n\n--- PAGE 5 ---\n                                       2023/DHC/000578 \nC.A.(COMM.IPD-TM) 114/2022                                                                                                                         Page 5 of 5 \n \n12. \nThe appellant has already given his disclaimer with regard to using \nthe individual components of the subject trademark. The appellant will not \nclaim any rights over the individual components of the trademark i.e., ‘NRI’ \nand ‘TAXI’. \n13. \nThe Registrar of Trade Marks is accordingly directed to proceed for \nregistration of the application. Let the same be advertised within a period of \nthree months. \n14. \nIf there is any opposition to the said application, the same shall be \ndecided on its own merits without being affected by the observations made \nherein. \n15. \nAccordingly, the appeal along with all pending applications is \ndisposed of.  \n16. \nRegistry to supply a copy of the present order to Trade Mark Registry \nat llc-ipo@gov.in for compliance.  \n \n \n \nAMIT BANSAL, J. \nJANUARY 25, 2023 \nat \nSigned By:SAKSHI\nRAMOLA\nSigning Date:01.26.2023\n21:41:13\nSignature Not Verified\n"
  },
  "total_pages": 5,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0002",
      "start_index": 1,
      "end_index": 1,
      "summary": "The document is a court judgment in a trademark case, **2023/DHC/000578 C.A.(COMM.IPD-TM) 114/2022**, available on the PDF file \"8. NRI Taxi vs Registrar.pdf\". Here's a summary of the key points:\n\n**Case Overview**\n\n* The High Court of Delhi at New Delhi heard the appeal case.\n* Date of decision: January 25, 2023.\n* Appellant: NRI Taxicab Service Pvt. Ltd. (represented by Dr. Amit George and others).\n* Respondent: Registrar of Trade Marks, Delhi (represented by Mr. Harish Vaidyanathan Shankar and others).\n\n**Case Details**\n\n* The appeal was filed under Section 91 of the Trade Marks Act, 1999.\n* The subject matter is an order dated August 5, 2020, passed by the Registrar of Trade Marks.\n\n**Judgment**\n\n* Justice Amit Bansal allowed an exemption for the present case, subject to the appellant filing supporting documents within four weeks.\n* The application is disposed of with a mention that the original/certified/translated copies of any relevant documents must be submitted.\n\n**Parties and Dates**\n\n* Parties involved: NRI Taxicab Service Pvt. Ltd. (appellant) and Registrar of Trade Marks, Delhi (respondent).\n* Key dates mentioned:\n\t+ August 5, 2020: Order passed by the Registrar of Trade Marks.\n\t+ January 25, 2023: Date of court decision.\n\nNote that no specific amounts or detailed arguments/decisions are mentioned in this summary.",
      "pdf_source": "8. NRI Taxi vs Registrar.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "**Pdf Source:** 8. NRI Taxi vs Registrar.pdf (2023/DHC/000578)\n\n**Summary:**\n\nIn the High Court of Delhi at New Delhi, C.A.(COMM.IPD-TM) 114/2022 was heard on January 25, 2023.\n\nThe appeal, filed by NRI TAXI SERVICE PVT. LTD., challenges an order dated August 5, 2020, passed by the Registrar of Trade Marks, Delhi.\n\n**Key Points:**\n\n1. The present appeal seeks exemption from filing certain documents.\n2. Exemption is granted subject to the appellant providing original/certified/translated copies of relevant documents within four weeks.\n3. The application was disposed of on January 25, 2023.\n4. The case is an appeal under Section 91 of the Trade Marks Act, 1999.\n\n**Participants:**\n\n- NRI TAXI SERVICE PVT. LTD. (Appellant)\n- Registrar of Trademarks, Delhi (Respondent)\n\n**Counsel:**\n\n- Dr. Amit George with Mr. Rishabh Dheer and Ms. Manmeet Kaur (for Appellant)\n- Mr. Harish Vaidyanathan Shankar, CGSC, with Mr. Srish Kumar Mishra, Mr. Sagar Mela Lawat, and Mr. Alexander Mathai Paikaday (for Respondent)\n\n**Judge:**\n\n-HON'BLE MR. JUSTICE AMIT B",
          "content": "2023/DHC/000578 \nC.A.(COMM.IPD-TM) 114/2022                                                                                                                         Page 1 of 5 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n% \n \n \n \n                 Date of decision: 25th January, 2023. \n \n+  \n \n \nC.A.(COMM.IPD-TM) 114/2022   \n \n \nNRI TAXI SERVICE PVT. LTD. \n \n \n..... Appellant \nThrough: \nDr. Amit George with Mr. Rishabh \nDheer and Ms. Manmeet Kaur \nSareen, Advocates. \n \n \n \n \n \nversus \n \n \nREGISTRAR OF TRADE MARKS, DELHI \n..... Respondent \nThrough: \nMr. Harish Vaidyanathan Shankar, \nCGSC with Mr. Srish Kumar Mishra, \nMr. \nSagar \nMehlawat \nand \nMr.Alexander \nMathai \nPaikaday, \nAdvocates. \n \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \n \n \n \n \nJUDGMENT \nAMIT BANSAL, J. (Oral) \n \nI.A. 6209/2022 (for exemption) \n1. \nSubject to the appellant filing the original/certified/translated copies \nof any documents on which the appellant may seek to place reliance, within \nfour weeks from today, exemption is granted for the present. \n2. \nThe application is disposed of. \nC.A.(COMM.IPD-TM) 114/2022  \n3. \nThe present appeal filed by the appellant under Section 91 of the \nTrade Marks Act, 1999 impugns the order dated 5th August, 2020 passed by \nSigned By:SAKSHI\nRAMOLA\nSigning Date:01.26.2023\n21:41:13\nSignature Not Verified",
          "pdf_source": "8. NRI Taxi vs Registrar.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Facts and Arguments",
      "node_id": "0006",
      "start_index": 2,
      "end_index": 4,
      "summary": "Here's a summary of the legal document section from PDF: `8. NRI Taxi vs Registrar.pdf`\n\n**Case Details:**\n\n* Case number: C.A.(COMM.IPD-TM) 114/2022\n* Date of decision: January 25, 2023\n* Parties involved:\n\t+ Appellant: NRI TAXI SERVICE PVT. LTD.\n\t+ Respondent: Not specified (Registrar?)\n* Jurisdiction: High Court of Delhi, India\n\n**Background:**\n\nThe appellant filed a trademark registration application for the mark \"(device mark)\" in Class 39 on May 12, 2017. An Examination Report was sent by the Trademark Registry raising objection under Section 9(1)(b) of the Trade Marks Act, 1999.\n\n**Proceedings:**\n\n* On July 13, 2017, the appellant filed a reply to the Examination Report.\n* A hearing took place on December 4, 2019. Additional documents were filed on November 29, 2019.\n* The impugned order was passed on August 5, 2020, rejecting the application for registration.\n\n**Arguments and Analysis:**\n\nThe appellant's counsel argued that the subject trademark cannot be termed as laudatory. Relying on a 1971 judgment (Mohd. Rafiq v. Modi Sugar Mills Ltd.), the counsel submitted that no reasons or justifications were given in the impugned order to support the finding of laudatory nature.\n\n**Decision:**\n\nThe court agreed with the appellant's submission and set aside the impugned order. No reasons or justifications were provided in the order to support the finding of laudatory nature.\n\n**Sources:**",
      "pdf_source": "8. NRI Taxi vs Registrar.pdf",
      "nodes": [
        {
          "title": "Page 2",
          "node_id": "0003",
          "start_index": 2,
          "end_index": 2,
          "summary": "Here is a summary of page 2 from the PDF \"8. NRI Taxi vs Registrar.pdf\" in 200 words or less:\n\nThe High Court of Delhi at New Delhi received an appeal (C.A.(COMM.IPD-TM) 114/2022) on January 25, 2023. The appeal was filed by NRI TAXI SERVICE PVT. LTD. against the Senior Examiner of Trade Marks, Delhi.\n\nKey points from page 2:\n\n* The trademark application no. 3547956 for registration of the device mark '' (subject trademark) in Class 39 has been rejected.\n* The rejection is based on Section 9(1)(b) of the Trade Marks Act, 1999, which states that a trademark is objectionable if it is laudatory.\n* The Examination Report was sent by the Trademark Registry on June 21, 2017, raising an objection under Section 9(1)(b).\n* The appellant filed a reply to the Examination Report on July 13, 2017.\n\nSource: PDF \"8. NRI Taxi vs Registrar.pdf\"",
          "content": "2023/DHC/000578 \nC.A.(COMM.IPD-TM) 114/2022                                                                                                                         Page 2 of 5 \n \nthe Senior Examiner of Trade Marks, Delhi whereby the trademark \napplication of the applicant bearing no.3547956 for registration of the device \nmark '\n' (hereinafter ‘subject trademark’) in Class 39 has been \nrejected on the ground that the subject trademark is laudatory and \nobjectionable in terms of Section 9(1)(b) of the Trade Marks Act, 1999 \n(hereinafter referred to as ‘the Act’).  \n4. \nThe details of the appellant’s trade mark application are as under: \nMark \nApplication \nno. \nApplication \nDate \nClass \nApplicant \n \n \n \n3547956 \n12.05.2017 \n39 \nNRI TAXI \nSERVICE \nPRIVATE \nLIMITED \n \nBRIEF FACTS \n5. \nBrief facts necessary for deciding the present appeal are as follows: \ni. \nOn 12th May, 2017, the appellant filed a trademark registration \napplication for registration of the subject trademark in class 39. \nii. \nOn 21st June, 2017, an Examination Report was sent by the \nTrademark Registry raising objection under Section 9(1)(b) of the \nAct. \niii. \nOn 13th July, 2017, the appellant filed a reply to the aforesaid \nExamination Report giving detailed submissions stating that, inter \nSigned By:SAKSHI\nRAMOLA\nSigning Date:01.26.2023\n21:41:13\nSignature Not Verified",
          "pdf_source": "8. NRI Taxi vs Registrar.pdf",
          "nodes": []
        },
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "Here is a summary of page 3 from PDF \"8. NRI Taxi vs Registrar.pdf\" in under 200 words:\n\n**Case Details**\n\n* Case: C.A.(COMM.IPD-TM) 114/2022\n* Date of decision: 25th January, 2023\n* Appellant: NRI TAXI SERVICE PVT. LTD.\n* Counsel for appellant: Dr. Amit George with Mr. Rishabh Dheer and Ms. Manmeet Kaur\n\n**Analysis**\n\nThe court heard the counsels for both parties and perused the record. The court agreed with the submission of the appellant that there is nothing laudatory about the subject trademark.\n\n**Judgment Cited**\n\nThe court relied on the judgment in Mohd. Rafiq v. Modi Sugar Mills Ltd., 1971 SCC OnLine Del 190, which states that a word such as \"SUN\" used for lanterns is not a laudatory term.\n\n**Proceedings**\n\nA hearing took place on December 4, 2019, and additional documents were filed by the appellant on November 29, 2019. The impugned order was passed on August 5, 2020, rejecting the appellant's application for registration of the subject trademark.",
          "content": "2023/DHC/000578 \nC.A.(COMM.IPD-TM) 114/2022                                                                                                                         Page 3 of 5 \n \nalia, the subject trademark is a unique combination of words and is \ntherefore, distinctive. \niv. \nIt was further stated that exclusivity was being claimed on the subject \ntrademark as a whole and no exclusive proprietorship was being \nclaimed on any of the descriptive elements of the mark. \nv. \nOn 5th October, 2019, a hearing notice was sent to the appellant and \nthe hearing took place on 4th December, 2019. On 29th November, \n2019, the appellant filed additional documents for the hearing. \nvi. \nVide impugned order dated 5th August, 2020, the appellant’s \napplication for registration of the subject trademark was rejected. \n6. \nCounsel appearing on behalf of the appellant submits that the subject \ntrademark cannot by any stretch of imagination be termed as laudatory. He \nplaces reliance on the judgment of the Division Bench in Mohd. Rafiq v. \nModi Sugar Mills Ltd., 1971 SCC OnLine Del 190. \nANALYSIS AND FINDINGS \n7. \nI have heard the counsels for the parties and perused the record. \n8. \nI am in agreement with the submission of the appellant that there is \nnothing laudatory about the subject trademark. In any event, no reasons or \njustifications have been given in the impugned order as to how the aforesaid \ntrademark amounts to being laudatory. \n9. \nCounsel for the appellant has correctly placed reliance on the \njudgment in Mohd. Rafiq (supra), the relevant observations of which are set \nout below: \n“We are unable to accede to the contention that the word “SUN” \nused in respect of the lanterns manufactured by the respondent is a \nlaudatory term having reference to the character and quality of those \nSigned By:SAKSHI\nRAMOLA\nSigning Date:01.26.2023\n21:41:13\nSignature Not Verified",
          "pdf_source": "8. NRI Taxi vs Registrar.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "Summary of page 4 from PDF: 8. NRI Taxi vs Registrar.pdf\n\nIn a trademark dispute, the High Court of Delhi has ruled in favor of NRI Taxi Service Pvt. Ltd. The decision is based on Case No. 2023/DHC/000578, C.A.(COMM.IPD-TM) 114/2022.\n\n**Key Points:**\n\n* The court assessed whether the word \"sun\" was inherently incapable of being distinctive as a trademark for lanterns.\n* The court held that the reference to character or quality should be direct and plain, not remote and far-fetched. The word \"sun\" is not self-evident praise and does not describe the character or quality of the lanterns.\n\n**Legal Facts:**\n\n* In re The Eastmen Photographic Materials Company, Limited (1898 A.C. 571), the House of Lords held that the word \"Solio\" was capable of being registered as a trade mark.\n* The subject trademark in this case is a device mark containing the text 'NRI Taxi' on a blue background with a car outline.\n\n**Decision:**\n\n* The impugned order refusing registration of Trademark Application No.3547956 is set aside.\n\nSource: 8. NRI Taxi vs Registrar.pdf",
          "content": "2023/DHC/000578 \nC.A.(COMM.IPD-TM) 114/2022                                                                                                                         Page 4 of 5 \n \nlanterns. It is no doubt true that the rays of sun dispel darkness and \nlanterns too are used for dispelling darkness, it does not follow from \nthat that the use of trade mark “SUN” for the lanterns has reference \nto the character and quality, of those lanterns. The reference to the \ncharacter and quality, in our opinion, should be direct and plain and \nnot remote and far-fetched. Likewise, the word, which is sought to be \nconstrued as laudatory, should have obvious significant of praise, and \nnot one out of which an inference of praise has to be spelt out by a \nlaboured process. Sun is the body which is the gravitational centre \nand source of light and heat to our planetary system. The element of \npraise is neither self evident in the word “SUN” nor can the said \nword be considered to be descriptive of the character or quality of the \nlanterns. A contrary view must necessarily result in stretching the \nconnotation of the word “sun” to limits which, in our opinion, are \nimpermissible. We, therefore, find it difficult to hold that the word \n“sun” is inherently incapable of being distinctive of the lanterns \nmanufactured by the respondent. In the matter of The Eastmen \nPhotographic Materials Company, Limited and The Comptroller-\nGeneral of Patents, Designs and Trade Marks, 1898 A.C. 571 (5), the \nHouse of Lords held that the word “Solio” when used in respect of \nphotographic paper was capable of registration as a trade mark. The \ncontention that the word indicated the character or quality of the \ngoods was repelled.” \n \n  \n10. \nThe subject trademark in the present case is a device mark, which is \nsought to be registered as a whole. The subject trademark is not a word mark \nsimpliciter but a stylized device containing the text 'NRI Taxi' overlayed on \na blue background with a partial outline of a side profile of a car. The same \nis required to be assessed as a whole. Further, the subject trademark is \nneither descriptive nor generic in respect of the services it is being used for.  \n11. \nIn view of the above, the impugned order dated 5th August, 2022 \nrefusing registration of the Trademark Application No.3547956 is \nunsustainable and is accordingly, set aside. \nSigned By:SAKSHI\nRAMOLA\nSigning Date:01.26.2023\n21:41:13\nSignature Not Verified",
          "pdf_source": "8. NRI Taxi vs Registrar.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Decision and Orders",
      "node_id": "0008",
      "start_index": 5,
      "end_index": 5,
      "summary": "The document is a court decision from the High Court of Delhi, dated January 25, 2023 (PDF: 8. NRI Taxi vs Registrar.pdf). The case is C.A.(COMM.IPD-TM) 114/2022, where NRI Taxi Service Pvt. Ltd. filed an appeal against the decision of the Registrar of Trade Marks.\n\n**Facts and Parties:**\n\n* Appellant: NRI Taxi Service Pvt. Ltd.\n* Respondent: Registrar of Trade Marks\n\nThe appellant had applied for registration of a trademark, but its application was opposed by the respondent. The case turned on whether the individual components of the trademark (\"NRI\" and \"TAXI\") could be registered separately.\n\n**Arguments and Decisions:**\n\nThe court observed that the appellant would not claim any rights over the individual components of the trademark and would use them separately. On this basis, the court directed the Registrar to proceed with the registration of the application.\n\n**Key Decisions:**\n\n* The appeal is allowed.\n* TheRegistrar of Trade Marks is directed to proceed for registration of the application.\n* The application shall be advertised within three months.\n* If any opposition arises, it shall be decided on its own merits without being affected by the court's observations.\n\n**Timeline and Signatures:**\n\n* Date of decision: January 25, 2023\n* Signed by Judge Amit Bansal\n\nThe document is a clear summary of the court's decision in this trademark dispute.",
      "pdf_source": "8. NRI Taxi vs Registrar.pdf",
      "nodes": [
        {
          "title": "Page 5",
          "node_id": "0007",
          "start_index": 5,
          "end_index": 5,
          "summary": "**Summary of page 5 from PDF \"NRI Taxi vs Registrar.pdf\"**\n\nOn January 25, 2023, a High Court of Delhi at New Delhi order was made in C.A.(COMM.IPD-TM) 114/2022.\n\n**Key points:**\n\n* The appellant's disclaimer regarding individual components of the trademark is accepted.\n* The Registry to Trade Marks is directed to proceed with registration of the application.\n* Advertisements shall be made within three months, and any opposition will be decided on its own merits.\n* The appeal, along with pending applications, is disposed of.\n* A copy of the order is to be supplied to the Trade Mark Registry at llc-ipo@gov.in for compliance.\n\n**Decision:**\n\nThe Registrar of Trade Marks is instructed to register the application.\n\n**Order made by:** Amit Bansal, J. on January 25, 2023\n\n**Source:** 8. NRI Taxi vs Registrar.pdf (C.A.(COMM.IPD-TM) 114/2022; 2023/DHC/000578)",
          "content": "2023/DHC/000578 \nC.A.(COMM.IPD-TM) 114/2022                                                                                                                         Page 5 of 5 \n \n12. \nThe appellant has already given his disclaimer with regard to using \nthe individual components of the subject trademark. The appellant will not \nclaim any rights over the individual components of the trademark i.e., ‘NRI’ \nand ‘TAXI’. \n13. \nThe Registrar of Trade Marks is accordingly directed to proceed for \nregistration of the application. Let the same be advertised within a period of \nthree months. \n14. \nIf there is any opposition to the said application, the same shall be \ndecided on its own merits without being affected by the observations made \nherein. \n15. \nAccordingly, the appeal along with all pending applications is \ndisposed of.  \n16. \nRegistry to supply a copy of the present order to Trade Mark Registry \nat llc-ipo@gov.in for compliance.  \n \n \n \nAMIT BANSAL, J. \nJANUARY 25, 2023 \nat \nSigned By:SAKSHI\nRAMOLA\nSigning Date:01.26.2023\n21:41:13\nSignature Not Verified",
          "pdf_source": "8. NRI Taxi vs Registrar.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-16T11:41:41.408874",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}