{
  "doc_name": "9. Bennet Coleman vs E1",
  "pdf_source": "9. Bennet Coleman vs E1.pdf",
  "metadata": {
    "document_name": "9. Bennet Coleman vs E1",
    "source_pdf": "9. Bennet Coleman vs E1.pdf",
    "judges": [
      "AMIT BANSAL"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "253/2019",
      "253/2019",
      "253/2019",
      "253/2019",
      "253/2019",
      "4831/2022",
      "4832/2022",
      "4831/2022"
    ],
    "dhc_numbers": [
      "2022/DHC/005230",
      "2022/DHC/005230",
      "2022/DHC/005230",
      "2022/DHC/005230",
      "2022/DHC/005230",
      "2022/DHC/005230",
      "2022/DHC/005230",
      "2022/DHC/005230"
    ],
    "ia_numbers": [],
    "decision_date": "28 November, 2022",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      {
        "name": "BENNETT, COLEMAN AND COMPANY LIMITED"
      }
    ],
    "defendants": [
      {
        "name": "E1 ENTERTAINMENT TELEVISION, LLC AND ANR."
      }
    ],
    "appellants": [],
    "respondents": [],
    "plaintiff_advocates": [
      {
        "name": "Mr. Hemant Singh",
        "firm": ""
      },
      {
        "name": "Mrs. Mamta Rani Jha",
        "firm": ""
      },
      {
        "name": "Mr. Amitesh Mishra",
        "firm": ""
      }
    ],
    "defendant_advocates": [
      {
        "name": "Ms. Shwetasree Majumder",
        "firm": ""
      },
      {
        "name": "Mr. Prithvi Singh",
        "firm": ""
      },
      {
        "name": "Ms. Devyani Nath",
        "firm": ""
      }
    ],
    "appellant_advocates": [],
    "respondent_advocates": [
      {
        "name": "Ms. Anushkaa Arora",
        "firm": ""
      },
      {
        "name": "Mr. Sahaj Garg",
        "firm": "Senior Panel Counsels (UOI)"
      },
      {
        "name": "Mr. Aditya Sharan",
        "firm": ""
      }
    ],
    "damages_claimed": "50,000",
    "damages_awarded": null,
    "key_issues": [
      "Here are the main legal issues extracted from the document:",
      "• Whether a rectification petition seeking to cancel a trademark registration can be filed after initiation of a civil suit for infringement?",
      "• Maintenance of a rectification petition when the petitioner was aware of the trademark registration prior to initiating the suit.",
      "• Applicability of Supreme Court judgments (Patel Field Marshal Agencies and Anr. v. P.M. Diesels Limited and Ors.) in similar cases.",
      "• Section 124 read with Section 30(2)(e) of the Trade Marks Act, 1999: framing a preliminary issue in the civil suit before filing a rectification application.",
      "• Whether the trademark registration in question is in issue in the ongoing civil suit (CS(COMM) 253/2019).",
      "• Applicability of Coordinate Bench judgments (Resilient Innovations Pvt. Ltd. v. Phonepe Private Limited & Anr.).",
      "• Whether the petitioner can seek injunction against the respondents using trademarks \"E! NOW\" and \"E! NEWS NOW\" in the civil suit.",
      "• The scope of relief available for rectification of trademark registration under Section 57 of the Trade Marks Act, 1999.",
      "• Whether the respondent's delay in filing a rectification petition is pertinent to its maintainability."
    ],
    "decision_summary": "**Case Summary:**\n\nThis is a civil case filed by Bennett, Coleman and Company Limited against E! Entertainment Television, LLC and another company, seeking rectification of the trademark register qua trademark registration no. 1252812 in class 99 (classes 38 and 41). The respondent's registration had been granted on December 2, 2003.\n\n**Background:**\n\nThe petitioner, Bennett, Coleman and Company Limited, filed a suit, CS(COMM) 253/2019, against the respondent, E! Entertainment Television, LLC, on May 10, 2019, claiming proprietary rights over trademarks \"NOW\" and its formative marks, including \"ENOW\". However, the petitioner has only sought injunctions against the respondent using the trademarks \"E! NOW\" and \"E! NEWS NOW\", but not questioning the validity of the respondent's trademark registration.\n\n**Legal Issues:**\n\nThe main legal issue in this case is whether the petitioner can file a rectification application under Section 124(1) read with Section 30(2)(e) of the Trade Marks Act, 1999, despite not having raised the issue of invalidity of the respondent's trademark registration in the earlier suit. The petitioner's counsel argued that since the impugned trademark registration is not in issue in CS(COMM) 253/2019, the judgments relied upon by the respondent are not applicable in this case.\n\n**Arguments:**\n\n1. The respondent's counsel submitted that the petitioner was aware of the respondent's trademark registration as far back as June 6, 2018, and despite filing a suit on May 10, 2019, did not raise the issue of invalidity of the registration.\n2. The respondent's counsel relied upon the judgments in Patel Field Marshal Agencies and Anr. v. P.M. Diesels Limited and Ors., (2018) 2 SCC 112, and Resilient Innovations Pvt. Ltd. v. Phonepe Private Limited & Anr., (2021) 88 PTC 610, to argue that the present rectification petition is not maintainable.\n3. The petitioner's counsel countered by arguing that since the impugned trademark registration was not in issue in CS(COMM) 253/2019, no preliminary issue could be framed under Section 124 of the Trade Marks Act, 1999.\n\n**Court Findings:**\n\nThe court noted that:\n\n*   The Supreme Court had held in Patel Field Marshal Agencies and Anr. v. P.M. Diesels Limited and Ors., (2018) 2 SCC 112, that a rectification application under Section 38 of the Trade Marks Act, 1950, was not maintainable where the ground for rectification was already pending consideration in another suit between the same parties.\n*   Similarly, in Resilient Innovations Pvt. Ltd. v. Phonepe Private Limited & Anr., (2021) 88 PTC 610, a Coordinate Bench of this Court held that a preliminary issue could not be framed to consider the invalidity of the respondent's trademark registration.\n\n**Decision:**\n\nThe court, relying on the judgments in Patel Field Marshal Agencies and Anr. v. P.M. Diesels Limited and Ors., (2018) 2 SCC 112, and Resilient Innovations Pvt. Ltd. v. Phonepe Private Limited & Anr., (2021) 88 PTC 610, held that:\n\n*   The present rectification petition filed by the petitioner is not maintainable under Section 124(1) read with section 28(e) of the Trade Marks Act, 1999.\n*   Since the impugned trademark registration was not in issue in CS(COMM) 253/2019 and a preliminary issue could not have been framed to consider its validity.",
    "legal_precedents": [
      "(2018) 2 SCC 112"
    ],
    "full_text": "\n--- PAGE 1 ---\n                                    2022/DHC/005230 \nC.O. (COMM.IPD-TM) 243/2022                                                                 Page 1 of 8 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n \n% \n \n \n \n                Date of decision: 28th November, 2022. \n \n+  \n \n \n \nC.O. (COMM.IPD-TM) 243/2022  \n \n \nBENNETT, COLEMAN AND COMPANY  \nLIMITED  \n \n \n \n \n \n..... Petitioner \nThrough: \nMr.Hemant Singh, Mrs.Mamta Rani \nJha \nand \nMr.Amitesh \nMishra, \nAdvocates. \n \n \n \n \nversus \n \n \nE1 ENTERTAINMENT TELEVISION, LLC AND  \nANR.  \n \n \n \n \n \n \n..... Respondents \nThrough: \nMs.Shwetasree Majumder, Mr.Prithvi \nSingh \nand \nMs.Devyani \nNath, \nAdvocates. \n \nMs.Anushkaa Arora, Mr.Sahaj Garg, \nSenior Panel Counsels (UOI) and \nMr.Aditya Sharan, Advocates for R-2 \n \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nAMIT BANSAL, J. (Oral) \n \nI.A. 4831/2022(of the respondent no.1 u/s 151 of CPC) \n1. \nThe present rectification petition has been filed on behalf of the \npetitioner for rectification of the trademark register qua trademark \nregistration no.1252812, which is registered in class 99 (classes 38 and 41) \nin favour of the respondent no.1 since 2nd December, 2003.   \n2. \nThe present application has been filed on behalf of the respondent \nno.1 seeking dismissal of the aforesaid rectification petition.  \n3. \nNotice in this application was issued on 5th March, 2022 and reply has \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:01.12.2022 14:22:17\nSignature Not Verified\n\n--- PAGE 2 ---\n                                    2022/DHC/005230 \nC.O. (COMM.IPD-TM) 243/2022                                                                 Page 2 of 8 \n \nbeen filed on behalf of the respondent no.1. Rejoinder thereto has also been \nfiled on behalf of the respondent no.1.  \n4. \nCounsel for the respondent no.1 submits that the petitioner was aware \nof the registration in favour of the respondent no.1 as far back as on 6th June, \n2018 and despite a suit, being CS(COMM) 253/2019, having been filed by \nthe petitioner against the respondent no.1 on 10th May, 2019, the petitioner \ntook no steps to have a preliminary issue framed on the alleged invalidity of \nthe respondent no.1’s trademark. Therefore, in view of the judgment of the \nSupreme Court in Patel Field Marshal Agencies and Anr. v. P.M. Diesels \nLimited and Ors., (2018) 2 SCC 112, followed by a Coordinate Bench of \nthis Court in Resilient Innovations Pvt. Ltd. v. Phonepe Private Limited & \nAnr., (2021) 88 PTC 610, the present rectification petition filed on behalf of \nthe petitioner is not maintainable.  \n5. \nCounsel for the respondent no.1 has placed reliance on the pleadings \nin the aforesaid suit to submit that the mark in respect of which rectification \nis sought by the petitioner herein, was subject matter of the aforesaid suit. \nTherefore, in terms of Section 124 read with Section 30(2)(e) of the Trade \nMarks Act, 1999, a preliminary issue would be required to be framed in the \naforesaid suit before a rectification application can be filed.  \n6. \nPer contra, the counsel for the petitioner submits that the impugned \ntrademark registration, which is the subject matter of the rectification \npetition, is not in issue in CS(COMM) 253/2019. In the said suit, the \npetitioner has claimed proprietary rights over the trademark “NOW” and \n“NOW” formative marks including “ENOW”.  Reference is this regard has \nbeen \nmade \nto \nparagraphs \n19, \n20 \nand \n21 \nof \nthe \nplaint \nin \nCS(COMM)253/2019. Hence, the petitioner herein has sought injunction \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:01.12.2022 14:22:17\nSignature Not Verified\n\n--- PAGE 3 ---\n                                    2022/DHC/005230 \nC.O. (COMM.IPD-TM) 243/2022                                                                 Page 3 of 8 \n \nagainst the respondent no.1 using the trademarks “E! NOW” and “E! NEWS \nNOW”. Therefore, it is submitted that the judgments relied upon by the \nrespondent no.1 are not applicable in the facts of the present case. \n7. \nI have heard the counsels for the parties. \n8. \nSection 30(2)(e) and Section 124(1) of the Trade Marks Act, 1999 are \nset out hereunder:  \n―30. Limits on effect of registered trade  mark. –  \n 2… A registered trade mark is not infringed where— \n(e) \nthe use of a registered trade mark, being one of two or more \ntrade marks registered under this Act which are identical or nearly \nresemble each other, in exercise of the right to the use of that trade \nmark given by registration under this Act.‖ \n… \n―124. Stay of proceedings where the validity of registration of the \ntrade mark is questioned, etc.— \n(1) Where in any suit for infringement of a trade mark— \n(a) the defendant pleads that registration of the plaintiff‘s trade mark \nis invalid; or \n(b) the defendant raises a defence under clause (e) of sub-section (2) \nof section 30 and the plaintiff pleads the invalidity of registration of \nthe defendant’s trade mark,  \nthe court trying the suit (hereinafter referred to as the court), shall,— \n(i) if any proceedings for rectification of the register in relation to the \nplaintiff‘s or defendant‘s trade mark are pending before the Registrar \nor the Appellate Board, stay the suit pending the final disposal of such \nproceedings; \n(ii) if no such proceedings are pending and the court is satisfied that \nthe plea regarding the invalidity of the registration of the plaintiff’s \nor defendant’s trade mark is prima facie tenable, raise an issue \nregarding the same and adjourn the case for a period of three \nmonths from the date of the framing of the issue in order to enable \nthe party concerned to apply to the Appellate Board for rectification \nof the register.‖ \n \n9. \nTo appreciate the rival submissions, a reference may be made to the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:01.12.2022 14:22:17\nSignature Not Verified\n\n--- PAGE 4 ---\n                                    2022/DHC/005230 \nC.O. (COMM.IPD-TM) 243/2022                                                                 Page 4 of 8 \n \nrelevant paragraphs of the plaint in CS(COMM) 253/2019: \n―3. \nThat the alleged usage of the marks ‗E! NOW‘ and ‗E News \nNOW‘ is a spurious and malafide besides being an afterthought done \nsimply to defeat the rights vested by the Plaintiff in using the mark \nand Logo of ‗NOW‘. \n4… \n(iv) \nThat on 10.10.2018, the Defendant Company filed the evidence \nin support of opposition under Rule 45 in Trade mark Application No. \n3679905 and for the first time claimed its right over the mark E! \nNEWS NOW only and not E Now.‖ \n \n10. \nFrom a reading of the plaint as a whole it emerges that the cause of \naction for filing the aforesaid suit by the petitioner herein was on account of \nrespondent no.1 ascertaining rights over the marks “E! NOW” and “E \nNEWS NOW”. In the prayer clause, a decree of permanent injunction is \nsought against the respondent no.1 herein from using the channel/domain \n“E! NOW” and “E! NEWS NOW”, which is deceptively similar to \npetitioner’s mark “E NOW”. There is no pleading in the plaint with regard \nto the mark “\n/E!”  and no injunction has been sought against the said \nmark. Therefore, the mark “\n/E!” is the not the subject matter of the \naforesaid suit. \n11. \nIn the written statement filed on behalf of the respondent no.1 herein \nin the aforesaid suit, the respondent no.1 has pleaded the registration of the \nmark “\n/E!”, which is the subject matter of the present rectification \npetition. However, the aforesaid pleading in the written statement has not \nbeen raised as a defence to the cause of action pleaded in the plaint in the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:01.12.2022 14:22:17\nSignature Not Verified\n\n--- PAGE 5 ---\n                                    2022/DHC/005230 \nC.O. (COMM.IPD-TM) 243/2022                                                                 Page 5 of 8 \n \naforesaid suit. In view of the aforesaid pleading made in the written \nstatement filed on behalf of the respondent no.1 herein, the petitioner herein \nhas rebutted the same in its replication. Merely because the respondent no.1 \nherein has pleaded in its written statement the fact of registration being \ngranted in its favour in respect of the mark “\n/E!”, would not expand the \nscope of the aforesaid suit. Admittedly, the respondent no.1 has not filed any \nsuit seeking to restrain the petitioner herein from using the said mark. \n12. \nA reading of the written statement filed on behalf of the respondent \nno.1 herein in the aforesaid suit shows that no defence has been raised by the \nrespondent no.1 herein in terms of Section 30(2)(e) of the Trade Marks Act, \n1999. The respondent no.1 has not pleaded that the registered marks of the \nplaintiff are identical to the mark “\n /E!” or nearly resemble each other. \nTherefore, Section 124 (1) (b) of the Trade Marks Act, 1999 is not attracted \nin the present case. It is not the case of the respondent no.1 that the provision \nof Section 124 (1) (a) is attracted in the present case. \n13. \nCounsel for the respondent no.1 has relied upon paragraphs 31 and 32 \nof the judgment in Patel Field Marshal Agencies (supra). The same are set \nout below: \n―31.  Rather, from the résumé of the provisions of the 1958 Act made \nabove, it becomes clear that all questions with regard to the validity \nof a trade mark is required to be decided by the Registrar or the High \nCourt under the 1958 Act or by the Registrar or the IPAB under the \n1999 Act and not by the civil court. The civil court, in fact, is not \nempowered by the Act to decide the said question. Furthermore, the \nAct mandates that the decisions rendered by the prescribed statutory \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:01.12.2022 14:22:17\nSignature Not Verified\n\n--- PAGE 6 ---\n                                    2022/DHC/005230 \nC.O. (COMM.IPD-TM) 243/2022                                                                 Page 6 of 8 \n \nauthority [Registrar/High Court (now IPAB)] will bind the civil court. \nAt the same time, the Act (both old and new) goes on to provide a \ndifferent procedure to govern the exercise of the same jurisdiction in \ntwo different situations. In a case where the issue of invalidity is \nraised or arises independent of a suit, the prescribed statutory \nauthority will be the sole authority to deal with the matter. However, \nin a situation where a suit is pending (whether instituted before or \nafter the filing of a rectification application) the exercise of \njurisdiction by the prescribed statutory authority is contingent on a \nfinding of the civil court as regards the prima facie tenability of the \nplea of invalidity. \n32.  \nConversely, in a situation where the civil court does not find a \ntriable issue on the plea of invalidity the remedy of an aggrieved party \nwould not be to move under Sections 46/56 of the 1958 Act but to \nchallenge the order of the civil court in appeal. This would be \nnecessary to avoid multiple proceedings on the same issue and \nresultant conflict of decisions.‖ \n \n14. \nIn the aforesaid judgment, relied upon by the respondent no.1, the \ndefendants had contested the validity of the plaintiffs’ trade mark “Field \nMarshal” in their written statement and claimed that the same was liable to \nbe rectified by the Trademark Registry. Similarly, in Resilient Innovations \nPvt. Ltd. (supra), in the written statement filed on behalf of the petitioner \ntherein (the defendant in the suit between the parties), it was pleaded that the \nregistration in favour of the plaintiff therein was invalid. Therefore, the \naforesaid cases were covered under Section 124 (1) (a) of the Trade Marks \nAct, 1999, which is not the case of the respondent no.1 here. Hence, the \naforesaid judgments would not come to the aid of the respondent no.1.  \n15. \nIn my considered view, the mark “\n/E!”, which is the subject \nmatter of the present rectification petition, is not the subject matter of \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:01.12.2022 14:22:17\nSignature Not Verified\n\n--- PAGE 7 ---\n                                    2022/DHC/005230 \nC.O. (COMM.IPD-TM) 243/2022                                                                 Page 7 of 8 \n \nCS(COMM)253/2019. In fact, the cause of action for filing the present \nrectification petition was on account of the petitioner coming to know that \nthe respondent no.1 has claimed exclusive proprietary rights over the mark \n“\n/E!”, when the respondent no.1 issued notices of opposition on 11th \nApril, 2018 against the petitioner’s applications for registration of its \ntrademarks.   \n16. \nIn view of the aforesaid discussion, Section 124 of the Trademarks \nAct, 1999 would not apply in the present case. There is no merit in the \npresent application and the same is dismissed. \nI.A. 4832/2022 (of the respondent no.1 seeking extension of time to file \ncounter statement/reply) \n \n17. \n The present application has been filed on behalf of the respondent \nno.1 seeking permission to file counter statement/reply after the issue of \nnon-admissibility of the present rectification petition as pleaded in I.A. \n4831/2022 is decided.  \n18. \nCounsel for the respondent no.1 submits that the present application \nhas been filed bonafide before 60 days period for filing the counter \nstatement/reply had expired. \n19. \nCounsel for the petitioner opposes the present application. He submits \nthat the present application has been filed in a malafide manner, only to \ndelay the proceedings in the present rectification petition. \n20. \nI have heard the counsels for the parties.   \n21. \nIn the facts and circumstances of the case, the respondent no.1 is \npermitted to file its counter statement/reply within four weeks from today \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:01.12.2022 14:22:17\nSignature Not Verified\n\n--- PAGE 8 ---\n                                    2022/DHC/005230 \nC.O. (COMM.IPD-TM) 243/2022                                                                 Page 8 of 8 \n \nsubject to payment of costs of Rs.50,000/- to the petitioner. \nC.O. (COMM.IPD-TM) 243/2022 \n22. \nIn view of the directions above, counter statement/reply be filed by \nthe respondent no.1 within four weeks from today.  \n23. \nRejoinder thereto, if any, be filed within four weeks thereafter. \n24. \nList before the Joint Registrar for completion of pleadings on 02nd \nFebruary, 2023. \n25. \nList before Court on 15th March, 2023. \n \n \nAMIT BANSAL, J \nNOVEMBER 28, 2022 \ndk \n \n \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:01.12.2022 14:22:17\nSignature Not Verified\n"
  },
  "total_pages": 8,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "Here is a summary of the legal document section from PDF:\n\n**Case Header and Parties**\n\n* Case No: 2022/DHC/005230\n* Date of Decision: 28th November, 2022\n* Parties:\n\t+ Petitioner: Bennett, Coleman and Company Limited (through Mr. Hemant Singh, Mrs. Mamta Rani Jha, and Mr. Amitesh Mishra)\n\t+ Respondents: E1 Entertainment Television LLC and Anr. (through Ms. Shwetasree Majumder, Mr. Prithvi Singh, and Ms. Devyani Nath)\n\n**Background**\n\n* Rectification petition filed by Bennett Coleman to rectify trademark registration no. 1252812 in favor of respondent no. 1.\n* Respondent no. 1 seeks dismissal of the petition.\n\n**Arguments**\n\n* Counsel for respondent no. 1 argues that petitioner was aware of the registration since June 2018 and should have framed a preliminary issue on alleged invalidity in a previous suit (CS(COMM) 253/2019).\n* Counsel relies on Supreme Court judgments to argue that the present rectification petition is not maintainable.\n* Counsel for petitioner argues that the impugned trademark registration is not in issue in the previous suit and therefore, the rectification application can be filed.\n\n**Decision**\n\nThe matter was decided by Hon'ble Mr. Justice Amit Bansal (Oral). The court will frame issues in due course of time.\n\n**Source**: Bennet Coleman vs E1.pdf",
      "pdf_source": "9. Bennet Coleman vs E1.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "The document is a court decision from the High Court of Delhi at New Delhi (PDF: 9. Bennet Coleman vs E1.pdf). Here are the key points summarized:\n\n**Case Details**\n\n* Case No.: C.O. (COMM.IPD-TM) 243/2022\n* Petitioner: Bennett, Coleman and Company Limited\n* Respondents: E1 Entertainment Television, LLC and others\n* Coram: HON'BLE MR. JUSTICE AMIT BANSAL\n\n**Proceedings**\n\n* A rectification petition was filed on behalf of the petitioner to remove a trademark registration No. 1252812.\n* The respondent sought dismissal of the rectification petition.\n* Notice was issued on 5th March, 2022, and a reply was submitted.\n\n**Decision Date**: 28th November, 2022\n\nThe decision is yet to be provided in the given snippet, but it can be inferred that the court was considering the rectification petition filed by the petitioner.\n\n**Source**: The PDF file \"9. Bennet Coleman vs E1.pdf\" (page 1 of 8)",
          "content": "2022/DHC/005230 \nC.O. (COMM.IPD-TM) 243/2022                                                                 Page 1 of 8 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n \n% \n \n \n \n                Date of decision: 28th November, 2022. \n \n+  \n \n \n \nC.O. (COMM.IPD-TM) 243/2022  \n \n \nBENNETT, COLEMAN AND COMPANY  \nLIMITED  \n \n \n \n \n \n..... Petitioner \nThrough: \nMr.Hemant Singh, Mrs.Mamta Rani \nJha \nand \nMr.Amitesh \nMishra, \nAdvocates. \n \n \n \n \nversus \n \n \nE1 ENTERTAINMENT TELEVISION, LLC AND  \nANR.  \n \n \n \n \n \n \n..... Respondents \nThrough: \nMs.Shwetasree Majumder, Mr.Prithvi \nSingh \nand \nMs.Devyani \nNath, \nAdvocates. \n \nMs.Anushkaa Arora, Mr.Sahaj Garg, \nSenior Panel Counsels (UOI) and \nMr.Aditya Sharan, Advocates for R-2 \n \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nAMIT BANSAL, J. (Oral) \n \nI.A. 4831/2022(of the respondent no.1 u/s 151 of CPC) \n1. \nThe present rectification petition has been filed on behalf of the \npetitioner for rectification of the trademark register qua trademark \nregistration no.1252812, which is registered in class 99 (classes 38 and 41) \nin favour of the respondent no.1 since 2nd December, 2003.   \n2. \nThe present application has been filed on behalf of the respondent \nno.1 seeking dismissal of the aforesaid rectification petition.  \n3. \nNotice in this application was issued on 5th March, 2022 and reply has \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:01.12.2022 14:22:17\nSignature Not Verified",
          "pdf_source": "9. Bennet Coleman vs E1.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "Here is a summary of page 2 from the PDF \"Bennet Coleman vs E1.pdf\":\n\nThe respondent's counsel submits that the petitioner knew about the registration in favor of respondent no.1 on June 6, 2018, and despite filing a suit (CS(COMM) 253/2019) on May 10, 2019, took no steps to frame a preliminary issue regarding the invalidity of respondent no.1's trademark.\n\nThe counsel cites two judgments:\n\n* Patel Field Marshal Agencies v. P.M. Diesels Limited, (2018) 2 SCC 112\n* Resilient Innovations Pvt. Ltd. v. Phonepe Private Limited & Anr., (2021) 88 PTC 610\n\nto argue that the present rectification petition is not maintainable.\n\nThe counsel also relies on pleadings from the aforesaid suit to submit that the mark in respect of which rectification is sought was subject matter of the suit, and therefore a preliminary issue would be required under Section 124 read with Section 30(2)(e) of the Trade Marks Act, 1999.\n\nSource: Bennet Coleman vs E1.pdf (PDF source not provided in the original prompt).",
          "content": "2022/DHC/005230 \nC.O. (COMM.IPD-TM) 243/2022                                                                 Page 2 of 8 \n \nbeen filed on behalf of the respondent no.1. Rejoinder thereto has also been \nfiled on behalf of the respondent no.1.  \n4. \nCounsel for the respondent no.1 submits that the petitioner was aware \nof the registration in favour of the respondent no.1 as far back as on 6th June, \n2018 and despite a suit, being CS(COMM) 253/2019, having been filed by \nthe petitioner against the respondent no.1 on 10th May, 2019, the petitioner \ntook no steps to have a preliminary issue framed on the alleged invalidity of \nthe respondent no.1’s trademark. Therefore, in view of the judgment of the \nSupreme Court in Patel Field Marshal Agencies and Anr. v. P.M. Diesels \nLimited and Ors., (2018) 2 SCC 112, followed by a Coordinate Bench of \nthis Court in Resilient Innovations Pvt. Ltd. v. Phonepe Private Limited & \nAnr., (2021) 88 PTC 610, the present rectification petition filed on behalf of \nthe petitioner is not maintainable.  \n5. \nCounsel for the respondent no.1 has placed reliance on the pleadings \nin the aforesaid suit to submit that the mark in respect of which rectification \nis sought by the petitioner herein, was subject matter of the aforesaid suit. \nTherefore, in terms of Section 124 read with Section 30(2)(e) of the Trade \nMarks Act, 1999, a preliminary issue would be required to be framed in the \naforesaid suit before a rectification application can be filed.  \n6. \nPer contra, the counsel for the petitioner submits that the impugned \ntrademark registration, which is the subject matter of the rectification \npetition, is not in issue in CS(COMM) 253/2019. In the said suit, the \npetitioner has claimed proprietary rights over the trademark “NOW” and \n“NOW” formative marks including “ENOW”.  Reference is this regard has \nbeen \nmade \nto \nparagraphs \n19, \n20 \nand \n21 \nof \nthe \nplaint \nin \nCS(COMM)253/2019. Hence, the petitioner herein has sought injunction \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:01.12.2022 14:22:17\nSignature Not Verified",
          "pdf_source": "9. Bennet Coleman vs E1.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0006",
      "start_index": 3,
      "end_index": 4,
      "summary": "**Case Summary**\n\nThe case pertains to a trademark dispute between Bennett Coleman and Company Limited (petitioner) and E1 (respondent no.1). The dispute is ongoing in CS(COMM) 253/2019, a civil suit initiated by the petitioner.\n\n**Background and Facts:**\n\n* In 2020, E1 claimed rights over the marks \"E! NOW\" and \"E NEWS NOW\" in its opposition to trade mark application No. 3679905.\n* The petitioner claims deceptively similar usage of these marks, seeking a permanent injunction against their use.\n* There is no pleading about the mark \"/E!\" in the plaint.\n\n**Arguments:**\n\n* Respondent E1 pleaded registration of the mark \"/E!\" in its written statement but did not raise it as a defense to the cause of action in CS(COMM) 253/2019.\n* The petitioner submits that judgments relied upon by respondent no.1 are not applicable due to the distinct facts of this case.\n\n**Section 30(2)(e) and Section 124(1) of the Trade Marks Act, 1999:**\n\n* These sections refer to limits on the effect of registered trademarks and the stay of proceedings where the validity of registration is questioned.\n\n**Case Status:**\n\n* The case was considered by the High Court of Delhi at New Delhi on November 28, 2022 (C.O. (COMM.IPD-TM) 243/2022).\n* The court has framed issues regarding the prima facie tenability of E1's plea about the invalidity of Bennett Coleman's trade mark.\n\n**Source:** Section from PDF file \"9. Bennet Coleman vs E1.pdf\".",
      "pdf_source": "9. Bennet Coleman vs E1.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "Here is a summary of page 3 from the PDF:\n\n**Case Details:** C.O. (COMM.IPD-TM) 243/2022\n**Reference Number:** 2022/DHC/005230\n\n**Key Points:**\n\n* The petitioner Bennett, Coleman and Company Limited argues against the respondent no.1 using trademarks \"E! NOW\" and \"E! NEWS NOW\".\n* The court is referred to Section 30(2)(e) and Section 124(1) of the Trade Marks Act, 1999.\n* Section 124(1) outlines when a suit for infringement can be stayed if the validity of registration is questioned.\n\n**Relevant Statutes:**\n\n* Section 30(2)(e): Registered trade mark not infringed where use is one of identical or nearly resembling trademarks registered under the Act.\n* Section 124(1): Stay of proceedings where validity of registration is questioned, including rectification of register before the Registrar or Appellate Board.\n\n**PDF Source:** 9. Bennet Coleman vs E1.pdf",
          "content": "2022/DHC/005230 \nC.O. (COMM.IPD-TM) 243/2022                                                                 Page 3 of 8 \n \nagainst the respondent no.1 using the trademarks “E! NOW” and “E! NEWS \nNOW”. Therefore, it is submitted that the judgments relied upon by the \nrespondent no.1 are not applicable in the facts of the present case. \n7. \nI have heard the counsels for the parties. \n8. \nSection 30(2)(e) and Section 124(1) of the Trade Marks Act, 1999 are \nset out hereunder:  \n―30. Limits on effect of registered trade  mark. –  \n 2… A registered trade mark is not infringed where— \n(e) \nthe use of a registered trade mark, being one of two or more \ntrade marks registered under this Act which are identical or nearly \nresemble each other, in exercise of the right to the use of that trade \nmark given by registration under this Act.‖ \n… \n―124. Stay of proceedings where the validity of registration of the \ntrade mark is questioned, etc.— \n(1) Where in any suit for infringement of a trade mark— \n(a) the defendant pleads that registration of the plaintiff‘s trade mark \nis invalid; or \n(b) the defendant raises a defence under clause (e) of sub-section (2) \nof section 30 and the plaintiff pleads the invalidity of registration of \nthe defendant’s trade mark,  \nthe court trying the suit (hereinafter referred to as the court), shall,— \n(i) if any proceedings for rectification of the register in relation to the \nplaintiff‘s or defendant‘s trade mark are pending before the Registrar \nor the Appellate Board, stay the suit pending the final disposal of such \nproceedings; \n(ii) if no such proceedings are pending and the court is satisfied that \nthe plea regarding the invalidity of the registration of the plaintiff’s \nor defendant’s trade mark is prima facie tenable, raise an issue \nregarding the same and adjourn the case for a period of three \nmonths from the date of the framing of the issue in order to enable \nthe party concerned to apply to the Appellate Board for rectification \nof the register.‖ \n \n9. \nTo appreciate the rival submissions, a reference may be made to the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:01.12.2022 14:22:17\nSignature Not Verified",
          "pdf_source": "9. Bennet Coleman vs E1.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "Here is a summary of page 4 from the provided PDF:\n\n**Case:** C.O. (COMM.IPD-TM) 243/2022\n\n**Petitioner:** Bennett Coleman and Company Limited\n\n**Respondent No.1:** [Not mentioned]\n\nThe court is analyzing the relevant paragraphs from the plaint in CS(COMM) 253/2019.\n\nKey excerpts:\n\n* The respondent No.1 claimed its right over the mark \"E! NEWS NOW\" on 10.10.2018, for the first time.\n* The plaintiff's cause of action was based on the respondent ascertaining rights over the marks \"E! NOW\" and \"E NEWS NOW\".\n* The plaint sought a decree of permanent injunction against using the channel/domain \"E! NOW\" and \"E! NEWS NOW\", which is deceptively similar to the petitioner's mark \"E NOW\".\n\n**PDF Source:** 9. Bennet Coleman vs E1.pdf",
          "content": "2022/DHC/005230 \nC.O. (COMM.IPD-TM) 243/2022                                                                 Page 4 of 8 \n \nrelevant paragraphs of the plaint in CS(COMM) 253/2019: \n―3. \nThat the alleged usage of the marks ‗E! NOW‘ and ‗E News \nNOW‘ is a spurious and malafide besides being an afterthought done \nsimply to defeat the rights vested by the Plaintiff in using the mark \nand Logo of ‗NOW‘. \n4… \n(iv) \nThat on 10.10.2018, the Defendant Company filed the evidence \nin support of opposition under Rule 45 in Trade mark Application No. \n3679905 and for the first time claimed its right over the mark E! \nNEWS NOW only and not E Now.‖ \n \n10. \nFrom a reading of the plaint as a whole it emerges that the cause of \naction for filing the aforesaid suit by the petitioner herein was on account of \nrespondent no.1 ascertaining rights over the marks “E! NOW” and “E \nNEWS NOW”. In the prayer clause, a decree of permanent injunction is \nsought against the respondent no.1 herein from using the channel/domain \n“E! NOW” and “E! NEWS NOW”, which is deceptively similar to \npetitioner’s mark “E NOW”. There is no pleading in the plaint with regard \nto the mark “\n/E!”  and no injunction has been sought against the said \nmark. Therefore, the mark “\n/E!” is the not the subject matter of the \naforesaid suit. \n11. \nIn the written statement filed on behalf of the respondent no.1 herein \nin the aforesaid suit, the respondent no.1 has pleaded the registration of the \nmark “\n/E!”, which is the subject matter of the present rectification \npetition. However, the aforesaid pleading in the written statement has not \nbeen raised as a defence to the cause of action pleaded in the plaint in the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:01.12.2022 14:22:17\nSignature Not Verified",
          "pdf_source": "9. Bennet Coleman vs E1.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0009",
      "start_index": 5,
      "end_index": 6,
      "summary": "Here's a summary of the legal document section from Bennett Coleman vs E1.pdf:\n\n**Case Details**\n\n* Case: Bennet Coleman & Co. Limited v/s Unknown Respondent (2022/DHC/005230)\n* Date: November 28, 2022\n* Court: Delhi High Court\n\n**Arguments and Facts**\n\n* Petitioner (Bennett Coleman) claims that the respondent's mark \" E!\" is identical to their registered mark.\n* Respondent failed to plead under Section 30(2)(e) of the Trade Marks Act, 1999, which would allow them to raise a defense.\n* Respondent did not file a separate suit seeking to restrain Bennett Coleman from using the mark.\n\n**Section 124 (1) (b) Not Applicable**\n\n* The court notes that Section 124 (1) (b) of the Trade Marks Act, 1999 is not attracted in this case as respondent has not pleaded that the registered marks are identical or nearly resemble each other.\n\n**Comparison to Relevant Judgments**\n\n* Counsel for respondent relied on Patel Field Marshal Agencies and Resilient Innovations Pvt. Ltd., but these cases were found to be distinguishable from the present case.\n\n**Decision**\n\n* The court held that respondent's failure to plead under Section 30(2)(e) of the Trade Marks Act, 1999 and their non-filing of a separate suit renders them liable for costs.\n\n(Note: This summary is kept under 300 words as per your request. Please let me know if you need any further clarification or details.)",
      "pdf_source": "9. Bennet Coleman vs E1.pdf",
      "nodes": [
        {
          "title": "Page 5",
          "node_id": "0007",
          "start_index": 5,
          "end_index": 5,
          "summary": "Here is a summary of page 5 from the provided PDF (9. Bennet Coleman vs E1.pdf):\n\n**Case Details**\n\nCourt: High Court of Delhi\nCase Number: 2022/DHC/005230\nSuit Number: C.O. (COMM.IPD-TM) 243/2022\n\n**Summary**\n\nThe petitioner, Bennett Coleman and Company Limited, has filed a reply to the written statement of respondent no.1, which pleaded that the registration of the mark \"E!\" was granted in their favor. The petitioner rejected this claim, stating that it does not expand the scope of the suit.\n\n**Key Points**\n\n* Respondent no.1 has not filed any suit to restrain the petitioner from using the said mark.\n* No defense has been raised under Section 30(2)(e) of the Trade Marks Act, 1999 by respondent no.1.\n* Section 124 (1) (b) of the Trade Marks Act, 1999 is not attracted in the present case.\n\n**PDF Source**: 9. Bennet Coleman vs E1.pdf",
          "content": "2022/DHC/005230 \nC.O. (COMM.IPD-TM) 243/2022                                                                 Page 5 of 8 \n \naforesaid suit. In view of the aforesaid pleading made in the written \nstatement filed on behalf of the respondent no.1 herein, the petitioner herein \nhas rebutted the same in its replication. Merely because the respondent no.1 \nherein has pleaded in its written statement the fact of registration being \ngranted in its favour in respect of the mark “\n/E!”, would not expand the \nscope of the aforesaid suit. Admittedly, the respondent no.1 has not filed any \nsuit seeking to restrain the petitioner herein from using the said mark. \n12. \nA reading of the written statement filed on behalf of the respondent \nno.1 herein in the aforesaid suit shows that no defence has been raised by the \nrespondent no.1 herein in terms of Section 30(2)(e) of the Trade Marks Act, \n1999. The respondent no.1 has not pleaded that the registered marks of the \nplaintiff are identical to the mark “\n /E!” or nearly resemble each other. \nTherefore, Section 124 (1) (b) of the Trade Marks Act, 1999 is not attracted \nin the present case. It is not the case of the respondent no.1 that the provision \nof Section 124 (1) (a) is attracted in the present case. \n13. \nCounsel for the respondent no.1 has relied upon paragraphs 31 and 32 \nof the judgment in Patel Field Marshal Agencies (supra). The same are set \nout below: \n―31.  Rather, from the résumé of the provisions of the 1958 Act made \nabove, it becomes clear that all questions with regard to the validity \nof a trade mark is required to be decided by the Registrar or the High \nCourt under the 1958 Act or by the Registrar or the IPAB under the \n1999 Act and not by the civil court. The civil court, in fact, is not \nempowered by the Act to decide the said question. Furthermore, the \nAct mandates that the decisions rendered by the prescribed statutory \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:01.12.2022 14:22:17\nSignature Not Verified",
          "pdf_source": "9. Bennet Coleman vs E1.pdf",
          "nodes": []
        },
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "Here is a summary of page 6 from the PDF \"9. Bennet Coleman vs E1.pdf\":\n\nThe court discusses the jurisdiction of the civil court versus the Trade Marks Registry in cases involving invalid trade marks. According to Section 46/56 of the 1958 Act, the registry's decision does not bind a civil court.\n\nIn a situation where the issue of invalidity is raised or arises independently of a suit, the registry has sole authority to deal with the matter. However, if a suit is pending, the registry's jurisdiction is contingent on a finding by the civil court regarding the prima facie tenability of the plea of invalidity.\n\nThe court refers to a judgment where defendants contested the validity of a trade mark in their written statement and moved for rectification before the registry. However, this case is distinguished from the respondent's situation, which does not involve a plea of invalidity raised in a suit.\n\nSource: 2022/DHC/005230 C.O. (COMM.IPD-TM) 243/2022",
          "content": "2022/DHC/005230 \nC.O. (COMM.IPD-TM) 243/2022                                                                 Page 6 of 8 \n \nauthority [Registrar/High Court (now IPAB)] will bind the civil court. \nAt the same time, the Act (both old and new) goes on to provide a \ndifferent procedure to govern the exercise of the same jurisdiction in \ntwo different situations. In a case where the issue of invalidity is \nraised or arises independent of a suit, the prescribed statutory \nauthority will be the sole authority to deal with the matter. However, \nin a situation where a suit is pending (whether instituted before or \nafter the filing of a rectification application) the exercise of \njurisdiction by the prescribed statutory authority is contingent on a \nfinding of the civil court as regards the prima facie tenability of the \nplea of invalidity. \n32.  \nConversely, in a situation where the civil court does not find a \ntriable issue on the plea of invalidity the remedy of an aggrieved party \nwould not be to move under Sections 46/56 of the 1958 Act but to \nchallenge the order of the civil court in appeal. This would be \nnecessary to avoid multiple proceedings on the same issue and \nresultant conflict of decisions.‖ \n \n14. \nIn the aforesaid judgment, relied upon by the respondent no.1, the \ndefendants had contested the validity of the plaintiffs’ trade mark “Field \nMarshal” in their written statement and claimed that the same was liable to \nbe rectified by the Trademark Registry. Similarly, in Resilient Innovations \nPvt. Ltd. (supra), in the written statement filed on behalf of the petitioner \ntherein (the defendant in the suit between the parties), it was pleaded that the \nregistration in favour of the plaintiff therein was invalid. Therefore, the \naforesaid cases were covered under Section 124 (1) (a) of the Trade Marks \nAct, 1999, which is not the case of the respondent no.1 here. Hence, the \naforesaid judgments would not come to the aid of the respondent no.1.  \n15. \nIn my considered view, the mark “\n/E!”, which is the subject \nmatter of the present rectification petition, is not the subject matter of \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:01.12.2022 14:22:17\nSignature Not Verified",
          "pdf_source": "9. Bennet Coleman vs E1.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0012",
      "start_index": 7,
      "end_index": 8,
      "summary": "**Summary of Court Decision in Bennett Coleman vs E1**\n\nThe summary is based on Section \"Court Decision\" from PDF: 9. Bennet Coleman vs E1.pdf.\n\n**Case Details:**\n\n* Case Number: 2022/DHC/005230\n* Date of Decision: November 28, 2022\n* Court: High Court of Delhi at New Delhi\n* Parties:\n\t+ Bennett Coleman and Company Limited (Petitioner)\n\t+ Respondent No.1 (E1)\n\n**Background:**\n\nThe petitioner company objected to the respondent's claim of exclusive proprietary rights over the mark \"/E!\" while filing trademark application. The respondent opposed the petition, leading to various applications.\n\n**Legal Proceedings:**\n\n* Rectification Petition CS(COMM)253/2019 was filed.\n* Respondent No.1 (E1) filed an application for extension of time to file a counter statement/reply in I.A. 4832/2022.\n\n**Decisions:**\n\n* Section 124 of the Trademarks Act, 1999 did not apply in this case, and there was no merit in the rectification petition.\n* The respondent No.1's application seeking permission to file a counter statement/reply after the issue of non-admissibility of the rectification petition was allowed, subject to payment of costs of Rs.50,000/- to the petitioner.\n* Timeline for completion of pleadings:\n\t+ Counter-statement/reply by Respondent No.1 within four weeks from November 28, 2022\n\t+ Rejoinder thereto, if any, within four weeks thereafter\n\t+ List before Joint Registrar on February 2, 2023\n\t+ List before Court on March 15, 2023\n\n**Significance:**\n\nThe case involved disputes over trademark rights and exclusivity. The court examined various provisions under the Trademarks Act, 1999 and made a decision based on the merits of",
      "pdf_source": "9. Bennet Coleman vs E1.pdf",
      "nodes": [
        {
          "title": "Page 7",
          "node_id": "0010",
          "start_index": 7,
          "end_index": 7,
          "summary": "Based on page 7 of the PDF \"9. Bennet Coleman vs E1.pdf\" (2022/DHC/005230 C.O. (COMM.IPD-TM) 243/2022), here is a summary of the relevant legal facts, proceedings, arguments, decisions, dates, names, and amounts:\n\n**Fact**: Respondent no.1 claimed exclusive proprietary rights over the mark \"/E!\" in notices issued on April 11, 2018.\n\n**Rectification Petition**: The cause of action for filing the present rectification petition was due to petitioner's opposition by respondent no.1.\n\n**Section 124 Trademarks Act, 1999**: Inapplicable in this case.\n\n**Decision**: The present application seeking rectification is dismissed with no merit.\n\n**I.A. 4832/2022**: Respondent no.1 seeks extension of time to file counter statement/reply after the issue of non-admissibility of the present rectification petition is decided.\n\n**Argument**: Counsel for respondent no.1 submits that the application was filed bonafide before the expiration of the 60-day period for filing the counter statement/reply.",
          "content": "2022/DHC/005230 \nC.O. (COMM.IPD-TM) 243/2022                                                                 Page 7 of 8 \n \nCS(COMM)253/2019. In fact, the cause of action for filing the present \nrectification petition was on account of the petitioner coming to know that \nthe respondent no.1 has claimed exclusive proprietary rights over the mark \n“\n/E!”, when the respondent no.1 issued notices of opposition on 11th \nApril, 2018 against the petitioner’s applications for registration of its \ntrademarks.   \n16. \nIn view of the aforesaid discussion, Section 124 of the Trademarks \nAct, 1999 would not apply in the present case. There is no merit in the \npresent application and the same is dismissed. \nI.A. 4832/2022 (of the respondent no.1 seeking extension of time to file \ncounter statement/reply) \n \n17. \n The present application has been filed on behalf of the respondent \nno.1 seeking permission to file counter statement/reply after the issue of \nnon-admissibility of the present rectification petition as pleaded in I.A. \n4831/2022 is decided.  \n18. \nCounsel for the respondent no.1 submits that the present application \nhas been filed bonafide before 60 days period for filing the counter \nstatement/reply had expired. \n19. \nCounsel for the petitioner opposes the present application. He submits \nthat the present application has been filed in a malafide manner, only to \ndelay the proceedings in the present rectification petition. \n20. \nI have heard the counsels for the parties.   \n21. \nIn the facts and circumstances of the case, the respondent no.1 is \npermitted to file its counter statement/reply within four weeks from today \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:01.12.2022 14:22:17\nSignature Not Verified",
          "pdf_source": "9. Bennet Coleman vs E1.pdf",
          "nodes": []
        },
        {
          "title": "Page 8",
          "node_id": "0011",
          "start_index": 8,
          "end_index": 8,
          "summary": "**Page 8 Summary**\n\nSource: Bennet Coleman vs El (PDF: 9. Bennet Coleman vs E1.pdf)\n\nOn page 8, the Court issues directions regarding further proceedings in the case:\n\n* The respondent is directed to file a counter statement/reply within four weeks from today.\n* Any rejoinder by the petitioner must be filed within four weeks of the receipt of the response.\n* The matter is listed before the Joint Registrar on February 2, 2023 for completion of pleadings.\n* The case will be listed before the Court on March 15, 2023.\n\nAdditionally, a cost of ₹50,000 to the petitioner has been prescribed.\n\n**Legal Facts and Details**\n\n* Case number: CO (COMM.IPD-TM) 243/2022\n* Date of decision: November 28, 2022\n* Cost awarded: ₹50,000\n* Next listing dates:\n\t+ February 2, 2023 (before Joint Registrar)\n\t+ March 15, 2023 (before Court)",
          "content": "2022/DHC/005230 \nC.O. (COMM.IPD-TM) 243/2022                                                                 Page 8 of 8 \n \nsubject to payment of costs of Rs.50,000/- to the petitioner. \nC.O. (COMM.IPD-TM) 243/2022 \n22. \nIn view of the directions above, counter statement/reply be filed by \nthe respondent no.1 within four weeks from today.  \n23. \nRejoinder thereto, if any, be filed within four weeks thereafter. \n24. \nList before the Joint Registrar for completion of pleadings on 02nd \nFebruary, 2023. \n25. \nList before Court on 15th March, 2023. \n \n \nAMIT BANSAL, J \nNOVEMBER 28, 2022 \ndk \n \n \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:01.12.2022 14:22:17\nSignature Not Verified",
          "pdf_source": "9. Bennet Coleman vs E1.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-16T11:45:24.241456",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}