{
  "doc_name": "1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD",
  "pdf_source": "1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf",
  "metadata": {
    "document_name": "1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD",
    "source_pdf": "1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf",
    "judges": [
      "AMIT BANSAL"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "835/2018",
      "835/2018",
      "835/2018",
      "835/2018",
      "835/2018",
      "835/2018",
      "835/2018",
      "835/2018",
      "835/2018",
      "12048/2019",
      "12049/2019",
      "3096/2020"
    ],
    "dhc_numbers": [
      "2022/DHC/005588",
      "2022/DHC/005588",
      "2022/DHC/005588",
      "2022/DHC/005588",
      "2022/DHC/005588",
      "2022/DHC/005588",
      "2022/DHC/005588"
    ],
    "ia_numbers": [],
    "decision_date": "13 December, 2022",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      "Western Digital Technologies, Inc"
    ],
    "defendants": [
      "SYT Solutions Pvt. Ltd."
    ],
    "appellants": [],
    "respondents": [],
    "plaintiff_advocates": [
      "Mr. Prithvi Singh",
      "Ms. Devyani Nath"
    ],
    "defendant_advocates": [
      "Mr. Nakul Mohta",
      "Mr. Ajay Kumar Pandey",
      "Mr. Vikas Kumar Sharma"
    ],
    "appellant_advocates": [],
    "respondent_advocates": [],
    "damages_claimed": "1,00,01,000",
    "damages_awarded": null,
    "key_issues": [
      "Impleadment of the Commissioner of Customs as a proper party in the present suit under Order 1 Rule 10 of the Code of Civil Procedure.",
      "Infringement of intellectual property rights by the defendant under the Custom Intellectual Property Rights (Imported Goods) Enforcement Rules, 2007.",
      "Seizure of goods by the Customs Authorities under Section 110(1) of the Customs Act, 1962, and liability for confiscation under Section 111(d).",
      "Violation of paragraph 2.3 of the Foreign Trade Policy, 2015-20 by the defendant.",
      "Necessity and propriety of the Commissioner of Customs as a party to the suit for adjudication of the present dispute.",
      "Right of the plaintiff to choose the persons against whom they wish to litigate as dominus litis.",
      "Applicability of Rule 11 of the Customs Rules regarding confiscation and destruction of infringing goods.",
      "Effect of the pendency of the present suit on the proceedings under the IPR Enforcement Rules.",
      "Whether the Commissioner of Customs can proceed under the IPR Enforcement Rules during the pendency of the present suit.",
      "Interplay between the Customs Act, 1962, and the Code of Civil Procedure, 1908, in relation to impleadment and intellectual property rights."
    ],
    "decision_summary": "**Background:**\nThe case, CS(COMM) 835/2018, was filed in the High Court of Delhi at New Delhi, with Western Digital Technologies, Inc. and Anr. as the plaintiffs, and Syt Solutions Pvt. Ltd. as the defendant. The plaintiffs alleged that the defendant had infringed on their intellectual property rights by importing goods that violated the Custom Intellectual Property Rights (Imported Goods) Enforcement Rules, 2007. The defendant had imported 9,644 pieces of goods, which were seized by the Commissioner of Customs (General), Air Cargo Complex, Sahar, Andheri (East), Mumbai, under Section 110(1) of the Customs Act, 1962.\n\n**Legal Issues:**\nThe Commissioner of Customs (General) filed an application, I.A. 3096/2020, seeking impleadment in the present suit as a proper party. The application was based on the grounds that the imported goods had infringed on the plaintiff's intellectual property rights and were liable for confiscation under Section 111(d) of the Customs Act, 1962. The plaintiffs and the defendant opposed the application, arguing that the applicant was neither a necessary nor a proper party for the adjudication of the present suit.\n\n**Arguments:**\nThe plaintiffs argued that the present suit had been filed on the basis of infringement of their trademarks by the defendant, and therefore, the applicant was not a necessary or proper party. They also pointed out that the applicant had asked the plaintiff about its willingness to join the proceedings, and since the plaintiff had chosen to file the present suit for injunction, the applicant could not proceed under the IPR Enforcement Rules during the pendency of the present suit.\n\nThe defendant also opposed the application, while the applicant argued that it had a legitimate interest in the proceedings as the goods had been seized and were liable for confiscation.\n\n**Court Findings:**\nThe court, citing the Supreme Court's decision in Mumbai International Airport (P) Ltd. v. Regency Convention Centre & Hotels (P) Ltd. (2010), observed that the plaintiff in a suit has the right to choose the persons against whom they wish to litigate and cannot be compelled to sue a person against whom they do not seek any relief.\n\nThe court also referred to the Supreme Court's decision in Kasturi v. Iyyamperumal (2005), which laid down the tests to determine who is a necessary party and a proper party in a suit. The court applied these tests to the present case and found that the applicant did not meet the criteria for a necessary or proper party.\n\n**Decision:**\nThe court, after hearing the counsels for the parties, dismissed the application, I.A. 3096/2020, filed by the Commissioner of Customs (General) seeking impleadment in the present suit as a proper party. The court held that the applicant was neither a necessary nor a proper party for the adjudication of the present suit, as the plaintiff had chosen to file the present suit for injunction, and the applicant could not proceed under the IPR Enforcement Rules during the pendency of the present suit.\n\nThe decision was made by Hon'ble Mr. Justice Amit Bansal, with the digitally signed judgment dated December 13, 2022.",
    "legal_precedents": [
      "(2005) 6 SCC 733",
      "In Kasturi Iyyamperumal",
      "(2012) 8 SCC 384",
      "(2010) 7 SCC 417"
    ],
    "full_text": "\n--- PAGE 1 ---\n2022/DHC/005588 \n \nCS(COMM) 835/2018                                                                                                      Page 1 of 7 \n \n$~7 \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n \n% \n \n \n \n                  Date of decision: 13th December, 2022 \n \n+  \nCS(COMM) 835/2018, I.A. 12048/2019(O-XI R-1 of CPC), I.A. \n12049/2019(for condonation of delay of 203 days in re-filing the \napplication) \n \n \nWESTERN DIGITAL TECHNOLOGIES,  \nINC & ANR \n \n \n \n \n \n..... Plaintiffs \nThrough: \nMr. Prithvi Singh and Ms. Devyani \nNath, Advocates \n \n \n \n \n \nversus \n \n \nSYT SOLUTIONS PVT. LTD.  \n \n \n..... Defendant \n \n \n \n \nThrough: \nMr. Nakul Mohta, Advocate \nMr. Ajay Kumar Pandey, Senior \nPanel \nCounsel \nfor \nthe \napplicant/custom \nin \nIA.3096/2020 \nwith Mr. Vikas Kumar Sharma, \nAdvocate \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nAMIT BANSAL, J. (Oral) \n \n \nI.A. 3096/2020(O.I R.10 of CPC) \n1. \nThe present application has been filed on behalf of Commissioner of \nCustoms (General), Air Cargo Complex, Sahar, Andheri (East), Mumbai – \n400009 seeking impleadment in the present suit as a proper party. \n2. \nThe application is premised on the infringement of the intellectual \nproperty rights of the plaintiff in terms of the Custom Intellectual Property \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.12.2022 12:11:23\nSignature Not Verified\n\n--- PAGE 2 ---\n2022/DHC/005588 \n \nCS(COMM) 835/2018                                                                                                      Page 2 of 7 \n \nRights (Imported Goods) Enforcement Rules, 2007 (hereinafter referred to \nas „IPR Enforcement Rules‟), on account of the import of goods by the \ndefendant. The applicant had passed a seizure memo dated 2nd May, 2018 in \nrespect of 9,644pieces of the goods imported by the defendant under Section \n110(1) of the Customs Act, 1962. It is also the case of the applicant that \ngoods which have been imported into India are in violation of paragraph 2.3 \nof the Foreign Trade Policy, 2015-20 and are therefore, liable for \nconfiscation under Section 111(d) of the Customs Act, 1962. \n3. \nBoth the plaintiff and the defendants have opposed the present \napplication. Plaintiffs have filed reply in opposition to the aforesaid \napplication, wherein it stated that the present suit has been filed on the basis \nof infringement of the plaintiffs‟ trademarks by the defendant and therefore, \nthe applicant is neither a necessary and nor a proper party for the \nadjudication of the present suit. The applicant, vide its letter dated 24th April, \n2018, asked the plaintiff of its willingness to join the proceedings, failing \nwhich the applicant would release the seized goods. Rule 11 of the Customs \nRules states that if the infringing goods have been confiscated and no legal \nproceedings are pending in relation to such goods, the applicant may \nproceed to destroy the goods after obtaining „No-Objection Certificate‟ from \nthe intellectual property right holder. Since the plaintiff has chosen to file \nthe present suit for injunction, the applicant cannot proceed under the IPR \nEnforcement Rules during the pendency of the present suit. Therefore, the \napplicant is neither a necessary party nor a proper party. \n4. \nI have heard the counsels for the parties. \n5. \nThe \nSupreme \nCourt \nin Mumbai \nInternational \nAirport \n(P) \nLtd. v. Regency Convention Centre & Hotels (P) Ltd., (2010) 7 SCC 417, \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.12.2022 12:11:23\nSignature Not Verified\n\n--- PAGE 3 ---\n2022/DHC/005588 \n \nCS(COMM) 835/2018                                                                                                      Page 3 of 7 \n \nhas observed that the general rule with regard to impleadment of parties is \nthat the plaintiff in a suit, being dominus litis, may choose the persons \nagainst whom he wishes to litigate and cannot be compelled to sue a person \nagainst whom he does not seek any relief. \n6. \nIn Kasturi v. Iyyamperumal, (2005) 6 SCC 733, the Supreme Court \nlaid down the tests to determine as to who is a necessary party and proper \nparty in a suit. The relevant portions are set out below: \n“7*.  In our view, a bare reading of this provision, namely, \nsecond part of Order 1 Rule 10 sub-rule (2) CPC would \nclearly show that the necessary parties in a suit for specific \nperformance of a contract for sale are the parties to the \ncontract or if they are dead, their legal representatives as also \na person who had purchased the contracted property from the \nvendor. In equity as well as in law, the contract constitutes \nrights and also regulates the liabilities of the parties. A \npurchaser is a necessary party as he would be affected if he \nhad purchased with or without notice of the contract, but a \nperson who claims adversely to the claim of a vendor is, \nhowever, not a necessary party. From the above, it is now \nclear that two tests are to be satisfied for determining the \nquestion who is a necessary party. Tests are — (1) there must \nbe a right to some relief against such party in respect of the \ncontroversies involved in the proceedings; (2) no effective \ndecree can be passed in the absence of such party. \n… \n11. As noted hereinearlier, two tests are required to be \nsatisfied to determine the question who is a necessary party, \nlet us now consider who is a proper party in a suit for specific \nperformance of a contract for sale. For deciding the question \nwho is a proper party in a suit for specific performance the \nguiding principle is that the presence of such a party is \nnecessary to adjudicate the controversies involved in the suit \nfor specific performance of the contract for sale. Thus, the \nquestion is to be decided keeping in mind the scope of the \nsuit. …” \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.12.2022 12:11:23\nSignature Not Verified\n\n--- PAGE 4 ---\n2022/DHC/005588 \n \nCS(COMM) 835/2018                                                                                                      Page 4 of 7 \n \n7. \nIn Vidur Impex & Traders (P) Ltd. v. Tosh Apartments (P) Ltd., \n(2012) 8 SCC 384, the Supreme Court has succinctly laid down the \nprinciples to be followed while deciding an application filed under Order 1 \nRule 10(2) of the CPC. Paragraph 36 in this regard is set out below : \n“36. Though there is apparent conflict in the observations \nmade in some of the aforementioned judgments, the broad \nprinciples which should govern disposal of an application for \nimpleadment are : \n \n1. The court can, at any stage of the proceedings, either \non an application made by the parties or otherwise, \ndirect impleadment of any person as party, who ought \nto have been joined as plaintiff or defendant or whose \npresence before the court is necessary for effective and \ncomplete adjudication of the issues involved in the suit. \n \n2. A necessary party is the person who ought to be \njoined as party to the suit and in whose absence an \neffective decree cannot be passed by the court. \n \n3. A proper party is a person whose presence would \nenable the court to completely, effectively and \nproperly adjudicate upon all matters and issues, \nthough he may not be a person in favour of or against \nwhom a decree is to be made. \n \n4. 4. If a person is not found to be a proper or necessary \nparty, the court does not have the jurisdiction to order \nhis impleadment against the wishes of the plaintiff.” \n \n8. \nAt this stage, a reference may be made to the prayers made in the \nplaint, which are set out below: \n“A. A decree of permanent injunction restraining the \ndefendants, their partners, representatives and/or others \nacting for and on their behalf for importing, selling, offering \nfor sale, advertising or otherwise dealing in infringing goods \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.12.2022 12:11:23\nSignature Not Verified\n\n--- PAGE 5 ---\n2022/DHC/005588 \n \nCS(COMM) 835/2018                                                                                                      Page 5 of 7 \n \nbearing the plaintiffs’ registered trademarks WESTERN \nDIGITAL,\n and/or WD under nos.1345682, 1349235 and \n1325732 in Class 9. \n \nB. \nAn order of delivery up of all the infringing goods \nbearing the plaintiffs’ trademarks WESTERN DIGITAL,\n \nand/or WD including packaging(s), cartons, labels, stickers, \nand/or publicity material bearing the impugned trademarks for \nthe purposes of destruction/erasure. \n \nC. \nAn order for damages of Rs.1,00,01,000. \n \n9. \nAs can be seen from the above, no relief has been sought against the \napplicant. The entire case of the plaintiff is based on the infringement of the \ntrademarks of the plaintiffs by the defendant. Therefore, it cannot be said \nthat an effective decree cannot be passed in the present suit in the absence of \nthe applicant. It is not even the case of the applicant that the applicant is a \nnecessary party, as the present application seeks impleadment only on the \nbasis of the applicant being a proper party. \n10. \nIn terms of the legal position discussed above, for a person to be a \nproper party to a suit, it is to be seen whether the presence of such person \nwould enable the Court to completely, effectively and properly adjudicate \nupon the issue in the case. \n11. \nAt this stage, a reference may be made to Rule 11 of the IPR \nEnforcement Rules, the relevant portion is set out below: \n“11. Disposal of  infringing goods. –  \n \n(1) Where upon determination by the Deputy Commissioner \nof Customs or Assistant Commissioner of Customs, as the case \nmay be, it is found that the goods detained or seized have \ninfringed intellectual property rights, and have been \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.12.2022 12:11:23\nSignature Not Verified\n\n--- PAGE 6 ---\n2022/DHC/005588 \n \nCS(COMM) 835/2018                                                                                                      Page 6 of 7 \n \nconfiscated under Section 111(d) of the Customs Act, 1962 \nand no legal proceedings are pending in relation to such \ndetermination, the Deputy Commissioner of Customs or \nAssistant Commissioner of Customs, as the case may be, shall \ndestroy the goods under official supervision or dispose them \noutside the normal channels of commerce after obtaining “no \nobjection” or concurrence of the right holder or his authorized \nrepresentative. \n \n \n \n…” \n \n12. \nIn terms of the aforesaid Rule, the applicant has the jurisdiction to \ndetermine if the seized goods are infringing the Intellectual Property Rights \nof the plaintiffs, only in the event of no legal proceedings being pending in \nrelation to such determination. However, the present suit is such a legal \nproceeding in which a determination is to be made whether the goods \nimported by the defendant are infringing or not. Therefore, in terms of Rule \n11 of IPR Enforcement Rules, the applicant cannot go into the question of \ninfringement till the final adjudication of the present suit. \n13. \nIn the event, this Court comes to a finding that the defendant has not \ninfringed the trademarks of the plaintiffs, the said determination shall be \nbinding on the applicant and there cannot be any question of destruction of \nthe infringing goods.  On the other hand, if a final determination is made by \nthis Court that the goods have infringed the trademarks of the plaintiffs, \nappropriate orders shall be passed with regard to the aforesaid goods. \n14. \nIn view of the discussion above, the applicant is neither a necessary \nparty nor a proper party for the adjudication of the suit. There is no merit in \nthe present application and the same is dismissed. \n15. \nNeedless to state this is without prejudice to any other statutory \nrights/remedy of the applicant.  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.12.2022 12:11:23\nSignature Not Verified\n\n--- PAGE 7 ---\n2022/DHC/005588 \n \nCS(COMM) 835/2018                                                                                                      Page 7 of 7 \n \nCS(COMM) 835/2018 \n16. \nIn the order dated 5th July, 2019, the submission of the counsel for the \nplaintiff has been recorded that the present suit is a fit case for the Court to \nproceed to pass a summary judgment under Order 13A of the Code of Civil \nProcedure, 1908. \n17. \nIn terms of the aforesaid order, both sides have filed their respective \nwritten submissions along with judgments in support thereof. \n18. \nList for hearing on 21st March, 2023. \n \n \nAMIT BANSAL, J. \nDECEMBER 13, 2022 \ndk \n \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.12.2022 12:11:23\nSignature Not Verified\n"
  },
  "total_pages": 7,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "According to the PDF document \"1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf\", the High Court of Delhi at New Delhi heard the case CS(COMM) 835/2018 on December 13, 2022. The plaintiffs, Western Digital Technologies, Inc. and another, sued the defendant, SYT Solutions Pvt. Ltd., for intellectual property rights infringement. The Commissioner of Customs (General) filed an application for impleadment as a proper party, citing the infringement of the plaintiff's intellectual property rights under the Custom Intellectual Property Rights (Imported Goods) Enforcement Rules, 2007.\n\nThe applicant had seized 9,644 pieces of goods imported by the defendant on May 2, 2018, under Section 110(1) of the Customs Act, 1962. Both the plaintiff and the defendant opposed the application, with the plaintiff arguing that the applicant was neither a necessary nor a proper party for the adjudication of the suit. The plaintiff claimed that the suit was filed for trademark infringement and that the applicant's role was limited to confiscation under the Customs Act.\n\nThe court considered the arguments and referred to the Supreme Court's decision in Mumbai International Airport (P) Ltd. v. Regency Convention Centre & Hotels (P) Ltd. The decision on the application was made by Hon'ble Mr. Justice Amit Bansal on December 13, 2022. The PDF document provides further details on the case, including the proceedings and arguments presented by the parties. (Source: 1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf)",
      "pdf_source": "1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "According to page 1 of the PDF \"1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf\", a court case (CS(COMM) 835/2018) is ongoing in the High Court of Delhi. The plaintiffs are Western Digital Technologies, Inc. and another, represented by Mr. Prithvi Singh and Ms. Devyani Nath. The defendant is SYT Solutions Pvt. Ltd., represented by Mr. Nakul Mohta and Mr. Ajay Kumar Pandey. The case involves an application (I.A. 3096/2020) filed by the Commissioner of Customs, seeking impleadment in the suit as a proper party due to infringement of the plaintiff's intellectual property rights. The decision date is December 13, 2022, and the judge is Hon'ble Mr. Justice Amit Bansal. (Source: PDF page 1)",
          "content": "2022/DHC/005588 \n \nCS(COMM) 835/2018                                                                                                      Page 1 of 7 \n \n$~7 \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n \n% \n \n \n \n                  Date of decision: 13th December, 2022 \n \n+  \nCS(COMM) 835/2018, I.A. 12048/2019(O-XI R-1 of CPC), I.A. \n12049/2019(for condonation of delay of 203 days in re-filing the \napplication) \n \n \nWESTERN DIGITAL TECHNOLOGIES,  \nINC & ANR \n \n \n \n \n \n..... Plaintiffs \nThrough: \nMr. Prithvi Singh and Ms. Devyani \nNath, Advocates \n \n \n \n \n \nversus \n \n \nSYT SOLUTIONS PVT. LTD.  \n \n \n..... Defendant \n \n \n \n \nThrough: \nMr. Nakul Mohta, Advocate \nMr. Ajay Kumar Pandey, Senior \nPanel \nCounsel \nfor \nthe \napplicant/custom \nin \nIA.3096/2020 \nwith Mr. Vikas Kumar Sharma, \nAdvocate \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nAMIT BANSAL, J. (Oral) \n \n \nI.A. 3096/2020(O.I R.10 of CPC) \n1. \nThe present application has been filed on behalf of Commissioner of \nCustoms (General), Air Cargo Complex, Sahar, Andheri (East), Mumbai – \n400009 seeking impleadment in the present suit as a proper party. \n2. \nThe application is premised on the infringement of the intellectual \nproperty rights of the plaintiff in terms of the Custom Intellectual Property \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.12.2022 12:11:23\nSignature Not Verified",
          "pdf_source": "1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "According to page 2 of the PDF \"1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf\", the applicant has filed an application under the Intellectual Property Rights (Imported Goods) Enforcement Rules, 2007, due to the import of goods by the defendant. A seizure memo was passed on May 2, 2018, for 9,644 pieces of goods. The plaintiffs and defendants have opposed the application, stating that the applicant is not a necessary or proper party for the suit. The plaintiff's suit is based on trademark infringement, and the applicant cannot proceed under the IPR Enforcement Rules while the suit is pending. The court has heard the counsels for the parties, referencing the Supreme Court case Mumbai International Airport (P) Ltd. v. Regency Convention Centre & Hotels (P) Ltd. (2010) 7 SCC 417. (Source: 2022/DHC/005588, CS(COMM) 835/2018)",
          "content": "2022/DHC/005588 \n \nCS(COMM) 835/2018                                                                                                      Page 2 of 7 \n \nRights (Imported Goods) Enforcement Rules, 2007 (hereinafter referred to \nas „IPR Enforcement Rules‟), on account of the import of goods by the \ndefendant. The applicant had passed a seizure memo dated 2nd May, 2018 in \nrespect of 9,644pieces of the goods imported by the defendant under Section \n110(1) of the Customs Act, 1962. It is also the case of the applicant that \ngoods which have been imported into India are in violation of paragraph 2.3 \nof the Foreign Trade Policy, 2015-20 and are therefore, liable for \nconfiscation under Section 111(d) of the Customs Act, 1962. \n3. \nBoth the plaintiff and the defendants have opposed the present \napplication. Plaintiffs have filed reply in opposition to the aforesaid \napplication, wherein it stated that the present suit has been filed on the basis \nof infringement of the plaintiffs‟ trademarks by the defendant and therefore, \nthe applicant is neither a necessary and nor a proper party for the \nadjudication of the present suit. The applicant, vide its letter dated 24th April, \n2018, asked the plaintiff of its willingness to join the proceedings, failing \nwhich the applicant would release the seized goods. Rule 11 of the Customs \nRules states that if the infringing goods have been confiscated and no legal \nproceedings are pending in relation to such goods, the applicant may \nproceed to destroy the goods after obtaining „No-Objection Certificate‟ from \nthe intellectual property right holder. Since the plaintiff has chosen to file \nthe present suit for injunction, the applicant cannot proceed under the IPR \nEnforcement Rules during the pendency of the present suit. Therefore, the \napplicant is neither a necessary party nor a proper party. \n4. \nI have heard the counsels for the parties. \n5. \nThe \nSupreme \nCourt \nin Mumbai \nInternational \nAirport \n(P) \nLtd. v. Regency Convention Centre & Hotels (P) Ltd., (2010) 7 SCC 417, \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.12.2022 12:11:23\nSignature Not Verified",
          "pdf_source": "1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0005",
      "start_index": 3,
      "end_index": 3,
      "summary": "According to the PDF document \"1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf\", the High Court of Delhi at New Delhi made a decision on December 13, 2022, in the case CS(COMM) 835/2018. The plaintiffs, Western Digital Technologies, Inc. and another, brought a suit against the defendants. The court observed that the general rule regarding impleadment of parties is that the plaintiff may choose the persons against whom they wish to litigate.\n\nThe court referred to the Supreme Court's decision in Kasturi v. Iyyamperumal (2005) 6 SCC 733, which laid down tests to determine necessary and proper parties in a suit. The tests include: (1) there must be a right to some relief against such party in respect of the controversies involved, and (2) no effective decree can be passed in the absence of such party.\n\nThe court considered the scope of the suit and the guiding principle that the presence of a party is necessary to adjudicate the controversies involved. The case involves an application for impleadment of parties, with the plaintiffs seeking relief against the defendants. The court's decision is based on the legal proceedings, facts, and arguments presented in the case. The PDF document provides detailed information on the legal proceedings, including the dates of filings and hearings. (Source: 1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf)",
      "pdf_source": "1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "According to page 3 of the PDF \"1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf\" (2022/DHC/005588), the court discusses the rule of impleadment of parties. The Supreme Court in Kasturi v. Iyyamperumal (2005) 6 SCC 733 laid down tests to determine necessary and proper parties in a suit. Two tests are required: (1) a right to some relief against the party, and (2) no effective decree can be passed in their absence. The court also notes that a plaintiff, as dominus litis, can choose who to litigate against and cannot be compelled to sue someone they don't seek relief from. The case CS(COMM) 835/2018 is being heard in the High Court of Delhi, with a decision date of December 13, 2022.",
          "content": "2022/DHC/005588 \n \nCS(COMM) 835/2018                                                                                                      Page 3 of 7 \n \nhas observed that the general rule with regard to impleadment of parties is \nthat the plaintiff in a suit, being dominus litis, may choose the persons \nagainst whom he wishes to litigate and cannot be compelled to sue a person \nagainst whom he does not seek any relief. \n6. \nIn Kasturi v. Iyyamperumal, (2005) 6 SCC 733, the Supreme Court \nlaid down the tests to determine as to who is a necessary party and proper \nparty in a suit. The relevant portions are set out below: \n“7*.  In our view, a bare reading of this provision, namely, \nsecond part of Order 1 Rule 10 sub-rule (2) CPC would \nclearly show that the necessary parties in a suit for specific \nperformance of a contract for sale are the parties to the \ncontract or if they are dead, their legal representatives as also \na person who had purchased the contracted property from the \nvendor. In equity as well as in law, the contract constitutes \nrights and also regulates the liabilities of the parties. A \npurchaser is a necessary party as he would be affected if he \nhad purchased with or without notice of the contract, but a \nperson who claims adversely to the claim of a vendor is, \nhowever, not a necessary party. From the above, it is now \nclear that two tests are to be satisfied for determining the \nquestion who is a necessary party. Tests are — (1) there must \nbe a right to some relief against such party in respect of the \ncontroversies involved in the proceedings; (2) no effective \ndecree can be passed in the absence of such party. \n… \n11. As noted hereinearlier, two tests are required to be \nsatisfied to determine the question who is a necessary party, \nlet us now consider who is a proper party in a suit for specific \nperformance of a contract for sale. For deciding the question \nwho is a proper party in a suit for specific performance the \nguiding principle is that the presence of such a party is \nnecessary to adjudicate the controversies involved in the suit \nfor specific performance of the contract for sale. Thus, the \nquestion is to be decided keeping in mind the scope of the \nsuit. …” \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.12.2022 12:11:23\nSignature Not Verified",
          "pdf_source": "1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0009",
      "start_index": 4,
      "end_index": 6,
      "summary": "According to the PDF document \"1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf\", the legal proceedings CS(COMM) 835/2018 involve Western Digital Technologies, Inc. and another party as plaintiffs, and Syt Solutions Pvt Ltd as the defendant. The case revolves around trademark infringement, with the plaintiffs seeking a permanent injunction, delivery up of infringing goods, and damages of Rs.1,00,01,000.\n\nThe court refers to the Supreme Court's judgment in Vidur Impex & Traders (P) Ltd. v. Tosh Apartments (P) Ltd. (2012) 8 SCC 384, which lays down principles for deciding applications under Order 1 Rule 10(2) of the CPC. The court notes that a necessary party is one whose presence is necessary for effective adjudication, while a proper party is one whose presence enables the court to completely adjudicate upon all matters.\n\nThe applicant seeks impleadment as a proper party, but the court observes that no relief has been sought against the applicant, and the plaintiff's case is based on trademark infringement by the defendant. The court cites Rule 11 of the IPR Enforcement Rules, which pertains to the disposal of infringing goods.\n\nThe decision was made on December 13, 2022, and the document was digitally signed by Amit Bansal on December 16, 2022. The proceedings are ongoing, with the court considering the legal arguments and principles applicable to the case. (Source: 1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf)",
      "pdf_source": "1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf",
      "nodes": [
        {
          "title": "Page 4",
          "node_id": "0006",
          "start_index": 4,
          "end_index": 4,
          "summary": "According to page 4 of the PDF \"1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf\", the court refers to the Supreme Court's decision in Vidur Impex & Traders (P) Ltd. v. Tosh Apartments (P) Ltd. (2012) 8 SCC 384, which lays down principles for deciding applications under Order 1 Rule 10(2) of the CPC. The principles include: \n1. The court can direct impleadment of any person at any stage of the proceedings.\n2. A necessary party is one in whose absence an effective decree cannot be passed.\n3. A proper party is one whose presence enables the court to completely adjudicate upon all matters.\n4. The court cannot order impleadment against the plaintiff's wishes if the person is not a proper or necessary party. \nThe court also refers to the prayers made in the plaint, including a decree of permanent injunction restraining the defendants from importing or selling infringing goods. (Source: PDF \"1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf\", page 4)",
          "content": "2022/DHC/005588 \n \nCS(COMM) 835/2018                                                                                                      Page 4 of 7 \n \n7. \nIn Vidur Impex & Traders (P) Ltd. v. Tosh Apartments (P) Ltd., \n(2012) 8 SCC 384, the Supreme Court has succinctly laid down the \nprinciples to be followed while deciding an application filed under Order 1 \nRule 10(2) of the CPC. Paragraph 36 in this regard is set out below : \n“36. Though there is apparent conflict in the observations \nmade in some of the aforementioned judgments, the broad \nprinciples which should govern disposal of an application for \nimpleadment are : \n \n1. The court can, at any stage of the proceedings, either \non an application made by the parties or otherwise, \ndirect impleadment of any person as party, who ought \nto have been joined as plaintiff or defendant or whose \npresence before the court is necessary for effective and \ncomplete adjudication of the issues involved in the suit. \n \n2. A necessary party is the person who ought to be \njoined as party to the suit and in whose absence an \neffective decree cannot be passed by the court. \n \n3. A proper party is a person whose presence would \nenable the court to completely, effectively and \nproperly adjudicate upon all matters and issues, \nthough he may not be a person in favour of or against \nwhom a decree is to be made. \n \n4. 4. If a person is not found to be a proper or necessary \nparty, the court does not have the jurisdiction to order \nhis impleadment against the wishes of the plaintiff.” \n \n8. \nAt this stage, a reference may be made to the prayers made in the \nplaint, which are set out below: \n“A. A decree of permanent injunction restraining the \ndefendants, their partners, representatives and/or others \nacting for and on their behalf for importing, selling, offering \nfor sale, advertising or otherwise dealing in infringing goods \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.12.2022 12:11:23\nSignature Not Verified",
          "pdf_source": "1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf",
          "nodes": []
        },
        {
          "title": "Page 5",
          "node_id": "0007",
          "start_index": 5,
          "end_index": 5,
          "summary": "According to page 5 of the PDF \"1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf\", the plaintiffs, Western Digital Technologies, Inc. & Anr, are seeking relief for trademark infringement. They are seeking an order for delivery up of infringing goods bearing their trademarks, including packaging and publicity materials, for destruction or erasure. They are also seeking damages of Rs.1,00,01,000.\n\nThe court notes that the applicant is not a necessary party to the suit, as the case is based on trademark infringement by the defendant. The court refers to Rule 11 of the IPR Enforcement Rules, which deals with the disposal of infringing goods. The decision was made on December 13, 2022, in the case CS(COMM) 835/2018. The PDF source provides details of the legal proceedings and arguments in the case.",
          "content": "2022/DHC/005588 \n \nCS(COMM) 835/2018                                                                                                      Page 5 of 7 \n \nbearing the plaintiffs’ registered trademarks WESTERN \nDIGITAL,\n and/or WD under nos.1345682, 1349235 and \n1325732 in Class 9. \n \nB. \nAn order of delivery up of all the infringing goods \nbearing the plaintiffs’ trademarks WESTERN DIGITAL,\n \nand/or WD including packaging(s), cartons, labels, stickers, \nand/or publicity material bearing the impugned trademarks for \nthe purposes of destruction/erasure. \n \nC. \nAn order for damages of Rs.1,00,01,000. \n \n9. \nAs can be seen from the above, no relief has been sought against the \napplicant. The entire case of the plaintiff is based on the infringement of the \ntrademarks of the plaintiffs by the defendant. Therefore, it cannot be said \nthat an effective decree cannot be passed in the present suit in the absence of \nthe applicant. It is not even the case of the applicant that the applicant is a \nnecessary party, as the present application seeks impleadment only on the \nbasis of the applicant being a proper party. \n10. \nIn terms of the legal position discussed above, for a person to be a \nproper party to a suit, it is to be seen whether the presence of such person \nwould enable the Court to completely, effectively and properly adjudicate \nupon the issue in the case. \n11. \nAt this stage, a reference may be made to Rule 11 of the IPR \nEnforcement Rules, the relevant portion is set out below: \n“11. Disposal of  infringing goods. –  \n \n(1) Where upon determination by the Deputy Commissioner \nof Customs or Assistant Commissioner of Customs, as the case \nmay be, it is found that the goods detained or seized have \ninfringed intellectual property rights, and have been \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.12.2022 12:11:23\nSignature Not Verified",
          "pdf_source": "1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf",
          "nodes": []
        },
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "According to page 6 of the PDF \"1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf\", the court discusses the jurisdiction of the applicant to determine infringement of Intellectual Property Rights. The court states that the applicant can only determine infringement if no legal proceedings are pending, but since the present suit is a legal proceeding, the applicant cannot decide on infringement until the suit is finalized. The court also mentions that if it finds the defendant has not infringed the trademarks, the determination will be binding on the applicant, and no goods will be destroyed. The application is dismissed, stating the applicant is neither a necessary nor proper party for the suit's adjudication. The decision was made on December 13, 2022, in the case CS(COMM) 835/2018. (Source: 1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf)",
          "content": "2022/DHC/005588 \n \nCS(COMM) 835/2018                                                                                                      Page 6 of 7 \n \nconfiscated under Section 111(d) of the Customs Act, 1962 \nand no legal proceedings are pending in relation to such \ndetermination, the Deputy Commissioner of Customs or \nAssistant Commissioner of Customs, as the case may be, shall \ndestroy the goods under official supervision or dispose them \noutside the normal channels of commerce after obtaining “no \nobjection” or concurrence of the right holder or his authorized \nrepresentative. \n \n \n \n…” \n \n12. \nIn terms of the aforesaid Rule, the applicant has the jurisdiction to \ndetermine if the seized goods are infringing the Intellectual Property Rights \nof the plaintiffs, only in the event of no legal proceedings being pending in \nrelation to such determination. However, the present suit is such a legal \nproceeding in which a determination is to be made whether the goods \nimported by the defendant are infringing or not. Therefore, in terms of Rule \n11 of IPR Enforcement Rules, the applicant cannot go into the question of \ninfringement till the final adjudication of the present suit. \n13. \nIn the event, this Court comes to a finding that the defendant has not \ninfringed the trademarks of the plaintiffs, the said determination shall be \nbinding on the applicant and there cannot be any question of destruction of \nthe infringing goods.  On the other hand, if a final determination is made by \nthis Court that the goods have infringed the trademarks of the plaintiffs, \nappropriate orders shall be passed with regard to the aforesaid goods. \n14. \nIn view of the discussion above, the applicant is neither a necessary \nparty nor a proper party for the adjudication of the suit. There is no merit in \nthe present application and the same is dismissed. \n15. \nNeedless to state this is without prejudice to any other statutory \nrights/remedy of the applicant.  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.12.2022 12:11:23\nSignature Not Verified",
          "pdf_source": "1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0011",
      "start_index": 7,
      "end_index": 7,
      "summary": "According to the PDF document \"WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf\", a court decision was made on December 13, 2022, in the case CS(COMM) 835/2018. The High Court of Delhi at New Delhi heard the case, with Amit Bansal, J. presiding. The plaintiffs, Western Digital Technologies, Inc. and another, were involved in a dispute with the defendant, Syt Solutions Pvt Ltd.\n\nThe court decision mentions that on July 5, 2019, the plaintiff's counsel submitted that the case was suitable for a summary judgment under Order 13A of the Code of Civil Procedure, 1908. Both parties subsequently filed written submissions and judgments in support of their arguments.\n\nThe court has listed the case for hearing on March 21, 2023. The decision does not mention any specific facts, arguments, or amounts involved in the case. The PDF document, sourced from 2022/DHC/005588, provides the court's proceedings and decisions in the case, including the digitally signed order by Amit Bansal, J. on December 16, 2022. The document consists of 7 pages, with the court decision recorded on pages 1 and 7.",
      "pdf_source": "1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf",
      "nodes": [
        {
          "title": "Page 7",
          "node_id": "0010",
          "start_index": 7,
          "end_index": 7,
          "summary": "According to page 7 of the PDF \"1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf\", the court proceedings are as follows: \nIn the case CS(COMM) 835/2018, the plaintiff's counsel submitted that the suit is fit for a summary judgment under Order 13A of the Code of Civil Procedure, 1908, as recorded in the order dated 5th July, 2019. \nBoth parties have filed written submissions along with supporting judgments. \nThe case is listed for hearing on 21st March, 2023. \nThe decision was made by Judge Amit Bansal on 13th December, 2022. \nThe PDF source provides the court details, including the case number and dates of decisions.",
          "content": "2022/DHC/005588 \n \nCS(COMM) 835/2018                                                                                                      Page 7 of 7 \n \nCS(COMM) 835/2018 \n16. \nIn the order dated 5th July, 2019, the submission of the counsel for the \nplaintiff has been recorded that the present suit is a fit case for the Court to \nproceed to pass a summary judgment under Order 13A of the Code of Civil \nProcedure, 1908. \n17. \nIn terms of the aforesaid order, both sides have filed their respective \nwritten submissions along with judgments in support thereof. \n18. \nList for hearing on 21st March, 2023. \n \n \nAMIT BANSAL, J. \nDECEMBER 13, 2022 \ndk \n \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.12.2022 12:11:23\nSignature Not Verified",
          "pdf_source": "1. WESTERN DIGITAL TECHNOLOGIES VS. SYT SOLUTIONS PVT LTD.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-15T18:28:35.644640",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}