{
  "doc_name": "10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED",
  "pdf_source": "10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf",
  "metadata": {
    "document_name": "10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED",
    "source_pdf": "10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf",
    "judges": [
      "AMIT BANSAL"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "21/2018",
      "21/2018",
      "21/2018",
      "21/2018",
      "21/2018",
      "21/2018",
      "21/2018",
      "21/2018",
      "21/2018",
      "364/2018",
      "17720/2019",
      "364/2018"
    ],
    "dhc_numbers": [
      "2022/DHC/005847",
      "2022/DHC/005847",
      "2022/DHC/005847",
      "2022/DHC/005847",
      "2022/DHC/005847",
      "2022/DHC/005847",
      "2022/DHC/005847"
    ],
    "ia_numbers": [],
    "decision_date": "21 December, 2022",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      "M/s RPG Enterprises Limited"
    ],
    "defendants": [
      "RPG Developers Private Limited",
      "Mr. Rampal Goswami"
    ],
    "appellants": [],
    "respondents": [],
    "plaintiff_advocates": [
      "Mr. Himanshu Deora",
      "Ms. Sejal Tayal",
      "Ms. Neeharika",
      "Mr. Naqeeb Nawab"
    ],
    "defendant_advocates": [],
    "appellant_advocates": [],
    "respondent_advocates": [],
    "damages_claimed": "3,00,000",
    "damages_awarded": null,
    "key_issues": [
      "Trademark infringement by the defendants through the use of the \"RPG\" word mark without authorization from the plaintiff.",
      "Passing off of goods and services by the defendants as those of the plaintiff, potentially causing confusion among consumers.",
      "Copyright infringement by the defendants through the unauthorized use of the plaintiff's registered copyright, the RPG Enterprises Logo (Label).",
      "Use of a deceptively similar trade name by the defendants, \"M/s RPG Developers\", with the intent to misrepresent an association with the plaintiff.",
      "Registration of domain names and websites by the defendants that incorporate the plaintiff's trademark, potentially causing dilution of the mark.",
      "Alleged intent by the defendants to benefit from the goodwill and reputation associated with the plaintiff's well-known trademarks.",
      "Potential violation of Section 2(1)(zg) of the Trade Marks Act, 1999, which recognizes the plaintiff's \"RPG\" marks as well-known trademarks.",
      "Infringement of the plaintiff's exclusive rights as the registered proprietor of the \"RPG\" marks in various classes under the Trade Marks Act, 1999.",
      "Potential damage to the plaintiff's business and reputation due to the defendants' unauthorized use of the plaintiff's trademarks and copyright.",
      "Breach of the plaintiff's rights under the Trade Marks Act, 1999, and the Copyright Act, which provide protection against infringement and passing off."
    ],
    "decision_summary": "**Background:**\nThe case involves a trademark and copyright infringement dispute between M/s RPG Enterprises Limited (the plaintiff) and RPG Developers Private Limited and its director, Mr. Rampal Goswami (the defendants). The plaintiff is an Indian industrial conglomerate that has been using the \"RPG\" word mark since 1979 and has registered trademarks in various classes under the Trade Marks Act, 1999. The defendants, on the other hand, are engaged in the selling and renting of properties in India and have been using the \"RPG\" mark in their business name and promotional materials.\n\n**Legal Issues:**\nThe plaintiff alleged that the defendants' use of the \"RPG\" mark constitutes trademark infringement, passing off, and copyright infringement. The plaintiff claimed that its \"RPG\" marks have acquired the status of well-known trademarks and that the defendants' use of the mark is likely to cause confusion among the public. The plaintiff also alleged that the defendants' actions are intended to misrepresent their association with the plaintiff.\n\n**Arguments:**\nThe plaintiff argued that the defendants' use of the \"RPG\" mark is unauthorized and infringing, and that it has caused damage to the plaintiff's reputation and business. The plaintiff relied on its prior use and registration of the \"RPG\" mark, as well as its reputation and goodwill, to support its claim. The plaintiff also submitted that the defendants' failure to respond to cease and desist notices and their continued use of the infringing mark demonstrate their intent to infringe the plaintiff's rights.\n\nThe defendants did not respond to the suit or appear in court, despite being served with notice.\n\n**Court Findings:**\nThe court found that the plaintiff has established a prima facie case of trademark infringement and passing off. The court noted that the plaintiff's \"RPG\" marks are well-known and have been registered in various classes, and that the defendants' use of the mark is likely to cause confusion among the public. The court also found that the defendants' actions are intended to misrepresent their association with the plaintiff.\n\n**Decision:**\nThe court granted an ex parte ad interim injunction in favor of the plaintiff, restraining the defendants from using the \"RPG\" mark. The court ordered the defendants to stop selling or offering for sale their projects under the \"RPG\" mark, recall their finished infringing goods and promotional materials, and give an undertaking not to infringe the plaintiff's marks in the future. The court's decision was based on the plaintiff's prior use and registration of the \"RPG\" mark, as well as the defendants' unauthorized and infringing use of the mark.\n\n**Conclusion:**\nThe court's decision in this case highlights the importance of protecting intellectual property rights, particularly in cases where a well-known trademark is involved. The court's finding that the defendants' use of the \"RPG\" mark constitutes trademark infringement and passing off demonstrates the need for businesses to ensure that their use of trademarks does not infringe the rights of others. The case also underscores the importance of responding to cease and desist notices and taking prompt action to remedy any infringement.",
    "legal_precedents": [
      "Enterprises Limited Riju Ghoshal"
    ],
    "full_text": "\n--- PAGE 1 ---\n                                  2022/DHC/005847 \nCS(COMM) 21/2018                                                                                                                                          Page 1 of 7 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n% \n \n \n \n                 Date of decision: 21st December, 2022 \n \n+  \nCS(COMM) 21/2018 & I.A. 364/2018 (O-XXXIX R-1 & 2 of \nCPC), I.A. 17720/2019 (O-V R-20 (1A)) \n \n \nM/S RPG ENTERPRISES LIMITED  \n \n..... Plaintiff \nThrough: \nMr. Himanshu Deora with Ms. Sejal \nTayal, \nMs. \nNeeharika \nand \nMr. \nNaqeeb Nawab, Advocates. \n \n \n \n \n \nversus \n \n \nRPG DEVELOPERS PRIVATE LIMITED  \n& OTHERS  \n \n \n \n \n \n..... Defendants \n \n \n \n \nThrough: \nNone. \n \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \n \n \n \n \nJUDGMENT \nAMIT BANSAL, J. (Oral) \nCS(COMM) 21/2018 \n1. \nThe present suit has been filed seeking relief of permanent injunction \nrestraining the defendants from infringing the trademarks and copyrights of \nthe plaintiff, passing off their goods as that of the plaintiff‟s and other \nancillary reliefs. \nPLEADINGS IN THE PLAINT \n2. \nThe case set up by the plaintiff in the plaint is as follows: \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:24.12.2022 18:20:37\nSignature Not Verified\n\n--- PAGE 2 ---\n                                  2022/DHC/005847 \nCS(COMM) 21/2018                                                                                                                                          Page 2 of 7 \n \n2.1 \nThe plaintiff, M/s RPG Enterprises Limited is an Indian industrial \nconglomerate comprising of over twenty companies in the area of \ninfrastructure, tyres, technology and speciality.  \n2.2 \nThe plaintiff has been has been using the „RPG‟ word mark since \n1979. \n2.3 \nThe plaintiff is the proprietor of the registered trademark „RPG‟, \n, \n  and other related marks in Classes 5, \n9, 12, 16 and 30 of the Trade Marks Act, 1999. The said marks have come to \nbe exclusively associated with the plaintiff. Details of the trademark \nregistrations of the plaintiff‟s „RPG‟ marks have been tabulated in paragraph \n5 of the plaint. \n2.4 \nThe said marks of the plaintiff are also registered by the plaintiff in \nvarious foreign countries, details of which have been provided in paragraph \n6 of the plaint. \n2.5 \nThe plaintiff‟s „RPG‟ marks have acquired the status of well-known \ntrademarks within the meaning of Section 2(1)(zg) of the Trade Marks Act, \n1999, which fact is recognised in the judgment of RPG Enterprises Limited \nv. Riju Ghoshal and Another, (2022) 90 PTC 312. \n2.6 \nThe plaintiff is also the registered copyright owner of the RPG \nEnterprises Logo (Label) in India and has been using the same since 1987. \nThe aforesaid label was granted registration on 30th June, 1988. The plaintiff \nalso owns the domain names „www.rpggroup.com‟ and „www.rpg.in‟.  \n2.7 \nThe defendant no. 1, M/s RPG Developers is a company engaged in \nthe selling and renting of properties in various parts of India. The defendant \nno. 2, Mr. Rampal Goswami, is the director of the defendant company.  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:24.12.2022 18:20:37\nSignature Not Verified\n\n--- PAGE 3 ---\n                                  2022/DHC/005847 \nCS(COMM) 21/2018                                                                                                                                          Page 3 of 7 \n \n2.8 \nSometime in August, 2017, the plaintiff came across the infringing \nactivities of the defendants. The defendants are deliberately using the trade \nname „M/s RPG Developers‟ with an intent to misrepresent to the public that \nthe defendants are associated with the plaintiff as an associate/joint \nventure/group company. The defendants have adopted the „RPG‟ mark and \nare using the mark \n. \n2.9 \nThe defendants‟ website mentions various projects using the word \nmark „RPG‟ titled as „RPG Sathya Nagar,‟ „RPG Metro City,‟ „RPG Vel \nNagar,‟ „RPG Global City,‟ „RPG Metro City,‟ „RPG Swarna Boomi,‟ „RPG \nAravindar City‟ and „RPG Rokkisha Bhoomi.‟  \n2.10 Plaintiff issued cease and desist notices dated 10th August, 2017 to the \ndefendants, inter alia, calling upon the defendants to stop selling/offering for \nsale their projects under the mark „RPG‟, recall their finished infringing \ngoods/promotional materials and give an undertaking to the effect that they \nshall not infringe the marks of the plaintiff in the future. However, despite \nservice, no reply to the said letters has been received by the plaintiff.  \n3. \nAccordingly, the plaintiff filed the present suit seeking to restrain the \ndefendants from carrying on their infringing activities.  \nPROCEEDINGS IN THE SUIT \n4. \nThis Court, vide order dated 10th January, 2018 granted an ex parte ad \ninterim injunction in favour of the plaintiff under I.A. 364/2018, retraining \nthe defendants from using the mark „RPG‟. The relevant portion of the said \norder is as under: \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:24.12.2022 18:20:37\nSignature Not Verified\n\n--- PAGE 4 ---\n                                  2022/DHC/005847 \nCS(COMM) 21/2018                                                                                                                                          Page 4 of 7 \n \n“Keeping in view the aforesaid, this Court is of the \nopinion that a prima facie case of infringement and passing off is \nmade out in favour of the plaintiff and balance of convenience is \nalso in its favour. Further, irreparable harm or injury would be \ncaused to the plaintiff if an interim injunction order is not \npassed.  \nConsequently, till further orders, the defendants, \ndirectors/proprietors/partners, their principals, employees, \nagents, distributors, franchisees, representatives and assigns \nare restrained from giving any services, in any manner \nwhatsoever and/or using the registered trademark RPG and/or \nRPG Developers and/or artistic work which is a colourable \nimitation of the plaintiff‟s artistic work or any other \ntrademark/artistic work confusingly similar to the registered \ntrade mark/copyright of the plaintiff.” \n5. \nThe matter was thereafter placed before the Joint Registrar for \neffecting service and completion of pleadings. \n6. \nEven though the defendant no.4 was served through ordinary mode on \n17th February, 2018, none appeared for the defendant no.4 on 16th March, \n2018, 9th May, 2018 and 15th May, 2018. Further, no written statement was \nfiled on behalf of the defendant no.4. Consequently, the defendant no.4 was \nproceeded against ex parte on 15th May, 2018. \n7. \nFresh service of summons was directed for the defendants no.1 to 3 \nand 5 on 3rd March, 2020 and 22nd September, 2021  \n8. \nOn 12th January, 2022, the counsel for the plaintiff submitted that all \nthe defendants, with the exception of the defendant no.4, have been duly \nserved and that an affidavit of service has also been filed in this regard. \n9. \nThereafter, vide order dated 6th July, 2022 passed by the Joint \nRegistrar, the defendants no.1 to 3 and 5 were deemed to be served on the \nbasis of the affidavit of service filed on behalf of the plaintiff.  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:24.12.2022 18:20:37\nSignature Not Verified\n\n--- PAGE 5 ---\n                                  2022/DHC/005847 \nCS(COMM) 21/2018                                                                                                                                          Page 5 of 7 \n \n10. \nOn 6th December, 2022, the Joint Registrar closed the right of the \ndefendants no.1 to 3 and 5 to file written statement and the matter was \nplaced before the Court.  \n11. \nIn view of the above, the counsel for the plaintiff prays for a decree of \npermanent injunction and damages along with costs in the suit. \nANALYSIS AND FINDINGS \n12. \nI have heard the counsel for the plaintiff and perused the record of the \ncase. \n13. \nAt the outset, it may be relevant to note that the defendants no.1 to 3 \nand 5 has been served through speed post, courier and email. Despite this, \nthe defendants no.1 to 3 and 5 have chosen not to enter appearance. The \ndefendant no.4 has also been proceeded against ex parte on 15th May, 2018. \nAmple opportunity has been given to the defendants to appear before the \nCourt and defend the case. \n14. \nSince the defendants have failed to enter appearance or even take any \nsteps requisite to contest the present suit, despite having suffered an ad \ninterim injunction order, it is evident that they have no defence to put forth \non merits.  \n15. \nAt this stage, it may be relevant to note the comparison between the \nmarks of the plaintiff and the defendants, which is as under: \nPLAINTIFF’S MARK \nDEFENDANTS’ MARK \n \n \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:24.12.2022 18:20:37\nSignature Not Verified\n\n--- PAGE 6 ---\n                                  2022/DHC/005847 \nCS(COMM) 21/2018                                                                                                                                          Page 6 of 7 \n \n16. \nFrom a perusal of the competing marks above, this Court is of the \nview that the defendants‟ use of the „RPG‟ marks is nothing but an attempt \nto ride on the goodwill and reputation of the plaintiff‟s well-known \ntrademarks. This is further evidenced from the prominent use of the marks \n„RPG‟/ \n \non \nthe \ndefendants‟ \nwebsite \n“www.rpgdevelopers.in”, screenshots of which have been annexed at pages \n45 to 47 of the documents filed along with the plaint. \n17. \nBased on the averments in the plaint and the discussion above, this \nCourt is of the view that this is a fit case for granting relief of permanent \ninjunction. The defendants are restrained from offering/rendering any \nservices using the impugned trademark „RPG‟ and/or „RPG DEVELOPERS‟ \nand/or artistic work which is a colourable imitation of the plaintiff‟s artistic \nwork or any other trademark/artistic work deceptively similar to the „RPG‟ \nmarks of the plaintiff. \n18. \nAccordingly, the present suit is decreed in terms of prayer clauses „a.‟, \n„b.‟ and „c.‟ of the plaint.  \n19. \nAt this stage, counsel for the plaintiff does not press for the reliefs \ncontemplated in prayer clauses „d.‟ and „e.‟ of the plaint. \n20. \nInsofar as the relief of damages as sought in prayer clause „f.‟ is \nconcerned, the defendants are trading under the name „M/s RPG \nDEVELOPERS‟ in order to dupe the general public into believing that the \ndefendants are a subsidiary/group company/joint venture of the plaintiff, \nwhich is a reputed industrial conglomerate in the business of infrastructure. \nProjects of the defendants are being listed on their website using the „RPG‟ \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:24.12.2022 18:20:37\nSignature Not Verified\n\n--- PAGE 7 ---\n                                  2022/DHC/005847 \nCS(COMM) 21/2018                                                                                                                                          Page 7 of 7 \n \nmark of the plaintiff. The defendants have also failed to respond to the legal \nnotices dated 10th August, 2017 sent to them on behalf of the plaintiff, \nrequiring them to cease and desist from their use of the „RPG‟ mark of the \nplaintiff. Moreover, the defendants have also chosen to stay away from the \npresent proceedings, despite service. \n21. \nIn view of the foregoing facts and circumstances, this Court is of the \nview that this is not a case of innocent adoption. The Court cannot ignore \nsuch flagrant misuse of the plaintiff‟s marks by the defendants. Therefore, \nconsidering the dishonest conduct of the defendant, the suit is decreed in \nfavour of the plaintiff for Rs.3,00,000/- as damages. Additionally, \nRs.3,00,000/- is awarded to the plaintiff as costs to be paid by the \ndefendants. \n22. \nThe defendants shall pay the said amount to the plaintiff within eight \nweeks, failing which the plaintiff is permitted to commence execution \nproceedings against the defendants. \n23. \nAll pending applications are disposed of. \n24. \nDecree sheet be drawn up. \n \n \nAMIT BANSAL, J. \nDECEMBER 21, 2022 \nat \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:24.12.2022 18:20:37\nSignature Not Verified\n"
  },
  "total_pages": 7,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "According to the PDF document \"RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf\", the High Court of Delhi at New Delhi heard the case CS(COMM) 21/2018 on December 21, 2022. The plaintiff, M/s RPG Enterprises Limited, sought a permanent injunction to restrain the defendants, RPG Developers Private Limited and others, from infringing their trademarks and copyrights.\n\nThe plaintiff, an Indian industrial conglomerate, has been using the \"RPG\" word mark since 1979 and is the proprietor of registered trademarks in various classes. The marks have been registered in foreign countries as well and have acquired the status of well-known trademarks. The plaintiff is also the registered copyright owner of the RPG Enterprises Logo (Label) and owns domain names \"www.rpggroup.com\" and \"www.rpg.in\".\n\nThe defendant, RPG Developers Private Limited, is a company engaged in selling and renting properties in India, with Mr. Rampal Goswami as its director. The plaintiff alleged that the defendants were infringing their trademarks and copyrights, and sought relief, including a permanent injunction.\n\nThe court, presided over by Hon'ble Mr. Justice Amit Bansal, heard the case, but the defendants were not represented. The judgment, delivered orally, is recorded in the PDF document, which provides details of the case, including pleadings, facts, and arguments. (Source: 2022/DHC/005847, CS(COMM) 21/2018, Pages 1-7 of the PDF document)",
      "pdf_source": "10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "According to page 1 of the PDF \"10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf\", a court case (CS(COMM) 21/2018) was heard in the High Court of Delhi at New Delhi. The plaintiff, M/S RPG ENTERPRISES LIMITED, sought relief of permanent injunction against the defendants, RPG DEVELOPERS PRIVATE LIMITED & OTHERS, for infringing trademarks and copyrights, and passing off goods. The case was decided on December 21, 2022, by HON'BLE MR. JUSTICE AMIT BANSAL. The plaintiff was represented by advocates Mr. Himanshu Deora, Ms. Sejal Tayal, Ms. Neeharika, and Mr. Naqeeb Nawab, while the defendants were not represented. The judgment was orally delivered by Justice Amit Bansal. (Source: 10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf, page 1)",
          "content": "2022/DHC/005847 \nCS(COMM) 21/2018                                                                                                                                          Page 1 of 7 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n% \n \n \n \n                 Date of decision: 21st December, 2022 \n \n+  \nCS(COMM) 21/2018 & I.A. 364/2018 (O-XXXIX R-1 & 2 of \nCPC), I.A. 17720/2019 (O-V R-20 (1A)) \n \n \nM/S RPG ENTERPRISES LIMITED  \n \n..... Plaintiff \nThrough: \nMr. Himanshu Deora with Ms. Sejal \nTayal, \nMs. \nNeeharika \nand \nMr. \nNaqeeb Nawab, Advocates. \n \n \n \n \n \nversus \n \n \nRPG DEVELOPERS PRIVATE LIMITED  \n& OTHERS  \n \n \n \n \n \n..... Defendants \n \n \n \n \nThrough: \nNone. \n \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \n \n \n \n \nJUDGMENT \nAMIT BANSAL, J. (Oral) \nCS(COMM) 21/2018 \n1. \nThe present suit has been filed seeking relief of permanent injunction \nrestraining the defendants from infringing the trademarks and copyrights of \nthe plaintiff, passing off their goods as that of the plaintiff‟s and other \nancillary reliefs. \nPLEADINGS IN THE PLAINT \n2. \nThe case set up by the plaintiff in the plaint is as follows: \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:24.12.2022 18:20:37\nSignature Not Verified",
          "pdf_source": "10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "According to page 2 of the PDF \"10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf\", the plaintiff, M/s RPG Enterprises Limited, is an Indian industrial conglomerate that has been using the \"RPG\" word mark since 1979. The company is the proprietor of registered trademarks \"RPG\" in various classes and has acquired the status of well-known trademarks under the Trade Marks Act, 1999. The plaintiff also owns the registered copyright of the RPG Enterprises Logo and domain names \"www.rpggroup.com\" and \"www.rpg.in\". The defendant, M/s RPG Developers, is a company engaged in selling and renting properties in India. The case, CS(COMM) 21/2018, was decided on December 21, 2022, in the High Court of Delhi at New Delhi. (Source: 10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf, page 2)",
          "content": "2022/DHC/005847 \nCS(COMM) 21/2018                                                                                                                                          Page 2 of 7 \n \n2.1 \nThe plaintiff, M/s RPG Enterprises Limited is an Indian industrial \nconglomerate comprising of over twenty companies in the area of \ninfrastructure, tyres, technology and speciality.  \n2.2 \nThe plaintiff has been has been using the „RPG‟ word mark since \n1979. \n2.3 \nThe plaintiff is the proprietor of the registered trademark „RPG‟, \n, \n  and other related marks in Classes 5, \n9, 12, 16 and 30 of the Trade Marks Act, 1999. The said marks have come to \nbe exclusively associated with the plaintiff. Details of the trademark \nregistrations of the plaintiff‟s „RPG‟ marks have been tabulated in paragraph \n5 of the plaint. \n2.4 \nThe said marks of the plaintiff are also registered by the plaintiff in \nvarious foreign countries, details of which have been provided in paragraph \n6 of the plaint. \n2.5 \nThe plaintiff‟s „RPG‟ marks have acquired the status of well-known \ntrademarks within the meaning of Section 2(1)(zg) of the Trade Marks Act, \n1999, which fact is recognised in the judgment of RPG Enterprises Limited \nv. Riju Ghoshal and Another, (2022) 90 PTC 312. \n2.6 \nThe plaintiff is also the registered copyright owner of the RPG \nEnterprises Logo (Label) in India and has been using the same since 1987. \nThe aforesaid label was granted registration on 30th June, 1988. The plaintiff \nalso owns the domain names „www.rpggroup.com‟ and „www.rpg.in‟.  \n2.7 \nThe defendant no. 1, M/s RPG Developers is a company engaged in \nthe selling and renting of properties in various parts of India. The defendant \nno. 2, Mr. Rampal Goswami, is the director of the defendant company.  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:24.12.2022 18:20:37\nSignature Not Verified",
          "pdf_source": "10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0005",
      "start_index": 3,
      "end_index": 3,
      "summary": "According to the PDF document \"RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf\", the High Court of Delhi at New Delhi heard the case CS(COMM) 21/2018. The plaintiff, M/s RPG Enterprises Limited, claimed that the defendant, RPG Developers Private Limited, was using the trade name \"M/s RPG Developers\" with the intent to misrepresent their association with the plaintiff. The defendant's website featured projects with the \"RPG\" mark, such as \"RPG Sathya Nagar\" and \"RPG Metro City\".\n\nThe plaintiff issued cease and desist notices on August 10, 2017, but received no response. Consequently, the plaintiff filed a suit to restrain the defendant's infringing activities. On January 10, 2018, the court granted an ex parte ad interim injunction in favor of the plaintiff, prohibiting the defendant from using the \"RPG\" mark.\n\nThe key dates in the case are:\n- August 2017: The plaintiff discovered the defendant's infringing activities.\n- August 10, 2017: The plaintiff issued cease and desist notices.\n- January 10, 2018: The court granted an ex parte ad interim injunction.\n- December 21, 2022: The court made a decision in the case.\n\nThe parties involved are M/s RPG Enterprises Limited (plaintiff) and RPG Developers Private Limited (defendant). The case highlights a trademark infringement dispute, with the plaintiff seeking to protect its \"RPG\" mark. (Source: RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf, 2022/DHC/005847, CS(COMM) 21/2018)",
      "pdf_source": "10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "According to page 3 of the PDF \"10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf\", the plaintiff (RPG Enterprises Limited) discovered the defendants' (RPG Developers Private Limited) infringing activities in August 2017. The defendants were using the \"RPG\" mark, misrepresenting their association with the plaintiff. The plaintiff issued cease and desist notices on August 10, 2017, but received no response.\n\nThe plaintiff filed a suit to restrain the defendants from using the \"RPG\" mark. On January 10, 2018, the court granted an ex parte ad interim injunction in favor of the plaintiff, restraining the defendants from using the \"RPG\" mark. The case is CS(COMM) 21/2018, with related applications I.A. 364/2018 and I.A. 17720/2019. The decision was made on December 21, 2022. (Source: 10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf, page 3)",
          "content": "2022/DHC/005847 \nCS(COMM) 21/2018                                                                                                                                          Page 3 of 7 \n \n2.8 \nSometime in August, 2017, the plaintiff came across the infringing \nactivities of the defendants. The defendants are deliberately using the trade \nname „M/s RPG Developers‟ with an intent to misrepresent to the public that \nthe defendants are associated with the plaintiff as an associate/joint \nventure/group company. The defendants have adopted the „RPG‟ mark and \nare using the mark \n. \n2.9 \nThe defendants‟ website mentions various projects using the word \nmark „RPG‟ titled as „RPG Sathya Nagar,‟ „RPG Metro City,‟ „RPG Vel \nNagar,‟ „RPG Global City,‟ „RPG Metro City,‟ „RPG Swarna Boomi,‟ „RPG \nAravindar City‟ and „RPG Rokkisha Bhoomi.‟  \n2.10 Plaintiff issued cease and desist notices dated 10th August, 2017 to the \ndefendants, inter alia, calling upon the defendants to stop selling/offering for \nsale their projects under the mark „RPG‟, recall their finished infringing \ngoods/promotional materials and give an undertaking to the effect that they \nshall not infringe the marks of the plaintiff in the future. However, despite \nservice, no reply to the said letters has been received by the plaintiff.  \n3. \nAccordingly, the plaintiff filed the present suit seeking to restrain the \ndefendants from carrying on their infringing activities.  \nPROCEEDINGS IN THE SUIT \n4. \nThis Court, vide order dated 10th January, 2018 granted an ex parte ad \ninterim injunction in favour of the plaintiff under I.A. 364/2018, retraining \nthe defendants from using the mark „RPG‟. The relevant portion of the said \norder is as under: \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:24.12.2022 18:20:37\nSignature Not Verified",
          "pdf_source": "10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0009",
      "start_index": 4,
      "end_index": 6,
      "summary": "According to the PDF document \"RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf\", a lawsuit (CS(COMM) 21/2018) was filed in the High Court of Delhi. The plaintiff, M/S RPG Enterprises Limited, alleged trademark infringement and passing off by the defendants, RPG Developers Private Limited. \n\nThe court granted an interim injunction order on December 21, 2022, restraining the defendants from using the registered trademark \"RPG\" and any similar marks. The defendants were served with summons multiple times, but they failed to appear or file a written statement. Consequently, the court proceeded against them ex parte.\n\nThe plaintiff prayed for a decree of permanent injunction, damages, and costs. After analyzing the case, the court found that the defendants had no defense to put forth on merits, despite being given ample opportunity to appear and contest the suit.\n\nThe court compared the plaintiff's mark with the defendants' mark and found similarities. The lawsuit highlights the importance of protecting intellectual property rights, particularly trademarks. The case is a reminder that failure to defend oneself in court can lead to adverse decisions.\n\nKey dates in the case include:\n- February 17, 2018: Defendant no.4 was served through ordinary mode.\n- May 15, 2018: Defendant no.4 was proceeded against ex parte.\n- December 6, 2022: The Joint Registrar closed the right of the defendants to file a written statement.\n- December 21, 2022: The court granted an interim injunction order.\n\nSource: RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf (2022/DHC/005847)",
      "pdf_source": "10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf",
      "nodes": [
        {
          "title": "Page 4",
          "node_id": "0006",
          "start_index": 4,
          "end_index": 4,
          "summary": "According to page 4 of the PDF \"10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf\", the court found a prima facie case of infringement and passing off in favor of the plaintiff, M/S RPG ENTERPRISES LIMITED. The balance of convenience and irreparable harm also favored the plaintiff. As a result, the court restrained the defendants from using the registered trademark \"RPG\" and other similar trademarks/artistic works. \n\nThe matter was then placed before the Joint Registrar for service and completion of pleadings. Defendant no. 4 was proceeded against ex parte on May 15, 2018, after failing to appear or file a written statement. Fresh service of summons was directed for defendants no. 1 to 3 and 5 on March 3, 2020, and September 22, 2021. By July 6, 2022, defendants no. 1 to 3 and 5 were deemed served based on the plaintiff's affidavit of service. (Source: 10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf, 2022/DHC/005847, CS(COMM) 21/2018)",
          "content": "2022/DHC/005847 \nCS(COMM) 21/2018                                                                                                                                          Page 4 of 7 \n \n“Keeping in view the aforesaid, this Court is of the \nopinion that a prima facie case of infringement and passing off is \nmade out in favour of the plaintiff and balance of convenience is \nalso in its favour. Further, irreparable harm or injury would be \ncaused to the plaintiff if an interim injunction order is not \npassed.  \nConsequently, till further orders, the defendants, \ndirectors/proprietors/partners, their principals, employees, \nagents, distributors, franchisees, representatives and assigns \nare restrained from giving any services, in any manner \nwhatsoever and/or using the registered trademark RPG and/or \nRPG Developers and/or artistic work which is a colourable \nimitation of the plaintiff‟s artistic work or any other \ntrademark/artistic work confusingly similar to the registered \ntrade mark/copyright of the plaintiff.” \n5. \nThe matter was thereafter placed before the Joint Registrar for \neffecting service and completion of pleadings. \n6. \nEven though the defendant no.4 was served through ordinary mode on \n17th February, 2018, none appeared for the defendant no.4 on 16th March, \n2018, 9th May, 2018 and 15th May, 2018. Further, no written statement was \nfiled on behalf of the defendant no.4. Consequently, the defendant no.4 was \nproceeded against ex parte on 15th May, 2018. \n7. \nFresh service of summons was directed for the defendants no.1 to 3 \nand 5 on 3rd March, 2020 and 22nd September, 2021  \n8. \nOn 12th January, 2022, the counsel for the plaintiff submitted that all \nthe defendants, with the exception of the defendant no.4, have been duly \nserved and that an affidavit of service has also been filed in this regard. \n9. \nThereafter, vide order dated 6th July, 2022 passed by the Joint \nRegistrar, the defendants no.1 to 3 and 5 were deemed to be served on the \nbasis of the affidavit of service filed on behalf of the plaintiff.  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:24.12.2022 18:20:37\nSignature Not Verified",
          "pdf_source": "10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf",
          "nodes": []
        },
        {
          "title": "Page 5",
          "node_id": "0007",
          "start_index": 5,
          "end_index": 5,
          "summary": "According to page 5 of the PDF \"10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf\", on December 6, 2022, the Joint Registrar closed the right of defendants 1 to 3 and 5 to file a written statement. The plaintiff's counsel prayed for a decree of permanent injunction, damages, and costs. The court noted that defendants 1 to 3 and 5 were served through speed post, courier, and email but chose not to appear. Defendant 4 was proceeded against ex parte on May 15, 2018. The court found that the defendants had no defense to put forth on merits, having failed to enter appearance despite an ad interim injunction order. The case was heard by the court, and the plaintiff's mark was compared to the defendants' mark. (Source: 10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf, 2022/DHC/005847, CS(COMM) 21/2018)",
          "content": "2022/DHC/005847 \nCS(COMM) 21/2018                                                                                                                                          Page 5 of 7 \n \n10. \nOn 6th December, 2022, the Joint Registrar closed the right of the \ndefendants no.1 to 3 and 5 to file written statement and the matter was \nplaced before the Court.  \n11. \nIn view of the above, the counsel for the plaintiff prays for a decree of \npermanent injunction and damages along with costs in the suit. \nANALYSIS AND FINDINGS \n12. \nI have heard the counsel for the plaintiff and perused the record of the \ncase. \n13. \nAt the outset, it may be relevant to note that the defendants no.1 to 3 \nand 5 has been served through speed post, courier and email. Despite this, \nthe defendants no.1 to 3 and 5 have chosen not to enter appearance. The \ndefendant no.4 has also been proceeded against ex parte on 15th May, 2018. \nAmple opportunity has been given to the defendants to appear before the \nCourt and defend the case. \n14. \nSince the defendants have failed to enter appearance or even take any \nsteps requisite to contest the present suit, despite having suffered an ad \ninterim injunction order, it is evident that they have no defence to put forth \non merits.  \n15. \nAt this stage, it may be relevant to note the comparison between the \nmarks of the plaintiff and the defendants, which is as under: \nPLAINTIFF’S MARK \nDEFENDANTS’ MARK \n \n \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:24.12.2022 18:20:37\nSignature Not Verified",
          "pdf_source": "10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf",
          "nodes": []
        },
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "According to page 6 of the PDF \"10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf\", the High Court of Delhi ruled in favor of the plaintiff, M/s RPG Enterprises Limited. The court found that the defendant's use of the \"RPG\" mark was an attempt to ride on the plaintiff's goodwill and reputation. The court granted a permanent injunction, restraining the defendants from using the \"RPG\" and \"RPG DEVELOPERS\" trademarks. The suit was decreed in terms of prayer clauses \"a\", \"b\", and \"c\" of the plaint. The court also noted that the defendants were trading under the name \"M/s RPG DEVELOPERS\" to dupe the public into believing they were associated with the plaintiff, a reputed industrial conglomerate. The decision was made on December 21, 2022. (Source: 2022/DHC/005847, CS(COMM) 21/2018)",
          "content": "2022/DHC/005847 \nCS(COMM) 21/2018                                                                                                                                          Page 6 of 7 \n \n16. \nFrom a perusal of the competing marks above, this Court is of the \nview that the defendants‟ use of the „RPG‟ marks is nothing but an attempt \nto ride on the goodwill and reputation of the plaintiff‟s well-known \ntrademarks. This is further evidenced from the prominent use of the marks \n„RPG‟/ \n \non \nthe \ndefendants‟ \nwebsite \n“www.rpgdevelopers.in”, screenshots of which have been annexed at pages \n45 to 47 of the documents filed along with the plaint. \n17. \nBased on the averments in the plaint and the discussion above, this \nCourt is of the view that this is a fit case for granting relief of permanent \ninjunction. The defendants are restrained from offering/rendering any \nservices using the impugned trademark „RPG‟ and/or „RPG DEVELOPERS‟ \nand/or artistic work which is a colourable imitation of the plaintiff‟s artistic \nwork or any other trademark/artistic work deceptively similar to the „RPG‟ \nmarks of the plaintiff. \n18. \nAccordingly, the present suit is decreed in terms of prayer clauses „a.‟, \n„b.‟ and „c.‟ of the plaint.  \n19. \nAt this stage, counsel for the plaintiff does not press for the reliefs \ncontemplated in prayer clauses „d.‟ and „e.‟ of the plaint. \n20. \nInsofar as the relief of damages as sought in prayer clause „f.‟ is \nconcerned, the defendants are trading under the name „M/s RPG \nDEVELOPERS‟ in order to dupe the general public into believing that the \ndefendants are a subsidiary/group company/joint venture of the plaintiff, \nwhich is a reputed industrial conglomerate in the business of infrastructure. \nProjects of the defendants are being listed on their website using the „RPG‟ \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:24.12.2022 18:20:37\nSignature Not Verified",
          "pdf_source": "10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0011",
      "start_index": 7,
      "end_index": 7,
      "summary": "According to the PDF document \"RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf\", the High Court of Delhi at New Delhi made a decision on December 21, 2022, in the case CS(COMM) 21/2018. The plaintiff, M/S RPG ENTERPRISES LIMITED, sued the defendants, RPG DEVELOPERS PRIVATE LIMITED, for allegedly misusing the \"RPG\" mark owned by the plaintiff. \n\nThe court found that the defendants had failed to respond to legal notices sent on August 10, 2017, and had also chosen not to participate in the proceedings despite being served. The court determined that this was not a case of innocent adoption, but rather a flagrant misuse of the plaintiff's marks by the defendants.\n\nAs a result, the court decreed the suit in favor of the plaintiff, awarding Rs.3,00,000/- as damages and an additional Rs.3,00,000/- as costs to be paid by the defendants. The defendants were given eight weeks to pay the amount, failing which the plaintiff could commence execution proceedings against them. All pending applications were disposed of, and a decree sheet was to be drawn up. The decision was made by Judge Amit Bansal on December 21, 2022, and digitally signed on December 24, 2022. (Source: 2022/DHC/005847, RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf)",
      "pdf_source": "10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf",
      "nodes": [
        {
          "title": "Page 7",
          "node_id": "0010",
          "start_index": 7,
          "end_index": 7,
          "summary": "According to page 7 of the PDF \"10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf\", the High Court of Delhi decreed the suit in favor of the plaintiff, M/S RPG ENTERPRISES LIMITED, due to the defendants' dishonest conduct and misuse of the plaintiff's \"RPG\" mark. The defendants failed to respond to legal notices and stayed away from the proceedings despite being served. The court awarded the plaintiff Rs.3,00,000/- as damages and Rs.3,00,000/- as costs to be paid by the defendants within eight weeks. If the defendants fail to pay, the plaintiff can commence execution proceedings. The decision was made by Judge Amit Bansal on December 21, 2022. All pending applications were disposed of, and a decree sheet was to be drawn up. (Source: 10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf, page 7)",
          "content": "2022/DHC/005847 \nCS(COMM) 21/2018                                                                                                                                          Page 7 of 7 \n \nmark of the plaintiff. The defendants have also failed to respond to the legal \nnotices dated 10th August, 2017 sent to them on behalf of the plaintiff, \nrequiring them to cease and desist from their use of the „RPG‟ mark of the \nplaintiff. Moreover, the defendants have also chosen to stay away from the \npresent proceedings, despite service. \n21. \nIn view of the foregoing facts and circumstances, this Court is of the \nview that this is not a case of innocent adoption. The Court cannot ignore \nsuch flagrant misuse of the plaintiff‟s marks by the defendants. Therefore, \nconsidering the dishonest conduct of the defendant, the suit is decreed in \nfavour of the plaintiff for Rs.3,00,000/- as damages. Additionally, \nRs.3,00,000/- is awarded to the plaintiff as costs to be paid by the \ndefendants. \n22. \nThe defendants shall pay the said amount to the plaintiff within eight \nweeks, failing which the plaintiff is permitted to commence execution \nproceedings against the defendants. \n23. \nAll pending applications are disposed of. \n24. \nDecree sheet be drawn up. \n \n \nAMIT BANSAL, J. \nDECEMBER 21, 2022 \nat \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:24.12.2022 18:20:37\nSignature Not Verified",
          "pdf_source": "10. RPG ENTERPRISES LIMITED VS. RPG DEVELOPERS PRIVATE LIMITED.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-15T18:28:22.255730",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}