{
  "doc_name": "11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR",
  "pdf_source": "11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf",
  "metadata": {
    "document_name": "11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR",
    "source_pdf": "11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf",
    "judges": [
      "HON’BLE AMIT BANSAL"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "606/2022",
      "606/2022",
      "606/202",
      "606/202",
      "606/2022",
      "606/2022",
      "606/2022",
      "606/202",
      "606/2022",
      "606/2022",
      "606/2022",
      "606/202",
      "606/2022",
      "606/202",
      "606/202",
      "606/2022",
      "606/2022",
      "16403/2022",
      "17064/2022",
      "16402/2022",
      "17085/2022",
      "14162/2022",
      "16402/2022",
      "14162/2022",
      "16402/2022",
      "16402/2022",
      "14162/2022",
      "16402/2022"
    ],
    "dhc_numbers": [
      "2023/DHC/000041",
      "2023/DHC/000041",
      "2023/DHC/000041",
      "2023/DHC/000041",
      "2023/DHC/000041",
      "2023/DHC/000041",
      "2023/DHC/000041",
      "2023/DHC/000041",
      "2023/DHC/000041",
      "2023/DHC/000041",
      "2023/DHC/000041",
      "2023/DHC/000041",
      "2023/DHC/000041",
      "2023/DHC/000041",
      "2023/DHC/000041"
    ],
    "ia_numbers": [],
    "decision_date": "16 December, 2022",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      "AIWA CO. LTD."
    ],
    "defendants": [
      "AIVVA ENTERPRISES PRIVATE LIMITED"
    ],
    "appellants": [],
    "respondents": [],
    "plaintiff_advocates": [
      "Ms. Anuradha Salhotra",
      "Mr. Sumit Wadhwa",
      "Mr. Ayush Samaddar"
    ],
    "defendant_advocates": [
      "Mr. S.K. Bansal",
      "Mr. Pankaj Kumar"
    ],
    "appellant_advocates": [],
    "respondent_advocates": [],
    "damages_claimed": null,
    "damages_awarded": null,
    "key_issues": [
      "Trademarks infringement is alleged by the plaintiff, AIWA CO. LTD., against the defendants, AIVVA ENTERPRISES PRIVATE LIMITED & ORS., for using a deceptively similar mark 'AIVVA'.",
      "The plaintiff claims to have worldwide trademark registrations in respect of its mark 'AIWA' and its formative marks, and has acquired tremendous reputation and goodwill throughout the world.",
      "The use of the mark 'AIVVA' by the defendants is claimed to be identical or deceptively similar to the plaintiff's trademarks, and may cause confusion among customers.",
      "The plaintiff has sought a permanent injunction to restrain the defendants from using the mark 'AIVVA' or any other mark that may be identical or deceptively similar to the plaintiff's trademarks.",
      "An ex parte ad interim injunction was granted by the Court in favor of the plaintiff, restraining the defendants from using the impugned marks.",
      "The defendants' use of the mark 'AIVVA' is also alleged to constitute passing off, as it may deceive customers into believing that the defendants' products are associated with the plaintiff.",
      "The plaintiff has claimed that the defendants have copied the stylized version of the plaintiff's mark, which is a serious infringement of the plaintiff's trademark rights.",
      "The registration of the mark 'AIVVA' by the defendants is alleged to be an attempt to pass off their products as those of the plaintiff.",
      "The plaintiff has sought ancillary reliefs, including damages and costs, in addition to the permanent injunction.",
      "The Court has to determine whether the defendants' use of the mark 'AIVVA' constitutes an infringement of the plaintiff's trademark rights and whether the plaintiff is entitled to the reliefs sought."
    ],
    "decision_summary": "**Case Summary: AIWA Co. Ltd. vs. AIVVA Enterprises Private Limited & Ors.**\n\n**Background:**\nThe plaintiff, AIWA Co. Ltd., a Japanese company, is the registered proprietor of the trademark \"AIWA\" in various classes, including Class 9 (televisions and audio equipment). The defendants, AIVVA Enterprises Private Limited and others, are allegedly using the mark \"AIVVA\" and its stylized version, which is deceptively similar to the plaintiff's trademark \"AIWA\". The plaintiff claims that the defendants' actions amount to trademark infringement and passing off.\n\n**Legal Issues:**\nThe legal issues in this case involve trademark infringement and passing off under the Code of Civil Procedure, 1908 (CPC). The plaintiff seeks a permanent injunction to restrain the defendants from using the mark \"AIVVA\" or any other mark that is identical or deceptively similar to the plaintiff's trademark \"AIWA\".\n\n**Arguments:**\nThe plaintiff argues that:\n\n1. The defendants' use of the mark \"AIVVA\" is deceptively similar to the plaintiff's trademark \"AIWA\", which is a well-known mark worldwide.\n2. The defendants have copied the stylized version of the plaintiff's mark, which is a clear indication of intent to pass off their goods as those of the plaintiff.\n3. The defendants' actions have caused and are likely to cause confusion among consumers, amounting to passing off.\n\nThe defendants' arguments are not explicitly stated in the provided pages, but it can be inferred that they may argue that their mark \"AIVVA\" is not deceptively similar to the plaintiff's mark \"AIWA\" or that they have not intended to pass off their goods as those of the plaintiff.\n\n**Court Findings:**\nThe court, after considering the plaintiff's application, granted an ex parte ad interim injunction in favor of the plaintiff, restraining the defendants from using the mark \"AIVVA\" or any other mark that is identical or deceptively similar to the plaintiff's trademark \"AIWA\". The court found that the defendants' use of the mark \"AIVVA\" was deceptively similar to the plaintiff's mark and that the defendants had copied the stylized version of the plaintiff's mark.\n\n**Decision:**\nThe court's decision is to grant a permanent injunction to the plaintiff, restraining the defendants from using the mark \"AIVVA\" or any other mark that is identical or deceptively similar to the plaintiff's trademark \"AIWA\". The court's order includes the following terms:\n\n1. The defendants are restrained from using the mark \"AIVVA\" or any other mark that is identical or deceptively similar to the plaintiff's trademark \"AIWA\".\n2. The defendants are restrained from using the mark \"AIVVA\" or any other mark that is deceptively similar to the plaintiff's trademark \"AIWA\" as a trademark or part of a trademark, a corporate name/trade name, a domain name or part of a domain name, an email address or part of an email address, or in any manner whatsoever in relation to their goods/services that are similar to those of the plaintiff.\n\nThe court's decision is based on the finding that the defendants' use of the mark \"AIVVA\" is deceptively similar to the plaintiff's trademark \"AIWA\" and that the defendants have intended to pass off their goods as those of the plaintiff.",
    "legal_precedents": [
      "(1996) 9 SCC 430",
      "(2001) 93 DLT 346",
      "Thukral Mechanical Works Nitin Machine Tools"
    ],
    "full_text": "\n--- PAGE 1 ---\n2023/DHC/000041\nCS(COMM) 606/2022\nPage 1 of 15\n*\nIN THE HIGH COURT OF DELHI AT NEW DELHI\n%\nJudgment Reserved On: 16th December, 2022\nJudgment Delivered On: 05th January, 2023\n+\nCS(COMM) 606/2022 & I.A. 16403/2022 (u/S 151 CPC-for release\nof seized goods), I.A. 17064/2022 (for condonation of delay of 1\nday in filing reply to I.A. 16402/2022), I.A. 17085/2022 (for\nexemption from filing notarized and apostilled copy of the Power\nof Attorney)\nAIWA CO. LTD.\n..... Plaintiff\nThrough:\nMs.Anuradha Salhotra with Mr.Sumit\nWadhwa and Mr.Ayush Samaddar,\nAdvocates.\nVersus\nAIVVA ENTERPRISES PRIVATE LIMITED & ORS.\n..... Defendants\nThrough:\nMr.S.K.\nBansal\nand\nMr.Pankaj\nKumar, Advocates.\nCORAM:\nHON’BLE MR. JUSTICE AMIT BANSAL\nJUDGMENT\nAMIT BANSAL, J.\nI.A. 14162/2022 (O-XXXIX R-1 & 2 of the CPC) &I.A. 16402/2022 (O-\nXXXIX R-4 of the CPC)\n1.\nBy way of the present judgment, I propose to dispose of the\napplication filed on behalf of the plaintiff under Order XXXIX Rules 1 and\n2 of the Code of Civil Procedure, 1908 (CPC) and the application filed on\nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified\n\n--- PAGE 2 ---\nCS(COMM) 606/202\nbehalf of the d\nvacation of the e\nGENESIS OF TH\n2.\nThe case\n2.1\nThe plain\nregistered propr\nClass 9 (televisi\n2.2\nThe word\ncorporate name\n2.3\nThe plain\nfrom 19th Octo\ntrademarks\nSeptember, 199\n2.4\nThe plain\nwell-known ma\n2007.\n2.5\nThe plain\ntrademark ‘AIW\nhave acquired a\n2.6\nIn Augus\nusing the word\ngoods and as a p\nonly the mark ‘A\n2023/DHC/000041\n22\ndefendants under Order XXXIX Rul\nex parte ad interim injunction granted b\nHE DISPUTE\nset up by the plaintiff in the plaint is as\nntiff company, which is incorporat\nrietor of the trademark ‘AIWA’ in vari\nons and audio equipment).\nd ‘AIWA’ also forms part of the trad\nas well as the email address of the plai\nntiff holds registration of the word mar\nober, 1982 and the stylized versio\nand\nin Class\n1 and 29th January, 2003 respectively.\nntiff’s trademark ‘AIWA’ has been i\narks maintained by the Trademark Re\nntiff holds worldwide trademark registr\nWA’ and its formative marks and the\ntremendous reputation and goodwill th\nst, 2022, the plaintiff became aware\nmark ‘AIVVA’ and the stylized ver\nthrough its brochure, both as a trade\npart of its corporate name. The defenda\nAIVVA’ but had also copied the styliz\nPage 2 of 15\nle 4 of the CPC for\nby this Court.\ns follows:\nted in Japan, is the\nious classes, including\nding style, both as the\nintiff.\nrk ‘AIWA’ with effect\nons of the aforesaid\n9 with effect from 12th\nncluded in the list of\negistry since the year\nrations in respect of its\ngoods of the plaintiff\nhroughout the world.\nof the defendant no.1\nrsion of the same i.e.,\nemark in relation to its\nant no.1 was using not\nzed manner adopted by\nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified\n\n--- PAGE 3 ---\nCS(COMM) 606/202\nthe plaintiff i.e.,\nclaimed to have\nthe alphabet ‘R\nregistration of th\n2.7\nThe plain\nrelevant class w\nin the name of th\n2.8\nThe plain\ndefendant no.1 a\nare also using\nThe defendant\nproducts.\n3.\nAccording\npermanent injun\n‘AIVVA’ /\nENTERPRISES\nbe identical or d\nthe trademarks\ntrademarks or an\nthe plaintiff and\n4.\nVide orde\nparte ad interim\n“26. Acc\nimpugned\n2023/DHC/000041\n22\n,\n. As per the brochu\ne registration in respect of the mark\nR’ placed in a circle on the top ri\nhe mark.\nntiff conducted a search in the Trade\nwhich revealed that there was no registr\nhe defendant no.1 or the defendant no.2\nntiff arranged for the purchase of a\nand found that apart from the mark ‘AI\nthe marks\n,\nno.2 was also involved in selling th\ngly, the present suit has been filed\nnction restraining the defendants from\n/\n/\nS PRIVATE LIMITED’, and/or any ot\ndeceptively similar to that of the plain\nof the plaintiff or constituting passi\nny part of the trade name, corporate na\nd other ancillary reliefs.\ner dated 2nd September, 2022, this Co\nm injunction in I.A.14162/2022 in the fo\ncordingly, Defendants are restrained\nd\nmarks,\ni.e.\nAIVVA/\n/ AIVVA ENTERPRISES PRIV\nPage 3 of 15\nure, the defendant no.1\nwith\night corner to denote\nemark Registry in the\nration of the said mark\n2.\na TV set sold by the\nIVVA’, the defendants\nand\n.\nhe aforesaid infringing\nseeking the relief of\nm using the trademarks\n/\n‘AIVVA\nther marks which may\nntiff, thereby infringing\ning off by use of the\name or domain name of\nourt had passed an ex\nollowing terms:\nfrom using the\n/\n/\nVATE LIMITED\nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified\n\n--- PAGE 4 ---\n2023/DHC/000041\nCS(COMM) 606/2022\nPage 4 of 15\nand/or any other mark/name identical/deceptively similar to\nPlaintiffs AIWA Marks, either by themselves or in conjunction\nwith any other word, as a trademark or part of a trademark, a\ncorporate name/trade name, a domain name or part of a\ndomain name, an email address or part of an email address, or\nin any manner whatsoever in relation to their goods/services\nwhich are similar to those of the Plaintiff, amounting to\ninfringement and passing off, till the next date of hearing.\n27.\nDefendants are directed to take down their webpage from\nthe\ne-commerce\nplatform\nIndia\nMART\nhttps://www.indiamart.com/usha-electrotradeagencies/ and not\nto advertise the trademark AIWA or any other mark deceptively\nsimilar thereto.”\n5.\nAggrieved by the aforesaid injunction order, the defendants filed\nI.A.16402/2022. Notice in this application was issued on 10th October, 2022\nand reply thereto has been filed on behalf of the plaintiff.\nSUBMISSIONS OF THE DEFENDANTS\n6.\nThe counsel for the defendants made the following submissions:\n6.1\nIt has wrongly been stated in the plaint that the plaintiff learnt of the\ndefendants’ use of the impugned marks in August, 2022 and have\napproached the Court without any delay. As is evident from the legal notice\ndated 17th August, 2020, the plaintiff was aware of the user of the mark\n‘AIVVA’ in August, 2020 by the defendants no.1 and 2, who were selling\nand marketing their products under the mark ‘AIVVA’ and the said products\nare also available for purchase on e-commerce platforms like IndiaMART.\n6.2\nThe plaintiff has deliberately not disclosed the legal notice or its reply\nin the plaint.\n6.3\nA reading of the aforesaid legal notice shows that the plaintiff was\nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified\n\n--- PAGE 5 ---\n2023/DHC/000041\nCS(COMM) 606/2022\nPage 5 of 15\naware about the use of the ‘AIVVA’ trademark by Mr. Ajjaay Advani as\nwell as the registrations of the trademark ‘AIVVA’ in his favour in the year\n2015.\n6.4\nThe aforesaid legal notice was copied to a Hong Kong based entity,\nNu-World Global, which has been described in paragraph 2 of the aforesaid\nnotice as an entity to which rights to manufacture and sell products under the\n‘AIWA’ trademark have been assigned by the plaintiff. Further, the\naforesaid Nu-World Global assigned the rights in favour of Aiwa Consumer\nProducts LLP, a partnership firm in India on whose behalf the aforesaid\nlegal notice was sent. Therefore, the plaintiff cannot claim ignorance of the\naforesaid legal notice. This fact has also been stated in paragraph 5 (ii) of\nI.A. 16402/2022 and no specific denial thereto has been made on behalf of\nthe plaintiff.\n6.5\nIt has further been stated in the aforesaid legal notice that the\ndefendants no.1 and 2 are acting in connivance with Mr. Ajjaay Advani. The\naforesaid legal notice was duly replied to on behalf of Mr. Ajjaay Advani,\nwherein it was stated that the mark ‘AIVVA’ has been registered by him\nunder Classes 7, 9 and 11 as far back as in December, 2015. It was also\nstated in the reply that the domain name ‘www.aivva.com’ has been\nregistered by Mr. Ajjaay Advani in February, 2017.\n6.6\nThe plaintiff was aware of the registration of the mark ‘AIVVA’ in\nfavour of Mr. Ajjaay Advani but has failed to challenge the same. Despite\nalleging connivance between Mr. Ajjaay Advani and the defendants, Mr.\nAjjaay Advani has not been made a party in the suit.\n6.7\nIn the affidavit filed on behalf of Mr. Ajjaay Advani filed along with\nthe written statement, it has been stated that Mr. Ajjaay Advani has given\nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified\n\n--- PAGE 6 ---\n2023/DHC/000041\nCS(COMM) 606/2022\nPage 6 of 15\npermission to the defendants no.1 and 2 to use the trademark ‘AIVVA’.\n6.8\nNo written authorization was required to be given by a registered\nproprietor of a trademark for use of the aforesaid trademark. Reliance in this\nregard is placed on the judgment of the Supreme Court in Cycle\nCorporation of India Ltd. v. T.I. Raleigh Industries Pvt. Ltd. and Ors.,\n(1996) 9 SCC 430.\n6.9\nIt has wrongly been stated in the plaint that the defendants have been\nselling TVs under the mark ‘AIWA’ as the defendants have only been\nselling TVs under the mark ‘AIVVA’. Reliance has been placed on the\nvarious invoices of the defendants from May, 2016 in this regard.\n6.10\nNo documents have been filed on behalf of the plaintiff showing user\nof the trademark ‘AIWA’ prior to the user of the defendants. On the other\nhand, defendants have filed invoices to show their user of the trademark\n‘AIVVA’ since 2016.\n7.\nCounsel for the defendants has also placed reliance on the judgments\nin Micolube India Ltd. v. Maggon Auto Centre &Anr., 2008 (36) PTC 231\n(Del.), Thukral Mechanical Works v. Nitin Machine Tools P. Ltd. &Anr.,\n(1998) 18 PTC 767, Standipack Private Limited &Ors. v. Oswal Trading\nCo. Ltd. &Ors., 1999 PTC (19) 479, B.L. and Co. and others v. Pfizer\nProducts Incl., (2001) 93 DLT 346 (DB) and Kent Ro System Ltd. v.\nGattubhai, 2022 SCC OnLine Del 791.\nSUBMISSIONS OF THE PLAINTIFF\n8.\nPer contra, counsel for the plaintiff made the following submissions:\n8.1\nThe plaintiff duly conducted a search of the Trademark Registry\nbefore filing the present suit and has filed the search report along with the\nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified\n\n--- PAGE 7 ---\nCS(COMM) 606/202\nplaint, in terms o\nAjjaay Advani.\n8.2\nThe defen\nor any other wr\nThere is nothin\nAdvani.\n8.3\nThe very\nthe CPC is bas\nAugust, 2020 w\n8.4\nThe afore\nplaintiff, nor did\nbeing sent to Mr\n8.5\nThe prese\nas it is the said\ntrademark of the\n8.6\nThe use\nand\ncorporate name,\nbut also an attem\nwell-known trad\n8.7\nIt is wron\nplaintiff’s tradem\nthe additional d\ndefendants are\n‘www.indiamart\n2023/DHC/000041\n22\nof which the mark ‘AIVVA’ is register\nndant companies have failed to show th\nritten authorization in their favour from\nng to suggest that the defendants are\npremise of the application under Ord\ned on a wrong assumption that the l\nas sent on behalf of the plaintiff.\nesaid notice was neither sent by the pla\nd the plaintiff have any knowledge abo\nr. Ajjaay Advani.\nent suit has been filed only against the\ndefendants who were selling goods th\ne plaintiff.\nand adoption of the trademarks ‘A\nby the defendants, inclu\n, is not only infringement of the trade\nmpt to ride on the reputation and goo\ndemark.\nng to state that the defendants are not\nmark ‘AIWA’. Attention of the Court\ndocuments filed on behalf of the plai\nselling TVs with the mark\nt.com’.\nPage 7 of 15\nred in the name of Mr.\nhat they have a license\nm Mr. Ajjaay Advani.\nrelated to Mr. Ajjaay\nder XXXIX Rule 4 of\nlegal notice dated 17th\naintiff/on behalf of the\nout the aforesaid notice\ndefendants no.1 and 2\nhat were infringing the\nAIVVA’,\n,\nuding as a part of their\nemarks of the plaintiff\ndwill of the plaintiff’s\nselling TVs under the\nis drawn to page 16 of\nintiff to show that the\non the website\nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified\n\n--- PAGE 8 ---\n2023/DHC/000041\nCS(COMM) 606/2022\nPage 8 of 15\n8.8\nIn their brochure, the defendant no.1 is also using the word ‘aiwa’ as a\npart of its email address.\n8.9\nThe reliance placed by the defendants on the affidavit of Mr. Ajjaay\nAdvani is completely misplaced as the aforesaid affidavit is dated 29th\nSeptember, 2022, after the interim order was passed by this Court on 1st\nSeptember, 2022.\n8.10\nIn\nterms\nof\nSection\n2(1)(r)(ii)\nof\nthe\nTrade\nMarks\nAct,\n1999,‘permitted user can only be by way of a written agreement’. The\ndefendants have failed to place on record any written agreement between\nthem and Mr. Ajjaay Advani permitting the use of the trademark ‘AIWA’ by\nthe defendants with effect from 2015.\n8.11\nReliance placed on the judgment in Raleigh Industries (supra) is\nmisplaced as the aforesaid judgment was under the Trade and Merchandise\nMarks Act, 1958 (old Act). In any case, the defendants have failed to show\nan unbroken trade connection between the defendants and Mr. Ajjaay\nAdvani and therefore, the judgment in Raleigh Industries (supra) is not\napplicable.\n8.12\nThe defendants in their brochure have wrongly claimed registration of\nthe mark ‘AIVVA’, when in fact, they were not the registered proprietors of\nthe aforesaid trademark. In any event, the defendants were not authorized to\nuse the stylized imitation of the plaintiff’s trademark as there was no\nregistration in respect of such stylized version.\nANALYSIS & FINDINGS\n9.\nI shall now proceed to deal with the rival contentions raised by the\ncounsels appearing on behalf of the parties.\nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified\n\n--- PAGE 9 ---\n2023/DHC/000041\nCS(COMM) 606/2022\nPage 9 of 15\n10.\nSince the case of the defendants is primarily premised on the legal\nnotice dated 17th August, 2020, I propose to deal with the same first.\n11.\nThe aforesaid legal notice has been sent on behalf of one Aiwa\nConsumer Products LLP, a partnership firm having its corporate office at A-\n62, Naraina Industrial Area, Phase-I, New Delhi-110028. There is nothing\non record to suggest any connection of the aforesaid entity with the plaintiff\ncompany or the fact that the plaintiff company was aware of sending of the\naforesaid legal notice.\n12.\nCounsel for the defendants has vehemently submitted that the term\n‘my client’ in the aforesaid notice would include the principals of the entity\nsending the notice. However, nothing has been placed on record to show that\nthe plaintiff company is the principal of the aforesaid entity. Merely because\nthe entity sending the legal notice uses the name ‘AIWA’ or that the plaintiff\ncompany has not initiated any legal action against the aforesaid entity for\nhaving sent the legal notice using the name of the plaintiff company, it\ncannot be contended that the aforesaid notice was sent with the knowledge\nand consent of the plaintiff company. It was for the defendants to show that\nthere was a connection between the said entity and the plaintiff company or\nthat the plaintiff company was aware of the aforesaid legal notice.\n13.\nOnce again, the fact that the aforesaid legal notice is copied to Nu-\nWorld Global, who is stated to be an assignee of the plaintiff company,\nwould not be sufficient to attribute knowledge of the aforesaid legal notice\nto the plaintiff company. To make good the allegations of suppression and\nconcealment, the defendants would have to show that it was within the\nknowledge of the plaintiff company that the aforesaid legal notice was sent\non their behalf. This has not been done in the present case and therefore, I do\nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified\n\n--- PAGE 10 ---\n2023/DHC/000041\nCS(COMM) 606/2022\nPage 10 of 15\nnot find merit in the submission of the defendants that the plaintiff was\naware of the legal notice or that they had deliberately suppressed the\naforesaid legal notice in order to obtain an ex parte ad interim injunction\nagainst the defendants.\n14.\nIn view of the above, there is no reason to disbelieve the submission\nmade in the plaint that the plaintiff company became aware of the\ndefendants no.1 and 2 infringing its trademark only in August, 2022, upon\ncoming across the brochure of the defendants and soon thereafter, the\npresent suit was filed. In other words, there is no basis to contend that the\ninterim order passed by this Court on 2nd September, 2022 was passed on the\naccount of concealment and suppression on behalf of the plaintiff or that\nthere was any delay on behalf of the plaintiff in filing the present suit. In\nview thereof, the judgments relied upon by the defendants in respect of\nconcealment i.e., Micolube India Ltd. (supra), Thukral Mechanical Works\n(supra), Standipack Private Limited (supra) and Kent Ro System Ltd.\n(supra) would not have any application to the facts and circumstances of the\npresent case. Further, the judgment in B.L. and Co. (supra) in respect of\ndelay would also be of no aid to the defendants.\n15.\nA perusal of the Company Master Data in respect of the defendant\nno.1 and 2 companies, as available on the website of Registrar of Companies\n(ROC), would show that Mr. Ajjaay Advani is neither a Director, nor a\nshareholder of the defendant companies. Nor have the defendants placed any\nlicense or other document assigning the mark ‘AIVVA’ in their favour from\nMr. Ajjaay Advani so as to justify their use of the said mark. Therefore, the\nreliance placed by the defendants on the registration granted in favour of Mr.\nAjjaay Advani is completely misplaced.\nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified\n\n--- PAGE 11 ---\nCS(COMM) 606/202\n16.\nThe defen\nmark ‘AIVVA’\nthis regard, reli\nallegedly affirm\ntrademark ‘AIV\naffidavit is extra\n“4.\nTha\nPri\nSho\nMa\n(Ind\nAge\nKal\ncom\nin\nbeg\n5.\nTha\nnam\nUsh\nfrie\n17.\nIn my con\nof the defendant\nfailed to place\nAdvani in their\nfrom the year\nthemselves in t\ntrademark\ncircle. Even if it\nto use the afore\nuser was on th\n2023/DHC/000041\n22\nndants have submitted that they were\nby Mr. Ajjaay Advani, the registered\niance is placed on an affidavit dated\nmed by Mr. Ajjaay Advani, the regist\nVVA’ under Classes 7, 9 and 11. Th\nacted below:\nat I have granted permission to M/s. Ai\nivate Limited, Usha Agencies, Shop N\nopping\nCentre,\nUlhasnagar,\naharashtra and M/s. Usha Electro\ndia) Pvt. Ltd., Trading as Usha\nencies, Shop No. 2 & 3, Sai Viha\nlyan, Thane-421003, Maharashtra (w\nmpanies) to use my aforesaid said trad\nrelation to said goods and business\nginning.\nat the directors of aforementioned gr\nmely M/s. Aivva Enterprises Private L\nha Electrotrade Agencies (India) Pv\nends and known to me.”\nnsidered view, the aforesaid affidavit\nts using the mark ‘AIVVA’ since 2016\nany contemporaneous document exe\nfavour that authorized them to use the\n2016. Further, the defendants hav\ntheir brochure as being the register\nby using the symbol\nt is assumed that they were permitted\nsaid trademarks, the brochure should h\nhe basis of permission or license gr\nPage 11 of 15\ne permitted to use the\nd proprietor thereof. In\n29th September, 2022\ntered proprietor of the\nhe relevant part of the\nivva Enterprises\nNo. 9-10, Tilson\nThane-421003,\ntrade Agencies\nAgency/ Usha\nr, Shivaji Path\nwhich are group\ndemark \"AIVVA\"\ns from the very\nroup companies\nLimited and M/s.\nvt. Ltd. are my\ncannot form the basis\n6. The defendants have\necuted by Mr. Ajjaay\ne aforesaid trademarks\nve wrongly projected\nred proprietors of the\nof the letter ‘R’ in a\nby Mr. Ajjaay Advani\nhave indicated that the\nranted by Mr. Ajjaay\nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified\n\n--- PAGE 12 ---\n2023/DHC/000041\nCS(COMM) 606/2022\nPage 12 of 15\nAdvani. By way of the aforesaid affidavit, a right cannot be created in\nfavour of the defendants to use the trademark ‘AIVVA’ retrospectively.\nClearly, the aforesaid affidavit has been executed at this belated stage only\nto support the defendants in the present case. In this regard, reference may\nbe made to Section 2(1)(r)(ii) of the Trade Marks Act, 1999, which defines\n“permitted use” as under:\n“(r) “permitted use”, in relation to a registered trade mark,\nmeans the use of trade mark—\n(ii)\nby a person other than the registered proprietor\nand registered user in relation to goods or\nservices—\n(a)\nwith which he is connected in the course of\ntrade; and\n(b)\nin respect of which the trade mark remains\nregistered for the time being; and\n(c)\nby consent of such registered proprietor in a\nwritten agreement; and\n(d)\nwhich\ncomplies\nwith\nany\nconditions\nor\nlimitations to which such user is subject and to\nwhich the registration of the trade mark is\nsubject”\n18.\nThe term “permitted use” was defined in the old Act as under:\n“2. Definitions and interpretation.—(1) In this Act, unless the\ncontext otherwise requires—\n(m) “permitted use”, in relation to a registered trade mark,\nmeans the use of a trade mark—\n(i) by a registered user of the trade mark in relation to\ngoods—\n(a) with which he is connected in the course of trade; and\n(b) in respect of which the trade mark remains registered\nfor the time being; and\n(c) for which he is registered as registered user; and\n(ii) which complies with any conditions or restrictions to\nwhich the registration of the trade mark is subject;”\nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified\n\n--- PAGE 13 ---\nCS(COMM) 606/202\n19.\nA compa\nabove reflects th\nregistered tradem\nproprietor, whic\n20.\nThere is m\nthe judgment in\ncase as the sam\nunder the old\nagreement. Ther\nthe registered pr\nthereof since 20\nuse the stylized\nno registration in\n21.\nThe conte\nsuit without con\nhave shown that\nmisplaced. The\nplaint that the a\nAjjaay Advani\nthis regard.\n22.\nOnce aga\nthe plaintiff has\npresent suit.\nIt\nlitigate and cann\nwish to seek any\n2023/DHC/000041\n22\narison of the two definitions of “perm\nhat the Trade Marks Act, 1999 require\nmark to be founded on the written con\nch condition was not contemplated unde\nmerit in the submissions of the counse\nn Raleigh Industries (supra) is not app\nme was in the context of the definitio\nAct, wherein the permitted use did\nrefore, the defendants have failed to sh\nroprietors of the trademark ‘AIVVA’\n015. Further, there is no justification\nmarks\nand\nin re\nn favour of the defendants or Mr. Ajjaa\nention of the defendants that the plainti\nnducting any search of the Trademark R\nt the mark ‘AIVVA’ is already register\nplaintiff company has duly averred i\naforesaid mark ‘AIVVA’ is registered\nand has also filed the Trademark Reg\nain, there is no merit in the contention\ns deliberately not made Mr. Ajjaay A\nt is for the plaintiff to decide agains\nnot be compelled to sue a person agai\ny relief. The defendants cannot dictate\nPage 13 of 15\nmitted use” as set out\nes “permitted use” of a\nnsent of the registered\ner the old Act.\nel for the plaintiff that\nplicable in the present\non of “permitted use”\nd not include written\nhow that they are either\nor are permitted users\nn for the defendants to\nspect of which there is\nay Advani.\niff has filed the present\nRegistry, which would\nred, is also completely\nn paragraph 14 of the\nd in the name of Mr.\ngistry search report in\nof the defendants that\nAdvani a party in the\nst whom he wishes to\ninst whom he does not\ne to the plaintiff which\nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified\n\n--- PAGE 14 ---\nCS(COMM) 606/202\nparty to make a\nplaintiff is again\ntrademarks of th\nAdvani was a ne\n23.\nCounsel\nwrongly stated\nused the tradem\nproducts of the\nshows that the\nthe plaintiff com\nlarge inasmuch\nemail address a\nfiled by the def\nwrongly stated t\n24.\nA compa\nplaintiff shows t\nphonetically sim\ndefendants are\nplaced on reco\njurisdictions inc\nthe ‘AIWA’ ma\nincurred for adv\nthe plaintiff has\n2023/DHC/000041\n22\na party in the suit. In the present case\nnst the defendants no.1 and 2 for selli\nhe plaintiff and therefore, it cannot be\necessary or a proper party in the presen\nfor the defendants has contended t\nin the plaint that the defendants are\nin respect of its products, whereas the\nmark ‘AIVVA’. However, a perusal\ne defendants on the website ‘www.in\ne TVs being sold by the defendants\nof the plaintiff (page 16 of the addition\nmpany). The dishonest conduct of the\nas the defendant no.1 is using the wor\ns shown in its product catalogue (page\nfendants). Therefore, it cannot be said\nthat the defendants are using the tradem\narison of the marks of the defendan\nthat the marks being used by the defen\nmilar to the plaintiff’s marks. The prod\nsimilar to the products of the plain\nord various trademark registrations\ncluding India. On account of the pub\nark and its stylized versions by the plai\nvertising and promoting the products ca\nacquired enormous goodwill and repu\nPage 14 of 15\ne, the grievance of the\ning TVs infringing the\ne said that Mr. Ajjaay\nnt suit.\nthat the plaintiff has\ne using the trademark\ne defendants have only\nof the listing of the\nndiamart.com’ clearly\ns bear the trademark\nnal documents filed by\ndefendant no.1 is writ\nrd ‘aiwa’ as part of its\ne 29 of the documents\nd that the plaintiff has\nmark ‘AIWA’.\nnts with those of the\nndants are visually and\nducts being sold by the\nntiff. The plaintiff has\nobtained in different\nblicity and long use of\nintiff and the expenses\narrying the said marks,\nutation worldwide. The\nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified\n\n--- PAGE 15 ---\n2023/DHC/000041\nCS(COMM) 606/2022\nPage 15 of 15\nplaintiff has also placed on record sufficient material to demonstrate prior\nuse of the trademarks in India. The defendants’ use of the impugned marks\nis prima facie dishonest and nothing but attempt to ride on the goodwill and\nreputation of the plaintiff’s marks as also to cause confusion in the market.\n25.\nIn view of the above, the plaintiff has made out a prima facie case in\nits favour. Balance of convenience is in favour of the plaintiff. Irreparable\nharm would be caused not only to the plaintiff but also to the public if the\ndefendants are not injuncted from using the impugned trademarks.\n26.\nTherefore, the interim order dated 2nd September, 2022 passed by this\nCourt is confirmed till the final adjudication of the suit.\n27.\nConsequently, I.A. 14162/2022 succeeds and I.A. 16402/2022 is\ndismissed.\nCS(COMM) 606/2022\n28.\nList along with pending applications on 20th April, 2023.\nAMIT BANSAL, J.\nJANUARY 05, 2023\nat\nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified\n"
  },
  "total_pages": 15,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "According to the PDF document \"AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf\", the case CS(COMM) 606/2022 was heard in the High Court of Delhi at New Delhi. The plaintiff, AIWA CO. LTD., filed a complaint against the defendants, AIVVA ENTERPRISES PRIVATE LIMITED, and others. The court reserved judgment on December 16, 2022, and delivered it on January 5, 2023.\n\nThe plaintiff, a Japanese company, is the registered proprietor of the trademark \"AIWA\" in various classes, including Class 9 for televisions and audio equipment. The defendant, AIVVA ENTERPRISES PRIVATE LIMITED, was using the mark \"AIVVA\" and a stylized version of it, which the plaintiff alleged was a infringement of its trademark.\n\nThe plaintiff's trademark \"AIWA\" has been included in the list of well-known marks maintained by the Trademark Registry since 2007. The plaintiff holds worldwide trademark registrations in respect of its mark \"AIWA\" and its formative marks. The plaintiff became aware of the defendant's use of the mark \"AIVVA\" in August 2022 and filed an application for an ex parte ad interim injunction.\n\nThe court considered the applications filed by the plaintiff under Order XXXIX Rules 1 and 2 of the Code of Civil Procedure, 1908, and the applications filed by the defendants. The judgment, delivered by Hon'ble Mr. Justice Amit Bansal, dispose of the applications and provides the court's decision on the matter. (Source: PDF document \"AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf\", page 1-2 of 15)",
      "pdf_source": "11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "According to page 1 of the PDF \"11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf\", the legal proceedings are as follows:\n\n* Case Number: CS(COMM) 606/2022\n* Court: High Court of Delhi at New Delhi\n* Judgment Reserved On: 16th December, 2022\n* Judgment Delivered On: 5th January, 2023\n* Parties: \n  - Plaintiff: AIWA CO. LTD.\n  - Defendants: AIVVA ENTERPRISES PRIVATE LIMITED & ORS.\n* Lawyers: \n  - Plaintiff: Ms. Anuradha Salhotra, Mr. Sumit Wadhwa, and Mr. Ayush Samaddar\n  - Defendants: Mr. S.K. Bansal and Mr. Pankaj Kumar\n* Judge: Hon'ble Mr. Justice Amit Bansal\n\nThe judgment proposes to dispose of two applications filed by the plaintiff under Order XXXIX Rules 1, 2, and 4 of the Code of Civil Procedure, 1908 (CPC). (Source: PDF \"11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf\", page 1)",
          "content": "2023/DHC/000041\nCS(COMM) 606/2022\nPage 1 of 15\n*\nIN THE HIGH COURT OF DELHI AT NEW DELHI\n%\nJudgment Reserved On: 16th December, 2022\nJudgment Delivered On: 05th January, 2023\n+\nCS(COMM) 606/2022 & I.A. 16403/2022 (u/S 151 CPC-for release\nof seized goods), I.A. 17064/2022 (for condonation of delay of 1\nday in filing reply to I.A. 16402/2022), I.A. 17085/2022 (for\nexemption from filing notarized and apostilled copy of the Power\nof Attorney)\nAIWA CO. LTD.\n..... Plaintiff\nThrough:\nMs.Anuradha Salhotra with Mr.Sumit\nWadhwa and Mr.Ayush Samaddar,\nAdvocates.\nVersus\nAIVVA ENTERPRISES PRIVATE LIMITED & ORS.\n..... Defendants\nThrough:\nMr.S.K.\nBansal\nand\nMr.Pankaj\nKumar, Advocates.\nCORAM:\nHON’BLE MR. JUSTICE AMIT BANSAL\nJUDGMENT\nAMIT BANSAL, J.\nI.A. 14162/2022 (O-XXXIX R-1 & 2 of the CPC) &I.A. 16402/2022 (O-\nXXXIX R-4 of the CPC)\n1.\nBy way of the present judgment, I propose to dispose of the\napplication filed on behalf of the plaintiff under Order XXXIX Rules 1 and\n2 of the Code of Civil Procedure, 1908 (CPC) and the application filed on\nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified",
          "pdf_source": "11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "According to page 2 of the PDF: 11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf, the case CS(COMM) 606/2022 involves a trademark dispute. The plaintiff, AIWA CO. LTD., is a Japanese company and the registered proprietor of the trademark 'AIWA' in various classes, including Class 9 (televisions and audio equipment). The plaintiff holds worldwide trademark registrations and has acquired tremendous reputation and goodwill. The defendants, AIVVA ENTERPRISES PRIVATE LIMITED, were found using the mark 'AIVVA' and a stylized version, similar to the plaintiff's trademark. The plaintiff became aware of this on August 1st, 2022, and an ex parte ad interim injunction was granted by the Court under Order XXXIX Rule 4 of the CPC. (Source: 2023/DHC/000041)",
          "content": "CS(COMM) 606/202\nbehalf of the d\nvacation of the e\nGENESIS OF TH\n2.\nThe case\n2.1\nThe plain\nregistered propr\nClass 9 (televisi\n2.2\nThe word\ncorporate name\n2.3\nThe plain\nfrom 19th Octo\ntrademarks\nSeptember, 199\n2.4\nThe plain\nwell-known ma\n2007.\n2.5\nThe plain\ntrademark ‘AIW\nhave acquired a\n2.6\nIn Augus\nusing the word\ngoods and as a p\nonly the mark ‘A\n2023/DHC/000041\n22\ndefendants under Order XXXIX Rul\nex parte ad interim injunction granted b\nHE DISPUTE\nset up by the plaintiff in the plaint is as\nntiff company, which is incorporat\nrietor of the trademark ‘AIWA’ in vari\nons and audio equipment).\nd ‘AIWA’ also forms part of the trad\nas well as the email address of the plai\nntiff holds registration of the word mar\nober, 1982 and the stylized versio\nand\nin Class\n1 and 29th January, 2003 respectively.\nntiff’s trademark ‘AIWA’ has been i\narks maintained by the Trademark Re\nntiff holds worldwide trademark registr\nWA’ and its formative marks and the\ntremendous reputation and goodwill th\nst, 2022, the plaintiff became aware\nmark ‘AIVVA’ and the stylized ver\nthrough its brochure, both as a trade\npart of its corporate name. The defenda\nAIVVA’ but had also copied the styliz\nPage 2 of 15\nle 4 of the CPC for\nby this Court.\ns follows:\nted in Japan, is the\nious classes, including\nding style, both as the\nintiff.\nrk ‘AIWA’ with effect\nons of the aforesaid\n9 with effect from 12th\nncluded in the list of\negistry since the year\nrations in respect of its\ngoods of the plaintiff\nhroughout the world.\nof the defendant no.1\nrsion of the same i.e.,\nemark in relation to its\nant no.1 was using not\nzed manner adopted by\nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified",
          "pdf_source": "11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0007",
      "start_index": 3,
      "end_index": 5,
      "summary": "According to the PDF document \"AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR\" (2023/DHC/000041), the High Court of Delhi at New Delhi heard a case between Aiwa Co. Ltd. (plaintiff) and Aivva Enterprises Private Limited (defendant). The plaintiff claimed trademark infringement and passing off by the defendant's use of the mark \"AIVVA\", which is allegedly deceptively similar to the plaintiff's \"AIWA\" mark.\n\nThe court granted an ex-parte ad interim injunction on September 2, 2022, restraining the defendants from using the \"AIVVA\" mark or any other mark identical or deceptively similar to the plaintiff's \"AIWA\" mark. The defendants were also directed to take down their webpage from the e-commerce platform IndiaMART.\n\nThe defendants filed an application (I.A.16402/2022) against the injunction order, arguing that the plaintiff was aware of their use of the \"AIVVA\" mark since August 2020, but delayed approaching the court. The defendants also claimed that the plaintiff had knowledge of their trademark registrations in 2015.\n\nThe court reserved judgment on December 16, 2022, and delivered it on January 5, 2023. The case involves claims of trademark infringement, passing off, and seeks permanent injunction, as well as other ancillary reliefs. The PDF document provides details of the legal proceedings, including submissions, arguments, and court decisions. (Source: PDF document \"AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR\", 2023/DHC/000041)",
      "pdf_source": "11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "According to page 3 of the PDF (2023/DHC/000041), in the case of AIWA CO. LTD. vs. AIVVA ENTERPRISES PRIVATE LIMITED, the plaintiff claimed trademark infringement. The defendants were using marks similar to the plaintiff's, including \"AIVVA\". The plaintiff conducted a search and found no registration of the mark by the defendants. The court granted an ex parte ad interim injunction on September 2, 2022, restraining the defendants from using the infringing marks. The plaintiff sought relief, including a permanent injunction, to prevent the defendants from using trademarks deceptively similar to theirs. The court's decision was made in the context of CS(COMM) 606/2022 and related interim applications. (Source: 2023/DHC/000041 PDF)",
          "content": "CS(COMM) 606/202\nthe plaintiff i.e.,\nclaimed to have\nthe alphabet ‘R\nregistration of th\n2.7\nThe plain\nrelevant class w\nin the name of th\n2.8\nThe plain\ndefendant no.1 a\nare also using\nThe defendant\nproducts.\n3.\nAccording\npermanent injun\n‘AIVVA’ /\nENTERPRISES\nbe identical or d\nthe trademarks\ntrademarks or an\nthe plaintiff and\n4.\nVide orde\nparte ad interim\n“26. Acc\nimpugned\n2023/DHC/000041\n22\n,\n. As per the brochu\ne registration in respect of the mark\nR’ placed in a circle on the top ri\nhe mark.\nntiff conducted a search in the Trade\nwhich revealed that there was no registr\nhe defendant no.1 or the defendant no.2\nntiff arranged for the purchase of a\nand found that apart from the mark ‘AI\nthe marks\n,\nno.2 was also involved in selling th\ngly, the present suit has been filed\nnction restraining the defendants from\n/\n/\nS PRIVATE LIMITED’, and/or any ot\ndeceptively similar to that of the plain\nof the plaintiff or constituting passi\nny part of the trade name, corporate na\nd other ancillary reliefs.\ner dated 2nd September, 2022, this Co\nm injunction in I.A.14162/2022 in the fo\ncordingly, Defendants are restrained\nd\nmarks,\ni.e.\nAIVVA/\n/ AIVVA ENTERPRISES PRIV\nPage 3 of 15\nure, the defendant no.1\nwith\night corner to denote\nemark Registry in the\nration of the said mark\n2.\na TV set sold by the\nIVVA’, the defendants\nand\n.\nhe aforesaid infringing\nseeking the relief of\nm using the trademarks\n/\n‘AIVVA\nther marks which may\nntiff, thereby infringing\ning off by use of the\name or domain name of\nourt had passed an ex\nollowing terms:\nfrom using the\n/\n/\nVATE LIMITED\nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified",
          "pdf_source": "11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "According to page 4 of the PDF \"11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf\", the court ordered the defendants to take down their webpage from IndiaMART and not to advertise the trademark AIWA or any similar marks. The defendants filed I.A.16402/2022 against this injunction order. The defendants' counsel stated that the plaintiff was aware of the defendants' use of the mark 'AIVVA' since August 2020, but did not disclose this in the plaint. The plaintiff had sent a legal notice to the defendants on August 17, 2020, and the defendants were selling products under the 'AIVVA' mark on e-commerce platforms like IndiaMART. The court proceedings are part of CS(COMM) 606/2022, with judgment reserved on December 16, 2022, and delivered on January 5, 2023. (Source: PDF \"11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf\", page 4)",
          "content": "2023/DHC/000041\nCS(COMM) 606/2022\nPage 4 of 15\nand/or any other mark/name identical/deceptively similar to\nPlaintiffs AIWA Marks, either by themselves or in conjunction\nwith any other word, as a trademark or part of a trademark, a\ncorporate name/trade name, a domain name or part of a\ndomain name, an email address or part of an email address, or\nin any manner whatsoever in relation to their goods/services\nwhich are similar to those of the Plaintiff, amounting to\ninfringement and passing off, till the next date of hearing.\n27.\nDefendants are directed to take down their webpage from\nthe\ne-commerce\nplatform\nIndia\nMART\nhttps://www.indiamart.com/usha-electrotradeagencies/ and not\nto advertise the trademark AIWA or any other mark deceptively\nsimilar thereto.”\n5.\nAggrieved by the aforesaid injunction order, the defendants filed\nI.A.16402/2022. Notice in this application was issued on 10th October, 2022\nand reply thereto has been filed on behalf of the plaintiff.\nSUBMISSIONS OF THE DEFENDANTS\n6.\nThe counsel for the defendants made the following submissions:\n6.1\nIt has wrongly been stated in the plaint that the plaintiff learnt of the\ndefendants’ use of the impugned marks in August, 2022 and have\napproached the Court without any delay. As is evident from the legal notice\ndated 17th August, 2020, the plaintiff was aware of the user of the mark\n‘AIVVA’ in August, 2020 by the defendants no.1 and 2, who were selling\nand marketing their products under the mark ‘AIVVA’ and the said products\nare also available for purchase on e-commerce platforms like IndiaMART.\n6.2\nThe plaintiff has deliberately not disclosed the legal notice or its reply\nin the plaint.\n6.3\nA reading of the aforesaid legal notice shows that the plaintiff was\nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified",
          "pdf_source": "11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf",
          "nodes": []
        },
        {
          "title": "Page 5",
          "node_id": "0006",
          "start_index": 5,
          "end_index": 5,
          "summary": "According to page 5 of the PDF \"11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf\", the plaintiff, Aiwa Co. Ltd., was aware of the use of the 'AIVVA' trademark by Mr. Ajjaay Advani and its registration in 2015. A legal notice was sent to the defendants, which was replied to by Mr. Advani, stating that he had registered the 'AIVVA' mark under Classes 7, 9, and 11 in December 2015. Despite this, the plaintiff failed to challenge the registration and did not make Mr. Advani a party to the suit, despite alleging connivance between him and the defendants. The case, CS(COMM) 606/2022, was heard in the High Court of Delhi, with judgment reserved on December 16, 2022, and delivered on January 5, 2023. (Source: PDF \"11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf\", page 5)",
          "content": "2023/DHC/000041\nCS(COMM) 606/2022\nPage 5 of 15\naware about the use of the ‘AIVVA’ trademark by Mr. Ajjaay Advani as\nwell as the registrations of the trademark ‘AIVVA’ in his favour in the year\n2015.\n6.4\nThe aforesaid legal notice was copied to a Hong Kong based entity,\nNu-World Global, which has been described in paragraph 2 of the aforesaid\nnotice as an entity to which rights to manufacture and sell products under the\n‘AIWA’ trademark have been assigned by the plaintiff. Further, the\naforesaid Nu-World Global assigned the rights in favour of Aiwa Consumer\nProducts LLP, a partnership firm in India on whose behalf the aforesaid\nlegal notice was sent. Therefore, the plaintiff cannot claim ignorance of the\naforesaid legal notice. This fact has also been stated in paragraph 5 (ii) of\nI.A. 16402/2022 and no specific denial thereto has been made on behalf of\nthe plaintiff.\n6.5\nIt has further been stated in the aforesaid legal notice that the\ndefendants no.1 and 2 are acting in connivance with Mr. Ajjaay Advani. The\naforesaid legal notice was duly replied to on behalf of Mr. Ajjaay Advani,\nwherein it was stated that the mark ‘AIVVA’ has been registered by him\nunder Classes 7, 9 and 11 as far back as in December, 2015. It was also\nstated in the reply that the domain name ‘www.aivva.com’ has been\nregistered by Mr. Ajjaay Advani in February, 2017.\n6.6\nThe plaintiff was aware of the registration of the mark ‘AIVVA’ in\nfavour of Mr. Ajjaay Advani but has failed to challenge the same. Despite\nalleging connivance between Mr. Ajjaay Advani and the defendants, Mr.\nAjjaay Advani has not been made a party in the suit.\n6.7\nIn the affidavit filed on behalf of Mr. Ajjaay Advani filed along with\nthe written statement, it has been stated that Mr. Ajjaay Advani has given\nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified",
          "pdf_source": "11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0016",
      "start_index": 6,
      "end_index": 13,
      "summary": "This section of the legal document, sourced from the PDF \"11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf\", pertains to the case CS(COMM) 606/2022 in the High Court of Delhi. The judgment was reserved on December 16, 2022, and delivered on January 5, 2023. The plaintiff, AIWA CO. LTD., is represented by Ms. Anuradha Salhotra. \n\nThe defendants, AIVVA ENTERPRISES PRIVATE LIMITED, argue that no written authorization is required for using the trademark 'AIVVA', citing the Supreme Court judgment in Cycle Corporation of India Ltd. v. T.I. Raleigh Industries Pvt. Ltd. They also claim that they have been selling TVs under the mark 'AIVVA' since 2016, providing invoices as evidence.\n\nThe plaintiff counters that they conducted a search of the Trademark Registry before filing the suit and found no authorization for the defendants to use the trademark 'AIWA'. The plaintiff also argues that the defendants' use of the trademark 'AIVVA' is an attempt to ride on the reputation and goodwill of the plaintiff's trademark 'AIWA'. The plaintiff disputes the defendants' claim that they have a license to use the trademark, citing the lack of written agreement between the defendants and Mr. Ajjaay Advani, who allegedly permitted the use of the trademark. (Source: PDF \"11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf\", pages 1-8)",
      "pdf_source": "11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf",
      "nodes": [
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "According to page 6 of the PDF \"11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf\", the defendant argues that no written authorization is required for using a trademark (citing Cycle Corporation of India Ltd. v. T.I. Raleigh Industries Pvt. Ltd.). The defendants claim they have only sold TVs under the mark 'AIVVA', not 'AIWA', and have filed invoices to prove their usage since 2016. The plaintiff failed to provide documents showing prior use of the 'AIWA' trademark. The defendants cite several judgments, including Micolube India Ltd. v. Maggon Auto Centre and Thukral Mechanical Works v. Nitin Machine Tools. The plaintiff's submissions begin on this page, stating they conducted a trademark search before filing the suit. (Source: 11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf, 2023/DHC/000041, CS(COMM) 606/2022)",
          "content": "2023/DHC/000041\nCS(COMM) 606/2022\nPage 6 of 15\npermission to the defendants no.1 and 2 to use the trademark ‘AIVVA’.\n6.8\nNo written authorization was required to be given by a registered\nproprietor of a trademark for use of the aforesaid trademark. Reliance in this\nregard is placed on the judgment of the Supreme Court in Cycle\nCorporation of India Ltd. v. T.I. Raleigh Industries Pvt. Ltd. and Ors.,\n(1996) 9 SCC 430.\n6.9\nIt has wrongly been stated in the plaint that the defendants have been\nselling TVs under the mark ‘AIWA’ as the defendants have only been\nselling TVs under the mark ‘AIVVA’. Reliance has been placed on the\nvarious invoices of the defendants from May, 2016 in this regard.\n6.10\nNo documents have been filed on behalf of the plaintiff showing user\nof the trademark ‘AIWA’ prior to the user of the defendants. On the other\nhand, defendants have filed invoices to show their user of the trademark\n‘AIVVA’ since 2016.\n7.\nCounsel for the defendants has also placed reliance on the judgments\nin Micolube India Ltd. v. Maggon Auto Centre &Anr., 2008 (36) PTC 231\n(Del.), Thukral Mechanical Works v. Nitin Machine Tools P. Ltd. &Anr.,\n(1998) 18 PTC 767, Standipack Private Limited &Ors. v. Oswal Trading\nCo. Ltd. &Ors., 1999 PTC (19) 479, B.L. and Co. and others v. Pfizer\nProducts Incl., (2001) 93 DLT 346 (DB) and Kent Ro System Ltd. v.\nGattubhai, 2022 SCC OnLine Del 791.\nSUBMISSIONS OF THE PLAINTIFF\n8.\nPer contra, counsel for the plaintiff made the following submissions:\n8.1\nThe plaintiff duly conducted a search of the Trademark Registry\nbefore filing the present suit and has filed the search report along with the\nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified",
          "pdf_source": "11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf",
          "nodes": []
        },
        {
          "title": "Page 7",
          "node_id": "0009",
          "start_index": 7,
          "end_index": 7,
          "summary": "According to page 7 of the PDF \"11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf\", the plaintiff Aiwa Co. Ltd. claims that the defendants Aivva Enterprises Private Limited are infringing on their trademark 'AIWA' by selling TVs under the mark 'AIVVA'. The defendants failed to show written authorization from the plaintiff to use the mark. The plaintiff argues that the use of 'AIVVA' is not only an infringement of their trademark but also an attempt to ride on their reputation and goodwill. The court is drawn to page 16 of the documents filed on behalf of the plaintiff, which shows the defendants selling TVs with the mark 'AIVVA' on the website 'www.indiamart.com'. The case, CS(COMM) 606/2022, was heard in the High Court of Delhi, with judgment reserved on December 16, 2022, and delivered on January 5, 2023. (Source: PDF \"11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf\", page 7)",
          "content": "CS(COMM) 606/202\nplaint, in terms o\nAjjaay Advani.\n8.2\nThe defen\nor any other wr\nThere is nothin\nAdvani.\n8.3\nThe very\nthe CPC is bas\nAugust, 2020 w\n8.4\nThe afore\nplaintiff, nor did\nbeing sent to Mr\n8.5\nThe prese\nas it is the said\ntrademark of the\n8.6\nThe use\nand\ncorporate name,\nbut also an attem\nwell-known trad\n8.7\nIt is wron\nplaintiff’s tradem\nthe additional d\ndefendants are\n‘www.indiamart\n2023/DHC/000041\n22\nof which the mark ‘AIVVA’ is register\nndant companies have failed to show th\nritten authorization in their favour from\nng to suggest that the defendants are\npremise of the application under Ord\ned on a wrong assumption that the l\nas sent on behalf of the plaintiff.\nesaid notice was neither sent by the pla\nd the plaintiff have any knowledge abo\nr. Ajjaay Advani.\nent suit has been filed only against the\ndefendants who were selling goods th\ne plaintiff.\nand adoption of the trademarks ‘A\nby the defendants, inclu\n, is not only infringement of the trade\nmpt to ride on the reputation and goo\ndemark.\nng to state that the defendants are not\nmark ‘AIWA’. Attention of the Court\ndocuments filed on behalf of the plai\nselling TVs with the mark\nt.com’.\nPage 7 of 15\nred in the name of Mr.\nhat they have a license\nm Mr. Ajjaay Advani.\nrelated to Mr. Ajjaay\nder XXXIX Rule 4 of\nlegal notice dated 17th\naintiff/on behalf of the\nout the aforesaid notice\ndefendants no.1 and 2\nhat were infringing the\nAIVVA’,\n,\nuding as a part of their\nemarks of the plaintiff\ndwill of the plaintiff’s\nselling TVs under the\nis drawn to page 16 of\nintiff to show that the\non the website\nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified",
          "pdf_source": "11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf",
          "nodes": []
        },
        {
          "title": "Page 8",
          "node_id": "0010",
          "start_index": 8,
          "end_index": 8,
          "summary": "According to page 8 of the PDF \"11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf\", the defendant used the word \"aiwa\" in their email address. The defendants' reliance on Mr. Ajjaay Advani's affidavit is misplaced since it was dated after the interim order on September 1, 2022. The Trade Marks Act, 1999, requires written agreement for permitted user, which the defendants failed to provide. The judgment in Raleigh Industries is also inapplicable due to the lack of an unbroken trade connection. The defendants wrongly claimed registration of the mark \"AIVVA\" and were not authorized to use a stylized imitation of the plaintiff's trademark. The case, CS(COMM) 606/2022, was heard in the High Court of Delhi, with judgment reserved on December 16, 2022, and delivered on January 5, 2023. (Source: PDF \"11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf\", page 8)",
          "content": "2023/DHC/000041\nCS(COMM) 606/2022\nPage 8 of 15\n8.8\nIn their brochure, the defendant no.1 is also using the word ‘aiwa’ as a\npart of its email address.\n8.9\nThe reliance placed by the defendants on the affidavit of Mr. Ajjaay\nAdvani is completely misplaced as the aforesaid affidavit is dated 29th\nSeptember, 2022, after the interim order was passed by this Court on 1st\nSeptember, 2022.\n8.10\nIn\nterms\nof\nSection\n2(1)(r)(ii)\nof\nthe\nTrade\nMarks\nAct,\n1999,‘permitted user can only be by way of a written agreement’. The\ndefendants have failed to place on record any written agreement between\nthem and Mr. Ajjaay Advani permitting the use of the trademark ‘AIWA’ by\nthe defendants with effect from 2015.\n8.11\nReliance placed on the judgment in Raleigh Industries (supra) is\nmisplaced as the aforesaid judgment was under the Trade and Merchandise\nMarks Act, 1958 (old Act). In any case, the defendants have failed to show\nan unbroken trade connection between the defendants and Mr. Ajjaay\nAdvani and therefore, the judgment in Raleigh Industries (supra) is not\napplicable.\n8.12\nThe defendants in their brochure have wrongly claimed registration of\nthe mark ‘AIVVA’, when in fact, they were not the registered proprietors of\nthe aforesaid trademark. In any event, the defendants were not authorized to\nuse the stylized imitation of the plaintiff’s trademark as there was no\nregistration in respect of such stylized version.\nANALYSIS & FINDINGS\n9.\nI shall now proceed to deal with the rival contentions raised by the\ncounsels appearing on behalf of the parties.\nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified",
          "pdf_source": "11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf",
          "nodes": []
        },
        {
          "title": "Page 9",
          "node_id": "0011",
          "start_index": 9,
          "end_index": 9,
          "summary": "According to page 9 of the PDF \"11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf\", the court discusses a legal notice dated 17th August, 2020, sent by Aiwa Consumer Products LLP. The defendants claim that the term \"my client\" in the notice includes the principals of the entity, but they fail to provide evidence of a connection between the entity and the plaintiff company, Aiwa Co. Ltd. The court notes that the plaintiff company was not aware of the notice and that the defendants have not shown that the notice was sent with the plaintiff's knowledge and consent. The court also mentions that the notice was copied to Nu-World Global, an assignee of the plaintiff company, but this is not sufficient to attribute knowledge of the notice to the plaintiff company. (Source: 2023/DHC/000041, CS(COMM) 606/2022)",
          "content": "2023/DHC/000041\nCS(COMM) 606/2022\nPage 9 of 15\n10.\nSince the case of the defendants is primarily premised on the legal\nnotice dated 17th August, 2020, I propose to deal with the same first.\n11.\nThe aforesaid legal notice has been sent on behalf of one Aiwa\nConsumer Products LLP, a partnership firm having its corporate office at A-\n62, Naraina Industrial Area, Phase-I, New Delhi-110028. There is nothing\non record to suggest any connection of the aforesaid entity with the plaintiff\ncompany or the fact that the plaintiff company was aware of sending of the\naforesaid legal notice.\n12.\nCounsel for the defendants has vehemently submitted that the term\n‘my client’ in the aforesaid notice would include the principals of the entity\nsending the notice. However, nothing has been placed on record to show that\nthe plaintiff company is the principal of the aforesaid entity. Merely because\nthe entity sending the legal notice uses the name ‘AIWA’ or that the plaintiff\ncompany has not initiated any legal action against the aforesaid entity for\nhaving sent the legal notice using the name of the plaintiff company, it\ncannot be contended that the aforesaid notice was sent with the knowledge\nand consent of the plaintiff company. It was for the defendants to show that\nthere was a connection between the said entity and the plaintiff company or\nthat the plaintiff company was aware of the aforesaid legal notice.\n13.\nOnce again, the fact that the aforesaid legal notice is copied to Nu-\nWorld Global, who is stated to be an assignee of the plaintiff company,\nwould not be sufficient to attribute knowledge of the aforesaid legal notice\nto the plaintiff company. To make good the allegations of suppression and\nconcealment, the defendants would have to show that it was within the\nknowledge of the plaintiff company that the aforesaid legal notice was sent\non their behalf. This has not been done in the present case and therefore, I do\nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified",
          "pdf_source": "11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf",
          "nodes": []
        },
        {
          "title": "Page 10",
          "node_id": "0012",
          "start_index": 10,
          "end_index": 10,
          "summary": "According to page 10 of the PDF \"11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf\", the court does not find merit in the defendants' claim that the plaintiff was aware of a legal notice and deliberately suppressed it to obtain an ex parte ad interim injunction. The plaintiff became aware of the trademark infringement in August 2022 and filed the suit soon after. The court rejects the defendants' reliance on judgments related to concealment and delay, citing that they do not apply to this case. Additionally, the court notes that Mr. Ajjaay Advani is not a director or shareholder of the defendant companies, and there is no license or document assigning the mark 'AIVVA' to the defendants. The court's decision was delivered on January 5, 2023, in the case CS(COMM) 606/2022. (Source: PDF \"11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf\", page 10)",
          "content": "2023/DHC/000041\nCS(COMM) 606/2022\nPage 10 of 15\nnot find merit in the submission of the defendants that the plaintiff was\naware of the legal notice or that they had deliberately suppressed the\naforesaid legal notice in order to obtain an ex parte ad interim injunction\nagainst the defendants.\n14.\nIn view of the above, there is no reason to disbelieve the submission\nmade in the plaint that the plaintiff company became aware of the\ndefendants no.1 and 2 infringing its trademark only in August, 2022, upon\ncoming across the brochure of the defendants and soon thereafter, the\npresent suit was filed. In other words, there is no basis to contend that the\ninterim order passed by this Court on 2nd September, 2022 was passed on the\naccount of concealment and suppression on behalf of the plaintiff or that\nthere was any delay on behalf of the plaintiff in filing the present suit. In\nview thereof, the judgments relied upon by the defendants in respect of\nconcealment i.e., Micolube India Ltd. (supra), Thukral Mechanical Works\n(supra), Standipack Private Limited (supra) and Kent Ro System Ltd.\n(supra) would not have any application to the facts and circumstances of the\npresent case. Further, the judgment in B.L. and Co. (supra) in respect of\ndelay would also be of no aid to the defendants.\n15.\nA perusal of the Company Master Data in respect of the defendant\nno.1 and 2 companies, as available on the website of Registrar of Companies\n(ROC), would show that Mr. Ajjaay Advani is neither a Director, nor a\nshareholder of the defendant companies. Nor have the defendants placed any\nlicense or other document assigning the mark ‘AIVVA’ in their favour from\nMr. Ajjaay Advani so as to justify their use of the said mark. Therefore, the\nreliance placed by the defendants on the registration granted in favour of Mr.\nAjjaay Advani is completely misplaced.\nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified",
          "pdf_source": "11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf",
          "nodes": []
        },
        {
          "title": "Page 11",
          "node_id": "0013",
          "start_index": 11,
          "end_index": 11,
          "summary": "According to page 11 of the PDF \"AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf\", the defendant, Aivva Enterprises, has submitted an affidavit by Mr. Ajjaay Advani, claiming permission to use the trademark \"AIVVA\" under Classes 7, 9, and 11. However, the court notes that this affidavit lacks contemporaneous evidence to support the claim of permission to use the trademark since 2016. The defendants have also wrongly projected themselves as registered proprietors of the trademark by using the symbol. The court references a letter dated 29th September, 2022, and notes that the defendants' brochure does not provide a basis for permission or license granted by the proprietor, Mr. Ajjaay Advani. (Source: AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf, page 11)",
          "content": "CS(COMM) 606/202\n16.\nThe defen\nmark ‘AIVVA’\nthis regard, reli\nallegedly affirm\ntrademark ‘AIV\naffidavit is extra\n“4.\nTha\nPri\nSho\nMa\n(Ind\nAge\nKal\ncom\nin\nbeg\n5.\nTha\nnam\nUsh\nfrie\n17.\nIn my con\nof the defendant\nfailed to place\nAdvani in their\nfrom the year\nthemselves in t\ntrademark\ncircle. Even if it\nto use the afore\nuser was on th\n2023/DHC/000041\n22\nndants have submitted that they were\nby Mr. Ajjaay Advani, the registered\niance is placed on an affidavit dated\nmed by Mr. Ajjaay Advani, the regist\nVVA’ under Classes 7, 9 and 11. Th\nacted below:\nat I have granted permission to M/s. Ai\nivate Limited, Usha Agencies, Shop N\nopping\nCentre,\nUlhasnagar,\naharashtra and M/s. Usha Electro\ndia) Pvt. Ltd., Trading as Usha\nencies, Shop No. 2 & 3, Sai Viha\nlyan, Thane-421003, Maharashtra (w\nmpanies) to use my aforesaid said trad\nrelation to said goods and business\nginning.\nat the directors of aforementioned gr\nmely M/s. Aivva Enterprises Private L\nha Electrotrade Agencies (India) Pv\nends and known to me.”\nnsidered view, the aforesaid affidavit\nts using the mark ‘AIVVA’ since 2016\nany contemporaneous document exe\nfavour that authorized them to use the\n2016. Further, the defendants hav\ntheir brochure as being the register\nby using the symbol\nt is assumed that they were permitted\nsaid trademarks, the brochure should h\nhe basis of permission or license gr\nPage 11 of 15\ne permitted to use the\nd proprietor thereof. In\n29th September, 2022\ntered proprietor of the\nhe relevant part of the\nivva Enterprises\nNo. 9-10, Tilson\nThane-421003,\ntrade Agencies\nAgency/ Usha\nr, Shivaji Path\nwhich are group\ndemark \"AIVVA\"\ns from the very\nroup companies\nLimited and M/s.\nvt. Ltd. are my\ncannot form the basis\n6. The defendants have\necuted by Mr. Ajjaay\ne aforesaid trademarks\nve wrongly projected\nred proprietors of the\nof the letter ‘R’ in a\nby Mr. Ajjaay Advani\nhave indicated that the\nranted by Mr. Ajjaay\nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified",
          "pdf_source": "11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf",
          "nodes": []
        },
        {
          "title": "Page 12",
          "node_id": "0014",
          "start_index": 12,
          "end_index": 12,
          "summary": "According to page 12 of the PDF \"11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf\", the court discusses the concept of \"permitted use\" under the Trade Marks Act, 1999. The defendant's affidavit is seen as an attempt to create a right to use the trademark \"AIVVA\" retrospectively. The court references Section 2(1)(r)(ii) of the Act, which defines \"permitted use\" as the use of a trademark by a person other than the registered proprietor, with their consent in a written agreement. The court also compares this definition to the old Act's definition. The case, CS(COMM) 606/2022, is being heard in the High Court of Delhi, with judgment reserved on December 16, 2022, and delivered on January 5, 2023. (Source: PDF \"11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf\", page 12)",
          "content": "2023/DHC/000041\nCS(COMM) 606/2022\nPage 12 of 15\nAdvani. By way of the aforesaid affidavit, a right cannot be created in\nfavour of the defendants to use the trademark ‘AIVVA’ retrospectively.\nClearly, the aforesaid affidavit has been executed at this belated stage only\nto support the defendants in the present case. In this regard, reference may\nbe made to Section 2(1)(r)(ii) of the Trade Marks Act, 1999, which defines\n“permitted use” as under:\n“(r) “permitted use”, in relation to a registered trade mark,\nmeans the use of trade mark—\n(ii)\nby a person other than the registered proprietor\nand registered user in relation to goods or\nservices—\n(a)\nwith which he is connected in the course of\ntrade; and\n(b)\nin respect of which the trade mark remains\nregistered for the time being; and\n(c)\nby consent of such registered proprietor in a\nwritten agreement; and\n(d)\nwhich\ncomplies\nwith\nany\nconditions\nor\nlimitations to which such user is subject and to\nwhich the registration of the trade mark is\nsubject”\n18.\nThe term “permitted use” was defined in the old Act as under:\n“2. Definitions and interpretation.—(1) In this Act, unless the\ncontext otherwise requires—\n(m) “permitted use”, in relation to a registered trade mark,\nmeans the use of a trade mark—\n(i) by a registered user of the trade mark in relation to\ngoods—\n(a) with which he is connected in the course of trade; and\n(b) in respect of which the trade mark remains registered\nfor the time being; and\n(c) for which he is registered as registered user; and\n(ii) which complies with any conditions or restrictions to\nwhich the registration of the trade mark is subject;”\nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified",
          "pdf_source": "11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf",
          "nodes": []
        },
        {
          "title": "Page 13",
          "node_id": "0015",
          "start_index": 13,
          "end_index": 13,
          "summary": "According to page 13 of the PDF \"11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf\", the court discusses the definition of \"permitted use\" under the Trade Marks Act, 1999. The plaintiff, AIWA CO. LTD, has filed a suit against AIVVA ENTERPRISES PRIVATE LIMITED, and the defendants have failed to show that they are either proprietors or permitted users of the trademark 'AIVVA'. The plaintiff has registered the mark 'AIVVA' and has filed the Trademark Registration Certificate. The court notes that the defendants' contention that the plaintiff did not conduct a search of the Trademark Registry is misplaced. The plaintiff has the right to decide whom to sue, and the defendants cannot dictate whom the plaintiff should or should not sue. Judgment was reserved on December 16, 2022, and delivered on January 5, 2023 (Source: 2023/DHC/000041, CS(COMM) 606/2022).",
          "content": "CS(COMM) 606/202\n19.\nA compa\nabove reflects th\nregistered tradem\nproprietor, whic\n20.\nThere is m\nthe judgment in\ncase as the sam\nunder the old\nagreement. Ther\nthe registered pr\nthereof since 20\nuse the stylized\nno registration in\n21.\nThe conte\nsuit without con\nhave shown that\nmisplaced. The\nplaint that the a\nAjjaay Advani\nthis regard.\n22.\nOnce aga\nthe plaintiff has\npresent suit.\nIt\nlitigate and cann\nwish to seek any\n2023/DHC/000041\n22\narison of the two definitions of “perm\nhat the Trade Marks Act, 1999 require\nmark to be founded on the written con\nch condition was not contemplated unde\nmerit in the submissions of the counse\nn Raleigh Industries (supra) is not app\nme was in the context of the definitio\nAct, wherein the permitted use did\nrefore, the defendants have failed to sh\nroprietors of the trademark ‘AIVVA’\n015. Further, there is no justification\nmarks\nand\nin re\nn favour of the defendants or Mr. Ajjaa\nention of the defendants that the plainti\nnducting any search of the Trademark R\nt the mark ‘AIVVA’ is already register\nplaintiff company has duly averred i\naforesaid mark ‘AIVVA’ is registered\nand has also filed the Trademark Reg\nain, there is no merit in the contention\ns deliberately not made Mr. Ajjaay A\nt is for the plaintiff to decide agains\nnot be compelled to sue a person agai\ny relief. The defendants cannot dictate\nPage 13 of 15\nmitted use” as set out\nes “permitted use” of a\nnsent of the registered\ner the old Act.\nel for the plaintiff that\nplicable in the present\non of “permitted use”\nd not include written\nhow that they are either\nor are permitted users\nn for the defendants to\nspect of which there is\nay Advani.\niff has filed the present\nRegistry, which would\nred, is also completely\nn paragraph 14 of the\nd in the name of Mr.\ngistry search report in\nof the defendants that\nAdvani a party in the\nst whom he wishes to\ninst whom he does not\ne to the plaintiff which\nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified",
          "pdf_source": "11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0019",
      "start_index": 14,
      "end_index": 15,
      "summary": "According to the PDF document \"11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf\", the High Court of Delhi at New Delhi delivered a judgment on January 5, 2023, in the case of CS(COMM) 606/2022. The plaintiff, AIWA CO. LTD., had filed a suit against the defendants, AIVVA ENTERPRISES PRIVATE LIMITED, for selling TVs that infringe on the plaintiff's trademarks. \n\nThe court found that the defendants were using the trademark \"AIVVA\" which is phonetically similar to the plaintiff's mark \"AIWA\". The plaintiff had acquired enormous goodwill and reputation worldwide due to the publicity and long use of its mark. The court held that the defendants' use of the impugned mark was prima facie dishonest and an attempt to ride on the goodwill and reputation of the plaintiff's mark.\n\nThe court confirmed the interim order dated September 2, 2022, which injuncted the defendants from using the impugned trademark until the final adjudication of the suit. The court also dismissed I.A. 16402/2022 and allowed I.A. 14162/2022. The next hearing is scheduled for April 20, 2023. The judgment was delivered by AMIT BANSAL, J. on January 5, 2023. The PDF document provides detailed information about the legal proceedings, facts, arguments, and decisions made by the court. (Source: 11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf)",
      "pdf_source": "11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf",
      "nodes": [
        {
          "title": "Page 14",
          "node_id": "0017",
          "start_index": 14,
          "end_index": 14,
          "summary": "According to page 14 of the PDF \"11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf\", the plaintiff, AIWA CO. LTD., has alleged that the defendants are infringing their trademark 'AIWA' by selling TVs with a similar mark. The defendants have contended that they are using the mark 'AIVVA', but the plaintiff has shown that the defendants' products bear the trademark 'AIWA'. The plaintiff has obtained various trademark registrations, including in India, and has acquired enormous goodwill and reputation due to long use and publicity of the mark. The court is considering the plaintiff's grievance and the defendants' use of the trademark. Key dates include December 16, 2022, when the judgment was reserved, and January 5, 2023, when the judgment was delivered. (Source: 2023/DHC/000041, CS(COMM) 606/2022)",
          "content": "CS(COMM) 606/202\nparty to make a\nplaintiff is again\ntrademarks of th\nAdvani was a ne\n23.\nCounsel\nwrongly stated\nused the tradem\nproducts of the\nshows that the\nthe plaintiff com\nlarge inasmuch\nemail address a\nfiled by the def\nwrongly stated t\n24.\nA compa\nplaintiff shows t\nphonetically sim\ndefendants are\nplaced on reco\njurisdictions inc\nthe ‘AIWA’ ma\nincurred for adv\nthe plaintiff has\n2023/DHC/000041\n22\na party in the suit. In the present case\nnst the defendants no.1 and 2 for selli\nhe plaintiff and therefore, it cannot be\necessary or a proper party in the presen\nfor the defendants has contended t\nin the plaint that the defendants are\nin respect of its products, whereas the\nmark ‘AIVVA’. However, a perusal\ne defendants on the website ‘www.in\ne TVs being sold by the defendants\nof the plaintiff (page 16 of the addition\nmpany). The dishonest conduct of the\nas the defendant no.1 is using the wor\ns shown in its product catalogue (page\nfendants). Therefore, it cannot be said\nthat the defendants are using the tradem\narison of the marks of the defendan\nthat the marks being used by the defen\nmilar to the plaintiff’s marks. The prod\nsimilar to the products of the plain\nord various trademark registrations\ncluding India. On account of the pub\nark and its stylized versions by the plai\nvertising and promoting the products ca\nacquired enormous goodwill and repu\nPage 14 of 15\ne, the grievance of the\ning TVs infringing the\ne said that Mr. Ajjaay\nnt suit.\nthat the plaintiff has\ne using the trademark\ne defendants have only\nof the listing of the\nndiamart.com’ clearly\ns bear the trademark\nnal documents filed by\ndefendant no.1 is writ\nrd ‘aiwa’ as part of its\ne 29 of the documents\nd that the plaintiff has\nmark ‘AIWA’.\nnts with those of the\nndants are visually and\nducts being sold by the\nntiff. The plaintiff has\nobtained in different\nblicity and long use of\nintiff and the expenses\narrying the said marks,\nutation worldwide. The\nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified",
          "pdf_source": "11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf",
          "nodes": []
        },
        {
          "title": "Page 15",
          "node_id": "0018",
          "start_index": 15,
          "end_index": 15,
          "summary": "According to page 15 of the PDF \"11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf\", the court ruled in favor of the plaintiff, AIWA CO. LTD. The plaintiff demonstrated prior use of trademarks in India, and the defendants' use was deemed dishonest and attempted to ride on the plaintiff's goodwill. The court found that the plaintiff made a prima facie case, and the balance of convenience was in their favor. The court confirmed the interim order dated September 2, 2022, and dismissed I.A. 16402/2022. The case is listed for further proceedings on April 20, 2023. Judge Amit Bansal delivered the judgment on January 5, 2023. The plaintiff was represented by Ms. Anuradha Salhotra. The court's decision aims to prevent irreparable harm to the plaintiff and the public. (Source: 11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf, page 15)",
          "content": "2023/DHC/000041\nCS(COMM) 606/2022\nPage 15 of 15\nplaintiff has also placed on record sufficient material to demonstrate prior\nuse of the trademarks in India. The defendants’ use of the impugned marks\nis prima facie dishonest and nothing but attempt to ride on the goodwill and\nreputation of the plaintiff’s marks as also to cause confusion in the market.\n25.\nIn view of the above, the plaintiff has made out a prima facie case in\nits favour. Balance of convenience is in favour of the plaintiff. Irreparable\nharm would be caused not only to the plaintiff but also to the public if the\ndefendants are not injuncted from using the impugned trademarks.\n26.\nTherefore, the interim order dated 2nd September, 2022 passed by this\nCourt is confirmed till the final adjudication of the suit.\n27.\nConsequently, I.A. 14162/2022 succeeds and I.A. 16402/2022 is\ndismissed.\nCS(COMM) 606/2022\n28.\nList along with pending applications on 20th April, 2023.\nAMIT BANSAL, J.\nJANUARY 05, 2023\nat\nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified",
          "pdf_source": "11. AIWA CO. LTD. VS. AIVVA ENTERPRISES PRIVATE LIMITED & OR.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-15T18:35:58.424478",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}