{
  "doc_name": "12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS",
  "pdf_source": "12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf",
  "metadata": {
    "document_name": "12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS",
    "source_pdf": "12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf",
    "judges": [
      "AMIT BANSAL"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "460/2016",
      "460/2016",
      "460/2016",
      "460/2016",
      "460/2016",
      "460/2016",
      "460/2016",
      "460/2016",
      "460/2016",
      "13923/2015"
    ],
    "dhc_numbers": [
      "2023/DHC/000458",
      "2023/DHC/000458",
      "2023/DHC/000458",
      "2023/DHC/000458",
      "2023/DHC/000458",
      "2023/DHC/000458",
      "2023/DHC/000458"
    ],
    "ia_numbers": [],
    "decision_date": "17 January, 2023",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      "ZINO DAVIDOFF SA"
    ],
    "defendants": [
      "BHALANI ENTERPRISES & ORS"
    ],
    "appellants": [],
    "respondents": [],
    "plaintiff_advocates": [
      "Mr. Ajay Amitabh Suman"
    ],
    "defendant_advocates": [
      "Ms. Snehima Jauhari",
      "Mr. Sohrab Singh Mann"
    ],
    "appellant_advocates": [],
    "respondent_advocates": [],
    "damages_claimed": "3,00,000",
    "damages_awarded": null,
    "key_issues": [
      "Trademark infringement by the defendants through the sale of counterfeit perfumes and fragrances bearing the plaintiff's trademark 'DAVIDOFF'.",
      "Passing off by the defendants, where they are attempting to deceive consumers into believing that their products are affiliated with or endorsed by the plaintiff.",
      "Copyright infringement, as the plaintiff alleges that the defendants are using their copyrighted materials without permission.",
      "The plaintiff's claim of permanent injunction to restrain the defendants from further infringing their trademarks and copyrights.",
      "The issue of jurisdiction, as the plaintiff is a foreign company and the defendants are operating in India, potentially raising questions about the court's authority to hear the case.",
      "The defendants' potential defense of ignorance, as they claim to have been unaware of the counterfeit nature of the products they were selling.",
      "The role of the website www.shopclues.com, operated by defendant no.3, in facilitating the sale of counterfeit products and potential liability for contributory infringement.",
      "The plaintiff's claim of vast goodwill and reputation in the 'DAVIDOFF' trademark, and whether this is sufficient to establish a strong case for trademark protection.",
      "The defendants' failure to respond to or comply with the cease and desist notice issued by the plaintiff, and how this may impact their defense.",
      "The potential for damages or other remedies to be awarded to the plaintiff if the court finds in their favor."
    ],
    "decision_summary": "**Case Summary: Zino Davidoff SA vs. Bhalani Enterprises & Ors.**\n\n**Background:**\nThe plaintiff, Zino Davidoff SA, is a Swiss company that manufactures and sells perfumes and fragrances under the trademark \"DAVIDOFF\". The company has been using the trademark since 1984 and has registered it in various countries, including India. The defendants, Bhalani Enterprises and others, were allegedly selling counterfeit perfumes and fragrances bearing the \"DAVIDOFF\" trademark through the website www.shopclues.com.\n\n**Legal Issues:**\nThe plaintiff filed a suit seeking permanent injunction to restrain the defendants from:\n\n1. Infringing the plaintiff's trademarks and copyrights\n2. Passing off their goods as those of the plaintiff\n3. Selling counterfeit products under the \"DAVIDOFF\" trademark\n\nThe plaintiff claimed that the defendants' actions would cause irreparable loss and injury to their business and goodwill.\n\n**Arguments:**\nThe plaintiff argued that they had a prima facie case for grant of ex parte injunction, as they had disclosed sufficient evidence to show that the defendants were selling counterfeit products under the \"DAVIDOFF\" trademark. The plaintiff also claimed that the balance of convenience was in their favor, as the defendants' actions would cause harm to their business and reputation.\n\nThe defendants, on the other hand, argued that they were not involved in the infringement activities and that the plaintiff had not provided sufficient evidence to support their claims.\n\n**Court Findings:**\nThe court found that the plaintiff had indeed disclosed a prima facie case in their favor, as they had provided evidence of the defendants' infringing activities and the potential harm that these actions could cause to the plaintiff's business and reputation. The court also noted that the balance of convenience was in favor of the plaintiff, as the defendants' actions would cause irreparable loss and injury to the plaintiff.\n\n**Decision:**\nOn January 17, 2023, the Hon'ble Mr. Justice Amit Bansal granted an ex parte ad interim injunction in favor of the plaintiff, restraining the defendants from selling the impugned products under the \"DAVIDOFF\" trademark. The court's decision was based on the plaintiff's prima facie case and the potential harm that the defendants' actions could cause to the plaintiff's business and reputation.\n\n**Key Takeaways:**\n\n1. The court recognized the importance of protecting intellectual property rights, particularly in cases where counterfeit products are being sold.\n2. The plaintiff's evidence of the defendants' infringing activities and the potential harm to their business and reputation was sufficient to support the grant of an ex parte ad interim injunction.\n3. The balance of convenience was in favor of the plaintiff, as the defendants' actions would cause irreparable loss and injury to the plaintiff's business and reputation.\n\nThis decision highlights the importance of protecting intellectual property rights and the need for companies to take prompt action to prevent the sale of counterfeit products.",
    "legal_precedents": [],
    "full_text": "\n--- PAGE 1 ---\n2023/DHC/000458 \n \nCS(COMM) 460/2016 \n                                                                                                      Page 1 of 7 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n% \n \n \n \n \nDate of Decision : 17th January, 2023 \n+  \n \n \n \nCS(COMM) 460/2016 \n \nZINO DAVIDOFF SA \n \n \n \n \n..... Plaintiff \n \n \n \n \nThrough: \nMr. Ajay Amitabh Suman, Advocate. \n \n \n \n \n \nversus \n \n \nBHALANI ENTERPRISES & ORS  \n \n..... Defendants \nThrough: \nMs. Snehima Jauhari with Mr. Sohrab \nSingh Mann, Advocates for D-3. \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nAMIT BANSAL, J. (Oral) \n \n \n \n \n \nCS(COMM) 460/2016 \n1. \nThe present suit has been filed seeking relief of permanent injunction \nrestraining the defendants from infringing the trademarks and copyrights of \nthe plaintiff, passing off their goods as that of the plaintiff’s and other \nancillary reliefs.  \nPLEADINGS IN THE PLAINT \n2. \nThe case set up by the plaintiff in the plaint is as follows:  \n2.1   The plaintiff is in the business of manufacturing, selling and \ndistributing various products including perfumes and fragrances under the \ntrademark ‘DAVIDOFF’.  \n2.2     The plaintiff has been using the trademark ‘DAVIDOFF’ since 1984 \nin respect of its perfumes and fragrances.  \n2.3     The plaintiff is the proprietor of the registered trademark \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:21.01.2023 17:07:53\nSignature Not Verified\n\n--- PAGE 2 ---\n2023/DHC/000458 \n \nCS(COMM) 460/2016 \n                                                                                                      Page 2 of 7 \n \n‘DAVIDOFF’ and other related marks of the plaintiff in Classes 3, 33 and \n25 of the Trade Marks Act, 1999, details of which are provided in paragraph \n8 of the plaint. The said marks of the plaintiff are also registered by the \nplaintiff in various foreign countries.  \n2.4        The goods of the plaintiffs are sold in more than 100 countries of the \nworld including India. The plaintiff’s trademark ‘DAVIDOFF’ has acquired \nvast goodwill and reputation all over the world including India. The \ntrademark ‘DAVIDOFF’ of the plaintiff has come to be exclusively \nassociated with the plaintiff. \n2.5      The trademark ‘DAVIDOFF’ has also been adopted by the plaintiff in \nrespect of its domain name www.zinodavidoff.com. The plaintiff has been \nusing the said domain name in relation to its goods and businesses.  \n2.6      In April, 2015, the plaintiff came across the infringing activities of \nthe defendants. The defendants no.1 and 2 are conducting their business of \nselling counterfeit perfumes and fragrances bearing the plaintiff’s trademark \n‘DAVIDOFF’ (hereinafter ‘impugned products’) through the website of the \ndefendant no.3, www.shopclues.com.  \n2.7    The packaging of the impugned products purchased by the plaintiff \nthrough the aforesaid website does not contain the names of the distributer \nand manufacturer, which indicates that the impugned products sold through \nthe said website are counterfeit products.  \n2.8     The plaintiff issued cease and desist notice to the defendants on 30th \nApril, 2015 calling upon the defendants to refrain from selling, displaying, \nadvertising or offering for sale products bearing the plaintiff’s trademark \n‘DAVIDOFF’. No response to the said notice was received by the plaintiff \non behalf of the defendant no.1. The defendants no.2 and 3 replied to the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:21.01.2023 17:07:53\nSignature Not Verified\n\n--- PAGE 3 ---\n2023/DHC/000458 \n \nCS(COMM) 460/2016 \n                                                                                                      Page 3 of 7 \n \nsaid notice vide letters dated 13th May, 2015 and 27th May, 2015 \nrespectively. In its reply, the defendant no.2 pleaded ignorance on the \ncounterfeit nature of the impugned products and undertook to refrain from \ndealing with the impugned products in future. The defendant no.3 in its \nreply denied its involvement in the infringement activities undertaken by the \ndefendants no.1 and 2.  \n3. \nAccordingly, the plaintiff has filed the present suit.  \nPROCEEDINGS IN THE SUIT \n4. \nThis court, vide order dated 15th July, 2015, granted ex parte ad \ninterim injunction in favour of the plaintiff under I.A. 13923/2015, \nrestraining the defendants from selling impugned products under the \ntrademark ‘DAVIDOFF’. The relevant portion of the said order is set out as \nunder:  \n           “I have heard the contentions of learned counsel for the plaintiff and \n perused the plaint along with documents annexed therewith and am  \nof the view that plaintiff has disclosed a, prima facie, case in its \nfavour for grant of ex-parte injunction. In case the defendants are not \nrestrained from selling the counterfeit products under the mark \n'DAVIDOFF', plaintiff shall suffer irreparable loss and injury, \ninasmuch as, balance of convenience is also in favour of the plaintiff \nand against the defendants. Accordingly, till next date of hearing, \ndefendants are restrained from selling the goods more particularly \nperfumes and fragrances under the mark 'DAVIDOFF' or any \ndeceptively similar mark as that of the plaintiff, in any manner, \nincluding through the website www.shopclues.com.” \n \n5. \nThe matter was thereafter placed before the Joint Registrar on 7th \nOctober, 2015 for effecting service and completion of pleadings. Counsel \nappeared on behalf of the defendant no. 3 on the said date. The defendants \nno.1 and 2 could not be served despite repeated attempts. Ultimately, the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:21.01.2023 17:07:53\nSignature Not Verified\n\n--- PAGE 4 ---\n2023/DHC/000458 \n \nCS(COMM) 460/2016 \n                                                                                                      Page 4 of 7 \n \ndefendants no.1 and 2 were served by way of publication on 29th June, 2017.   \n6. \nWritten statement was filed on behalf of the defendant no.3 on 20th \nOctober, 2015 and the replication thereto was filed by the plaintiff. Order \ndated 30th January, 2017 records the undertaking of the defendant no.3 to \ntake down any existing listing with regard to the mark ‘ZINO DAVIDOFF’ \nwithin 72 hours and any other listing as and when identified by the plaintiff.  \n7. \nOn 16th November, 2017, the defendants no.1 and 2 were proceeded \nagainst ex parte in the present suit.  \n8. \nOn 1st March, 2018, the following issues were framed:  \n1.Whether the suit against the defendant no. 3 being an intermediary \nas provided under Section 2(1)(w) of the Information Technology Act, \n2000 is maintainable or not? OPD \n \n2.Whether the defendant no. 3 had 'actual knowledge' of the allegedly \ninfringing nature of the goods listed by defendant nos. 1 and 2 on its \nwebsite www.shopclues.com and if so, how the knowledge mandated \nby Section 79(3)(b) of the Information Technology Act, 2000 was \nsatisfied to render the defendants liable? OPP \n \n3. Whether the defendants had conspired or abetted or aided or \ninduced, whether by threats or promise or otherwise in the \ncommission of the acts of passing off and/or infringement by \ndefendant nos. 1 and 2? OPP \n \n          4. Relief. \n9. \nOn 10th April, 2019, the matter was referred for mediation and the \nmatter was settled vide Settlement Agreement dated 5th December, 2022 \nentered into between the plaintiff and the defendant no.3. The Settlement \nAgreement dated 5th December, 2022 has been placed on record. The said \nSettlement Agreement has been signed by the representatives of the plaintiff \nand defendant no.3. It is stated in the Settlement Agreement that the terms of \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:21.01.2023 17:07:53\nSignature Not Verified\n\n--- PAGE 5 ---\n2023/DHC/000458 \n \nCS(COMM) 460/2016 \n                                                                                                      Page 5 of 7 \n \nthe settlement are confidential. \n10. \nIn view of the above, the counsel for the plaintiff prays for a decree of \npermanent injunction and damages along with costs in the suit against the \ndefendants no.1 and 2 and a decree in terms of the Settlement Agreement \nagainst the defendant no.3.  \nANALYSIS AND FINDING  \n11. \nI have heard the counsel for the plaintiff and the defendant no.3 and \nperused the record of the case. \n12. \n In the present case, the defendants no.1 and 2 have failed to appear \nbefore this Court despite service. Therefore, the defendants no.1 and 2 have \nbeen proceeded against ex parte on 16th November, 2017.  \n13. \n Since the aforesaid defendants have failed to enter appearance or \neven take any requisite steps to contest the present suit, despite having \nsuffered an ad interim injunction order, it is evident that they have no \ndefence to put forth on merits. \n14. \n From a perusal of the material on record, this Court is of the view \nthat the defendants no.1 and 2 have been selling impugned products with a \nview to trade upon the established goodwill and reputation of the plaintiff. \nBy their aforesaid conduct, the defendants no.1 and 2 are infringing the \ntrademarks of the plaintiff, as also passing off their goods as that of the \nplaintiff.  \n15. \n Based on the averments in the plaint and the discussion above, this \nCourt is of the view that this is a fit case for granting relief of permanent \ninjunction in favour of the plaintiff and against the defendants no.1 and 2. \nAccordingly, the defendants no.1 and 2 are restrained from manufacturing \nand selling counterfeit products bearing the plaintiff’s trademark \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:21.01.2023 17:07:53\nSignature Not Verified\n\n--- PAGE 6 ---\n2023/DHC/000458 \n \nCS(COMM) 460/2016 \n                                                                                                      Page 6 of 7 \n \n‘DAVIDOFF’ or any other trademark deceptively similar to the \n‘DAVIDOFF’ marks of the plaintiff on the website, www.shopclues.com, or \nany other website in relation to the business of perfumes, fragrances and \nrelated products.   \n16. \nIn so far as the reliefs of damages and cost prayed for in the plaint, the \ndefendant no.2 has given an undertaking not to deal with the impugned \nproducts vide reply dated 13th May, 2015 to the cease and desist notice. In \nmy considered view, it is not the case of the plaintiff that after the aforesaid \nreply, the defendant no.2 continued to sell the impugned products. \nTherefore, I do not deem it proper to award damages and costs against the \ndefendant no.2.    \n17. \nAs regards defendant no.1, the defendant no.1 neither replied to the \nlegal notice, nor appeared before this Court. There can be no justification for \nmanufacturing and selling perfumes and fragrances in counterfeit \n‘DAVIDOFF’ branded packaging. The use of the impugned products on \nhuman body can cause adverse reactions. Clearly, customers are being \nmisled by the defendants no.1 and the entire effort is deliberate and \ndishonest. This amounts to dilution of the reputation and goodwill of the \nplaintiff’s trademarks and causing loss to the plaintiff in business and \nreputation. The defendant no.1 has been making unlawful gains at the \nexpense of the plaintiff.  \n18. \nIn view of the foregoing facts and circumstances, this Court is of the \nview that this is not a case of innocent adoption by the defendant no.1. The \nCourt cannot ignore such flagrant misuse of the plaintiff’s marks by the \ndefendant no.1. Therefore, the suit is decreed in favour of the plaintiff for \nRs.3,00,000/- towards damages to be paid by the defendant no.1. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:21.01.2023 17:07:53\nSignature Not Verified\n\n--- PAGE 7 ---\n2023/DHC/000458 \n \nCS(COMM) 460/2016 \n                                                                                                      Page 7 of 7 \n \nAdditionally, Rs.2,00,000/- is awarded to the plaintiff as costs to be paid by \nthe defendant no.1.  \n19. \nThe defendants no.1 shall pay the said amount to the plaintiff within \neight weeks, failing which the plaintiff is permitted to commence execution \nproceedings against the defendant no.1.  \n20. \nAccordingly, the present suit is decreed against the defendant no.1 in \nterms of prayer clauses ‘a’, ‘e’ and ‘g’ of the plaint and against the \ndefendant no.2 in terms of prayer clause ‘a’ of the plaint.   \n21. \nCounsel for the plaintiff does not press for the reliefs contemplated in \nprayer clauses ‘b’, ‘c’, ‘d’ and ‘f’ of the plaint against the defendants no.1 \nand 2. \n22. \nInsofar as the defendant no.3 is concerned, the suit is decreed against \nthe defendant no.3 in terms of the Settlement Agreement dated 5th \nDecember, 2022. The said Settlement agreement shall form part of the \ndecree.  \n23.    Decree sheet be drawn up. \n24.    All pending applications stand disposed of. \n \n \n \nAMIT BANSAL, J. \nJANUARY 17, 2023 \nat \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:21.01.2023 17:07:53\nSignature Not Verified\n"
  },
  "total_pages": 7,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "According to the PDF document \"12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf\", a lawsuit was filed by Zino Davidoff SA against Bhalani Enterprises and others in the High Court of Delhi at New Delhi (Case No. CS(COMM) 460/2016). The plaintiff sought a permanent injunction to restrain the defendants from infringing their trademarks and copyrights, passing off their goods as the plaintiff's, and other ancillary reliefs.\n\nThe plaintiff, Zino Davidoff SA, has been using the trademark \"DAVIDOFF\" since 1984 for perfumes and fragrances and has acquired vast goodwill and reputation worldwide. The defendants were found to be selling counterfeit perfumes and fragrances bearing the plaintiff's trademark through a website.\n\nThe plaintiff issued a cease and desist notice to the defendants on April 30, 2015, but received no response from defendant no.1 and only a reply from defendants no.2 and 3. The court heard the case on January 17, 2023, with Hon'ble Mr. Justice Amit Bansal presiding.\n\nThe key facts and dates in the case include:\n- The plaintiff's use of the \"DAVIDOFF\" trademark since 1984\n- The defendants' infringing activities discovered in April 2015\n- A cease and desist notice issued on April 30, 2015\n- The court hearing on January 17, 2023\n\nThe PDF document provides the details of the legal proceedings, including the pleadings, the case set up by the plaintiff, and the court's decision. (Source: \"12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf\")",
      "pdf_source": "12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "According to page 1 of the PDF \"12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf\", a suit (CS(COMM) 460/2016) was filed by Zino Davidoff SA against Bhalani Enterprises & Ors. The plaintiff seeks a permanent injunction to restrain the defendants from infringing their trademarks and copyrights. The case was heard by Hon'ble Mr. Justice Amit Bansal on January 17, 2023. The plaintiff, a manufacturer of perfumes and fragrances, has been using the 'DAVIDOFF' trademark since 1984 and is the proprietor of the registered trademark. The plaintiff is represented by Mr. Ajay Amitabh Suman, while the defendants are represented by Ms. Snehima Jauhari and Mr. Sohrab Singh Mann. The suit seeks relief for trademark infringement, passing off, and other ancillary reliefs. (Source: 2023/DHC/000458, PDF page 1)",
          "content": "2023/DHC/000458 \n \nCS(COMM) 460/2016 \n                                                                                                      Page 1 of 7 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n% \n \n \n \n \nDate of Decision : 17th January, 2023 \n+  \n \n \n \nCS(COMM) 460/2016 \n \nZINO DAVIDOFF SA \n \n \n \n \n..... Plaintiff \n \n \n \n \nThrough: \nMr. Ajay Amitabh Suman, Advocate. \n \n \n \n \n \nversus \n \n \nBHALANI ENTERPRISES & ORS  \n \n..... Defendants \nThrough: \nMs. Snehima Jauhari with Mr. Sohrab \nSingh Mann, Advocates for D-3. \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nAMIT BANSAL, J. (Oral) \n \n \n \n \n \nCS(COMM) 460/2016 \n1. \nThe present suit has been filed seeking relief of permanent injunction \nrestraining the defendants from infringing the trademarks and copyrights of \nthe plaintiff, passing off their goods as that of the plaintiff’s and other \nancillary reliefs.  \nPLEADINGS IN THE PLAINT \n2. \nThe case set up by the plaintiff in the plaint is as follows:  \n2.1   The plaintiff is in the business of manufacturing, selling and \ndistributing various products including perfumes and fragrances under the \ntrademark ‘DAVIDOFF’.  \n2.2     The plaintiff has been using the trademark ‘DAVIDOFF’ since 1984 \nin respect of its perfumes and fragrances.  \n2.3     The plaintiff is the proprietor of the registered trademark \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:21.01.2023 17:07:53\nSignature Not Verified",
          "pdf_source": "12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "According to page 2 of the PDF \"12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf\", the plaintiff, Zino Davidoff SA, has trademark registrations for 'DAVIDOFF' and related marks in Classes 3, 33, and 25 of the Trade Marks Act, 1999. The plaintiff's goods are sold in over 100 countries, including India, and the 'DAVIDOFF' trademark has acquired significant goodwill and reputation worldwide. \n\nIn April 2015, the plaintiff discovered the defendants' infringing activities, including selling counterfeit perfumes and fragrances bearing the 'DAVIDOFF' trademark through the website www.shopclues.com. The plaintiff issued a cease and desist notice on April 30, 2015, but received no response from defendant no.1. The case, CS(COMM) 460/2016, was decided on January 17, 2023, by the High Court of Delhi. (Source: 2023/DHC/000458, PDF page 2)",
          "content": "2023/DHC/000458 \n \nCS(COMM) 460/2016 \n                                                                                                      Page 2 of 7 \n \n‘DAVIDOFF’ and other related marks of the plaintiff in Classes 3, 33 and \n25 of the Trade Marks Act, 1999, details of which are provided in paragraph \n8 of the plaint. The said marks of the plaintiff are also registered by the \nplaintiff in various foreign countries.  \n2.4        The goods of the plaintiffs are sold in more than 100 countries of the \nworld including India. The plaintiff’s trademark ‘DAVIDOFF’ has acquired \nvast goodwill and reputation all over the world including India. The \ntrademark ‘DAVIDOFF’ of the plaintiff has come to be exclusively \nassociated with the plaintiff. \n2.5      The trademark ‘DAVIDOFF’ has also been adopted by the plaintiff in \nrespect of its domain name www.zinodavidoff.com. The plaintiff has been \nusing the said domain name in relation to its goods and businesses.  \n2.6      In April, 2015, the plaintiff came across the infringing activities of \nthe defendants. The defendants no.1 and 2 are conducting their business of \nselling counterfeit perfumes and fragrances bearing the plaintiff’s trademark \n‘DAVIDOFF’ (hereinafter ‘impugned products’) through the website of the \ndefendant no.3, www.shopclues.com.  \n2.7    The packaging of the impugned products purchased by the plaintiff \nthrough the aforesaid website does not contain the names of the distributer \nand manufacturer, which indicates that the impugned products sold through \nthe said website are counterfeit products.  \n2.8     The plaintiff issued cease and desist notice to the defendants on 30th \nApril, 2015 calling upon the defendants to refrain from selling, displaying, \nadvertising or offering for sale products bearing the plaintiff’s trademark \n‘DAVIDOFF’. No response to the said notice was received by the plaintiff \non behalf of the defendant no.1. The defendants no.2 and 3 replied to the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:21.01.2023 17:07:53\nSignature Not Verified",
          "pdf_source": "12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0005",
      "start_index": 3,
      "end_index": 3,
      "summary": "According to the PDF document \"ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf\", the High Court of Delhi at New Delhi heard the case CS(COMM) 460/2016. The plaintiff, Zino Davidoff SA, was represented by Mr. Ajay Amitabh Suman, while the defendants, Bhalani Enterprises & Ors, were represented by Ms. Snehima Jauhari with Mr. Sohrab. \n\nThe court proceedings began with the plaintiff serving notice to the defendants regarding the sale of counterfeit products under the trademark 'DAVIDOFF'. The defendants replied, with defendant no.2 pleading ignorance and undertaking to refrain from dealing with the impugned products, while defendant no.3 denied any involvement in the infringement activities.\n\nThe plaintiff subsequently filed a suit, and the court granted an ex-parte ad interim injunction on July 15, 2015, restraining the defendants from selling products under the 'DAVIDOFF' trademark. The court found that the plaintiff had a prima facie case and would suffer irreparable loss if the defendants were not restrained.\n\nThe matter was then placed before the Joint Registrar for effecting service and completion of pleadings. Despite repeated attempts, defendants no.1 and 2 could not be served. The decision was made on January 17, 2023, as per the PDF document 2023/DHC/000458. The court's decision and the parties' arguments are detailed in the document, which provides insight into the legal proceedings and facts of the case.",
      "pdf_source": "12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "According to page 3 of the PDF \"12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf\", the plaintiff, Zino Davidoff SA, filed a suit against Bhalani Enterprises and others for selling counterfeit products under the trademark \"DAVIDOFF\". The defendants were served notice, and defendant no.2 undertook to refrain from dealing with the impugned products. The court granted an ex parte ad interim injunction on July 15, 2015, restraining the defendants from selling products under the \"DAVIDOFF\" mark. The injunction was granted as the plaintiff had disclosed a prima facie case and would suffer irreparable loss if the defendants were not restrained. The matter was then placed before the Joint Registrar for effecting service and completion of pleadings. (Source: 2023/DHC/000458, CS(COMM) 460/2016, PDF page 3)",
          "content": "2023/DHC/000458 \n \nCS(COMM) 460/2016 \n                                                                                                      Page 3 of 7 \n \nsaid notice vide letters dated 13th May, 2015 and 27th May, 2015 \nrespectively. In its reply, the defendant no.2 pleaded ignorance on the \ncounterfeit nature of the impugned products and undertook to refrain from \ndealing with the impugned products in future. The defendant no.3 in its \nreply denied its involvement in the infringement activities undertaken by the \ndefendants no.1 and 2.  \n3. \nAccordingly, the plaintiff has filed the present suit.  \nPROCEEDINGS IN THE SUIT \n4. \nThis court, vide order dated 15th July, 2015, granted ex parte ad \ninterim injunction in favour of the plaintiff under I.A. 13923/2015, \nrestraining the defendants from selling impugned products under the \ntrademark ‘DAVIDOFF’. The relevant portion of the said order is set out as \nunder:  \n           “I have heard the contentions of learned counsel for the plaintiff and \n perused the plaint along with documents annexed therewith and am  \nof the view that plaintiff has disclosed a, prima facie, case in its \nfavour for grant of ex-parte injunction. In case the defendants are not \nrestrained from selling the counterfeit products under the mark \n'DAVIDOFF', plaintiff shall suffer irreparable loss and injury, \ninasmuch as, balance of convenience is also in favour of the plaintiff \nand against the defendants. Accordingly, till next date of hearing, \ndefendants are restrained from selling the goods more particularly \nperfumes and fragrances under the mark 'DAVIDOFF' or any \ndeceptively similar mark as that of the plaintiff, in any manner, \nincluding through the website www.shopclues.com.” \n \n5. \nThe matter was thereafter placed before the Joint Registrar on 7th \nOctober, 2015 for effecting service and completion of pleadings. Counsel \nappeared on behalf of the defendant no. 3 on the said date. The defendants \nno.1 and 2 could not be served despite repeated attempts. Ultimately, the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:21.01.2023 17:07:53\nSignature Not Verified",
          "pdf_source": "12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0009",
      "start_index": 4,
      "end_index": 6,
      "summary": "According to the PDF document \"ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf\", the legal proceedings (CS(COMM) 460/2016) in the High Court of Delhi at New Delhi, the plaintiff Zino Davidoff SA sued Bhalani Enterprises and others for trademark infringement and passing off. The court framed four issues, including whether the suit against the defendant no. 3 (an intermediary under the Information Technology Act, 2000) was maintainable and whether the defendants had conspired to commit acts of passing off and infringement.\n\nThe defendants no. 1 and 2 were proceeded against ex parte on November 16, 2017, after they failed to appear despite service. The defendant no. 3 filed a written statement on October 20, 2015, and later entered into a settlement agreement with the plaintiff on December 5, 2022, the terms of which are confidential.\n\nThe court granted a decree of permanent injunction against the defendants no. 1 and 2, restraining them from manufacturing and selling counterfeit products bearing the plaintiff's trademark. The court also accepted the settlement agreement between the plaintiff and defendant no. 3. The decision was made on January 17, 2023. The PDF document (2023/DHC/000458) provides detailed information on the case, including the legal arguments, facts, and decisions. The court's ruling is based on the defendants' failure to contest the suit and the evidence of trademark infringement and passing off.",
      "pdf_source": "12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf",
      "nodes": [
        {
          "title": "Page 4",
          "node_id": "0006",
          "start_index": 4,
          "end_index": 4,
          "summary": "According to page 4 of the PDF \"12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf\", the legal proceedings involved the following key points:\n\n* Defendants 1 and 2 were served by publication on June 29, 2017, and proceeded against ex parte on November 16, 2017.\n* A written statement was filed by Defendant 3 on October 20, 2015, with a replication by the plaintiff.\n* An undertaking was recorded on January 30, 2017, where Defendant 3 agreed to take down listings related to the 'ZINO DAVIDOFF' mark.\n* Issues were framed on March 1, 2018, including the maintainability of the suit against Defendant 3 as an intermediary and their liability under the Information Technology Act, 2000.\n* The matter was referred for mediation on April 10, 2019, and settled via a Settlement Agreement on December 5, 2022, between the plaintiff and Defendant 3.\n\nSource: 12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf (2023/DHC/000458, CS(COMM) 460/2016)",
          "content": "2023/DHC/000458 \n \nCS(COMM) 460/2016 \n                                                                                                      Page 4 of 7 \n \ndefendants no.1 and 2 were served by way of publication on 29th June, 2017.   \n6. \nWritten statement was filed on behalf of the defendant no.3 on 20th \nOctober, 2015 and the replication thereto was filed by the plaintiff. Order \ndated 30th January, 2017 records the undertaking of the defendant no.3 to \ntake down any existing listing with regard to the mark ‘ZINO DAVIDOFF’ \nwithin 72 hours and any other listing as and when identified by the plaintiff.  \n7. \nOn 16th November, 2017, the defendants no.1 and 2 were proceeded \nagainst ex parte in the present suit.  \n8. \nOn 1st March, 2018, the following issues were framed:  \n1.Whether the suit against the defendant no. 3 being an intermediary \nas provided under Section 2(1)(w) of the Information Technology Act, \n2000 is maintainable or not? OPD \n \n2.Whether the defendant no. 3 had 'actual knowledge' of the allegedly \ninfringing nature of the goods listed by defendant nos. 1 and 2 on its \nwebsite www.shopclues.com and if so, how the knowledge mandated \nby Section 79(3)(b) of the Information Technology Act, 2000 was \nsatisfied to render the defendants liable? OPP \n \n3. Whether the defendants had conspired or abetted or aided or \ninduced, whether by threats or promise or otherwise in the \ncommission of the acts of passing off and/or infringement by \ndefendant nos. 1 and 2? OPP \n \n          4. Relief. \n9. \nOn 10th April, 2019, the matter was referred for mediation and the \nmatter was settled vide Settlement Agreement dated 5th December, 2022 \nentered into between the plaintiff and the defendant no.3. The Settlement \nAgreement dated 5th December, 2022 has been placed on record. The said \nSettlement Agreement has been signed by the representatives of the plaintiff \nand defendant no.3. It is stated in the Settlement Agreement that the terms of \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:21.01.2023 17:07:53\nSignature Not Verified",
          "pdf_source": "12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 5",
          "node_id": "0007",
          "start_index": 5,
          "end_index": 5,
          "summary": "According to page 5 of the PDF \"12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf\", the court proceedings involve a trademark infringement case (CS(COMM) 460/2016) between Zino Davidoff SA (plaintiff) and Bhalani Enterprises & Ors (defendants). The counsel for the plaintiff prayed for a decree of permanent injunction and damages against defendants 1 and 2. The court found that defendants 1 and 2 had failed to appear despite service and had been selling counterfeit products with the plaintiff's trademark. The court granted a permanent injunction in favor of the plaintiff, restraining defendants 1 and 2 from manufacturing and selling counterfeit products bearing the plaintiff's trademark. The decision was made on January 17, 2023. (Source: 2023/DHC/000458, PDF page 5)",
          "content": "2023/DHC/000458 \n \nCS(COMM) 460/2016 \n                                                                                                      Page 5 of 7 \n \nthe settlement are confidential. \n10. \nIn view of the above, the counsel for the plaintiff prays for a decree of \npermanent injunction and damages along with costs in the suit against the \ndefendants no.1 and 2 and a decree in terms of the Settlement Agreement \nagainst the defendant no.3.  \nANALYSIS AND FINDING  \n11. \nI have heard the counsel for the plaintiff and the defendant no.3 and \nperused the record of the case. \n12. \n In the present case, the defendants no.1 and 2 have failed to appear \nbefore this Court despite service. Therefore, the defendants no.1 and 2 have \nbeen proceeded against ex parte on 16th November, 2017.  \n13. \n Since the aforesaid defendants have failed to enter appearance or \neven take any requisite steps to contest the present suit, despite having \nsuffered an ad interim injunction order, it is evident that they have no \ndefence to put forth on merits. \n14. \n From a perusal of the material on record, this Court is of the view \nthat the defendants no.1 and 2 have been selling impugned products with a \nview to trade upon the established goodwill and reputation of the plaintiff. \nBy their aforesaid conduct, the defendants no.1 and 2 are infringing the \ntrademarks of the plaintiff, as also passing off their goods as that of the \nplaintiff.  \n15. \n Based on the averments in the plaint and the discussion above, this \nCourt is of the view that this is a fit case for granting relief of permanent \ninjunction in favour of the plaintiff and against the defendants no.1 and 2. \nAccordingly, the defendants no.1 and 2 are restrained from manufacturing \nand selling counterfeit products bearing the plaintiff’s trademark \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:21.01.2023 17:07:53\nSignature Not Verified",
          "pdf_source": "12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "According to page 6 of the PDF \"12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf\", the court has made the following decisions:\n\n* The defendant no.2 has given an undertaking not to deal with the impugned products, and therefore, no damages and costs are awarded against them.\n* The defendant no.1, who neither replied to the legal notice nor appeared in court, is found guilty of manufacturing and selling counterfeit 'DAVIDOFF' branded perfumes and fragrances.\n* The court decrees the suit in favor of the plaintiff, Zino Davidoff SA, and orders the defendant no.1 to pay Rs.3,00,000/- in damages.\n* The decision was made on January 17, 2023, by the High Court of Delhi, with the digitally signed order by Amit Bansal on January 21, 2023.\n* The case number is CS(COMM) 460/2016, and the advocates involved are Mr. Ajay Amitabh Suman for the plaintiff and Ms. Snehima Jauhari with Mr. Sohrab for the defendants. (Source: 2023/DHC/000458)",
          "content": "2023/DHC/000458 \n \nCS(COMM) 460/2016 \n                                                                                                      Page 6 of 7 \n \n‘DAVIDOFF’ or any other trademark deceptively similar to the \n‘DAVIDOFF’ marks of the plaintiff on the website, www.shopclues.com, or \nany other website in relation to the business of perfumes, fragrances and \nrelated products.   \n16. \nIn so far as the reliefs of damages and cost prayed for in the plaint, the \ndefendant no.2 has given an undertaking not to deal with the impugned \nproducts vide reply dated 13th May, 2015 to the cease and desist notice. In \nmy considered view, it is not the case of the plaintiff that after the aforesaid \nreply, the defendant no.2 continued to sell the impugned products. \nTherefore, I do not deem it proper to award damages and costs against the \ndefendant no.2.    \n17. \nAs regards defendant no.1, the defendant no.1 neither replied to the \nlegal notice, nor appeared before this Court. There can be no justification for \nmanufacturing and selling perfumes and fragrances in counterfeit \n‘DAVIDOFF’ branded packaging. The use of the impugned products on \nhuman body can cause adverse reactions. Clearly, customers are being \nmisled by the defendants no.1 and the entire effort is deliberate and \ndishonest. This amounts to dilution of the reputation and goodwill of the \nplaintiff’s trademarks and causing loss to the plaintiff in business and \nreputation. The defendant no.1 has been making unlawful gains at the \nexpense of the plaintiff.  \n18. \nIn view of the foregoing facts and circumstances, this Court is of the \nview that this is not a case of innocent adoption by the defendant no.1. The \nCourt cannot ignore such flagrant misuse of the plaintiff’s marks by the \ndefendant no.1. Therefore, the suit is decreed in favour of the plaintiff for \nRs.3,00,000/- towards damages to be paid by the defendant no.1. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:21.01.2023 17:07:53\nSignature Not Verified",
          "pdf_source": "12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0011",
      "start_index": 7,
      "end_index": 7,
      "summary": "According to the Court Decision section of the PDF document \"ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf\" (2023/DHC/000458), the High Court of Delhi at New Delhi has made a decision in the case CS(COMM) 460/2016. The plaintiff, Zino Davidoff SA, was represented by Mr. Ajay Amitabh Suman, Advocate, while the defendants, Bhalani Enterprises & Ors, were represented by Ms. Snehima Jauhari with Mr. Sohrab.\n\nThe court has decreed the present suit against the defendant no.1 in terms of prayer clauses 'a', 'e', and 'g' of the plaint and against the defendant no.2 in terms of prayer clause 'a' of the plaint. The defendant no.1 has been ordered to pay Rs.2,00,000/- to the plaintiff as costs within eight weeks, failing which the plaintiff can commence execution proceedings.\n\nThe court has also accepted a Settlement Agreement dated 5th December, 2022, in relation to the defendant no.3, which shall form part of the decree. The plaintiff has chosen not to pursue reliefs contemplated in prayer clauses 'b', 'c', 'd', and 'f' of the plaint against the defendants no.1 and 2.\n\nThe decree sheet has been ordered to be drawn up, and all pending applications have been disposed of. The decision was made by AMIT BANSAL, J. on January 17, 2023, and digitally signed on January 21, 2023. The details of the case can be found in the PDF document \"ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf\" (source: 2023/DHC/000458).",
      "pdf_source": "12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf",
      "nodes": [
        {
          "title": "Page 7",
          "node_id": "0010",
          "start_index": 7,
          "end_index": 7,
          "summary": "According to page 7 of the PDF \"12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf\" (2023/DHC/000458), the court ruled in favor of the plaintiff, Zino Davidoff SA. The defendant no.1, Bhalani Enterprises, was ordered to pay Rs.2,00,000/- as costs to the plaintiff within eight weeks. The suit was decreed against defendant no.1 in terms of prayer clauses 'a', 'e', and 'g' of the plaint, and against defendant no.2 in terms of prayer clause 'a'. The counsel for the plaintiff did not press for reliefs in prayer clauses 'b', 'c', 'd', and 'f'. The suit was also decreed against defendant no.3 based on a Settlement Agreement dated December 5, 2022. The court was presided over by Amit Bansal, J., with the decision dated January 17, 2023.",
          "content": "2023/DHC/000458 \n \nCS(COMM) 460/2016 \n                                                                                                      Page 7 of 7 \n \nAdditionally, Rs.2,00,000/- is awarded to the plaintiff as costs to be paid by \nthe defendant no.1.  \n19. \nThe defendants no.1 shall pay the said amount to the plaintiff within \neight weeks, failing which the plaintiff is permitted to commence execution \nproceedings against the defendant no.1.  \n20. \nAccordingly, the present suit is decreed against the defendant no.1 in \nterms of prayer clauses ‘a’, ‘e’ and ‘g’ of the plaint and against the \ndefendant no.2 in terms of prayer clause ‘a’ of the plaint.   \n21. \nCounsel for the plaintiff does not press for the reliefs contemplated in \nprayer clauses ‘b’, ‘c’, ‘d’ and ‘f’ of the plaint against the defendants no.1 \nand 2. \n22. \nInsofar as the defendant no.3 is concerned, the suit is decreed against \nthe defendant no.3 in terms of the Settlement Agreement dated 5th \nDecember, 2022. The said Settlement agreement shall form part of the \ndecree.  \n23.    Decree sheet be drawn up. \n24.    All pending applications stand disposed of. \n \n \n \nAMIT BANSAL, J. \nJANUARY 17, 2023 \nat \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:21.01.2023 17:07:53\nSignature Not Verified",
          "pdf_source": "12. ZINO DAVIDOFF VS. BHALANI ENTERPRISES & ORS.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-15T18:28:48.937878",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}