{
  "doc_name": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED",
  "pdf_source": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
  "metadata": {
    "document_name": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED",
    "source_pdf": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
    "judges": [
      "AMIT BANSAL"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "550/2022",
      "550/2022",
      "550/2022",
      "550/2022",
      "550/2022",
      "550/2022",
      "550/2022",
      "550/2022",
      "550/2022",
      "550/2022",
      "550/2022",
      "550/2022",
      "550/2022",
      "550/2022",
      "550/2022",
      "550/2022",
      "550/2022",
      "12642/2022"
    ],
    "dhc_numbers": [
      "2023/DHC/000394",
      "2023/DHC/000394",
      "2023/DHC/000394",
      "2023/DHC/000394",
      "2023/DHC/000394",
      "2023/DHC/000394",
      "2023/DHC/000394",
      "2023/DHC/000394",
      "2023/DHC/000394",
      "2023/DHC/000394",
      "2023/DHC/000394",
      "2023/DHC/000394",
      "2023/DHC/000394",
      "2023/DHC/000394",
      "2023/DHC/000394",
      "2023/DHC/000394"
    ],
    "ia_numbers": [],
    "decision_date": "06 January, 2023",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      "KRBL LIMITED"
    ],
    "defendants": [
      "VIKRAM ROLLER FLOUR MILLS LIMITED"
    ],
    "appellants": [],
    "respondents": [],
    "plaintiff_advocates": [
      "Sudarshan Kumar Bansal",
      "Anirudh Bakhru",
      "Nikhil Sonker",
      "C. Tejaswani"
    ],
    "defendant_advocates": [
      "Ajay Sahni",
      "Manish Singhal",
      "Chirag Ahluwalia"
    ],
    "appellant_advocates": [],
    "respondent_advocates": [],
    "damages_claimed": null,
    "damages_awarded": null,
    "key_issues": [
      "Trademark infringement by the defendant using the 'INDIA GATE' mark for their products.",
      "Validity of the plaintiff's trademark registration for 'INDIA GATE' and its effectiveness from 1993.",
      "Whether the defendant's use of the 'INDIA GATE' trademark with a device constitutes infringement of the plaintiff's registered trademark.",
      "The plaintiff's claim of secondary significance and distinctiveness of their 'INDIA GATE' trademark due to impressive sales figures.",
      "The impact of the Registrar of Trade Marks declaring 'INDIA GATE' as a 'well-known trademark' under the Trade Marks Act, 1999.",
      "Copyright registration for 'INDIA GATE' labels and artistic works, and their originality and distinctiveness.",
      "Opposition to the plaintiff's other trademark applications for 'INDIA GATE' label/device/word marks in various classes.",
      "The plaintiff's right to seek relief under Order XXXIX Rules 1 and 2 of the Code of Civil Procedure, 1908, for interim injunction.",
      "Whether the defendant's actions have caused dilution or tarnishment of the plaintiff's 'INDIA GATE' trademark.",
      "The plaintiff's entitlement to protection of their intellectual property rights, including trademark and copyright, in the 'INDIA GATE' mark and labels."
    ],
    "decision_summary": "**Case Summary: KRBL Limited vs. Vikram Roller Flour Mills Limited**\n\n**Background:**\nThe plaintiff, KRBL Limited, is a leading company in the business of processing, marketing, and exporting rice in India. The defendant, Vikram Roller Flour Mills Limited, is engaged in the business of processing, marketing, and selling flour products. The dispute revolves around the use of the trademark \"INDIA GATE\" by both parties.\n\n**Facts:**\n\n* The plaintiff acquired the rights to the trademark \"INDIA GATE\" (word per se) in 2019 and subsequently registered it.\n* The plaintiff has filed various trademark applications for \"INDIA GATE\" label/device/word marks in different classes, which have been opposed.\n* The plaintiff has been granted copyright registration for \"INDIA GATE\" labels in India and abroad.\n* The plaintiff has been using the trademark \"INDIA GATE\" since 1993 and has claimed that it has become distinctive and acquired secondary significance.\n* The defendant is using the trademark \"INDIA GATE\" with a device for its flour products.\n\n**Legal Issues:**\n\n* The plaintiff has filed a suit against the defendant for infringement of its trademark \"INDIA GATE\" and sought an injunction to restrain the defendant from using the mark.\n* The defendant has filed a counter-claim challenging the plaintiff's rights to the trademark \"INDIA GATE\".\n\n**Arguments:**\n\n* The plaintiff argued that it has been using the trademark \"INDIA GATE\" since 1993 and has built up a significant reputation and goodwill in the market.\n* The plaintiff claimed that the defendant's use of the trademark \"INDIA GATE\" with a device is likely to cause confusion among consumers and dilute the distinctiveness of the plaintiff's mark.\n* The defendant argued that it has been using the trademark \"INDIA GATE\" with a device for its flour products and that the plaintiff's mark is not distinctive or well-known in the market.\n\n**Court Findings:**\n\n* The court noted that the plaintiff has been using the trademark \"INDIA GATE\" since 1993 and has filed various trademark applications and copyright registrations for the mark.\n* The court observed that the plaintiff has claimed that its mark has become distinctive and acquired secondary significance, but the defendant has challenged this claim.\n* The court found that the defendant has been using the trademark \"INDIA GATE\" with a device for its flour products, which may cause confusion among consumers.\n\n**Decision:**\n\n* The court reserved its judgment on the application filed by the plaintiff under Order XXXIX Rules 1 and 2 of the Code of Civil Procedure, 1908 (CPC) and granted liberty to both parties to file written submissions.\n* The court will decide on the plaintiff's application for an injunction to restrain the defendant from using the trademark \"INDIA GATE\" with a device.\n* The court's decision will depend on its findings on the distinctiveness and reputation of the plaintiff's mark, as well as the likelihood of confusion among consumers.\n\n**Previous Litigation:**\n\n* The plaintiff had filed a suit (CS no. 131/2011) against the defendant in 2011, seeking an injunction to restrain the defendant from using the trademark \"INDIA GATE\" along with the device of INDIA GATE. An ex parte injunction order was granted in favor of the plaintiff, which was later confirmed.\n* The defendant had filed an appeal (FAO no. 7/2012) against the injunction order, which was disposed of by the court along with other appeals and revisions filed by the defendant.\n\nThe court's decision in this case will have significant implications for the parties involved and may set a precedent for similar trademark disputes in the future.",
    "legal_precedents": [
      "(1995) 5 SCC 545",
      "Laxmi Agro Impex \nIndia Ladli India Commodities",
      "Laxmi Agro Impex India Ladli India \nCommodities"
    ],
    "full_text": "\n--- PAGE 1 ---\n2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 1 of 16 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n% \n \n \n Judgment Reserved on :  06th January, 2023 \nJudgment Delivered on : 19th January, 2023 \n \n+  \n \n \n \n \nCS(COMM) 550/2022  \n \n \nKRBL LIMITED  \n \n \n \n \n..... Plaintiff \nThrough: \nMr. \nSudarshan \nKumar \nBansal, \nMr.Anirudh \nBakhru, \nMr. \nNikhil \nSonker \nand \nMs. \nC. \nTejaswani, \nAdvocates. \n \n \n \n \n \nversus \n \n \nVIKRAM ROLLER FLOUR MILLS LIMITED \n..... Defendant \nThrough: \nMr. Ajay Sahni, Mr.  Manish Singhal \nand \nMr. \nChirag \nAhluwalia, \nAdvocates. \n \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nJUDGMENT \nAMIT BANSAL, J. \n \nI.A. 12642/2022 (O-XXXIX R-1 & 2 of CPC) \n1. \nBy way of the present judgment, I shall decide the application filed on \nbehalf of the plaintiff under Order XXXIX Rules 1 and 2 of the Code of \nCivil Procedure, 1908 (CPC). \n2. \nSubmissions on behalf of the counsels were heard on 7th December, \n2022, 13th December, 2022 and 6th January, 2023, when judgment was \nreserved and liberty was given to both parties to file written submissions \nwithin one week.  Pursuant thereto, written submissions have been filed on \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified\n\n--- PAGE 2 ---\n2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 2 of 16 \n \nbehalf of the parties. \n3. \nBriefly, the case set up by the plaintiff in the plaint is as follows: \n3.1. The plaintiff company is in the business of processing, marketing and \nexporting rice of various kinds and is a market leader in the aforesaid \nbusiness in India.  \n3.2. In 2019, the plaintiff acquired rights in the trademark ‘INDIA GATE’ \n(word per se) from one, Mr. Ram Pratap vide Deed of Assignment dated 6th \nAugust, 2019 and hence, the trademark ‘INDIA GATE’ (word per se) was \nsubsequently registered in favour of the plaintiff vide registration certificate \ndated 12th August, 2019, effective from 18th June, 1993. \n3.3. The plaintiff has filed various other trademark applications in respect \nof ‘INDIA GATE’ label/device/word marks in various classes which have \nbeen opposed. \n3.4. The plaintiff has been granted copyright registration for ‘INDIA \nGATE’ labels, \n and \n in India \nas well as abroad. The abovesaid labels/artistic works of the plaintiff bear \noriginal artistic features of placement, distinctive getup, makeup, lettering \nstyle etc.  \n3.5. The plaintiff has given sales figures in respect of export as well as \ndomestic sales of the plaintiff’s rice sold under the trademark ‘INDIA \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified\n\n--- PAGE 3 ---\n2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 3 of 16 \n \nGATE’ w.e.f. 1993-94.  Plaintiff has placed on record various invoices \nshowing sales of its products under the trademark ‘INDIA GATE’ with \neffect from 18th February, 1995 \n3.6. Plaintiff has also given details in respect of advertisement and \npromotional expenses in respect of plaintiffs’ trademark ‘INDIA GATE’ \nwith effect from 2004-05.   \n3.7. On account of its impressive sales figures, it is claimed that the \nplaintiff’s trademark has become distinctive and acquired secondary \nsignificance with the goods and business of the plaintiff. \n3.8. The trademark ‘INDIA GATE’ has been declared as a ‘well-known \ntrademark’ under Section 2(1)(zg) of the Trade Marks Act, 1999 by the \nRegistrar of Trade Marks vide publication dated 19th August, 2019. \n3.9. The defendant is engaged in the business of processing, marketing \nand selling of ‘atta’, ‘suji’, ‘maida’, ‘rawa’ and ‘bran’ under the trademark \n‘INDIA GATE’, with the device of INDIA GATE. \n3.10. Plaintiff filed a suit, bearing CS no.131/2011 against the defendant \nwherein an ex parte injunction order was granted on 16th June, 2011 in \nfavour of the plaintiff and against the defendant restraining the defendant \nfrom using the trademark ‘INDIA GATE’ along with the device of INDIA \nGATE. The said injunction order was confirmed vide order dated 24th \nOctober, 2011. The said suit has been re-numbered and is pending \nadjudication. \n3.11. An appeal, bearing FAO no.7/2012 was filed by the plaintiff before \nthis Court and a common order dated 21st April, 2014 was passed by this \nCourt in the said appeal as well as appeals/revisions filed on behalf of the \ndefendant. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified\n\n--- PAGE 4 ---\n2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 4 of 16 \n \n3.12. In July, 2011, the defendant filed a suit, being CS no. 1777/2011 \nagainst the plaintiff before this Court alleging infringement of their \ntrademark/ label \n/‘INDIA GATE’ registered in class 30.  The \nsaid suit was re-numbered and is pending adjudication before this Court and \nno interim order has been passed therein. \n3.13. A cancellation petition has been filed by the plaintiff against the \naforesaid registered trademark/label of the defendant, \n/ \n‘INDIA GATE’, which is pending adjudication. The defendant has given an \nundertaking that the defendant would not rely upon the said registration \nagainst the plaintiff.  \n3.14. In the first week of May, 2022, the plaintiff came to know about an \napplication filed by the defendant in Class 30 for registration of trademark \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified\n\n--- PAGE 5 ---\n2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 5 of 16 \n \n(device) \n/ ‘INDIA GATE BRAND’ in relation to ‘dalia’ \nand also came to know about the defendant using the aforesaid trademark in \nrespect of ‘dalia’.   \n4. \nAccordingly, the present suit has been filed seeking, inter alia, the \nrelief of permanent injunction against the defendants. The suit was \naccompanied by the present application under Order XXXIX Rules 1 and 2 \nof the CPC seeking a grant of interim injunction.  Summons in the suit and \nnotice in the application was issued on 21st November, 2022. Pursuant \nthereto, written statement, as well as reply to the interim application, has \nbeen filed on behalf of the defendant.  \nSUBMISSIONS OF THE PLAINTIFF \n5. \nCounsel for the plaintiff has made the following submission. \n5.1 \nThe user by the defendant of the trademark ‘INDIA GATE’ in \nrelation to ‘dalia’ is in violation of the order dated 21st April, 2014 passed by \nthis court in FAO no.7/2012. The defendant was permitted to use the \ntrademark ‘INDIA GATE’ in respect of only ‘atta’, ‘suji’, ‘maida’, ‘rawa’ \nand ‘bran’, but not ‘dalia’. It is further submitted that the injunction granted \nagainst the defendant by the Trial Court vide order dated 24th October, 2011 \nin relation to goods other than ‘atta’, ‘suji’, ‘maida’, ‘rawa’ and ‘bran’ was \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified\n\n--- PAGE 6 ---\n2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 6 of 16 \n \nnot set aside and therefore, continues to operate.  \n5.2 \nThe invoices placed on record by the defendant showing user prior to \nthe date of invoice of the plaintiff do not show that the defendant was selling \nits goods under the trademark ‘INDIA GATE’. \n5.3 \nThe trademark registration application of the defendant in respect of \n‘dalia’ is still pending. Therefore, the aforesaid usage constitutes \ninfringement of the registered and ‘well-known trademark’ of the plaintiff, \n‘INDIA GATE’.  \n5.4 \nThe impugned logo on the defendant’s packaging is similar to the \nlogo on the plaintiff’s packaging and therefore, constitutes infringement of \nthe copyright of the plaintiff. \n5.5 \nThe defendant is also guilty of passing off its goods as those of the \nplaintiff. \n5.6 \nDefendant has failed to make out a case of ‘continuous user’ in terms \nof Section 34 of the Trade Marks Act, 1999. Reliance in this regard has been \nplaced on Pioneer Nuts and Bolts Pvt. Ltd. v. Goodwill Enterprises, 2009 \nSCC OnLine Del 2851, PEPS Industries (P) Ltd. v. Kurlon Ltd., 2022 SCC \nOnLine Del 3275, Dabur India Ltd. v. Real Drinks Pvt. Ltd., 2014 SCC \nOnLine Del 23 and S. Narendra Kumar & Co. v. Everest Beverages and \nFoods Inudstries, 2008 SCC OnLine Del 1759. \nSUBMISSIONS OF THE DEFENDANT \n6. \nPer contra, the case of the defendant in the written statement and as \nper the submissions made by the counsel for the defendant can be \nsummarized as under: \n6.1 \nThe consent order dated 21st April, 2014 is only in relation to ‘rice’ \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified\n\n--- PAGE 7 ---\n2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 7 of 16 \n \n(plaintiff’s product) and ‘atta’, ‘suji’, ‘maida’, ‘rawa’ and ‘bran’ \n(defendant’s products) and not in relation to any other goods. Therefore, it \nwas open for both the sides to expand their business to other products.  \n6.2 \nThe defendant is the prior user of the trademark ‘INDIA GATE’ in \nrespect of ‘atta’, ‘suji’, ‘maida’, ‘rawa’ and ‘bran’, which are all wheat \nproducts, since 1975. The defendant has an inherent right to expand its range \nof products and hence, use the aforesaid trademark in respect of ‘dalia’, \nwhich is an allied/cognate product to the earlier products of the defendant. \nThe defendant has been using the trademark ‘INDIA GATE’ in respect of \n‘dalia’ since 2015, which the plaintiff was fully aware of. \n6.3 \nThe plaintiff itself has filed various registration applications for the \ntrademark ‘INDIA GATE’ in respect of ‘rice flour’, ‘idli rava’, ‘rice atta’ \nand in respect of goods other than ‘rice’, such as ‘quinoa’, ‘flax seeds’ and \n‘millets’.  \n6.4 \nAs regards the trademark of the plaintiff being a ‘well-known \ntrademark’, it is not based on any proper determination by the Court.  \n6.5    Registration in respect of the plaintiff is defective as the trademark \napplication was wrongly advertised as a word mark instead of a device mark \nas initially applied for. \n6.6 \nCounsel for the defendant has drawn the attention of the Court to \ncopies of bills/invoices as well as advertisements in trade directories \nshowing user of the trademark ‘INDIA GATE’ by the defendant since 1990.  \nANALYSIS & FINDINGS \n7. \nI have heard the rival submissions. \n8. \nBoth sides have placed extensive reliance on the order dated 21st \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified\n\n--- PAGE 8 ---\n2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 8 of 16 \n \nApril, 2014 passed by this Court in FAO no.7/2012 and have sought to place \ntheir own interpretation of the same. Therefore, it is deemed expedient to \nextract the relevant portions of the said order: \n“1. \nCounsels for the parties, and who are veterans in IPR law, \nafter some initial arguments, have agreed to dispose of these \nappeals with the following consent order:- \n \n(i) \nThe appellant in FAO 7/12 i.e. KRBL Ltd., and who is the \nplaintiff in the trial court, will use the trademark ‘INDIA GATE’ \nwith respect to rice but not with respect to Aata, Suji, Maida, \nRawa \nand \nBran \nbeing \npresently \nused \nby \nthe \nrespondents/defendants, and all of which later products will be \nsold \nin \npackages \nof \n20 \nkilograms \nand \nabove \nby \nthe  respondents/defendants. Any claim or entitlement of the \nrespective  parties to use the trademark ‘INDIA GATE’ for any \nother products except  as stated in this order, is not the subject \nmatter of the present consent  order. The trademark ‘INDIA \nGATE’ will be used with respect to product  rice in packages of \nany size whatsoever by the appellant/plaintiff. \n \n(ii)  \nThe respondents in FAO 7/2012, and who are defendants \nin the suits, without in any manner comment being made upon \ntheir inter se disputes, will, so far as the appellant-plaintiff is \nconcerned, be entitled to use the  trademark ‘INDIA GATE for \ntheir products being Aata, Maida, Rawa, Suzi and Bran, for \nwhich a registration under the Trades Mark Act, 1999 exists in \ntheir favour. Of course, observations with respect to registration \nis not being made in a final manner for or against any of the \nparties to the  appeal, and which aspect will be decided in \nappropriate legal proceedings. \n \nxxx \n \n \n \n \nxxx \n \n \n \n xxx \n \n3. \nThis consent order will bind the parties with respect to \nuse  of the trade mark „INDIA GATE‟, is in the nature of interim \norder till  the disposal of the suit not only in the present \nsuit/litigation, but  also for the interim stages in the other \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified\n\n--- PAGE 9 ---\n2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 9 of 16 \n \nlitigations \nwhich \nare \nsaid \nto \nbe \npending \ninter \nse \nrespondents/defendants on the one hand and the appellant-\n  plaintiff on the other hand. \n \n \nxxx \n \n \n \n \nxxx \n \n \n \n xxx \n \n5. \nIt is again clarified that the observations in this appeal  and \norder are with respect to use in the interim stages during \nthe  pendency of the suit for the trademark „INDIA GATE‟, and \nwith respect to  the products which is stated above in the present \norder. \n...” \n \n9. \nThe position that emerges from a reading of the aforesaid order can be \nsummarized as under: \n9.1 \nThis was a consent order passed by the Court. \n9.2 \nThe plaintiff was restrained from using the trademark ‘INDIA GATE’ \nin respect of the following products viz, ‘atta’, ‘suji’, ‘maida’, ‘rawa’ and \n‘bran’, that were being used at that point of time by the defendant. \n9.3 \nThe defendant could not use the trademark ‘INDIA GATE’ in respect \nof ‘rice’. \n9.4 \nPlaintiff was permitted to use the trademark ‘INDIA GATE’ in \nrespect of ‘rice’ in packages of any size. The defendant could sell ‘atta’, \n‘suji’, ‘maida’, ‘rawa’ and ‘bran’ in packages of 20 kg and above. \n9.5 \nThe entitlement of parties to use the trademark ‘INDIA GATE’ \nfor any other products other than the aforenoted products, was not \ncovered by the said order. \n9.6 \nThis arrangement was to continue till the final disposal of the suit.  \n10. \nA reading of the aforesaid order makes it clear that there was no bar \neither on the plaintiff or on the defendant to use the trademark ‘INDIA \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified\n\n--- PAGE 10 ---\n2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 10 of 16 \n \nGATE’ in respect of products other than those that were the subject matter \nof the said suit i.e., ‘atta’, ‘suji’, ‘maida’, ‘rawa’, ‘bran’ and ‘rice’.   \n11. \nCounsel for the plaintiff submits that since the aforesaid order did not \nset aside the order passed by the Trial Court on 24th October, 2011, \nrestraining the defendant from use of the trademark ‘INDIA GATE’ along \nwith the label or device of INDIA GATE in respect of products other than \nthe products that were registered by the defendant. The said restraint order \nwould continue to operate even after passing of the aforesaid consent order. \n12. \nI do not agree with the aforesaid submission of the plaintiff.  The \nobservations made in paragraph 14 of the order dated 24th October, 2011, \nwhich was the subject matter of appeal in FAO no. 7/2012, restraining the \ndefendants from using the trademark ‘INDIA GATE’ along with the label or \ndevice of INDIA GATE in respect of any product other than ‘atta’, ‘suji’, \n‘maida’, ‘rawa’ and ‘bran’, would not operate after the consent order dated \n21st April, 2014 was passed by this Court. Once a comprehensive consent \norder has been passed by the Appellate Court clearly defining the inter se \narrangement between the plaintiff and the defendant during the pendency of \nthe suit, no reliance can be placed on the order of the Trial Court, which is \ndeemed to have merged with the order passed by the Appellate Court. \nTherefore, there is no merit in the submission that the consent order did not \nspecifically set aside the order of the Trial Court and only partially modified \nthe said order.   \n13. \nAfter passing of the aforesaid consent order, the plaintiff filed various \ntrademark registration applications in Class 30 in respect of ‘rice flour’, ‘idli \nrava’, ‘rice atta’ and goods other than ‘rice’, such as ‘quinoa’, ‘flaxseeds’, \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified\n\n--- PAGE 11 ---\n2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 11 of 16 \n \n‘millets’, etc. However, no trademark registration application has been filed \nby the plaintiff for ‘dalia’. \n14. \nSurely, if the plaintiff has a right to expand the usage of its trademark \n‘INDIA GATE’ in respect of other ‘rice’ products and products beyond \n‘rice’, the defendant cannot be denied the same right to expand its business \ninto other allied/cognate products. The present case relates to ‘dalia’, which \nwould fall in the category of wheat products. Pertinently, the defendant is \nnot using the trademark ‘INDIA GATE’ in respect of ‘rice’ or ‘rice’ \nproducts. I do not read any restriction in the consent order either on the \nplaintiff or the defendant from expanding their business into other products. \nTherefore, in my considered view, the defendant was entitled to expand its \nproduct range into similar or cognate or allied goods and use the trademark \n‘INDIA GATE’ in respect of such goods, including ‘dalia’. In this regard \ncounsel for defendant has correctly placed reliance on the judgment of a Co-\nordinate Bench of this Court in Somany Ceramics Ltd. v. Shri Ganesh \nElectric Co., 2022 SCC OnLine Del 3270. The relevant paragraph is set out \nbelow: \n“61. \nPertinent it is to mention, at this stage, that while the \nPlaintiff started its business in ceramics tiles, it subsequently \nexpanded into sanitaryware and bath fittings and obtained \nregistrations in Class 11 on 05.01.2007. Later, Plaintiff also \nexpanded its business into selling water heaters/geysers and \nobtained registration on 31.07.2018. This fact is important in the \ncontext of the judgment of the Supreme Court in Laxmikant \n(supra), where it was held that Courts have to be mindful of \nfuture expansion of the business of a proprietor of a trademark. \nPlaintiff is right in its contention that merely because a \ntrademark registration is applied for in a particular class, the \nproprietor is forever bound to sell only those goods. Law \nrecognises the expansion of business into similar or cognate or \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified\n\n--- PAGE 12 ---\n2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 12 of 16 \n \nallied goods and this factor is relevant for determination of a \nclaim for passing off.” \n \n15. \nIt has been vehemently contended on behalf of the plaintiff that the \ndefendant has failed to file invoices showing that the products of the \ndefendant were sold under the trademark ‘INDIA GATE’. Therefore, the \ndefendant cannot claim user  prior to the registration of the plaintiff. In this \nregard, reference may be made to the invoices placed on record by the \ndefendant beginning from 8th May, 1990 (pages no. 44 to 189 of the \ndefendant’s documents) which show the use of the ‘INDIA GATE’ device \nmark and the word mark. While it is correct that some of the invoices for the \nearlier period do not show that the goods were being sold under the \ntrademark ‘INDIA GATE’, in all the aforesaid invoices the device of INDIA \nGATE prominently features at the top left corner of the invoices. Defendant \nhas also placed on record the advertisements made by the defendant in \nvarious trade directories with effect from May, 1990 (pages no. 325 to 339 \nof the defendant’s documents) to show that the defendant was continuously \nusing the trademark ‘INDIA GATE’ in respect of their wheat products. \n16. \nFor a prima facie consideration, the defendant has placed sufficient \nmaterial on record showing user of the ‘INDIA GATE’ device mark from \n1990, which is prior to the registration of the plaintiff. To be noted, the \nregistration granted in favour of the plaintiff was only in respect of ‘rice’. \nThe earliest invoice filed on behalf of the plaintiff showing user of the \ntrademark ‘INDIA GATE’ is of 18th February, 1995.  \n17. \nIt has also to be borne in mind that the defendant was granted \nregistration in respect of the device mark ‘INDIA GATE’ with effect from \n3rd November, 1993. In this regard reference may be made to the judgment \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified\n\n--- PAGE 13 ---\n2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 13 of 16 \n \nin Gujarat Bottling Co. Ltd. v. Coca Cola Co., (1995) 5 SCC 545 followed \nby a Co-ordinate Bench of this Court in Aditya Birla Nuvo Limited v. R.S. \nSales Corporation, 2018 SCC OnLine Del 9794, wherein it has been held \nthat a mark which is registered is protected, irrespective of the fact whether \nthe party uses the registered mark or not.  \n18. \nThe undertaking given on behalf of the defendant in the rectification \npetition filed by the plaintiff was only in respect of the earlier suit that was \npending before the Patiala House Courts, New Delhi. The said undertaking \ncannot be applied to the present suit.  \n19. \nReliance placed on behalf of the plaintiff on the judgments in Pioneer \nNuts and Bolts Pvt. Ltd. v. Goodwill Enterprises, 2009 SCC OnLine Del \n2851, PEPS Industries (P) Ltd. v. Kurlon Ltd., 2022 SCC OnLine Del \n3275, Dabur India Ltd. v. Real Drinks Pvt. Ltd., 2014 SCC OnLine Del 23 \nand S. Narendra Kumar & Co. v. Everest Beverages and Foods Inudstries, \n2008 SCC OnLine Del 1759, would not come to the assistance of the \nplaintiff as in all the aforesaid cases, unlike the present case, there was no \nregistration of the trademark in favour of the defendant. \n20. \nMuch emphasis has been laid on behalf of the plaintiff on the aspect \nthat the trademark of the plaintiff is a ‘well-known trademark’ in terms of \nSection 2(1)(zg) of the Trade Marks Act, 1999. In this regard, reliance has \nbeen placed on the order dated 31st July, 2019 passed by the Deputy \nRegistrar of Trade Marks, declaring the trademark of the plaintiff, ‘INDIA \nGATE’ as a ‘well-known trademark’. However, a perusal of the aforesaid \norder shows that the aforesaid determination was made by the Deputy \nRegistrar based on an order dated 10th May, 2016 passed by the Additional \nDistrict Judge, Patiala House Courts, New Delhi in ex parte proceedings.  It \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified\n\n--- PAGE 14 ---\n2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 14 of 16 \n \nis pertinent to note that neither any prayer was sought nor any issue was \nframed with regard to the trademark of the plaintiff being a ‘well-known \ntrademark’. The plaintiff cannot take advantage of the aforesaid \ndetermination of its trademark being a ‘well-known trademark’ so as to \nprevent the defendant from using the said trademark in respect of which the \ndefendant has prior user and registration. In terms of Section 28(3) of the \nTrade Marks Act, 1999, where two persons are registered proprietors of \nidentical or similar trademarks both shall have the exclusive right to use the \nsaid trademarks. \n21. \nIt is significant to note that the defendant applied for the registration \nof the device mark ‘INDIA GATE’ in respect of ‘dalia’ on 5th October, 2021 \nclaiming user since 1st April, 2015. The defendant has also placed on record \ninvoices from 8th October, 2015 (pages no.291-322 of the defendant’s \ndocuments) showing sale of ‘dalia’ under the trademark ‘INDIA GATE \nBRAND’, which is much prior to filing of the present suit.  \n22. \nAs regards the infringement of the plaintiff’s registered copyright by \nthe defendant, it is to be noted that the earliest copyright registration in \nfavour of the plaintiff is in 1999, which is much after the user of the artistic \ndevice of \n by the defendant. The pictorial depiction of INDIA \nGATE is substantially different in the label of the plaintiff and the label of \nthe defendant. Therefore, no case for copyright infringement is made out.  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified\n\n--- PAGE 15 ---\n2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 15 of 16 \n \n23. \nAs regards the allegations of passing off, in paragraph 36 of the plaint \nat page no.52, a comparison of the trademark ‘INDIA GATE’ of the plaintiff \nand the defendant has been made, which is set out below: \n \n24. \n The aforesaid comparison shows that there is a material difference \nbetween the packaging of the plaintiff and the defendant. Even though the \nwords ‘INDIA GATE’ and the pictorial representation of INDIA GATE \noccur in both the packaging of the plaintiff and the defendant, the getup of \nthe packaging is substantially different, so there can be no possibility of \nconfusion or deception to the public. Reference in this regard may be made \nto the judgment of a Co-ordinate Bench of this Court in Laxmi Agro Impex \nIndia v. Ladli India Commodities, 2019 SCC OnLine Del 11147, wherein it \nhas been held that the rival marks have to be compared as a whole, keeping \nin mind an unwary purchaser of average intelligence and imperfect \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified\n\n--- PAGE 16 ---\n2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 16 of 16 \n \nrecollection. The judgment in  Laxmi Agro (supra) was upheld by a Division \nBench of this Court in Laxmi Agro Impex India v. Ladli India \nCommodities, 2019 SCC OnLine Del 11717 and SLP (C) no.8282/2020 \npreferred thereagainst was dismissed on 16th October, 2020.  \n25. \nIn view of the discussion above, the plaintiff has failed to establish a \nprima facie case in its favour for the grant of interim injunction. Balance of \nconvenience is also in favour of the defendant for not granting interim \ninjunction at this stage, as the product ‘dalia’ of the defendant has been \nselling in the market with the impugned trademark since 2015.  There is no \nmerit in the present application under Order XXXIX Rules 1 and 2 of the \nCPC.  \n26. \nDismissed.  \n \nAMIT BANSAL, J. \nJANUARY 19, 2023 \ndk \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified\n"
  },
  "total_pages": 16,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "According to the PDF document \"KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf\", the case CS(COMM) 550/2022 was heard in the High Court of Delhi. The plaintiff, KRBL Limited, was represented by advocates Mr. Sudarshan Kumar Bansal, Mr. Anirudh Bakhru, Mr. Nikhil Sonker, and Ms. C. Tejaswani, while the defendant, Vikram Roller Flour Mills Limited, was represented by advocates Mr. Ajay Sahni, Mr. Manish Singhal, and Mr. Chirag Ahluwalia.\n\nThe judgment was reserved on January 6, 2023, and delivered on January 19, 2023, by Hon'ble Mr. Justice Amit Bansal. The plaintiff claimed rights to the trademark 'INDIA GATE' (word per se) and 'INDIA GATE' labels/devices/word marks in various classes, which were registered in their favor. The plaintiff also claimed copyright registration for 'INDIA GATE' labels/artistic works.\n\nThe case involves an application filed by the plaintiff under Order XXXIX Rules 1 and 2 of the Code of Civil Procedure, 1908 (CPC). The submissions were heard on December 7, 2022, December 13, 2022, and January 6, 2023. Written submissions were filed by both parties after the judgment was reserved. The plaintiff's business includes processing, marketing, and exporting rice, and they claim to be a market leader in India. The defendant's arguments and the court's decision are not summarized in this excerpt, but can be found in the full PDF document \"KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf\" (Source: 2023/DHC/000394).",
      "pdf_source": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "According to page 1 of the PDF \"13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf\", the case CS(COMM) 550/2022 was heard in the High Court of Delhi at New Delhi. The judgment was reserved on January 6, 2023, and delivered on January 19, 2023. The plaintiff, KRBL Limited, was represented by Mr. Sudarshan Kumar Bansal, Mr. Anirudh Bakhru, Mr. Nikhil Sonker, and Ms. C. Tejaswani, while the defendant, Vikram Roller Flour Mills Limited, was represented by Mr. Ajay Sahni, Mr. Manish Singhal, and Mr. Chirag Ahluwalia. The court, presided over by Hon'ble Mr. Justice Amit Bansal, decided on an application filed under Order XXXIX Rules 1 and 2 of the Code of Civil Procedure, 1908 (CPC). The court heard submissions on December 7, 13, and January 6, 2023, before reserving judgment. (Source: PDF page 1)",
          "content": "2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 1 of 16 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n% \n \n \n Judgment Reserved on :  06th January, 2023 \nJudgment Delivered on : 19th January, 2023 \n \n+  \n \n \n \n \nCS(COMM) 550/2022  \n \n \nKRBL LIMITED  \n \n \n \n \n..... Plaintiff \nThrough: \nMr. \nSudarshan \nKumar \nBansal, \nMr.Anirudh \nBakhru, \nMr. \nNikhil \nSonker \nand \nMs. \nC. \nTejaswani, \nAdvocates. \n \n \n \n \n \nversus \n \n \nVIKRAM ROLLER FLOUR MILLS LIMITED \n..... Defendant \nThrough: \nMr. Ajay Sahni, Mr.  Manish Singhal \nand \nMr. \nChirag \nAhluwalia, \nAdvocates. \n \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nJUDGMENT \nAMIT BANSAL, J. \n \nI.A. 12642/2022 (O-XXXIX R-1 & 2 of CPC) \n1. \nBy way of the present judgment, I shall decide the application filed on \nbehalf of the plaintiff under Order XXXIX Rules 1 and 2 of the Code of \nCivil Procedure, 1908 (CPC). \n2. \nSubmissions on behalf of the counsels were heard on 7th December, \n2022, 13th December, 2022 and 6th January, 2023, when judgment was \nreserved and liberty was given to both parties to file written submissions \nwithin one week.  Pursuant thereto, written submissions have been filed on \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified",
          "pdf_source": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "According to page 2 of the PDF \"13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf\", the plaintiff, KRBL Limited, is a market leader in processing, marketing, and exporting rice in India. In 2019, they acquired the trademark 'INDIA GATE' from Mr. Ram Pratap and subsequently registered it. The plaintiff has also filed trademark applications and obtained copyright registration for 'INDIA GATE' labels in India and abroad. The case, CS(COMM) 550/2022, was heard in the High Court of Delhi, with judgment reserved on January 6, 2023, and delivered on January 19, 2023. The plaintiff's legal team includes Mr. Sudarshan Kumar Bansal, Mr. Anirudh Bakhru, Mr. Nikhil Sonker, and Ms. C. Tejaswani. (Source: 13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf, page 2)",
          "content": "2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 2 of 16 \n \nbehalf of the parties. \n3. \nBriefly, the case set up by the plaintiff in the plaint is as follows: \n3.1. The plaintiff company is in the business of processing, marketing and \nexporting rice of various kinds and is a market leader in the aforesaid \nbusiness in India.  \n3.2. In 2019, the plaintiff acquired rights in the trademark ‘INDIA GATE’ \n(word per se) from one, Mr. Ram Pratap vide Deed of Assignment dated 6th \nAugust, 2019 and hence, the trademark ‘INDIA GATE’ (word per se) was \nsubsequently registered in favour of the plaintiff vide registration certificate \ndated 12th August, 2019, effective from 18th June, 1993. \n3.3. The plaintiff has filed various other trademark applications in respect \nof ‘INDIA GATE’ label/device/word marks in various classes which have \nbeen opposed. \n3.4. The plaintiff has been granted copyright registration for ‘INDIA \nGATE’ labels, \n and \n in India \nas well as abroad. The abovesaid labels/artistic works of the plaintiff bear \noriginal artistic features of placement, distinctive getup, makeup, lettering \nstyle etc.  \n3.5. The plaintiff has given sales figures in respect of export as well as \ndomestic sales of the plaintiff’s rice sold under the trademark ‘INDIA \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified",
          "pdf_source": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0007",
      "start_index": 3,
      "end_index": 5,
      "summary": "According to the PDF document \"13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf\", the High Court of Delhi at New Delhi heard a case between KRBL Limited (Plaintiff) and Vikram Roller Flour Mills Limited (Defendant). The court reserved judgment on January 6, 2023, and delivered it on January 19, 2023.\n\nThe Plaintiff, KRBL Limited, claimed that the Defendant's use of the trademark \"INDIA GATE\" for \"dalia\" infringed on their rights, as they had been using the trademark since 1993-94. The Plaintiff had previously obtained an ex parte injunction order in 2011, which was confirmed in 2011. The Defendant had also filed a suit in 2011, which was pending adjudication.\n\nThe Plaintiff argued that the Defendant's actions violated the court's order dated April 21, 2014. The Plaintiff sought a permanent injunction against the Defendant and filed an application for an interim injunction. The Defendant filed a written statement and reply to the interim application.\n\nKey dates include:\n\n* 1993-94: Plaintiff started using the trademark \"INDIA GATE\"\n* 2011: Plaintiff obtained an ex parte injunction order\n* 2011: Defendant filed a suit, which is pending adjudication\n* 2014: Court passed an order in FAO no.7/2012\n* 2022: Plaintiff discovered the Defendant's application for registration of the trademark \"INDIA GATE BRAND\" for \"dalia\"\n* January 6, 2023: Judgment reserved\n* January 19, 2023: Judgment delivered\n\nSource: 13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf (2023/DHC/000394)",
      "pdf_source": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "According to page 3 of the PDF \"13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf\", the plaintiff, KRBL Limited, has been using the trademark 'INDIA GATE' since 1993-94. The plaintiff has provided invoices showing sales under this trademark from 1995 and details of advertisement expenses from 2004-05. The trademark was declared 'well-known' under the Trade Marks Act, 1999, in 2019. The defendant, Vikram Roller Flour Mills Limited, is also using the 'INDIA GATE' trademark, leading to a lawsuit filed by KRBL Limited in 2011, resulting in an ex parte injunction order in favor of the plaintiff. The case is still pending adjudication. Key dates include June 16, 2011, October 24, 2011, and April 21, 2014. (Source: 2023/DHC/000394, CS(COMM) 550/2022)",
          "content": "2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 3 of 16 \n \nGATE’ w.e.f. 1993-94.  Plaintiff has placed on record various invoices \nshowing sales of its products under the trademark ‘INDIA GATE’ with \neffect from 18th February, 1995 \n3.6. Plaintiff has also given details in respect of advertisement and \npromotional expenses in respect of plaintiffs’ trademark ‘INDIA GATE’ \nwith effect from 2004-05.   \n3.7. On account of its impressive sales figures, it is claimed that the \nplaintiff’s trademark has become distinctive and acquired secondary \nsignificance with the goods and business of the plaintiff. \n3.8. The trademark ‘INDIA GATE’ has been declared as a ‘well-known \ntrademark’ under Section 2(1)(zg) of the Trade Marks Act, 1999 by the \nRegistrar of Trade Marks vide publication dated 19th August, 2019. \n3.9. The defendant is engaged in the business of processing, marketing \nand selling of ‘atta’, ‘suji’, ‘maida’, ‘rawa’ and ‘bran’ under the trademark \n‘INDIA GATE’, with the device of INDIA GATE. \n3.10. Plaintiff filed a suit, bearing CS no.131/2011 against the defendant \nwherein an ex parte injunction order was granted on 16th June, 2011 in \nfavour of the plaintiff and against the defendant restraining the defendant \nfrom using the trademark ‘INDIA GATE’ along with the device of INDIA \nGATE. The said injunction order was confirmed vide order dated 24th \nOctober, 2011. The said suit has been re-numbered and is pending \nadjudication. \n3.11. An appeal, bearing FAO no.7/2012 was filed by the plaintiff before \nthis Court and a common order dated 21st April, 2014 was passed by this \nCourt in the said appeal as well as appeals/revisions filed on behalf of the \ndefendant. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified",
          "pdf_source": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "According to page 4 of the PDF \"13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf\", the following legal facts are mentioned:\n\n* In July 2011, the defendant filed a suit (CS no. 1777/2011) against the plaintiff before the Delhi High Court, alleging infringement of their trademark \"INDIA GATE\" registered in class 30.\n* The said suit is pending adjudication with no interim order passed.\n* The plaintiff has filed a cancellation petition against the defendant's registered trademark \"INDIA GATE\", which is also pending.\n* The defendant has given an undertaking not to rely on the said registration against the plaintiff.\n* In May 2022, the plaintiff discovered the defendant's application for registration of a trademark in Class 30.\n\nSource: 13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf (2023/DHC/000394, CS(COMM) 550/2022)",
          "content": "2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 4 of 16 \n \n3.12. In July, 2011, the defendant filed a suit, being CS no. 1777/2011 \nagainst the plaintiff before this Court alleging infringement of their \ntrademark/ label \n/‘INDIA GATE’ registered in class 30.  The \nsaid suit was re-numbered and is pending adjudication before this Court and \nno interim order has been passed therein. \n3.13. A cancellation petition has been filed by the plaintiff against the \naforesaid registered trademark/label of the defendant, \n/ \n‘INDIA GATE’, which is pending adjudication. The defendant has given an \nundertaking that the defendant would not rely upon the said registration \nagainst the plaintiff.  \n3.14. In the first week of May, 2022, the plaintiff came to know about an \napplication filed by the defendant in Class 30 for registration of trademark \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified",
          "pdf_source": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
          "nodes": []
        },
        {
          "title": "Page 5",
          "node_id": "0006",
          "start_index": 5,
          "end_index": 5,
          "summary": "According to page 5 of the PDF \"13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf\", the plaintiff, KRBL Limited, has filed a suit against the defendant, Vikram Roller Flour Mills Limited, for using the trademark \"INDIA GATE\" in relation to \"dalia\", which is alleged to be a violation of a previous court order. The court had permitted the defendant to use the trademark only for \"atta\", \"suji\", \"maida\", \"rawa\", and \"bran\", but not for \"dalia\". The plaintiff's counsel submitted that the defendant's use of the trademark for \"dalia\" is in violation of the order dated 21st April, 2014, and the injunction granted by the Trial Court on 24th October, 2011. The suit was filed on November 21, 2022, and the defendant has filed a written statement and reply to the interim application. (Source: 13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf, page 5)",
          "content": "2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 5 of 16 \n \n(device) \n/ ‘INDIA GATE BRAND’ in relation to ‘dalia’ \nand also came to know about the defendant using the aforesaid trademark in \nrespect of ‘dalia’.   \n4. \nAccordingly, the present suit has been filed seeking, inter alia, the \nrelief of permanent injunction against the defendants. The suit was \naccompanied by the present application under Order XXXIX Rules 1 and 2 \nof the CPC seeking a grant of interim injunction.  Summons in the suit and \nnotice in the application was issued on 21st November, 2022. Pursuant \nthereto, written statement, as well as reply to the interim application, has \nbeen filed on behalf of the defendant.  \nSUBMISSIONS OF THE PLAINTIFF \n5. \nCounsel for the plaintiff has made the following submission. \n5.1 \nThe user by the defendant of the trademark ‘INDIA GATE’ in \nrelation to ‘dalia’ is in violation of the order dated 21st April, 2014 passed by \nthis court in FAO no.7/2012. The defendant was permitted to use the \ntrademark ‘INDIA GATE’ in respect of only ‘atta’, ‘suji’, ‘maida’, ‘rawa’ \nand ‘bran’, but not ‘dalia’. It is further submitted that the injunction granted \nagainst the defendant by the Trial Court vide order dated 24th October, 2011 \nin relation to goods other than ‘atta’, ‘suji’, ‘maida’, ‘rawa’ and ‘bran’ was \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified",
          "pdf_source": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0017",
      "start_index": 6,
      "end_index": 14,
      "summary": "The legal document section from the PDF \"13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf\" discusses a trademark infringement case between KRBL Limited (the plaintiff) and Vikram Roller Flour Mills Limited (the defendant). The case, CS(COMM) 550/2022, was heard in the High Court of Delhi at New Delhi.\n\nThe plaintiff claims that the defendant's use of the \"INDIA GATE\" trademark for \"dalia\" (a type of wheat product) infringes on their registered and well-known trademark. The defendant argues that they have been using the \"INDIA GATE\" trademark for wheat products, including \"dalia\", since 2015, and have an inherent right to expand their product range.\n\nThe court considered a consent order dated April 21, 2014, which allowed both parties to expand their business to other products. The defendant claims to have been using the \"INDIA GATE\" trademark for wheat products, including \"atta\", \"suji\", \"maida\", \"rawa\", and \"bran\", since 1975.\n\nThe court analyzed the submissions from both parties, considering the order dated April 21, 2014, and the defendant's prior use of the \"INDIA GATE\" trademark. The judgment was reserved on January 6, 2023, and delivered on January 19, 2023. The PDF source provides further details on the case, including the court's findings and decisions. (Source: 13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf, 2023/DHC/000394)",
      "pdf_source": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
      "nodes": [
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "According to page 6 of the PDF \"13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf\", the plaintiff's trademark 'INDIA GATE' continues to operate. The defendant's invoices show use prior to the plaintiff's invoice, but not under the 'INDIA GATE' trademark. The defendant's trademark registration for 'dalia' is pending, and their usage constitutes infringement of the plaintiff's registered trademark. The defendant's logo is similar to the plaintiff's, constituting copyright infringement. The defendant is also guilty of passing off their goods as the plaintiff's. The defendant failed to prove 'continuous user' under Section 34 of the Trade Marks Act, 1999. The case involves submissions from both the plaintiff and defendant, with the defendant arguing that the consent order only relates to 'rice'. (Source: 13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf, 2023/DHC/000394, CS(COMM) 550/2022)",
          "content": "2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 6 of 16 \n \nnot set aside and therefore, continues to operate.  \n5.2 \nThe invoices placed on record by the defendant showing user prior to \nthe date of invoice of the plaintiff do not show that the defendant was selling \nits goods under the trademark ‘INDIA GATE’. \n5.3 \nThe trademark registration application of the defendant in respect of \n‘dalia’ is still pending. Therefore, the aforesaid usage constitutes \ninfringement of the registered and ‘well-known trademark’ of the plaintiff, \n‘INDIA GATE’.  \n5.4 \nThe impugned logo on the defendant’s packaging is similar to the \nlogo on the plaintiff’s packaging and therefore, constitutes infringement of \nthe copyright of the plaintiff. \n5.5 \nThe defendant is also guilty of passing off its goods as those of the \nplaintiff. \n5.6 \nDefendant has failed to make out a case of ‘continuous user’ in terms \nof Section 34 of the Trade Marks Act, 1999. Reliance in this regard has been \nplaced on Pioneer Nuts and Bolts Pvt. Ltd. v. Goodwill Enterprises, 2009 \nSCC OnLine Del 2851, PEPS Industries (P) Ltd. v. Kurlon Ltd., 2022 SCC \nOnLine Del 3275, Dabur India Ltd. v. Real Drinks Pvt. Ltd., 2014 SCC \nOnLine Del 23 and S. Narendra Kumar & Co. v. Everest Beverages and \nFoods Inudstries, 2008 SCC OnLine Del 1759. \nSUBMISSIONS OF THE DEFENDANT \n6. \nPer contra, the case of the defendant in the written statement and as \nper the submissions made by the counsel for the defendant can be \nsummarized as under: \n6.1 \nThe consent order dated 21st April, 2014 is only in relation to ‘rice’ \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified",
          "pdf_source": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
          "nodes": []
        },
        {
          "title": "Page 7",
          "node_id": "0009",
          "start_index": 7,
          "end_index": 7,
          "summary": "According to page 7 of the PDF \"13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf\", the defendant has been using the trademark 'INDIA GATE' for wheat products like 'atta', 'suji', 'maida', 'rawa', and 'bran' since 1975. The defendant expanded its product range to 'dalia' in 2015. The plaintiff, KRBL LIMITED, was aware of this expansion. The plaintiff has also filed trademark registration applications for 'INDIA GATE' for other goods like 'rice flour' and 'quinoa'. The defendant's counsel submitted evidence of bills, invoices, and advertisements showing the use of 'INDIA GATE' since 1990. The court analyzed the rival submissions and considered the defendant's prior use of the trademark. (Source: 13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf, 2023/DHC/000394, CS(COMM) 550/2022)",
          "content": "2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 7 of 16 \n \n(plaintiff’s product) and ‘atta’, ‘suji’, ‘maida’, ‘rawa’ and ‘bran’ \n(defendant’s products) and not in relation to any other goods. Therefore, it \nwas open for both the sides to expand their business to other products.  \n6.2 \nThe defendant is the prior user of the trademark ‘INDIA GATE’ in \nrespect of ‘atta’, ‘suji’, ‘maida’, ‘rawa’ and ‘bran’, which are all wheat \nproducts, since 1975. The defendant has an inherent right to expand its range \nof products and hence, use the aforesaid trademark in respect of ‘dalia’, \nwhich is an allied/cognate product to the earlier products of the defendant. \nThe defendant has been using the trademark ‘INDIA GATE’ in respect of \n‘dalia’ since 2015, which the plaintiff was fully aware of. \n6.3 \nThe plaintiff itself has filed various registration applications for the \ntrademark ‘INDIA GATE’ in respect of ‘rice flour’, ‘idli rava’, ‘rice atta’ \nand in respect of goods other than ‘rice’, such as ‘quinoa’, ‘flax seeds’ and \n‘millets’.  \n6.4 \nAs regards the trademark of the plaintiff being a ‘well-known \ntrademark’, it is not based on any proper determination by the Court.  \n6.5    Registration in respect of the plaintiff is defective as the trademark \napplication was wrongly advertised as a word mark instead of a device mark \nas initially applied for. \n6.6 \nCounsel for the defendant has drawn the attention of the Court to \ncopies of bills/invoices as well as advertisements in trade directories \nshowing user of the trademark ‘INDIA GATE’ by the defendant since 1990.  \nANALYSIS & FINDINGS \n7. \nI have heard the rival submissions. \n8. \nBoth sides have placed extensive reliance on the order dated 21st \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified",
          "pdf_source": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
          "nodes": []
        },
        {
          "title": "Page 8",
          "node_id": "0010",
          "start_index": 8,
          "end_index": 8,
          "summary": "According to page 8 of the PDF \"13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf\", a consent order was passed by the Court in FAO no.7/2012 in April 2014. The order stated that KRBL Ltd. can use the trademark \"INDIA GATE\" for rice, while Vikram Roller Flour Mills Limited can use it for Aata, Suji, Maida, Rawa, and Bran in packages of 20 kilograms and above. The order is interim in nature and will bind the parties until the disposal of the suit. The court noted that the trademark registration aspect will be decided in separate legal proceedings. The PDF source provides details of the court proceedings, including the case number CS(COMM) 550/2022, and the judgment reserved and delivered dates of January 6, 2023, and January 19, 2023, respectively.",
          "content": "2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 8 of 16 \n \nApril, 2014 passed by this Court in FAO no.7/2012 and have sought to place \ntheir own interpretation of the same. Therefore, it is deemed expedient to \nextract the relevant portions of the said order: \n“1. \nCounsels for the parties, and who are veterans in IPR law, \nafter some initial arguments, have agreed to dispose of these \nappeals with the following consent order:- \n \n(i) \nThe appellant in FAO 7/12 i.e. KRBL Ltd., and who is the \nplaintiff in the trial court, will use the trademark ‘INDIA GATE’ \nwith respect to rice but not with respect to Aata, Suji, Maida, \nRawa \nand \nBran \nbeing \npresently \nused \nby \nthe \nrespondents/defendants, and all of which later products will be \nsold \nin \npackages \nof \n20 \nkilograms \nand \nabove \nby \nthe  respondents/defendants. Any claim or entitlement of the \nrespective  parties to use the trademark ‘INDIA GATE’ for any \nother products except  as stated in this order, is not the subject \nmatter of the present consent  order. The trademark ‘INDIA \nGATE’ will be used with respect to product  rice in packages of \nany size whatsoever by the appellant/plaintiff. \n \n(ii)  \nThe respondents in FAO 7/2012, and who are defendants \nin the suits, without in any manner comment being made upon \ntheir inter se disputes, will, so far as the appellant-plaintiff is \nconcerned, be entitled to use the  trademark ‘INDIA GATE for \ntheir products being Aata, Maida, Rawa, Suzi and Bran, for \nwhich a registration under the Trades Mark Act, 1999 exists in \ntheir favour. Of course, observations with respect to registration \nis not being made in a final manner for or against any of the \nparties to the  appeal, and which aspect will be decided in \nappropriate legal proceedings. \n \nxxx \n \n \n \n \nxxx \n \n \n \n xxx \n \n3. \nThis consent order will bind the parties with respect to \nuse  of the trade mark „INDIA GATE‟, is in the nature of interim \norder till  the disposal of the suit not only in the present \nsuit/litigation, but  also for the interim stages in the other \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified",
          "pdf_source": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
          "nodes": []
        },
        {
          "title": "Page 9",
          "node_id": "0011",
          "start_index": 9,
          "end_index": 9,
          "summary": "According to page 9 of the PDF \"13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf\" (2023/DHC/000394, CS(COMM) 550/2022), the court order clarified the use of the trademark \"INDIA GATE\" by the parties. The key points are:\n\n* The plaintiff (KRBL LIMITED) was restrained from using \"INDIA GATE\" for products like 'atta', 'suji', 'maida', 'rawa', and 'bran'.\n* The defendant (VIKRAM ROLLER FLOUR MILLS LIMITED) could not use \"INDIA GATE\" for 'rice'.\n* The plaintiff could use \"INDIA GATE\" for 'rice' in any package size.\n* The defendant could sell the restricted products in packages of 20 kg and above.\n* This arrangement would continue until the final disposal of the suit.\n\nThe order was passed on an unspecified date, with judgment reserved on January 6, 2023, and delivered on January 19, 2023. (Source: PDF \"13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf\")",
          "content": "2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 9 of 16 \n \nlitigations \nwhich \nare \nsaid \nto \nbe \npending \ninter \nse \nrespondents/defendants on the one hand and the appellant-\n  plaintiff on the other hand. \n \n \nxxx \n \n \n \n \nxxx \n \n \n \n xxx \n \n5. \nIt is again clarified that the observations in this appeal  and \norder are with respect to use in the interim stages during \nthe  pendency of the suit for the trademark „INDIA GATE‟, and \nwith respect to  the products which is stated above in the present \norder. \n...” \n \n9. \nThe position that emerges from a reading of the aforesaid order can be \nsummarized as under: \n9.1 \nThis was a consent order passed by the Court. \n9.2 \nThe plaintiff was restrained from using the trademark ‘INDIA GATE’ \nin respect of the following products viz, ‘atta’, ‘suji’, ‘maida’, ‘rawa’ and \n‘bran’, that were being used at that point of time by the defendant. \n9.3 \nThe defendant could not use the trademark ‘INDIA GATE’ in respect \nof ‘rice’. \n9.4 \nPlaintiff was permitted to use the trademark ‘INDIA GATE’ in \nrespect of ‘rice’ in packages of any size. The defendant could sell ‘atta’, \n‘suji’, ‘maida’, ‘rawa’ and ‘bran’ in packages of 20 kg and above. \n9.5 \nThe entitlement of parties to use the trademark ‘INDIA GATE’ \nfor any other products other than the aforenoted products, was not \ncovered by the said order. \n9.6 \nThis arrangement was to continue till the final disposal of the suit.  \n10. \nA reading of the aforesaid order makes it clear that there was no bar \neither on the plaintiff or on the defendant to use the trademark ‘INDIA \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified",
          "pdf_source": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
          "nodes": []
        },
        {
          "title": "Page 10",
          "node_id": "0012",
          "start_index": 10,
          "end_index": 10,
          "summary": "According to page 10 of the PDF \"13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf\", the court discusses the consent order dated 21st April, 2014, which was passed by the Appellate Court. The plaintiff's counsel submits that the order did not set aside the restraint order passed by the Trial Court on 24th October, 2011, which restrained the defendant from using the trademark 'INDIA GATE' for products other than 'atta', 'suji', 'maida', 'rawa', and 'bran'. However, the court disagrees, stating that the comprehensive consent order supersedes the Trial Court's order. The plaintiff then filed various trademark registration applications in Class 30 for products like 'rice flour' and 'quinoa'. The court's decision was reserved on 6th January, 2023, and delivered on 19th January, 2023. (Source: 13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf, page 10)",
          "content": "2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 10 of 16 \n \nGATE’ in respect of products other than those that were the subject matter \nof the said suit i.e., ‘atta’, ‘suji’, ‘maida’, ‘rawa’, ‘bran’ and ‘rice’.   \n11. \nCounsel for the plaintiff submits that since the aforesaid order did not \nset aside the order passed by the Trial Court on 24th October, 2011, \nrestraining the defendant from use of the trademark ‘INDIA GATE’ along \nwith the label or device of INDIA GATE in respect of products other than \nthe products that were registered by the defendant. The said restraint order \nwould continue to operate even after passing of the aforesaid consent order. \n12. \nI do not agree with the aforesaid submission of the plaintiff.  The \nobservations made in paragraph 14 of the order dated 24th October, 2011, \nwhich was the subject matter of appeal in FAO no. 7/2012, restraining the \ndefendants from using the trademark ‘INDIA GATE’ along with the label or \ndevice of INDIA GATE in respect of any product other than ‘atta’, ‘suji’, \n‘maida’, ‘rawa’ and ‘bran’, would not operate after the consent order dated \n21st April, 2014 was passed by this Court. Once a comprehensive consent \norder has been passed by the Appellate Court clearly defining the inter se \narrangement between the plaintiff and the defendant during the pendency of \nthe suit, no reliance can be placed on the order of the Trial Court, which is \ndeemed to have merged with the order passed by the Appellate Court. \nTherefore, there is no merit in the submission that the consent order did not \nspecifically set aside the order of the Trial Court and only partially modified \nthe said order.   \n13. \nAfter passing of the aforesaid consent order, the plaintiff filed various \ntrademark registration applications in Class 30 in respect of ‘rice flour’, ‘idli \nrava’, ‘rice atta’ and goods other than ‘rice’, such as ‘quinoa’, ‘flaxseeds’, \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified",
          "pdf_source": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
          "nodes": []
        },
        {
          "title": "Page 11",
          "node_id": "0013",
          "start_index": 11,
          "end_index": 11,
          "summary": "According to page 11 of the PDF \"13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf\", the court notes that the plaintiff, KRBL Limited, has not registered the trademark \"INDIA GATE\" for \"dalia\" products. The defendant, Vikram Roller Flour Mills Limited, is entitled to expand its business into allied products, including \"dalia\", using the trademark \"INDIA GATE\". The court cites a previous judgment, Somany Ceramics Ltd. v. Shri Ganesh Electric Co., 2022 SCC OnLine Del 3270, which supports the idea that a trademark proprietor can expand their business into similar or cognate goods. The court reserves judgment on January 6, 2023, and delivers it on January 19, 2023. (Source: 2023/DHC/000394, CS(COMM) 550/2022)",
          "content": "2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 11 of 16 \n \n‘millets’, etc. However, no trademark registration application has been filed \nby the plaintiff for ‘dalia’. \n14. \nSurely, if the plaintiff has a right to expand the usage of its trademark \n‘INDIA GATE’ in respect of other ‘rice’ products and products beyond \n‘rice’, the defendant cannot be denied the same right to expand its business \ninto other allied/cognate products. The present case relates to ‘dalia’, which \nwould fall in the category of wheat products. Pertinently, the defendant is \nnot using the trademark ‘INDIA GATE’ in respect of ‘rice’ or ‘rice’ \nproducts. I do not read any restriction in the consent order either on the \nplaintiff or the defendant from expanding their business into other products. \nTherefore, in my considered view, the defendant was entitled to expand its \nproduct range into similar or cognate or allied goods and use the trademark \n‘INDIA GATE’ in respect of such goods, including ‘dalia’. In this regard \ncounsel for defendant has correctly placed reliance on the judgment of a Co-\nordinate Bench of this Court in Somany Ceramics Ltd. v. Shri Ganesh \nElectric Co., 2022 SCC OnLine Del 3270. The relevant paragraph is set out \nbelow: \n“61. \nPertinent it is to mention, at this stage, that while the \nPlaintiff started its business in ceramics tiles, it subsequently \nexpanded into sanitaryware and bath fittings and obtained \nregistrations in Class 11 on 05.01.2007. Later, Plaintiff also \nexpanded its business into selling water heaters/geysers and \nobtained registration on 31.07.2018. This fact is important in the \ncontext of the judgment of the Supreme Court in Laxmikant \n(supra), where it was held that Courts have to be mindful of \nfuture expansion of the business of a proprietor of a trademark. \nPlaintiff is right in its contention that merely because a \ntrademark registration is applied for in a particular class, the \nproprietor is forever bound to sell only those goods. Law \nrecognises the expansion of business into similar or cognate or \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified",
          "pdf_source": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
          "nodes": []
        },
        {
          "title": "Page 12",
          "node_id": "0014",
          "start_index": 12,
          "end_index": 12,
          "summary": "According to page 12 of the PDF \"13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf\", the defendant has provided invoices and advertisements showing the use of the 'INDIA GATE' trademark from 1990, prior to the plaintiff's registration. The invoices, from pages 44 to 189 of the defendant's documents, feature the 'INDIA GATE' device mark, while advertisements from pages 325 to 339 show continuous use from May 1990. The defendant was granted registration for the device mark 'INDIA GATE' on November 3, 1993. The plaintiff's earliest invoice showing use of the trademark is from February 18, 1995. The court considers this sufficient material to show prior use by the defendant. (Source: 13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf, page 12)",
          "content": "2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 12 of 16 \n \nallied goods and this factor is relevant for determination of a \nclaim for passing off.” \n \n15. \nIt has been vehemently contended on behalf of the plaintiff that the \ndefendant has failed to file invoices showing that the products of the \ndefendant were sold under the trademark ‘INDIA GATE’. Therefore, the \ndefendant cannot claim user  prior to the registration of the plaintiff. In this \nregard, reference may be made to the invoices placed on record by the \ndefendant beginning from 8th May, 1990 (pages no. 44 to 189 of the \ndefendant’s documents) which show the use of the ‘INDIA GATE’ device \nmark and the word mark. While it is correct that some of the invoices for the \nearlier period do not show that the goods were being sold under the \ntrademark ‘INDIA GATE’, in all the aforesaid invoices the device of INDIA \nGATE prominently features at the top left corner of the invoices. Defendant \nhas also placed on record the advertisements made by the defendant in \nvarious trade directories with effect from May, 1990 (pages no. 325 to 339 \nof the defendant’s documents) to show that the defendant was continuously \nusing the trademark ‘INDIA GATE’ in respect of their wheat products. \n16. \nFor a prima facie consideration, the defendant has placed sufficient \nmaterial on record showing user of the ‘INDIA GATE’ device mark from \n1990, which is prior to the registration of the plaintiff. To be noted, the \nregistration granted in favour of the plaintiff was only in respect of ‘rice’. \nThe earliest invoice filed on behalf of the plaintiff showing user of the \ntrademark ‘INDIA GATE’ is of 18th February, 1995.  \n17. \nIt has also to be borne in mind that the defendant was granted \nregistration in respect of the device mark ‘INDIA GATE’ with effect from \n3rd November, 1993. In this regard reference may be made to the judgment \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified",
          "pdf_source": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
          "nodes": []
        },
        {
          "title": "Page 13",
          "node_id": "0015",
          "start_index": 13,
          "end_index": 13,
          "summary": "According to page 13 of the PDF \"KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf\" (2023/DHC/000394), the court refers to previous judgments, including Gujarat Bottling Co. Ltd. v. Coca Cola Co. (1995) and Aditya Birla Nuvo Limited v. R.S. Sales Corporation (2018), which state that a registered mark is protected regardless of use. The defendant's undertaking in a previous suit does not apply to the present case. The plaintiff's reliance on judgments such as Pioneer Nuts and Bolts Pvt. Ltd. v. Goodwill Enterprises (2009) and Dabur India Ltd. v. Real Drinks Pvt. Ltd. (2014) is dismissed due to the absence of trademark registration in favor of the defendant in those cases. The plaintiff's trademark, 'INDIA GATE', was declared a 'well-known trademark' by the Deputy Registrar of Trade Marks in 2019, based on a 2016 order by the Additional District Judge, Patiala House Courts. (Source: KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf, page 13)",
          "content": "2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 13 of 16 \n \nin Gujarat Bottling Co. Ltd. v. Coca Cola Co., (1995) 5 SCC 545 followed \nby a Co-ordinate Bench of this Court in Aditya Birla Nuvo Limited v. R.S. \nSales Corporation, 2018 SCC OnLine Del 9794, wherein it has been held \nthat a mark which is registered is protected, irrespective of the fact whether \nthe party uses the registered mark or not.  \n18. \nThe undertaking given on behalf of the defendant in the rectification \npetition filed by the plaintiff was only in respect of the earlier suit that was \npending before the Patiala House Courts, New Delhi. The said undertaking \ncannot be applied to the present suit.  \n19. \nReliance placed on behalf of the plaintiff on the judgments in Pioneer \nNuts and Bolts Pvt. Ltd. v. Goodwill Enterprises, 2009 SCC OnLine Del \n2851, PEPS Industries (P) Ltd. v. Kurlon Ltd., 2022 SCC OnLine Del \n3275, Dabur India Ltd. v. Real Drinks Pvt. Ltd., 2014 SCC OnLine Del 23 \nand S. Narendra Kumar & Co. v. Everest Beverages and Foods Inudstries, \n2008 SCC OnLine Del 1759, would not come to the assistance of the \nplaintiff as in all the aforesaid cases, unlike the present case, there was no \nregistration of the trademark in favour of the defendant. \n20. \nMuch emphasis has been laid on behalf of the plaintiff on the aspect \nthat the trademark of the plaintiff is a ‘well-known trademark’ in terms of \nSection 2(1)(zg) of the Trade Marks Act, 1999. In this regard, reliance has \nbeen placed on the order dated 31st July, 2019 passed by the Deputy \nRegistrar of Trade Marks, declaring the trademark of the plaintiff, ‘INDIA \nGATE’ as a ‘well-known trademark’. However, a perusal of the aforesaid \norder shows that the aforesaid determination was made by the Deputy \nRegistrar based on an order dated 10th May, 2016 passed by the Additional \nDistrict Judge, Patiala House Courts, New Delhi in ex parte proceedings.  It \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified",
          "pdf_source": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
          "nodes": []
        },
        {
          "title": "Page 14",
          "node_id": "0016",
          "start_index": 14,
          "end_index": 14,
          "summary": "According to page 14 of the PDF \"13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf\", the court noted that the plaintiff, KRBL Limited, did not seek any prayer or frame an issue regarding its trademark being a 'well-known trademark'. The defendant, Vikram Roller Flour Mills Limited, has prior user and registration of the trademark. The court referenced Section 28(3) of the Trade Marks Act, 1999, which grants both parties the exclusive right to use identical or similar trademarks. The defendant applied for registration of the 'INDIA GATE' device mark on October 5, 2021, and provided invoices showing sales under the trademark since 2015, prior to the filing of the suit. The court also found no case for copyright infringement, as the plaintiff's copyright registration in 1999 was after the defendant's use of the artistic device. (Source: 13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf, 2023/DHC/000394, CS(COMM) 550/2022)",
          "content": "2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 14 of 16 \n \nis pertinent to note that neither any prayer was sought nor any issue was \nframed with regard to the trademark of the plaintiff being a ‘well-known \ntrademark’. The plaintiff cannot take advantage of the aforesaid \ndetermination of its trademark being a ‘well-known trademark’ so as to \nprevent the defendant from using the said trademark in respect of which the \ndefendant has prior user and registration. In terms of Section 28(3) of the \nTrade Marks Act, 1999, where two persons are registered proprietors of \nidentical or similar trademarks both shall have the exclusive right to use the \nsaid trademarks. \n21. \nIt is significant to note that the defendant applied for the registration \nof the device mark ‘INDIA GATE’ in respect of ‘dalia’ on 5th October, 2021 \nclaiming user since 1st April, 2015. The defendant has also placed on record \ninvoices from 8th October, 2015 (pages no.291-322 of the defendant’s \ndocuments) showing sale of ‘dalia’ under the trademark ‘INDIA GATE \nBRAND’, which is much prior to filing of the present suit.  \n22. \nAs regards the infringement of the plaintiff’s registered copyright by \nthe defendant, it is to be noted that the earliest copyright registration in \nfavour of the plaintiff is in 1999, which is much after the user of the artistic \ndevice of \n by the defendant. The pictorial depiction of INDIA \nGATE is substantially different in the label of the plaintiff and the label of \nthe defendant. Therefore, no case for copyright infringement is made out.  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified",
          "pdf_source": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0020",
      "start_index": 15,
      "end_index": 16,
      "summary": "According to the PDF document \"13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf\", the High Court of Delhi at New Delhi delivered a judgment on January 19, 2023, in the case CS(COMM) 550/2022. The plaintiff, KRBL Limited, had filed a suit against the defendant, Vikram Roller Flour Mills Limited, alleging passing off. \n\nThe court compared the trademarks \"INDIA GATE\" of both parties and found significant differences in the packaging, making it unlikely to cause confusion or deception among the public. The court cited the judgment in Laxmi Agro Impex India v. Ladli India Commodities (2019 SCC OnLine Del 11147) to support its decision.\n\nThe court concluded that the plaintiff failed to establish a prima facie case for an interim injunction. The balance of convenience also favored the defendant, as their product \"dalia\" had been selling in the market with the impugned trademark since 2015. \n\nTherefore, the court dismissed the application under Order XXXIX Rules 1 and 2 of the CPC, stating that there was no merit in the present application. The judgment was delivered by Judge Amit Bansal on January 19, 2023. The PDF source provides detailed information about the case, including the court proceedings, arguments, and decisions.",
      "pdf_source": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
      "nodes": [
        {
          "title": "Page 15",
          "node_id": "0018",
          "start_index": 15,
          "end_index": 15,
          "summary": "According to page 15 of the PDF \"13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf\", the court discusses the allegations of passing off. A comparison of the trademark 'INDIA GATE' of the plaintiff (KRBL Limited) and the defendant (Vikram Roller Flour Mills Limited) is made, showing material differences in packaging. The court notes that despite similarities in the words 'INDIA GATE' and pictorial representation, the overall getup of the packaging is substantially different, reducing the possibility of public confusion or deception.\n\nThe court references a judgment from a Co-ordinate Bench (Laxmi Agro Impex India v. Ladli India Commodities, 2019 SCC OnLine Del 11147) that rival marks must be compared as a whole, considering an unwary purchaser of average intelligence and imperfect recollection. The case (CS(COMM) 550/2022) was judged with a reserved judgment on January 6, 2023, and delivered on January 19, 2023. (Source: 13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf, page 15)",
          "content": "2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 15 of 16 \n \n23. \nAs regards the allegations of passing off, in paragraph 36 of the plaint \nat page no.52, a comparison of the trademark ‘INDIA GATE’ of the plaintiff \nand the defendant has been made, which is set out below: \n \n24. \n The aforesaid comparison shows that there is a material difference \nbetween the packaging of the plaintiff and the defendant. Even though the \nwords ‘INDIA GATE’ and the pictorial representation of INDIA GATE \noccur in both the packaging of the plaintiff and the defendant, the getup of \nthe packaging is substantially different, so there can be no possibility of \nconfusion or deception to the public. Reference in this regard may be made \nto the judgment of a Co-ordinate Bench of this Court in Laxmi Agro Impex \nIndia v. Ladli India Commodities, 2019 SCC OnLine Del 11147, wherein it \nhas been held that the rival marks have to be compared as a whole, keeping \nin mind an unwary purchaser of average intelligence and imperfect \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified",
          "pdf_source": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
          "nodes": []
        },
        {
          "title": "Page 16",
          "node_id": "0019",
          "start_index": 16,
          "end_index": 16,
          "summary": "According to page 16 of the PDF \"13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf\", the court ruled in favor of the defendant. The plaintiff, KRBL Limited, failed to establish a prima facie case for an interim injunction. The balance of convenience was also in favor of the defendant, as their product \"dalia\" had been sold in the market with the impugned trademark since 2015. The court dismissed the application under Order XXXIX Rules 1 and 2 of the CPC, citing no merit in the case. The judgment was delivered by Amit Bansal, J. on January 19, 2023. The court referenced the judgment in Laxmi Agro, which was upheld by a Division Bench of the court in 2019 and later confirmed by the dismissal of SLP (C) no.8282/2020 on October 16, 2020. (Source: 13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf, page 16)",
          "content": "2023/DHC/000394 \n \nCS(COMM) 550/2022                                                                                                                Page 16 of 16 \n \nrecollection. The judgment in  Laxmi Agro (supra) was upheld by a Division \nBench of this Court in Laxmi Agro Impex India v. Ladli India \nCommodities, 2019 SCC OnLine Del 11717 and SLP (C) no.8282/2020 \npreferred thereagainst was dismissed on 16th October, 2020.  \n25. \nIn view of the discussion above, the plaintiff has failed to establish a \nprima facie case in its favour for the grant of interim injunction. Balance of \nconvenience is also in favour of the defendant for not granting interim \ninjunction at this stage, as the product ‘dalia’ of the defendant has been \nselling in the market with the impugned trademark since 2015.  There is no \nmerit in the present application under Order XXXIX Rules 1 and 2 of the \nCPC.  \n26. \nDismissed.  \n \nAMIT BANSAL, J. \nJANUARY 19, 2023 \ndk \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:19.01.2023 12:43:47\nSignature Not Verified",
          "pdf_source": "13. KRBL LIMITED VS. VIKRAM ROLLER FLOUR MILLS LIMITED.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-15T18:33:21.080572",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}