{
  "doc_name": "14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN",
  "pdf_source": "14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf",
  "metadata": {
    "document_name": "14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN",
    "source_pdf": "14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf",
    "judges": [
      "AMIT BANSAL"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "34/2022",
      "34/2022",
      "34/2022",
      "34/2022",
      "34/2022",
      "34/2022",
      "34/2022",
      "34/2022",
      "813/2022"
    ],
    "dhc_numbers": [
      "2023/DHC/000970",
      "2023/DHC/000970",
      "2023/DHC/000970",
      "2023/DHC/000970",
      "2023/DHC/000970",
      "2023/DHC/000970"
    ],
    "ia_numbers": [],
    "decision_date": "7 February, 2023",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      "SNS PRODUCTS PRIVATE LIMITED"
    ],
    "defendants": [
      "IJAZ UDDIN"
    ],
    "appellants": [],
    "respondents": [],
    "plaintiff_advocates": [
      "Mr. Tejveer Singh Bhatia",
      "Mr. Kunal Vats",
      "Ms. Tanya Arora"
    ],
    "defendant_advocates": [
      "Mr. Shashank Khurana"
    ],
    "appellant_advocates": [],
    "respondent_advocates": [],
    "damages_claimed": null,
    "damages_awarded": null,
    "key_issues": [
      "The plaintiffs are seeking relief of permanent injunction restraining the defendant from infringing their trademark and passing off goods as their own.",
      "The defendant has entered a belated written statement, seeking condonation of delay under Order VIII Rule 1 of the Code of Civil Procedure, 1908.",
      "The court must determine whether the replication filed by the plaintiff is within the permissible time limit under Chapter VII Rule 5 of the Delhi High Court (Original Side) Rules, 2018.",
      "The calculation of the time period for filing the replication is disputed, with the defendant arguing it should be counted from the date the written statement was supplied, and the plaintiff arguing it should be counted from the date the written statement was permitted to be taken on record.",
      "The applicability of judgments in Ram Sarup Lugani v. Nirmal Lugani and Atlanta Limited v. National Highways & Infrastructure Development Corporation Limited to the present case is in question.",
      "The court must consider the provisions of Order VIII Rule 1 of the Code of Civil Procedure, 1908, regarding the filing of a written statement and the condonation of delay.",
      "The plaintiff's trademark rights and the alleged infringement by the defendant are central to the case, with the plaintiff seeking to protect their intellectual property.",
      "The role of the Local Commissioner in seizing and inventoring infringing goods is also relevant to the case, as is the ex parte ad interim injunction granted against the defendant.",
      "The interpretation of Chapter VII Rule 5 of the Delhi High Court (OS) Rules, 2018, and its application to the filing of the replication, is a key issue in the case."
    ],
    "decision_summary": "**Case Summary: SNS Products Private Limited vs. Ijaz Uddin**\n\n**Background:**\nThe plaintiff, SNS Products Private Limited, filed a suit against the defendant, Ijaz Uddin, seeking relief of permanent injunction, restraining the defendant from infringing the plaintiff's trademark, passing off his goods as that of the plaintiff, damages, and other ancillary reliefs. The plaintiff alleged that the defendant was using the impugned mark 'SHAN E DELHI', 'SHAN-A-DELHI' or any other mark identical or deceptively similar to the plaintiff's trademark 'SHAN-E-DELHI'.\n\n**Procedural History:**\nThe court granted an ex parte ad interim injunction against the defendant on January 17, 2022, restraining him from using the impugned mark. A Local Commissioner was appointed to seize and inventorize the infringing goods. The defendant entered appearance on April 26, 2022, and filed a written statement, which was belatedly filed with an application seeking condonation of delay of 27 days. The application was allowed by the Joint Registrar on July 11, 2022. The plaintiff filed a replication on July 23, 2022.\n\n**Legal Issues:**\nThe defendant contended that the replication could not be taken on record as it was filed beyond the maximum permissible period of 45 days from the date when the written statement was supplied to the plaintiff. The defendant relied on Chapter VII Rule 5 of the Delhi High Court (Original Side) Rules, 2018, and two judgments: Ram Sarup Lugani v. Nirmal Lugani (2020) and Atlanta Limited v. National Highways & Infrastructure Development Corporation Limited (2019).\n\n**Arguments:**\nThe plaintiff argued that the copy of the written statement was supplied to him only on May 17, 2022, and the time for counting the period for filing replication could only be counted from the date when the written statement was permitted to be taken on record, which was July 11, 2022. The plaintiff submitted that the judgments relied upon by the defendant were not applicable to the facts and circumstances of the case.\n\n**Court Findings:**\nThe court found that the issue before the Division Bench in Ram Sarup Lugani (supra) was not regarding the date from which the period of 45 days for filing the replication would begin, but rather whether delay in filing the replication could be condoned beyond the period of 45 days in terms of Rule 5 of Chapter VII of the Delhi High Court (OS) Rules. Therefore, the observations of the Division Bench would not be of any assistance to the defendant.\n\n**Decision:**\nThe court did not agree with the submission of the defendant that in all cases, the period for filing replication would commence from the date when the written statement was supplied to the plaintiff. The court's decision on the admissibility of the replication and the subsequent proceedings in the case are not explicitly stated in the provided text, as the decision page is not included. However, based on the court's findings, it appears that the court is inclined to allow the replication to be taken on record, as the defendant's contention regarding the timing of the replication is not supported by the applicable rules and judgments.",
    "legal_precedents": [
      "Ram Sarup Lugani Nirmal Lugani",
      "Atlanta Limited National Highways"
    ],
    "full_text": "\n--- PAGE 1 ---\n2023/DHC/000970\nCS(COMM) 34/2022\nPage 1 of 6\n$~10\n*\nIN THE HIGH COURT OF DELHI AT NEW DELHI\n%\nDate of decision : 7th February, 2023\n+\nCS(COMM) 34/2022\nSNS PRODUCTS PRIVATE\nLIMITED\n..... Plaintiff\nThrough:\nMr.Tejveer Singh Bhatia, Mr. Kunal\nVats and Ms. Tanya Arora,\nAdvocates.\nversus\nIJAZ UDDIN\n..... Defendant\nThrough:\nMr. Shashank Khurana, Advocate\nCORAM:\nHON'BLE MR. JUSTICE AMIT BANSAL\nAMIT BANSAL, J. (Oral)\nCS(COMM) 34/2022\n1.\nThe present suit has been filed seeking relief of permanent injunction\nrestraining the defendant from infringing the trademark of the plaintiff,\npassing off his goods as that of the plaintiff, damages and other ancillary\nreliefs.\n2.\nSummons in the suit were issued on 17th January, 2022, when this\nCourt granted ex parte ad interim injunction against the defendant\nrestraining him from using the impugned mark ‘SHAN E DELHI’, ‘SHAN-\nA-DELHI’ or any other mark identical or deceptively similar to the\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 16:52:41\nSignature Not Verified\n\n--- PAGE 2 ---\n2023/DHC/000970\nCS(COMM) 34/2022\nPage 2 of 6\nplaintiff’s trademark, ‘SHAN-E-DELHI’ /\n. A\nLocal Commissioner was also appointed by this Court to seize and\ninventorize the infringing goods. Vide order dated 2nd February, 2022 one\nmore Local Commissioner was appointed to visit another premises of the\ndefendant.\n3.\nThe counsel appearing on behalf of the defendant entered appearance\non 26th April, 2022 and the Court directed for the written statement along\nwith an affidavit of admission/denial of documents to be filed within the\nperiod permissible in law. The replication was directed to be filed within\nfifteen days of the receipt of the written statement.\n4.\nThe written statement was filed on behalf of the defendant on 26th\nApril, 2022 and copy of the same was supplied to the counsel for the\nplaintiff on the same date. The written statement was filed belatedly and\ntherefore, it was accompanied by an application under Order VIII Rule 1 of\nthe Code of Civil Procedure, 1908 (CPC) seeking condonation of delay of\n27 days in filing the written statement.\n5.\nThe aforesaid application was allowed by the Joint Registrar on 11th\nJuly, 2022 while noting that the counsel for the plaintiff does not have any\nobjection to the same. Subsequently, replication was filed on behalf of the\nplaintiff on 23rd July, 2022.\n6.\nCounsel for the defendant contends that the replication cannot be\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 16:52:41\nSignature Not Verified\n\n--- PAGE 3 ---\n2023/DHC/000970\nCS(COMM) 34/2022\nPage 3 of 6\ntaken on record as it was filed beyond the maximum permissible period of\n45 days from the date when the written statement was supplied to the\nplaintiff. He places reliance on Chapter VII Rule 5 of the Delhi High Court\n(Original Side) Rules, 2018 (hereinafter ‘Delhi High Court (OS) Rules’), the\njudgment of the Division Bench in Ram Sarup Lugani v. Nirmal Lugani,\n2020 SCC OnLine Del 1353 and the judgment of a Co-ordinate Bench in\nAtlanta Limited v. National Highways & Infrastructure Development\nCorporation Limited, 2019 SCC OnLine Del 11276.\n7.\nCounsel for the plaintiff submits that the copy of the written statement\nwas supplied to him only on 17th May, 2022. The time for counting the\nperiod for filing replication can only be counted from the date when the\nwritten statement was permitted to be taken on record. In the present case,\nthe said date would be 11th July, 2022. He further submits that the aforesaid\njudgments relied upon by the defendant are not applicable to the facts and\ncircumstances of the case.\n8.\nI have heard the counsels for the parties.\n9.\nTo appreciate the submissions of the parties, a reference may be made\nto the relevant portion of Chapter VII Rule 5 of the Delhi High Court (OS)\nRules, which is reproduced below:\n“5. Replication. – The replication, if any, shall be filed within\n30 days of receipt of the written statement. …”\n10.\nThe Division Bench in Ram Sarup Lugani (supra) while considering\nthe aforesaid Rule came to the conclusion that the Rule 5 of the Delhi High\nCourt (OS) Rules is mandatory in nature and the replication cannot be\npermitted to be taken on record after the exhaustion of the maximum\nprescribed period of 45 days. The issue before the Division Bench was not\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 16:52:41\nSignature Not Verified\n\n--- PAGE 4 ---\n2023/DHC/000970\nCS(COMM) 34/2022\nPage 4 of 6\nwith regard to the date from which the period of 45 days for filing the\nreplication would begin. The issue before the Division Bench was in the\ncontext of whether delay in filing the replication can be condoned beyond\nthe period of 45 days in terms of Rule 5 of Chapter VII of the Delhi High\nCourt (OS) Rules. Therefore, the observations of the Division Bench would\nnot be of any assistance to the defendant.\n11.\nI do not agree with the submission of the defendant that in all cases\nthe period for filing replication would commence from the date of written\nstatement being supplied by the defendant to the plaintiff in terms of Rule 5\nof the Delhi High Court (OS) Rules. Undoubtedly, the language used in\nRule 5 of the Delhi High Court (OS) Rules is that the replication has to be\nfiled within 30 days from the receipt of the written statement. This may be\nordinarily so. However, where the written statement was filed beyond the\nstatutory time limit and was taken on record only upon an application for\ncondonation of delay being allowed by the Court, the aforesaid rule has to\nbe interpreted in a manner that the period of 30 days will begin from the\ntime the written statement is permitted to be taken on record.\n12.\nThis issue may be examined from a different point of view as well.\nThere would be no requirement for the plaintiff to file a replication in the\nevent that the application seeking condonation of delay in filing written\nstatement is not allowed and the written statement is not taken on record.\nThe plaintiff would be required to file replication only once the condonation\nin delay is allowed and the written statement is taken on record. Therefore, it\nis axiomatic that the period for filing replication would only commence from\nthe date when the delay is condoned and the written statement is taken on\nrecord.\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 16:52:41\nSignature Not Verified\n\n--- PAGE 5 ---\n2023/DHC/000970\nCS(COMM) 34/2022\nPage 5 of 6\n13.\nIn the present case, the replication was filed by the plaintiff within 12\ndays after the written statement was taken on record. It was the defendant\nwho had filed the written statement in a belated manner and sought\ncondonation of delay for the same, which the counsel for the plaintiff fairly\ndid not oppose. Therefore, there is no basis for the defendant to object to the\nreplication being taken on record.\n14.\nReliance has been placed by the counsel for the defendant on the\njudgment in Atlanta Limited (supra). In the said case, the written statement\nwas already taken on record and the plaintiff had filed an application under\nthe provisions of Order VIII Rule 10 of the CPC for taking the written\nstatement off the record as the filing of the written statement was delayed\nand the said application was dismissed. The counsel for the plaintiff therein\nfiled an application contending that the maximum permissible period of 45\ndays for filing replication should be counted from the date when the\napplication of the plaintiff for taking the written statement off the record was\ndismissed. The said application was rejected by the Court. In the present\ncase the written statement though filed by the defendant earlier, was\npermitted to be taken on record only on a subsequent date and the replication\nwas filed within 12 days from the said date. Therefore, reliance placed on\nthe judgment in Atlanta Limited (supra) is misplaced.\n15.\nTherefore, I do not find any merit in the submission of the defendant\nthat the replication filed by the plaintiff along with admission/denial of\ndocuments not be taken on record. Accordingly, the replication is permitted\nbe taken on record.\n16.\nList on 2nd March, 2023.\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 16:52:41\nSignature Not Verified\n\n--- PAGE 6 ---\n2023/DHC/000970\nCS(COMM) 34/2022\nPage 6 of 6\nI.A. 813/2022 (O-XXXIX R-1 & 2 of CPC)\n17.\nList for further proceedings on 2nd March 2023.\n18.\nInterim orders to continue.\nAMIT BANSAL, J\nFEBRUARY 7, 2023\nrt/sr\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 16:52:41\nSignature Not Verified\n"
  },
  "total_pages": 6,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "According to the PDF document \"14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf\", a lawsuit (CS(COMM) 34/2022) was filed by SNS Products Private Limited against Ijaz Uddin in the High Court of Delhi. The plaintiff sought a permanent injunction to prevent the defendant from infringing on their trademark, passing off goods as their own, and sought damages and other relief.\n\nThe court granted an ex parte ad interim injunction on January 17, 2022, restraining the defendant from using the marks 'SHAN E DELHI' and 'SHAN-A-DELHI', which are similar to the plaintiff's trademark 'SHAN-E-DELHI'. A Local Commissioner was appointed to seize and inventory the infringing goods.\n\nThe defendant entered an appearance on April 26, 2022, and filed a written statement, which was accepted after an application for condonation of delay was allowed on July 11, 2022. The plaintiff filed a replication on July 23, 2022. However, the defendant's counsel contested the replication, leading to further proceedings.\n\nKey dates include:\n- January 17, 2022: Ex parte ad interim injunction granted\n- April 26, 2022: Defendant entered appearance and filed written statement\n- July 11, 2022: Application for condonation of delay allowed\n- July 23, 2022: Replication filed by the plaintiff\n- February 7, 2023: Date of decision\n\nThe case was heard by Hon'ble Mr. Justice Amit Bansal, and the decision was digitally signed on February 10, 2023. (Source: 14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf)",
      "pdf_source": "14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "According to page 1 of the PDF \"14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf\", a suit (CS(COMM) 34/2022) was filed in the High Court of Delhi by SNS Products Private Limited against Ijaz Uddin. The plaintiff sought a permanent injunction to restrain the defendant from infringing their trademark, passing off goods, and claimed damages. The suit was heard by Hon'ble Mr. Justice Amit Bansal. On January 17, 2022, the court issued summons and granted an ex parte ad interim injunction against the defendant, restraining them from using the marks 'SHAN E DELHI' and 'SHAN-A-DELHI'. The decision was made on February 7, 2023. The plaintiff was represented by Mr. Tejveer Singh Bhatia, Mr. Kunal Vats, and Ms. Tanya Arora, while the defendant was represented by Mr. Shashank Khurana. (Source: 14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf)",
          "content": "2023/DHC/000970\nCS(COMM) 34/2022\nPage 1 of 6\n$~10\n*\nIN THE HIGH COURT OF DELHI AT NEW DELHI\n%\nDate of decision : 7th February, 2023\n+\nCS(COMM) 34/2022\nSNS PRODUCTS PRIVATE\nLIMITED\n..... Plaintiff\nThrough:\nMr.Tejveer Singh Bhatia, Mr. Kunal\nVats and Ms. Tanya Arora,\nAdvocates.\nversus\nIJAZ UDDIN\n..... Defendant\nThrough:\nMr. Shashank Khurana, Advocate\nCORAM:\nHON'BLE MR. JUSTICE AMIT BANSAL\nAMIT BANSAL, J. (Oral)\nCS(COMM) 34/2022\n1.\nThe present suit has been filed seeking relief of permanent injunction\nrestraining the defendant from infringing the trademark of the plaintiff,\npassing off his goods as that of the plaintiff, damages and other ancillary\nreliefs.\n2.\nSummons in the suit were issued on 17th January, 2022, when this\nCourt granted ex parte ad interim injunction against the defendant\nrestraining him from using the impugned mark ‘SHAN E DELHI’, ‘SHAN-\nA-DELHI’ or any other mark identical or deceptively similar to the\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 16:52:41\nSignature Not Verified",
          "pdf_source": "14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "According to page 2 of the PDF \"14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf\", the court proceedings involve a trademark infringement case. A Local Commissioner was appointed to seize and inventories the infringing goods. The defendant's counsel entered appearance on April 26, 2022, and filed a written statement with an application for condonation of delay under Order VIII Rule 1 of the CPC. The application was allowed on July 11, 2022, and the plaintiff filed a replication on July 23, 2022. The defendant's counsel argued that the replication cannot be filed. Key dates include: February 2, 2022 (Local Commissioner appointment), April 26, 2022 (defendant's written statement), July 11, 2022 (condonation of delay), and July 23, 2022 (replication filing). The case, CS(COMM) 34/2022, is being heard by Hon'ble Mr. Justice Amit Bansal. (Source: 14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf)",
          "content": "2023/DHC/000970\nCS(COMM) 34/2022\nPage 2 of 6\nplaintiff’s trademark, ‘SHAN-E-DELHI’ /\n. A\nLocal Commissioner was also appointed by this Court to seize and\ninventorize the infringing goods. Vide order dated 2nd February, 2022 one\nmore Local Commissioner was appointed to visit another premises of the\ndefendant.\n3.\nThe counsel appearing on behalf of the defendant entered appearance\non 26th April, 2022 and the Court directed for the written statement along\nwith an affidavit of admission/denial of documents to be filed within the\nperiod permissible in law. The replication was directed to be filed within\nfifteen days of the receipt of the written statement.\n4.\nThe written statement was filed on behalf of the defendant on 26th\nApril, 2022 and copy of the same was supplied to the counsel for the\nplaintiff on the same date. The written statement was filed belatedly and\ntherefore, it was accompanied by an application under Order VIII Rule 1 of\nthe Code of Civil Procedure, 1908 (CPC) seeking condonation of delay of\n27 days in filing the written statement.\n5.\nThe aforesaid application was allowed by the Joint Registrar on 11th\nJuly, 2022 while noting that the counsel for the plaintiff does not have any\nobjection to the same. Subsequently, replication was filed on behalf of the\nplaintiff on 23rd July, 2022.\n6.\nCounsel for the defendant contends that the replication cannot be\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 16:52:41\nSignature Not Verified",
          "pdf_source": "14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0005",
      "start_index": 3,
      "end_index": 3,
      "summary": "According to the PDF document \"14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf\", a legal proceeding is underway in the High Court of Delhi. The case, CS(COMM) 34/2022, involves SNS Products Private Limited as the plaintiff and Ijaz Uddin as the defendant. The court, presided over by Hon'ble Mr. Justice Amit Bansal, is considering a suit filed by the plaintiff seeking relief of permanent injunction.\n\nThe defendant argued that the plaintiff's replication was filed beyond the maximum permissible period of 45 days from the date when the written statement was supplied to the plaintiff. The defendant cited Chapter VII Rule 5 of the Delhi High Court (Original Side) Rules, 2018, and two judgments: Ram Sarup Lugani v. Nirmal Lugani (2020) and Atlanta Limited v. National Highways & Infrastructure Development Corporation Limited (2019).\n\nThe plaintiff countered that the written statement was supplied on May 17, 2022, and the time for filing replication should be counted from July 11, 2022, when the written statement was permitted to be taken on record. The plaintiff argued that the defendant's cited judgments are not applicable to the case.\n\nThe court considered the arguments and referred to Chapter VII Rule 5 of the Delhi High Court (OS) Rules, which states that replication should be filed within 30 days of receipt of the written statement. The court also considered the Division Bench's conclusion in Ram Sarup Lugani that Rule 5 is mandatory, and replication cannot be permitted after 45 days. The case is ongoing, with the court weighing the arguments and applicable rules. (Source: \"14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf\", Page 1-3 of 6)",
      "pdf_source": "14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "According to page 3 of the PDF \"14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf\", the defendant argued that the plaintiff's replication should not be taken on record as it was filed beyond the 45-day limit from the date the written statement was supplied. The plaintiff countered that the time period should be counted from July 11, 2022, when the written statement was permitted to be taken on record. The court referred to Chapter VII Rule 5 of the Delhi High Court (Original Side) Rules, 2018, and judgments in Ram Sarup Lugani v. Nirmal Lugani and Atlanta Limited v. National Highways & Infrastructure Development Corporation Limited. The court considered the mandatory nature of Rule 5, which states that the replication must be filed within 30 days of receiving the written statement. (Source: 14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf, 2023/DHC/000970, CS(COMM) 34/2022)",
          "content": "2023/DHC/000970\nCS(COMM) 34/2022\nPage 3 of 6\ntaken on record as it was filed beyond the maximum permissible period of\n45 days from the date when the written statement was supplied to the\nplaintiff. He places reliance on Chapter VII Rule 5 of the Delhi High Court\n(Original Side) Rules, 2018 (hereinafter ‘Delhi High Court (OS) Rules’), the\njudgment of the Division Bench in Ram Sarup Lugani v. Nirmal Lugani,\n2020 SCC OnLine Del 1353 and the judgment of a Co-ordinate Bench in\nAtlanta Limited v. National Highways & Infrastructure Development\nCorporation Limited, 2019 SCC OnLine Del 11276.\n7.\nCounsel for the plaintiff submits that the copy of the written statement\nwas supplied to him only on 17th May, 2022. The time for counting the\nperiod for filing replication can only be counted from the date when the\nwritten statement was permitted to be taken on record. In the present case,\nthe said date would be 11th July, 2022. He further submits that the aforesaid\njudgments relied upon by the defendant are not applicable to the facts and\ncircumstances of the case.\n8.\nI have heard the counsels for the parties.\n9.\nTo appreciate the submissions of the parties, a reference may be made\nto the relevant portion of Chapter VII Rule 5 of the Delhi High Court (OS)\nRules, which is reproduced below:\n“5. Replication. – The replication, if any, shall be filed within\n30 days of receipt of the written statement. …”\n10.\nThe Division Bench in Ram Sarup Lugani (supra) while considering\nthe aforesaid Rule came to the conclusion that the Rule 5 of the Delhi High\nCourt (OS) Rules is mandatory in nature and the replication cannot be\npermitted to be taken on record after the exhaustion of the maximum\nprescribed period of 45 days. The issue before the Division Bench was not\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 16:52:41\nSignature Not Verified",
          "pdf_source": "14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0009",
      "start_index": 4,
      "end_index": 6,
      "summary": "According to the PDF document \"14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf\", a legal case (CS(COMM) 34/2022) was heard in the High Court of Delhi at New Delhi. The plaintiff, SNS Products Private Limited, filed a suit against the defendant, Ijaz Uddin. The case revolves around the filing of a replication by the plaintiff, which the defendant objected to, citing a delay beyond the 45-day limit.\n\nThe court, presided over by Hon'ble Mr. Justice Amit Bansal, considered the defendant's submission that the 45-day period for filing the replication should commence from the date the written statement was supplied by the defendant to the plaintiff. However, the court disagreed, stating that the period should begin from the date the written statement was permitted to be taken on record, which was after the delay was condoned by the court.\n\nThe plaintiff filed the replication within 12 days of the written statement being taken on record, which was deemed timely. The defendant's reliance on the judgment in Atlanta Limited was deemed misplaced, as the facts of the two cases differed. Ultimately, the court permitted the replication to be taken on record, finding no merit in the defendant's submission. The case was listed for further proceedings on March 2, 2023, with interim orders to continue. Source: \"14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf\" (2023/DHC/000970, CS(COMM) 34/2022).",
      "pdf_source": "14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf",
      "nodes": [
        {
          "title": "Page 4",
          "node_id": "0006",
          "start_index": 4,
          "end_index": 4,
          "summary": "According to page 4 of the PDF \"14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf\" (2023/DHC/000970, CS(COMM) 34/2022), the court discusses the timeline for filing a replication. The defendant argues that the 45-day period for filing a replication starts from the date the written statement is supplied to the plaintiff. However, the court disagrees, stating that when a written statement is filed beyond the statutory time limit and is taken on record after condonation of delay, the 30-day period for filing a replication begins from the date the written statement is permitted to be taken on record. The court's decision is made by HON'BLE MR. JUSTICE AMIT BANSAL on February 7, 2023. The case involves SNS Products Private Limited (plaintiff) and Ijaz Uddin (defendant), represented by their respective advocates.",
          "content": "2023/DHC/000970\nCS(COMM) 34/2022\nPage 4 of 6\nwith regard to the date from which the period of 45 days for filing the\nreplication would begin. The issue before the Division Bench was in the\ncontext of whether delay in filing the replication can be condoned beyond\nthe period of 45 days in terms of Rule 5 of Chapter VII of the Delhi High\nCourt (OS) Rules. Therefore, the observations of the Division Bench would\nnot be of any assistance to the defendant.\n11.\nI do not agree with the submission of the defendant that in all cases\nthe period for filing replication would commence from the date of written\nstatement being supplied by the defendant to the plaintiff in terms of Rule 5\nof the Delhi High Court (OS) Rules. Undoubtedly, the language used in\nRule 5 of the Delhi High Court (OS) Rules is that the replication has to be\nfiled within 30 days from the receipt of the written statement. This may be\nordinarily so. However, where the written statement was filed beyond the\nstatutory time limit and was taken on record only upon an application for\ncondonation of delay being allowed by the Court, the aforesaid rule has to\nbe interpreted in a manner that the period of 30 days will begin from the\ntime the written statement is permitted to be taken on record.\n12.\nThis issue may be examined from a different point of view as well.\nThere would be no requirement for the plaintiff to file a replication in the\nevent that the application seeking condonation of delay in filing written\nstatement is not allowed and the written statement is not taken on record.\nThe plaintiff would be required to file replication only once the condonation\nin delay is allowed and the written statement is taken on record. Therefore, it\nis axiomatic that the period for filing replication would only commence from\nthe date when the delay is condoned and the written statement is taken on\nrecord.\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 16:52:41\nSignature Not Verified",
          "pdf_source": "14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf",
          "nodes": []
        },
        {
          "title": "Page 5",
          "node_id": "0007",
          "start_index": 5,
          "end_index": 5,
          "summary": "According to page 5 of the PDF \"14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf\", the court discusses the admissibility of the plaintiff's replication. The defendant had filed a written statement in a belated manner, and the plaintiff filed a replication within 12 days after it was taken on record. The defendant objected to the replication, citing the judgment in Atlanta Limited. However, the court found this reliance misplaced, as the written statement in the present case was permitted to be taken on record on a subsequent date, and the replication was filed within 12 days from that date. The court, presided by Hon'ble Mr. Justice Amit Bansal, permitted the replication to be taken on record, finding no merit in the defendant's submission. The next hearing was scheduled for March 2, 2023. (Source: 14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf, page 5)",
          "content": "2023/DHC/000970\nCS(COMM) 34/2022\nPage 5 of 6\n13.\nIn the present case, the replication was filed by the plaintiff within 12\ndays after the written statement was taken on record. It was the defendant\nwho had filed the written statement in a belated manner and sought\ncondonation of delay for the same, which the counsel for the plaintiff fairly\ndid not oppose. Therefore, there is no basis for the defendant to object to the\nreplication being taken on record.\n14.\nReliance has been placed by the counsel for the defendant on the\njudgment in Atlanta Limited (supra). In the said case, the written statement\nwas already taken on record and the plaintiff had filed an application under\nthe provisions of Order VIII Rule 10 of the CPC for taking the written\nstatement off the record as the filing of the written statement was delayed\nand the said application was dismissed. The counsel for the plaintiff therein\nfiled an application contending that the maximum permissible period of 45\ndays for filing replication should be counted from the date when the\napplication of the plaintiff for taking the written statement off the record was\ndismissed. The said application was rejected by the Court. In the present\ncase the written statement though filed by the defendant earlier, was\npermitted to be taken on record only on a subsequent date and the replication\nwas filed within 12 days from the said date. Therefore, reliance placed on\nthe judgment in Atlanta Limited (supra) is misplaced.\n15.\nTherefore, I do not find any merit in the submission of the defendant\nthat the replication filed by the plaintiff along with admission/denial of\ndocuments not be taken on record. Accordingly, the replication is permitted\nbe taken on record.\n16.\nList on 2nd March, 2023.\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 16:52:41\nSignature Not Verified",
          "pdf_source": "14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf",
          "nodes": []
        },
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "According to page 6 of the PDF \"14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf\", the court case CS(COMM) 34/2022 was heard by HON'BLE MR. JUSTICE AMIT BANSAL on February 7, 2023. The interim orders were directed to continue. The case was listed for further proceedings on March 2, 2023. The plaintiff, SNS Products Private Limited, was represented by advocates Mr. Tejveer Singh Bhatia, Mr. Kunal Vats, and Ms. Tanya Arora, while the defendant, Ijaz Uddin, was represented by Mr. Shashank Khurana. The decision was digitally signed by Justice Amit Bansal on February 10, 2023. (Source: 14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf, page 6)",
          "content": "2023/DHC/000970\nCS(COMM) 34/2022\nPage 6 of 6\nI.A. 813/2022 (O-XXXIX R-1 & 2 of CPC)\n17.\nList for further proceedings on 2nd March 2023.\n18.\nInterim orders to continue.\nAMIT BANSAL, J\nFEBRUARY 7, 2023\nrt/sr\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 16:52:41\nSignature Not Verified",
          "pdf_source": "14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0010",
      "start_index": 7,
      "end_index": 6,
      "summary": "Section 'Court Decision' from 14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf - No extractable content",
      "pdf_source": "14. SNS PRODUCTS PRIVATE VS. IJAZ UDDIN.pdf",
      "nodes": []
    }
  ],
  "created_at": "2025-07-15T18:41:52.094675",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}