{
  "doc_name": "15. SANDISK LLC vs Excel",
  "pdf_source": "15. SANDISK LLC vs Excel.pdf",
  "metadata": {
    "document_name": "15. SANDISK LLC vs Excel",
    "source_pdf": "15. SANDISK LLC vs Excel.pdf",
    "judges": [
      "AMIT BANSAL"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "992/2018",
      "992/2018",
      "992/2018",
      "992/2018",
      "992/2018",
      "992/2018",
      "992/2018",
      "992/2018",
      "992/2018",
      "992/2018",
      "5298/2023",
      "5297/2023",
      "8516/2018"
    ],
    "dhc_numbers": [
      "2023:DHC:2057"
    ],
    "ia_numbers": [],
    "decision_date": "17 March, 2023",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      "SANDISK LLC",
      "SanDisk India Device Design"
    ],
    "defendants": [
      "EXCEL MARKETING"
    ],
    "appellants": [],
    "respondents": [],
    "plaintiff_advocates": [
      "Mr.Prithvi Singh",
      "Ms.Devyani Nath",
      "Ms.Coral Shah"
    ],
    "defendant_advocates": [],
    "appellant_advocates": [],
    "respondent_advocates": [],
    "damages_claimed": "29,00,000",
    "damages_awarded": null,
    "key_issues": [
      "Trademark infringement by the defendant, specifically the unauthorized use of the SanDisk trademarks, including the SanDisk logo and other formative marks.",
      "Copyright infringement by the defendant, specifically the unauthorized use of the unique and distinct packaging of the plaintiffs' products, which qualifies as an original artistic work under the Copyright Act, 1957.",
      "Passing off by the defendant, by marketing and selling counterfeit products bearing the identical trademarks and packaging as the plaintiffs' products.",
      "The plaintiffs' entitlement to exclusive rights in their trademarks and packaging, and the defendant's alleged infringement of those rights.",
      "The validity and enforceability of the plaintiffs' trademark registrations in India, including the earliest registration of the SanDisk mark in 2003.",
      "The plaintiffs' claims of prior use and reputation in the Indian market, having sold their products since 2005 and spent significant amounts on research and development and advertising.",
      "The defendant's alleged sale of counterfeit products, including micro SDHC cards and USB flash drives, bearing the SanDisk and Cruzer Blade trademarks.",
      "The admissibility and relevance of evidence, including photographs of the counterfeit products and testimony of investigators, in establishing the defendant's infringement and passing off.",
      "The court's jurisdiction to grant relief, including permanent injunction, in a case involving trademark and copyright infringement, as well as passing off.",
      "The applicability of the Trade Marks Act, 1999, and the Copyright Act, 1957, to the facts of the case and the plaintiffs' claims for relief."
    ],
    "decision_summary": "**Summary of the Legal Case: SanDisk LLC & Anr. vs. Excel Marketing**\n\n**Background:**\n\nThe plaintiffs, SanDisk LLC and SanDisk India Device Design, are entities that design, develop, and manufacture data storage solutions. The plaintiffs are the registered proprietors of the trademarks \"SanDisk,\" \"(logo),\" \"the red frame logo,\" \"SanDisk Ultra,\" and \"Cruzer Blade\" (hereinafter referred to as \"SanDisk trademarks\") in Class 9 of the Trade Marks Act, 1999. The plaintiffs' products are sold worldwide, and they have a significant presence in the Indian market.\n\n**Legal Issues:**\n\nThe plaintiffs discovered that the defendant, Excel Marketing, was marketing and selling counterfeit micro SDHC cards and USB flash drives bearing the identical trademarks and packaging as the plaintiffs' products. The plaintiffs alleged that the defendant's actions constituted trademark infringement, copyright infringement, and passing off.\n\n**Arguments:**\n\nThe plaintiffs argued that they had a prima facie case of infringement, as the defendant's products were identical to theirs and could cause confusion among consumers. The plaintiffs also argued that they had suffered irreparable harm and injury due to the defendant's actions and that the balance of convenience was in their favor.\n\n**Court Proceedings:**\n\nThe court granted an ex parte ad interim injunction in favor of the plaintiffs on July 5, 2018, restraining the defendant from dealing in any product or packaging bearing the plaintiffs' registered trademarks. The court found that a prima facie case of infringement had been made out in favor of the plaintiffs and that the balance of convenience was also in their favor.\n\n**Court Findings:**\n\nThe court found that the plaintiffs had established a prima facie case of infringement, as the defendant's products were identical to theirs and could cause confusion among consumers. The court also found that the plaintiffs had suffered irreparable harm and injury due to the defendant's actions.\n\n**Decision:**\n\nThe court granted a permanent injunction in favor of the plaintiffs, restraining the defendant from infringing the plaintiffs' trademarks and copyright. The court also granted other ancillary reliefs, including an order for the defendant to destroy all counterfeit products and packaging bearing the plaintiffs' trademarks.\n\n**Key Points:**\n\n1. The plaintiffs established a prima facie case of trademark infringement, copyright infringement, and passing off.\n2. The court granted an ex parte ad interim injunction in favor of the plaintiffs, which was later made permanent.\n3. The defendant's actions were found to have caused irreparable harm and injury to the plaintiffs.\n4. The court ordered the defendant to destroy all counterfeit products and packaging bearing the plaintiffs' trademarks.\n\n**Conclusion:**\n\nThe court's decision in this case highlights the importance of protecting intellectual property rights, particularly in the context of counterfeiting. The plaintiffs' success in obtaining a permanent injunction and other ancillary reliefs demonstrates the effectiveness of the Indian legal system in enforcing trademark and copyright laws. The case also serves as a warning to potential infringers that counterfeiting can have serious consequences, including damage to reputation and financial losses.",
    "legal_precedents": [
      "Uflex Government"
    ],
    "full_text": "\n--- PAGE 1 ---\n2023:DHC:2057 \n \n          CS(COMM) 992/2018                                                                    Page 1 of 8 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n \n \n \n \n \n \n      Date of decision: 17th March, 2023. \n \n+  \nCS(COMM) 992/2018 and I.A. 5298/2023 (for exemption) \n \n \nSANDISK LLC & ANR.  \n \n \n \n..... Plaintiffs \nThrough: \nMr.Prithvi Singh, Ms.Devyani Nath \nand Ms.Coral Shah, Advocates. \n \n \n \n \nversus \n \n \nEXCEL MARKETING  \n \n \n \n..... Defendant \n \n \n \n \nThrough: \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nAMIT BANSAL, J. (Oral) \n \nI.A.5297/2023 (O-XIII A R-3 & 6(1)(a) of CPC for Summary Judgment) \n& CS(COMM) 992/2018 \n \n1. \nThe present suit has been filed seeking relief of permanent injunction \nrestraining the defendant from infringing the trademark and copyright of the \nplaintiffs, passing off and other ancillary reliefs \nPLEADINGS IN THE PLAINT \n2. \nThe case set up by the plaintiffs in the plaint is as follows: \n2.1. Plaintiff no.1, SanDisk LLC is an entity existing under the laws of the \nstate of Delaware, USA. The plaintif no.1 is the registered proprietor of the \ntrademarks SanDisk, \n(logo), the red frame logo [\n],  \nSanDisk Ultra and Cruzer Blade (hereinafter „SanDisk trademarks‟). \nPlaintiff no.2, SanDisk India Device Design is a sister concern of the plaintiff \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:22.03.2023 18:39:48\nSignature Not Verified\n\n--- PAGE 2 ---\n2023:DHC:2057 \n \n          CS(COMM) 992/2018                                                                    Page 2 of 8 \n \nno.1 and is the registered user of the SanDisk trademarks. The plaintiffs \ndesign, develop and manufacture data storage solutions in a range of form \nfactors using flash memory, controller and firmware technologies. \n2.2. The plaintiffs are the registered proprietor of the trademark SanDisk \nand SanDisk formative marks in Class 9 of the Trade Marks Act, 1999. \nDetails of the plaintiffs SanDisk trademarks registered in India have been \ntabulated in paragraph no.15 of the plaint. The earliest registration of the \nplaintiffs‟ SanDisk mark is of 14th November, 2003. The said marks of the \nplaintiffs are also registered by the plaintiff no.1 in various foreign \ncountries.  \n2.3. The plaintiff no.1 sells its memory cards in a unique and distinct \npackaging. The packaging of the plaintiffs qualifies as an „original artistic \nwork‟ within the meaning of Section 2(c) of the Copyright Act, 1957 and the \nplaintiff is entitled to the exclusive rights in the same. \n2.4. The plaintiff no.1 has been selling its products in the Indian market \nsince 2005. It is further stated that approximately 3,00,000 storefronts \nworldwide stock and sell the plaintiffs‟ products and the plaintiffs spend \nhundreds of millions of dollars in research and development of their \nproducts and on advertising. \n2.5. In June 2018, the plaintiffs discovered that some unauthorised third-\nparties were marketing and selling counterfeit micro SDHC cards and USB \nflash drives bearing the identical trademarks and packaging as the plaintiffs‟ \nproducts marketed and sold under the trademarks „SanDisk‟ and „Cruzer \nBlade‟. Pursuant thereto, the plaintiffs availed the services of an \ninvestigator, to ascertain the business activities of the defendant. The \ninvestigator purchased samples of the counterfeit products bearing the mark \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:22.03.2023 18:39:48\nSignature Not Verified\n\n--- PAGE 3 ---\n2023:DHC:2057 \n \n          CS(COMM) 992/2018                                                                    Page 3 of 8 \n \n„SanDisk‟ and „Cruzer Blade‟ from the defendant. Photographs of the said \ncounterfeit products have been filed long with the plaint. \n2.6. Accordingly, the plaintiffs have filed the present suit.  \nPROCEEDINGS IN THE SUIT \n3. \nThis Court, vide order dated 5th July, 2018 granted an ex parte ad \ninterim injunction in favour of the plaintiffs under I.A.8516/2018, \nrestraining the defendant from dealing in any product or packaging bearing \nthe plaintiffs‟ registered trademarks  SanDisk, \n (logo), the \nred frame logo [\n],  and Cruzer Blade.  The relevant portion of the \nsaid order is as under: \n“Keeping in view the aforesaid, this Court is of the opinion that \na prima facie case of infringement is made out in favour of the \nplaintiffs and balance of convenience is also in their favour. \nFurther, irreparable harm or injury would be caused to the \nplaintiffs if an interim injunction order is not passed. \n  \nConsequently, \ntill \nfurther \norders, \nthe \ndefendant, \nits \nproprietors/partners, servants, agents and all others in active \nconcert with them are restrained from manufacturing, \nmarketing, selling, offering for sale, advertising, directly or \nindirectly dealing in any product or any product packaging \nbearing the plaintiffs' registered trademarks SanDisk, the \nlogo, 'Cruzer Blade' and the Red Frame Logo \nand/or any mark/s or confusingly or deceptively similar in any \nmanner whatsoever.” \n \n4. \nVide the aforesaid order, a Local Commissioner was appointed by the \nCourt to seize and inventories the infringing products. The Local \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:22.03.2023 18:39:48\nSignature Not Verified\n\n--- PAGE 4 ---\n2023:DHC:2057 \n \n          CS(COMM) 992/2018                                                                    Page 4 of 8 \n \nCommission was carried out on 20th July, 2018 and a copy of the entire suit \npaper book was served upon the defendant. The report of the Local \nCommissioner has been placed on record.  \n5. \nThe defendant filed written statement to the plaint on 27th October, \n2018 along with purchase and sales invoices. Subsequently, the plaintiff \nfiled an application under Order VI Rule 17 of the CPC seeking amendment \nof plaint, which was allowed vide order dated 4th February, 2019 passed by \nthe Joint Registrar. Order dated 16th May, 2019 records that the defendant \ndid not wish to file written statement to the amended plaint and therefore, \nthe pleadings stood complete. \n6. \nThe defendant has not been appearing in the suit since 20th April, \n2022 and vide order dated 28th February, 2023, the defendant was proceeded \nagainst ex parte. \n7. \nAccordingly, the present application for passing a summary judgment \nhas been filed. \n8. \nCounsel for the plaintiffs submits that this is a fit case where a \nSummary Judgment in terms of Order XIII-A of the Code of Civil \nProcedure, as applicable to commercial disputes of a specified value, read \nwith Rule 27 of the Delhi High Court Intellectual Property Rights Division \nRules, 2022 (in short, „IPD Rules‟), deserves to be passed in favour of the \nplaintiffs and against the defendant. \nANALYSIS AND FINDINGS \n9. \nI have heard the counsel for the plaintiffs and perused the record of \nthe case.  \n10. \nFrom the averments made in the plaint and the documents filed \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:22.03.2023 18:39:48\nSignature Not Verified\n\n--- PAGE 5 ---\n2023:DHC:2057 \n \n          CS(COMM) 992/2018                                                                    Page 5 of 8 \n \ntherewith, the plaintiffs have been able to prove that they are the registered \nproprietors of the SanDisk trademarks and the said registrations are valid \nand subsisting. The plaintiffs have also been able to show their goodwill and \nreputation in respect of the SanDisk trademarks. Plaintiffs have established \nstatutory as well as common law rights on account of long usage of the \nSanDisk trademarks. \n11. \nA comparison of the original products of the plaintiffs and the \ncounterfeit products of the defendant has been made in paragraph 33 of the \nplaint. From the comparison it is clear that the defendant has made use of \nidentical trademarks and packaging in relation to counterfeit goods. The \nreport of the Local Commissioner also shows that the defendant is indulging \nin marketing and sales of counterfeit products, which bear the identical \nmarks as that of the plaintiffs. \n12. \nThe marketing and selling of counterfeit products by the defendant \nnot only amount to infringing the registered SanDisk trademarks and \ncopyrights of the plaintiffs but also to passing off the goods of the defendant \nas that of the plaintiffs. The defendant has taken unfair advantage of the \nreputation and goodwill of the plaintiffs‟ marks and has also deceived \nunwary consumers of its association with the plaintiffs. Such acts of the \ndefendant would also lead to dilution of the plaintiffs‟ marks. \n13. \nThe defendant in its written statement to the original plaint has made \nbare averments without placing on record any substantial documentary \nevidence. Moreover, since the defendant has failed to enter appearance after \n20th April, 2022, despite having suffered an ad interim injunction order, it is \nevident that the defendant has nothing substantial to urge.  \n14. \nI am of the opinion that no purpose would be served by directing the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:22.03.2023 18:39:48\nSignature Not Verified\n\n--- PAGE 6 ---\n2023:DHC:2057 \n \n          CS(COMM) 992/2018                                                                    Page 6 of 8 \n \nplaintiffs to lead ex parte evidence by filing an affidavit of examination in \nchief. Therefore, in my opinion, this is a fit case where a Summary \nJudgment in terms of Order XIII-A of the CPC, as applicable to commercial \ndisputes of a specified value, read with Rule 27 of the IPD Rules, deserves \nto be passed in favour of the plaintiffs and against the defendant. Reference \nin this regard may be made to the judgment in Su-Kam Power Systems Ltd. \nv. Kunwer Sachdev, 2019 SCC OnLine Del 10764, wherein this Court has \nobserved as under: \n“90. To reiterate, the intent behind incorporating the summary \njudgment procedure in the Commercial Court Act, 2015 is to \nensure disposal of commercial disputes in a time-bound \nmanner. In fact, the applicability of Order XIIIA, CPC to \ncommercial disputes, demonstrates that the trial is no longer \nthe default procedure/norm. \n \n91. Rule 3 of Order XIIIA, CPC, as applicable to commercial \ndisputes, empowers the Court to grant a summary judgement \nagainst the defendant where the Court considers that the \ndefendant has no real prospects of successfully defending the \nclaim and there is no other compelling reason why the claim \nshould not be disposed of before recording of oral evidence. \nThe expression “real” directs the Court to examine whether \nthere is a “realistic” as opposed to “fanciful” prospects of \nsuccess. This Court is of the view that the expression “no \ngenuine issue requiring a trial” in Ontario Rules of Civil \nProcedure and “no other compelling reason…..for trial” in \nCommercial Courts Act can be read mutatis mutandis. \nConsequently, Order XIIIA, CPC would be attracted if the \nCourt, while hearing such an application, can make the \nnecessary finding of fact, apply the law to the facts and the \nsame is a proportionate, more expeditious and less expensive \nmeans of achieving a fair and just result. \n \n92. Accordingly, unlike ordinary suits, Courts need not hold \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:22.03.2023 18:39:48\nSignature Not Verified\n\n--- PAGE 7 ---\n2023:DHC:2057 \n \n          CS(COMM) 992/2018                                                                    Page 7 of 8 \n \ntrial in commercial suits, even if there are disputed questions of \nfact as held by the Canadian Supreme Court in Robert \nHryniak (supra), in the event, the Court comes to the conclusion \nthat the defendant lacks a real prospect of successfully \ndefending the claim.” \n \n15. \nThe aforesaid principles are fully applicable in the facts and \ncircumstances of the present case and therefore, the plaintiffs are entitled to \na summary judgment. \n16. \nIn view of the above, the present application is allowed.  \nRELIEF \n17. \nThe various registrations and the long usage of the SanDisk \ntrademarks by the plaintiffs, as also the goodwill vesting in the SanDisk \ntrademarks, entitles the plaintiffs for grant of permanent injunction and \ndecree in terms of the plaint. \n18. \nAccordingly, the present suit is decreed against the defendant in terms \nof the relief of permanent injunction as sought in prayer clauses 41 (a) and \n(b).  \n19. \nInsofar as delivery up for the purpose of destruction, as sought in \nprayer clause 41(c) is concerned, the goods seized by the Local \nCommissioner, which are lying in supardari with the defendant, the details \nof which are given in paragraph 6 of the report dated 20th July, 2018 are \ndirected to be handed to the representatives of the plaintiffs forthwith for the \npurpose of destruction, in compliance with extant rules/regulations. \n20. \nSince the defendant is not appearing any longer and has not rendered \nany accounts of profits, the said relief as sought in prayer clause 41(d) \ncannot be granted.  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:22.03.2023 18:39:48\nSignature Not Verified\n\n--- PAGE 8 ---\n2023:DHC:2057 \n \n          CS(COMM) 992/2018                                                                    Page 8 of 8 \n \n21. \nThe Local Commissioner found a total number of 253 infringing and \ncounterfeit goods at the premises of the defendant, which were inventorized \nby him and seized and handed over on supardari to the defendant. Further, \nthe sale invoices filed by the defendant which go as far back as September, \n2016 reflect total sales of more than Rs.29,00,000. \n22. \nI am convinced that this is not a case of innocent adoption and \ntherefore, the plaintiffs are entitled to damages. Taking a reasonable \nassessment of the volume of seizure made, nature of counterfeiting indulged \ninto by the defendant, in the opinion of the Court, the plaintiffs are entitled \nto damages Rs,5,00,000.  \n23. \nPlaintiffs have also incurred costs for executing the commission and \ndeposited court fees. Thus, in view of the judgment of the Supreme Court in \nUflex v. Government of Tamil Nadu, 2021 SCC OnLine SC 738 as well as \nin terms of the Commercial Courts Act, 2015 and the Delhi High Court \n(Original Side) Rules, 2018 read with Delhi High Court Intellectual Property \nDivision Rules, 2022, the plaintiffs are entitled to actual costs recoverable \nfrom the defendant. Plaintiffs shall file their bill of costs in terms of Rule 5 \nof Chapter XXIII of the Delhi High Court (Original Side) Rules, 2018 on or \nbefore 31st March, 2023. As and when the same is filed, the matter will be \nlisted before the Taxing Officer for computation of the costs. \n24. \nLet the decree sheet be drawn up.  \n25. \nAll pending applications are disposed of in the above terms. \n \n \nAMIT BANSAL, J \nMARCH 17, 2023 \nsr \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:22.03.2023 18:39:48\nSignature Not Verified\n"
  },
  "total_pages": 8,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "According to the PDF document \"15. SANDISK LLC vs Excel.pdf\", the case CS(COMM) 992/2018 was heard in the High Court of Delhi at New Delhi. The plaintiffs, SanDisk LLC and SanDisk India Device Design, sued the defendant, Excel Marketing, for trademark and copyright infringement, passing off, and other relief. The case was decided on March 17, 2023.\n\nThe plaintiffs claimed to be the registered proprietors of the \"SanDisk\" trademarks and logos, and that they design, develop, and manufacture data storage solutions. They alleged that the defendant was selling counterfeit micro SDHC cards and USB flash drives bearing the SanDisk trademarks and packaging.\n\nThe plaintiffs' counsel, Mr. Prithvi Singh, Ms. Devyani Nath, and Ms. Coral Shah, argued that the defendant's actions constituted trademark and copyright infringement. The defendant's counsel was not specified in the provided excerpt.\n\nThe court, presided over by Hon'ble Mr. Justice Amit Bansal, considered the plaintiffs' application for a summary judgment under Order XIII A R-3 and 6(1)(a) of the Civil Procedure Code. The plaintiffs sought a permanent injunction restraining the defendant from infringing their trademarks and copyrights.\n\nThe court's decision is not specified in the provided excerpt, but the case highlights the importance of protecting intellectual property rights in India. The plaintiffs' claim of hundreds of millions of dollars spent on research and development and advertising underscores the significant investment in their brand and products. (Source: 15. SANDISK LLC vs Excel.pdf)",
      "pdf_source": "15. SANDISK LLC vs Excel.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "According to page 1 of the PDF \"15. SANDISK LLC vs Excel.pdf\", the case \"CS(COMM) 992/2018\" was decided on March 17, 2023, in the High Court of Delhi. SanDisk LLC and SanDisk India Device Design (plaintiffs) sued Excel Marketing (defendant) for trademark and copyright infringement, passing off, and other reliefs. The plaintiffs claimed to be the registered proprietors of the \"SanDisk trademarks\". The case was heard by Hon'ble Mr. Justice Amit Bansal. The plaintiffs sought a permanent injunction to restrain the defendant from infringing their trademarks and copyrights. (Source: 15. SANDISK LLC vs Excel.pdf, page 1)",
          "content": "2023:DHC:2057 \n \n          CS(COMM) 992/2018                                                                    Page 1 of 8 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n \n \n \n \n \n \n      Date of decision: 17th March, 2023. \n \n+  \nCS(COMM) 992/2018 and I.A. 5298/2023 (for exemption) \n \n \nSANDISK LLC & ANR.  \n \n \n \n..... Plaintiffs \nThrough: \nMr.Prithvi Singh, Ms.Devyani Nath \nand Ms.Coral Shah, Advocates. \n \n \n \n \nversus \n \n \nEXCEL MARKETING  \n \n \n \n..... Defendant \n \n \n \n \nThrough: \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nAMIT BANSAL, J. (Oral) \n \nI.A.5297/2023 (O-XIII A R-3 & 6(1)(a) of CPC for Summary Judgment) \n& CS(COMM) 992/2018 \n \n1. \nThe present suit has been filed seeking relief of permanent injunction \nrestraining the defendant from infringing the trademark and copyright of the \nplaintiffs, passing off and other ancillary reliefs \nPLEADINGS IN THE PLAINT \n2. \nThe case set up by the plaintiffs in the plaint is as follows: \n2.1. Plaintiff no.1, SanDisk LLC is an entity existing under the laws of the \nstate of Delaware, USA. The plaintif no.1 is the registered proprietor of the \ntrademarks SanDisk, \n(logo), the red frame logo [\n],  \nSanDisk Ultra and Cruzer Blade (hereinafter „SanDisk trademarks‟). \nPlaintiff no.2, SanDisk India Device Design is a sister concern of the plaintiff \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:22.03.2023 18:39:48\nSignature Not Verified",
          "pdf_source": "15. SANDISK LLC vs Excel.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "According to page 2 of the PDF \"15. SANDISK LLC vs Excel.pdf\", the plaintiffs, Sandisk LLC and another, are the registered users of the SanDisk trademarks and have been selling their products in India since 2005. They have spent hundreds of millions of dollars on research and development and advertising. In June 2018, they discovered unauthorized third-parties selling counterfeit products bearing their trademarks. The plaintiffs availed an investigator's services to ascertain the defendant's business activities. The case, CS(COMM) 992/2018, was heard in the High Court of Delhi at New Delhi, with the decision date being 17th March, 2023. The plaintiffs are represented by Mr. Prithvi Singh, Ms. Devyani Nath, and Ms. Coral Shah, Advocates. The defendant is Excel Marketing. (Source: \"15. SANDISK LLC vs Excel.pdf\", page 2)",
          "content": "2023:DHC:2057 \n \n          CS(COMM) 992/2018                                                                    Page 2 of 8 \n \nno.1 and is the registered user of the SanDisk trademarks. The plaintiffs \ndesign, develop and manufacture data storage solutions in a range of form \nfactors using flash memory, controller and firmware technologies. \n2.2. The plaintiffs are the registered proprietor of the trademark SanDisk \nand SanDisk formative marks in Class 9 of the Trade Marks Act, 1999. \nDetails of the plaintiffs SanDisk trademarks registered in India have been \ntabulated in paragraph no.15 of the plaint. The earliest registration of the \nplaintiffs‟ SanDisk mark is of 14th November, 2003. The said marks of the \nplaintiffs are also registered by the plaintiff no.1 in various foreign \ncountries.  \n2.3. The plaintiff no.1 sells its memory cards in a unique and distinct \npackaging. The packaging of the plaintiffs qualifies as an „original artistic \nwork‟ within the meaning of Section 2(c) of the Copyright Act, 1957 and the \nplaintiff is entitled to the exclusive rights in the same. \n2.4. The plaintiff no.1 has been selling its products in the Indian market \nsince 2005. It is further stated that approximately 3,00,000 storefronts \nworldwide stock and sell the plaintiffs‟ products and the plaintiffs spend \nhundreds of millions of dollars in research and development of their \nproducts and on advertising. \n2.5. In June 2018, the plaintiffs discovered that some unauthorised third-\nparties were marketing and selling counterfeit micro SDHC cards and USB \nflash drives bearing the identical trademarks and packaging as the plaintiffs‟ \nproducts marketed and sold under the trademarks „SanDisk‟ and „Cruzer \nBlade‟. Pursuant thereto, the plaintiffs availed the services of an \ninvestigator, to ascertain the business activities of the defendant. The \ninvestigator purchased samples of the counterfeit products bearing the mark \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:22.03.2023 18:39:48\nSignature Not Verified",
          "pdf_source": "15. SANDISK LLC vs Excel.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0006",
      "start_index": 3,
      "end_index": 4,
      "summary": "According to the PDF document \"15. SANDISK LLC vs Excel.pdf\", a legal proceeding (CS(COMM) 992/2018) was initiated by SanDisk LLC and another party against Excel Marketing. The High Court of Delhi at New Delhi heard the case, with the plaintiffs represented by Mr. Prithvi Singh, Ms. Devyani Nath, and Ms. Coral Shah, Advocates.\n\nThe plaintiffs alleged that the defendant was selling counterfeit products bearing the registered trademarks \"SanDisk\" and \"Cruzer Blade\". The Court granted an ex parte ad interim injunction on July 5, 2018, restraining the defendant from dealing in products with the plaintiffs' trademarks. A Local Commissioner was appointed to seize and inventory the infringing products.\n\nThe defendant filed a written statement on October 27, 2018, but did not appear in court after April 20, 2022. The Court proceeded against the defendant ex parte on February 28, 2023. The plaintiffs then filed an application for a summary judgment under Order XIII-A of the Code of Civil Procedure.\n\nThe Court analyzed the case and found that the plaintiffs had made a prima facie case of trademark infringement. The Court also noted that the defendant had not contested the amended plaint and had not appeared in court for over a year. Based on these findings, the Court considered passing a summary judgment in favor of the plaintiffs. (Source: 15. SANDISK LLC vs Excel.pdf, Page 1-4 of 8)",
      "pdf_source": "15. SANDISK LLC vs Excel.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "According to page 3 of the PDF \"15. SANDISK LLC vs Excel.pdf\", the plaintiffs, SanDisk LLC, filed a suit against Excel Marketing for trademark infringement. The Court granted an ex parte ad interim injunction on July 5, 2018, restraining the defendant from dealing in products bearing SanDisk's registered trademarks, including \"SanDisk\", \"(logo)\", and \"Cruzer Blade\". The Court found a prima facie case of infringement and ruled that irreparable harm would be caused to the plaintiffs if an interim injunction was not passed. A Local Commissioner was appointed to seize and inventory the infringing products. The decision was made in CS(COMM) 992/2018, with the date of decision being March 17, 2023. (Source: 15. SANDISK LLC vs Excel.pdf, page 3)",
          "content": "2023:DHC:2057 \n \n          CS(COMM) 992/2018                                                                    Page 3 of 8 \n \n„SanDisk‟ and „Cruzer Blade‟ from the defendant. Photographs of the said \ncounterfeit products have been filed long with the plaint. \n2.6. Accordingly, the plaintiffs have filed the present suit.  \nPROCEEDINGS IN THE SUIT \n3. \nThis Court, vide order dated 5th July, 2018 granted an ex parte ad \ninterim injunction in favour of the plaintiffs under I.A.8516/2018, \nrestraining the defendant from dealing in any product or packaging bearing \nthe plaintiffs‟ registered trademarks  SanDisk, \n (logo), the \nred frame logo [\n],  and Cruzer Blade.  The relevant portion of the \nsaid order is as under: \n“Keeping in view the aforesaid, this Court is of the opinion that \na prima facie case of infringement is made out in favour of the \nplaintiffs and balance of convenience is also in their favour. \nFurther, irreparable harm or injury would be caused to the \nplaintiffs if an interim injunction order is not passed. \n  \nConsequently, \ntill \nfurther \norders, \nthe \ndefendant, \nits \nproprietors/partners, servants, agents and all others in active \nconcert with them are restrained from manufacturing, \nmarketing, selling, offering for sale, advertising, directly or \nindirectly dealing in any product or any product packaging \nbearing the plaintiffs' registered trademarks SanDisk, the \nlogo, 'Cruzer Blade' and the Red Frame Logo \nand/or any mark/s or confusingly or deceptively similar in any \nmanner whatsoever.” \n \n4. \nVide the aforesaid order, a Local Commissioner was appointed by the \nCourt to seize and inventories the infringing products. The Local \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:22.03.2023 18:39:48\nSignature Not Verified",
          "pdf_source": "15. SANDISK LLC vs Excel.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "According to page 4 of the PDF \"15. SANDISK LLC vs Excel.pdf\", the court proceedings are as follows: \n\n* A Local Commissioner's report was placed on record after a commission was carried out on July 20, 2018.\n* The defendant filed a written statement on October 27, 2018, and the plaintiff filed an application to amend the plaint, which was allowed on February 4, 2019.\n* The defendant did not wish to file a written statement to the amended plaint, and the pleadings were deemed complete as of May 16, 2019.\n* The defendant has not appeared in court since April 20, 2022, and was proceeded against ex parte as of February 28, 2023.\n* The plaintiff's counsel has submitted that this is a fit case for a summary judgment in favor of the plaintiffs, as per Order XIII-A of the Code of Civil Procedure and the Delhi High Court Intellectual Property Rights Division Rules, 2022. (Source: 15. SANDISK LLC vs Excel.pdf, page 4)",
          "content": "2023:DHC:2057 \n \n          CS(COMM) 992/2018                                                                    Page 4 of 8 \n \nCommission was carried out on 20th July, 2018 and a copy of the entire suit \npaper book was served upon the defendant. The report of the Local \nCommissioner has been placed on record.  \n5. \nThe defendant filed written statement to the plaint on 27th October, \n2018 along with purchase and sales invoices. Subsequently, the plaintiff \nfiled an application under Order VI Rule 17 of the CPC seeking amendment \nof plaint, which was allowed vide order dated 4th February, 2019 passed by \nthe Joint Registrar. Order dated 16th May, 2019 records that the defendant \ndid not wish to file written statement to the amended plaint and therefore, \nthe pleadings stood complete. \n6. \nThe defendant has not been appearing in the suit since 20th April, \n2022 and vide order dated 28th February, 2023, the defendant was proceeded \nagainst ex parte. \n7. \nAccordingly, the present application for passing a summary judgment \nhas been filed. \n8. \nCounsel for the plaintiffs submits that this is a fit case where a \nSummary Judgment in terms of Order XIII-A of the Code of Civil \nProcedure, as applicable to commercial disputes of a specified value, read \nwith Rule 27 of the Delhi High Court Intellectual Property Rights Division \nRules, 2022 (in short, „IPD Rules‟), deserves to be passed in favour of the \nplaintiffs and against the defendant. \nANALYSIS AND FINDINGS \n9. \nI have heard the counsel for the plaintiffs and perused the record of \nthe case.  \n10. \nFrom the averments made in the plaint and the documents filed \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:22.03.2023 18:39:48\nSignature Not Verified",
          "pdf_source": "15. SANDISK LLC vs Excel.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0009",
      "start_index": 5,
      "end_index": 6,
      "summary": "According to the PDF document \"15. SANDISK LLC vs Excel.pdf\", a legal proceeding was held in the High Court of Delhi at New Delhi, with the case number CS(COMM) 992/2018. The plaintiffs, SanDisk LLC and another, were represented by advocates Mr. Prithvi Singh, Ms. Devyani Nath, and Ms. Coral Shah. The defendant was Excel Marketing.\n\nThe court found that the plaintiffs had proven their ownership of the SanDisk trademarks and established their goodwill and reputation. A comparison of the original products and the counterfeit products sold by the defendant showed that the defendant had used identical trademarks and packaging. The Local Commissioner's report also confirmed that the defendant was marketing and selling counterfeit products.\n\nThe defendant's actions were found to infringe on the plaintiffs' registered trademarks and copyrights, and to constitute passing off their goods as those of the plaintiffs. The defendant had failed to enter an appearance after an ad interim injunction order was issued, indicating that they had no substantial defense.\n\nThe court decided to pass a summary judgment in favor of the plaintiffs, citing the judgment in Su-Kam Power Systems Ltd. v. Kunwer Sachdev, which supported the use of summary judgments in commercial disputes. The court found that the defendant had no real prospects of successfully defending the claim, and there was no compelling reason to proceed with a trial. The decision was made on March 17, 2023, and digitally signed by Amit Bansal on March 22, 2023. (Source: 15. SANDISK LLC vs Excel.pdf)",
      "pdf_source": "15. SANDISK LLC vs Excel.pdf",
      "nodes": [
        {
          "title": "Page 5",
          "node_id": "0007",
          "start_index": 5,
          "end_index": 5,
          "summary": "According to page 5 of the PDF \"15. SANDISK LLC vs Excel.pdf\", the plaintiffs, SanDisk LLC, have proven their registered ownership of the SanDisk trademarks, which are valid and subsisting. They have also established their goodwill and reputation. The defendant, Excel Marketing, has been found to be marketing and selling counterfeit products with identical trademarks and packaging, infringing on the plaintiffs' rights and passing off their goods as those of the plaintiffs. The defendant's actions have taken unfair advantage of the plaintiffs' reputation and deceived consumers. The court notes that the defendant has failed to provide substantial evidence and has not entered an appearance since April 20, 2022, despite an ad interim injunction order. The decision was made on March 17, 2023, in the High Court of Delhi (CS(COMM) 992/2018).",
          "content": "2023:DHC:2057 \n \n          CS(COMM) 992/2018                                                                    Page 5 of 8 \n \ntherewith, the plaintiffs have been able to prove that they are the registered \nproprietors of the SanDisk trademarks and the said registrations are valid \nand subsisting. The plaintiffs have also been able to show their goodwill and \nreputation in respect of the SanDisk trademarks. Plaintiffs have established \nstatutory as well as common law rights on account of long usage of the \nSanDisk trademarks. \n11. \nA comparison of the original products of the plaintiffs and the \ncounterfeit products of the defendant has been made in paragraph 33 of the \nplaint. From the comparison it is clear that the defendant has made use of \nidentical trademarks and packaging in relation to counterfeit goods. The \nreport of the Local Commissioner also shows that the defendant is indulging \nin marketing and sales of counterfeit products, which bear the identical \nmarks as that of the plaintiffs. \n12. \nThe marketing and selling of counterfeit products by the defendant \nnot only amount to infringing the registered SanDisk trademarks and \ncopyrights of the plaintiffs but also to passing off the goods of the defendant \nas that of the plaintiffs. The defendant has taken unfair advantage of the \nreputation and goodwill of the plaintiffs‟ marks and has also deceived \nunwary consumers of its association with the plaintiffs. Such acts of the \ndefendant would also lead to dilution of the plaintiffs‟ marks. \n13. \nThe defendant in its written statement to the original plaint has made \nbare averments without placing on record any substantial documentary \nevidence. Moreover, since the defendant has failed to enter appearance after \n20th April, 2022, despite having suffered an ad interim injunction order, it is \nevident that the defendant has nothing substantial to urge.  \n14. \nI am of the opinion that no purpose would be served by directing the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:22.03.2023 18:39:48\nSignature Not Verified",
          "pdf_source": "15. SANDISK LLC vs Excel.pdf",
          "nodes": []
        },
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "According to page 6 of the PDF \"15. SANDISK LLC vs Excel.pdf\", the court considers granting a summary judgment in favor of the plaintiffs, Sandisk LLC, against the defendant, Excel Marketing. The court cites the Commercial Court Act, 2015, and Order XIII-A of the CPC, which allows for summary judgment in commercial disputes where the defendant has no real prospects of successfully defending the claim. The court references the judgment in Su-Kam Power Systems Ltd. v. Kunwer Sachdev (2019 SCC OnLine Del 10764) to support its decision. The case, CS(COMM) 992/2018, was heard on March 17, 2023. The plaintiffs are represented by Mr. Prithvi Singh, Ms. Devyani Nath, and Ms. Coral Shah, Advocates. (Source: 15. SANDISK LLC vs Excel.pdf, page 6)",
          "content": "2023:DHC:2057 \n \n          CS(COMM) 992/2018                                                                    Page 6 of 8 \n \nplaintiffs to lead ex parte evidence by filing an affidavit of examination in \nchief. Therefore, in my opinion, this is a fit case where a Summary \nJudgment in terms of Order XIII-A of the CPC, as applicable to commercial \ndisputes of a specified value, read with Rule 27 of the IPD Rules, deserves \nto be passed in favour of the plaintiffs and against the defendant. Reference \nin this regard may be made to the judgment in Su-Kam Power Systems Ltd. \nv. Kunwer Sachdev, 2019 SCC OnLine Del 10764, wherein this Court has \nobserved as under: \n“90. To reiterate, the intent behind incorporating the summary \njudgment procedure in the Commercial Court Act, 2015 is to \nensure disposal of commercial disputes in a time-bound \nmanner. In fact, the applicability of Order XIIIA, CPC to \ncommercial disputes, demonstrates that the trial is no longer \nthe default procedure/norm. \n \n91. Rule 3 of Order XIIIA, CPC, as applicable to commercial \ndisputes, empowers the Court to grant a summary judgement \nagainst the defendant where the Court considers that the \ndefendant has no real prospects of successfully defending the \nclaim and there is no other compelling reason why the claim \nshould not be disposed of before recording of oral evidence. \nThe expression “real” directs the Court to examine whether \nthere is a “realistic” as opposed to “fanciful” prospects of \nsuccess. This Court is of the view that the expression “no \ngenuine issue requiring a trial” in Ontario Rules of Civil \nProcedure and “no other compelling reason…..for trial” in \nCommercial Courts Act can be read mutatis mutandis. \nConsequently, Order XIIIA, CPC would be attracted if the \nCourt, while hearing such an application, can make the \nnecessary finding of fact, apply the law to the facts and the \nsame is a proportionate, more expeditious and less expensive \nmeans of achieving a fair and just result. \n \n92. Accordingly, unlike ordinary suits, Courts need not hold \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:22.03.2023 18:39:48\nSignature Not Verified",
          "pdf_source": "15. SANDISK LLC vs Excel.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0012",
      "start_index": 7,
      "end_index": 8,
      "summary": "According to the PDF document \"15. Sandisk LLC vs Excel.pdf\", the High Court of Delhi at New Delhi made a decision on March 17, 2023, in the case of Sandisk LLC & Anr. vs Excel Marketing (CS(COMM) 992/2018). The court granted a summary judgment in favor of the plaintiffs, Sandisk LLC, and ordered a permanent injunction against the defendant, Excel Marketing.\n\nThe court found that the defendant had been selling counterfeit SanDisk products, and the plaintiffs were entitled to relief due to the defendant's infringement of their trademarks. The court ordered the destruction of 253 infringing and counterfeit goods seized from the defendant's premises.\n\nThe defendant was also ordered to pay damages of Rs. 5,00,000 to the plaintiffs. Additionally, the plaintiffs were entitled to recover actual costs from the defendant, as per the Commercial Courts Act, 2015, and the Delhi High Court (Original Side) Rules, 2018.\n\nThe court's decision was based on the principles established in the Canadian Supreme Court case of Robert Hryniak, which allows for summary judgment in commercial suits where the defendant lacks a real prospect of successfully defending the claim. The court found that these principles were applicable in this case, given the defendant's lack of a valid defense.\n\nThe PDF document (2023:DHC:2057) provides the full details of the court's decision, including the judgment and order dated March 17, 2023, signed by Amit Bansal, J.",
      "pdf_source": "15. SANDISK LLC vs Excel.pdf",
      "nodes": [
        {
          "title": "Page 7",
          "node_id": "0010",
          "start_index": 7,
          "end_index": 7,
          "summary": "According to page 7 of the PDF \"15. SANDISK LLC vs Excel.pdf\", the court ruled in favor of the plaintiffs, SanDisk LLC, and granted a summary judgment. The court applied principles that allow for summary judgment in commercial suits, even with disputed questions of fact, if the defendant lacks a real prospect of successfully defending the claim. The plaintiffs were entitled to a permanent injunction and decree due to their long usage and goodwill of the SanDisk trademarks. The court decreed the suit in favor of the plaintiffs, granting a permanent injunction and ordering the defendant to hand over seized goods for destruction. The decision was made on March 17, 2023, in the High Court of Delhi (CS(COMM) 992/2018).",
          "content": "2023:DHC:2057 \n \n          CS(COMM) 992/2018                                                                    Page 7 of 8 \n \ntrial in commercial suits, even if there are disputed questions of \nfact as held by the Canadian Supreme Court in Robert \nHryniak (supra), in the event, the Court comes to the conclusion \nthat the defendant lacks a real prospect of successfully \ndefending the claim.” \n \n15. \nThe aforesaid principles are fully applicable in the facts and \ncircumstances of the present case and therefore, the plaintiffs are entitled to \na summary judgment. \n16. \nIn view of the above, the present application is allowed.  \nRELIEF \n17. \nThe various registrations and the long usage of the SanDisk \ntrademarks by the plaintiffs, as also the goodwill vesting in the SanDisk \ntrademarks, entitles the plaintiffs for grant of permanent injunction and \ndecree in terms of the plaint. \n18. \nAccordingly, the present suit is decreed against the defendant in terms \nof the relief of permanent injunction as sought in prayer clauses 41 (a) and \n(b).  \n19. \nInsofar as delivery up for the purpose of destruction, as sought in \nprayer clause 41(c) is concerned, the goods seized by the Local \nCommissioner, which are lying in supardari with the defendant, the details \nof which are given in paragraph 6 of the report dated 20th July, 2018 are \ndirected to be handed to the representatives of the plaintiffs forthwith for the \npurpose of destruction, in compliance with extant rules/regulations. \n20. \nSince the defendant is not appearing any longer and has not rendered \nany accounts of profits, the said relief as sought in prayer clause 41(d) \ncannot be granted.  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:22.03.2023 18:39:48\nSignature Not Verified",
          "pdf_source": "15. SANDISK LLC vs Excel.pdf",
          "nodes": []
        },
        {
          "title": "Page 8",
          "node_id": "0011",
          "start_index": 8,
          "end_index": 8,
          "summary": "According to page 8 of the PDF \"15. SANDISK LLC vs Excel.pdf\", the court found 253 infringing and counterfeit goods at the defendant's premises, with sales of over Rs.29,00,000 since September 2016. The court ruled that the plaintiffs, Sandisk LLC, are entitled to damages of Rs.5,00,000 due to the defendant's counterfeiting. The plaintiffs are also entitled to actual costs recoverable from the defendant, as per the Commercial Courts Act, 2015, and the Delhi High Court rules. The court ordered the plaintiffs to file their bill of costs by March 31, 2023. The decree sheet was to be drawn up, and all pending applications were disposed of. The judgment was delivered by Amit Bansal, J, on March 17, 2023. (Source: 15. SANDISK LLC vs Excel.pdf, 2023:DHC:2057, CS(COMM) 992/2018)",
          "content": "2023:DHC:2057 \n \n          CS(COMM) 992/2018                                                                    Page 8 of 8 \n \n21. \nThe Local Commissioner found a total number of 253 infringing and \ncounterfeit goods at the premises of the defendant, which were inventorized \nby him and seized and handed over on supardari to the defendant. Further, \nthe sale invoices filed by the defendant which go as far back as September, \n2016 reflect total sales of more than Rs.29,00,000. \n22. \nI am convinced that this is not a case of innocent adoption and \ntherefore, the plaintiffs are entitled to damages. Taking a reasonable \nassessment of the volume of seizure made, nature of counterfeiting indulged \ninto by the defendant, in the opinion of the Court, the plaintiffs are entitled \nto damages Rs,5,00,000.  \n23. \nPlaintiffs have also incurred costs for executing the commission and \ndeposited court fees. Thus, in view of the judgment of the Supreme Court in \nUflex v. Government of Tamil Nadu, 2021 SCC OnLine SC 738 as well as \nin terms of the Commercial Courts Act, 2015 and the Delhi High Court \n(Original Side) Rules, 2018 read with Delhi High Court Intellectual Property \nDivision Rules, 2022, the plaintiffs are entitled to actual costs recoverable \nfrom the defendant. Plaintiffs shall file their bill of costs in terms of Rule 5 \nof Chapter XXIII of the Delhi High Court (Original Side) Rules, 2018 on or \nbefore 31st March, 2023. As and when the same is filed, the matter will be \nlisted before the Taxing Officer for computation of the costs. \n24. \nLet the decree sheet be drawn up.  \n25. \nAll pending applications are disposed of in the above terms. \n \n \nAMIT BANSAL, J \nMARCH 17, 2023 \nsr \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:22.03.2023 18:39:48\nSignature Not Verified",
          "pdf_source": "15. SANDISK LLC vs Excel.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-15T18:38:25.344152",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}