{
  "doc_name": "17. Burger King vs. Ranjan Gupta",
  "pdf_source": "17. Burger King vs. Ranjan Gupta.pdf",
  "metadata": {
    "document_name": "17. Burger King vs. Ranjan Gupta",
    "source_pdf": "17. Burger King vs. Ranjan Gupta.pdf",
    "judges": [
      "AMIT BANSAL"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "229/2018",
      "229/2018",
      "229/2018",
      "229/2018",
      "229/2018",
      "229/2018",
      "229/2018",
      "229/2018",
      "229/2018",
      "229/2018",
      "229/2018",
      "229/2018",
      "229/2018",
      "229/2018",
      "229/2018",
      "229/2018",
      "229/2018",
      "16492/2019",
      "10536/2022"
    ],
    "dhc_numbers": [
      "2023/DHC/001661",
      "2023/DHC/001661",
      "2023/DHC/001661",
      "2023/DHC/001661",
      "2023/DHC/001661",
      "2023/DHC/001661",
      "2023/DHC/001661",
      "2023/DHC/001661",
      "2023/DHC/001661",
      "2023/DHC/001661",
      "2023/DHC/001661",
      "2023/DHC/001661",
      "2023/DHC/001661",
      "2023/DHC/001661",
      "2023/DHC/001661",
      "2023/DHC/001661"
    ],
    "ia_numbers": [],
    "decision_date": "22 February, 2023",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      "Burger King Corporation"
    ],
    "defendants": [
      "Ranjan Gupta & Ors"
    ],
    "appellants": [],
    "respondents": [],
    "plaintiff_advocates": [
      "Mr. Raunaq Kamath",
      "Mr. Aditya Gupta",
      "Mr. Mukul Kochhar",
      "Mr. Rajul Bajaj"
    ],
    "defendant_advocates": [
      "Mr. Shailen Bhatia",
      "Mr. Raghav Bhalla",
      "Ms. Sreelakshmi Menon",
      "Mr. Nakul Mehta"
    ],
    "appellant_advocates": [],
    "respondent_advocates": [],
    "damages_claimed": null,
    "damages_awarded": null,
    "key_issues": [
      "The plaintiff is seeking relief of permanent injunction restraining the defendants from infringing their trademark \"BURGER KING\" and its formative marks.",
      "The defendants have raised a defence that the plaintiff's registered trademark \"BURGER KING\" is liable to be cancelled, which needs to be adjudicated by the Court.",
      "The Court needs to determine the prima facie tenability of the plea of invalidity of the registered trademark raised by the defendant.",
      "The Trademarks Act, 1999, provides that the Court shall raise an issue regarding the plea of invalidity of a registered trademark only upon being satisfied that such a plea is prima facie tenable.",
      "The Court has to adjourn the case for a period of three months to enable the concerned party to apply for rectification of the register if the plea of invalidity is found to be prima facie tenable.",
      "The plaintiff has obtained various registrations in respect of its mark \"BURGER KING\" and its formative marks in various classes, which are disputed by the defendants.",
      "The defendants have filed rectification petitions seeking cancellation of the trademark registrations of the plaintiff, which is a key aspect of the case.",
      "The Court has to consider the judgments of the Supreme Court in similar cases, such as Patel Field Marshal Agencies v. P.M. Diesels Ltd, and Abbott Healthcare Pvt. Ltd. v. Raj Kumar Prasad & Anr.",
      "The ex parte ad interim injunction granted in favour of the plaintiff restraining the defendants from using the trademark \"BURGER KING\" or any other deceptively similar mark needs to be confirmed or vacated."
    ],
    "decision_summary": "**Background:**\nThe case involves a trademark infringement dispute between Burger King Corporation (the plaintiff) and Ranjan Gupta & Ors (the defendants). The plaintiff, a well-known international fast-food chain, has obtained various registrations for its trademark \"BURGER KING\" and its formative marks in different classes. The defendants, allegedly using a deceptively similar mark, were restrained by an ex parte ad interim injunction in 2014, which was later confirmed in 2018.\n\n**Legal Issues:**\nThe primary issue before the court was whether the defendants' plea of invalidity of the plaintiff's registered trademark \"BURGER KING\" was prima facie tenable. The defendants claimed that the plaintiff's trademark was liable to be cancelled. The court needed to determine whether the defendants' plea was tenable to decide on the next course of action.\n\n**Arguments:**\nThe plaintiff's counsel argued that:\n\n1. The court should raise an issue regarding the plea of invalidity of a registered trademark only if it is prima facie tenable, as per Section 124(1)(b)(ii) of the Trademarks Act, 1999.\n2. The court must determine the prima facie tenability of the plea to prevent the defendants from instituting rectification proceedings as a counter blast to the infringement actions filed against them.\n3. The defendants had filed 13 rectification petitions seeking cancellation of the plaintiff's trademark registrations, of which four were listed before the court.\n4. The grounds taken by the defendants in their written statement regarding invalidity of the registration of the trademarks of the plaintiff were not tenable.\n\nThe plaintiff's counsel specifically argued that the ground of \"non-use\" of the registered trademark taken by the defendants under Section 47 of the Act was not tenable, as the defendants failed to show that the plaintiff had an intention to abandon the use of their trademark in India.\n\n**Court Findings:**\nAfter hearing submissions from both parties, the court observed that one of the defenses raised by the defendants was that the plaintiff's registered trademark \"BURGER KING\" was liable to be cancelled. The court noted that it was necessary to determine the prima facie tenability of the plea of invalidity to ensure that the defendants did not institute rectification proceedings as a counter blast to the infringement actions filed against them.\n\n**Decision:**\nThe court delivered its judgment on March 6, 2023, after reserving it on February 22, 2023. Although the court's decision is not explicitly stated in the provided text, it is clear that the court was tasked with determining whether the defendants' plea of invalidity of the plaintiff's registered trademark was prima facie tenable. The court's decision would likely depend on its assessment of the defendants' grounds for challenging the validity of the plaintiff's trademark, including the ground of \"non-use\" under Section 47 of the Act.\n\nGiven the plaintiff's arguments and the court's observations, it is likely that the court would find that the defendants' plea of invalidity was not prima facie tenable, and therefore, the plaintiff's trademark \"BURGER KING\" would remain valid. However, a definitive conclusion cannot be drawn without the full text of the court's decision.",
    "legal_precedents": [
      "(2003) 11 \nSCC 92",
      "Industries Private Limited Kurlon Limited",
      "(2018) 2 SCC 112"
    ],
    "full_text": "\n--- PAGE 1 ---\n2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 1 of 16 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n \n% \n \n \n \nJudgment reserved on   : 22nd February, 2023 \n \n \n \n \nJudgment delivered on : 6th March, 2023 \n \n+ \n \n \nCS(COMM) 229/2018  \n \n \nBURGER KING CORPORATION \n \n \n..... Plaintiff \nThrough: \nMr. \nRaunaq \nKamath, \nMr.Aditya \nGupta, Mr. Mukul Kochhar and \nMr.Rajul Bajaj, Advocates. \n \n \n \n \nversus \n \n \nRANJAN GUPTA & ORS \n \n \n \n..... Defendants \nThrough: \nMr. \nShailen \nBhatia, \nMr.Raghav \nBhalla, Ms. Sreelakshmi Menon and \nMr.Nakul Mehta, Advocates. \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \n \n \n \n \nJUDGMENT \n \n1. \nThe present suit has been filed on behalf of the plaintiff seeking relief \nof permanent injunction restraining the defendants from infringing \nplaintiff‟s trademark „BURGER KING‟ and its formative marks, passing off \ntheir goods as that of the plaintiff along with other ancillary reliefs. \n2. \nThe plaintiff has obtained various registrations in respect of its mark \n„BURGER KING‟ and its formative marks in various classes. Details of the \nregistration of the said marks are given in Annexure A annexed to the plaint. \n3. \nVide order dated 25th July, 2014, an ex parte ad interim injunction \nwas granted in favour of the plaintiff restraining the defendants from using \nthe trademark „BURGER KING‟ or any other deceptively similar mark. \nSubsequently, vide order dated 24th September, 2018, the aforesaid interim \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified\n\n--- PAGE 2 ---\n2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 2 of 16 \n \norder was confirmed till the final adjudication of the present suit. Appeal is \nstated to have been filed on behalf of the defendant, which is pending before \nthe Division Bench of this Court. \n4. \nIt was noted in the order dated 18th February, 2020 passed in the suit \nthat one of the defences raised by the defendants in their written statement is \nthat the plaintiff‟s registered trademark „BURGER KING‟ is liable to be \ncancelled. It was observed that the first question that is required to be \nadjudicated in the present case is whether the case of the defendants on this \naccount is prima facie tenable.  \n5. \nSubmissions on behalf of the parties on the aforesaid aspect were \nheard on 16th January, 2023, 24th January, 2023 and 22nd February, 2023.  \n6. \nCounsel appearing for the plaintiff has made the following \nsubmissions:  \nI. \nIn terms of Section 124(1)(b)(ii) of the Trademarks Act, 1999 \n(hereinafter „Act‟), the Court shall raise an issue regarding the plea of \ninvalidity of a registered trademark only upon being satisfied that \nsuch a plea is prima facie tenable. From the date of framing of the \nsaid issue, the Court shall adjourn the case for a period of three \nmonths in order to enable the concerned party to apply for \nrectification of the register.  \nII. \nIt is necessary for the Court to determine the prima facie tenability of \nthe plea of invalidity of the registered trademark raised by the \ndefendant in order to ensure that the defendants do not institute \nrectification proceedings as a counter blast to the infringement actions \nfiled against them. Reliance in this regard is placed on the judgments \nof the Supreme Court in Patel Field Marshal Agencies v. P.M. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified\n\n--- PAGE 3 ---\n2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 3 of 16 \n \nDiesels Ltd, (2018) 2 SCC 112 and Abbott Healthcare Pvt. Ltd. v. \nRaj Kumar Prasad & Anr., 2018 SCC OnLine Del 6657. \nIII. \nA total of 13 rectification petitions have been filed on behalf of the \ndefendants seeking cancellation of the trademark registrations of the \nplaintiff, of which four are listed before this Court today. The \nremaining nine were filed before different benches of Intellectual \nProperty Appellate Board (IPAB) and are liable to be transferred \nbefore different High Courts after coming into effect of the Tribunals \nReforms Act, 2021. \nIV. \nThe grounds taken by the defendants in their written statement with \nregard to invalidity of the registration of the trademarks of the \nplaintiff are not tenable at all. The ground of „non-use‟ of the \nregistered trademark of the plaintiff taken by the defendants under \nSection 47 of the Act, is not tenable as the defendants have failed to \nshow that the plaintiff had an intention to abandon the use of their \ntrademark in India. Reliance in this regard is placed on Hardie \nTrading Ltd. & Anr. v. Addissons Paint & Chemical Ltd., (2003) 11 \nSCC 92, and Express Bottlers Services Private Ltd. v. Pepsico Inc. & \nOrs., 1988 SCC OnLine Cal 62. \nV. \nPrior to the launch of BURGER KING restaurant in India in \nNovember, 2014, the plaintiff had taken various steps towards the \nlaunch of the said restaurant in India, which would constitute „use‟ \nunder Section 47 of the Act. \nVI. \nThe defendants are estopped from taking the defence that the \ntrademark „BURGER KING‟ is generic and common to the trade and \nhence, cannot be registered as a trademark, as the defendants \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified\n\n--- PAGE 4 ---\n2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 4 of 16 \n \nthemselves have applied for registration of the said trademark. \nReliance in this regard is placed on the judgments of the Division \nBench of this Court in Indian Hotels Company Limited & Anr. v. \nJiva Institute of Vedic Science & Culture, 2008 SCC OnLine Del \n1758 and PEPS Industries Private Limited v. Kurlon Limited, 2022 \nSCC OnLine 3275. \nVII. The plaintiff has used the trademark „BURGER KING‟ since 1954 \nand the said mark has acquired secondary meaning and is exclusively \nassociated with the plaintiff. Further, the plaintiff has obtained \nregistrations of the trademark „BURGER KING‟ in over 122 \ncountries. \n7. \nCounsel appearing for the defendants has made the following \nsubmissions: \nI. \nThe defendant no.2 through its predecessor adopted the trademark \nBURGER KING in the year 1970. Since then the defendants have \nextensively used the said mark in respect of their business.  \nII. \nThe plaintiff has no exclusive right in the word „BURGER‟ as the \nsame is generic and common to trade and the word „KING‟ is \nlaudatory. Two generic/laudatory words cannot create a distinctive \ntrademark. Therefore, the trademark „BURGER KING‟ cannot be \nregistered. Reliance in this regard is placed on the judgment in \nNational Bell Co. v. Gupta Industrial Corporation, 1970 (3) SCC \n665.  \nIII. \nThe registrations of the plaintiff are liable to be rectified on various \ngrounds including on the ground of „non-user‟ under Section 47 of the \nAct. It has been averred by the plaintiff in paragraph 17 of the plaint \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified\n\n--- PAGE 5 ---\n2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 5 of 16 \n \nthat the plaintiff was not using the said trademark in India at the time \nof filing of the present suit.  \nIV. \nThe rectification petitions have been filed by the defendants in \nNovember, 2014 and therefore, the relevant period of five years to be \nconsidered in terms of Section 47 (1) (b) of the Act would commence \nfrom three months before the date of filing of the aforesaid \nrectification petitions, i.e., August, 2009 to August, 2014. In the said \nperiod, the plaintiff has failed to give evidence of its user of the \ntrademark BURGER KING in India. \nV. \n  The issues with regard to the invalidity of the plaintiff‟s trademarks \narise out of the pleadings and therefore, the said issue has to be \nframed in terms of Order XIV of the Code of Civil Procedure, 1908 \n(CPC) as well as Section 124 of the Act. Reliance in this regard is \nplaced on the judgment in Abbott Healthcare (supra).  \nVI. \nThe judgments cited on behalf of the plaintiff are distinguishable on \nfacts and therefore, not applicable to the present case. \n8. \nI have heard the counsels for the parties. \n9. \nAt the outset, a reference may be made to the relevant portion of \nSection 124 of the Act, which is set out below:  \n“124. Stay of proceedings where the validity of registration \nof the trade mark is questioned, etc.—(1) Where in any suit \nfor infringement of a trade mark—  \n \n(a) the defendant pleads that registration of the plaintiff’s \ntrade mark is invalid; or \n  \n(b) the defendant raises a defence under clause (e) of sub-\nsection (2) of section 30 and the plaintiff pleads the invalidity \nof registration of the defendant’s trade mark, \n  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified\n\n--- PAGE 6 ---\n2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 6 of 16 \n \nthe court trying the suit (hereinafter referred to as the court), \nshall,—  \n \n(i) if any proceedings for rectification of the register in \nrelation to the plaintiff’s or defendant’s trade mark are \npending before the Registrar or the [High Court], stay the suit \npending the final disposal of such proceedings; \n  \n(ii) if no such proceedings are pending and the court is \nsatisfied that the plea regarding the invalidity of the \nregistration of the plaintiff’s or defendant’s trade mark is \nprima facie tenable, raise an issue regarding the same and \nadjourn the case for a period of three months from the date \nof the framing of the issue in order to enable the party \nconcerned to apply to the [High Court] for rectification of \nthe register. \n  \n(2) If the party concerned proves to the court that he has made \nany such application as is referred to in clause (b) (ii) of sub-\nsection (1) within the time specified therein or within such \nextended time as the court may for sufficient cause allow, the \ntrial of the suit shall stand stayed until the final disposal of the \nrectification proceedings.” \n \n10. \nSub clause (a) of Sub Section (1) of Section 124 of the Act deals with \nthe situation where a defendant pleads that the registration of the plaintiff‟s \ntrademark is invalid, as in the present case. Sub clause (b) (i) envisages a \nsituation where the rectification proceedings are pending on the date of \nfiling of the suit, which is not the situation in the present case. Sub clause (b) \n(ii) deals with the situation where the rectification proceedings have been \nfiled subsequent to the filing of the suit and therefore, this sub clause would \nbe applicable in the present case as admittedly, the rectification proceedings \nwere filed on behalf of the defendants after filing of the present suit. \n11. \nA perusal of sub clause (b) (ii) of Section 124(1) of the Act shows that \nthe Court has to be satisfied that the plea regarding the invalidity of \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified\n\n--- PAGE 7 ---\n2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 7 of 16 \n \nregistration of the trademark is prima facie tenable. Thereupon, the Court \nmay raise an issue regarding the same and adjourn the case for a period of \nthree months from the date of framing of the said issue to enable the \nconcerned party to apply for rectification of the register. It is significant to \nnote that there is no “or” between the words “prima facie tenable” and \n“raise an issue regarding the same”. In fact, the aforesaid phrases are \nseparated by “,” which means that the Court will proceed to frame the issue \nwith regard to invalidity of the registration of the trademark only upon being \nsatisfied that the plea of invalidity is prima facie tenable. Thereupon, the \ndefendant can file a rectification petition. \n12. \nI am in agreement with the submission of the plaintiff that the finding \nof prima facie tenability is a statutory safeguard to ensure that the \ndefendants do not file rectification proceedings as a counter blast to the \ninfringement actions against them, unless their plea of invalidity is prima \nfacie tenable. If this were not so, the defendants would be permitted to \nchallenge the registrations of the plaintiff by filing rectification petitions on \nfrivolous and untenable grounds. It is for this reason that the legislature has \nplaced the safeguard of prima facie tenability in cases where the rectification \nproceedings are filed after a suit for infringement has been filed, whereas no \nsuch safeguard is there in cases where rectification proceedings have been \nfiled before the suit. \n13. \nIn Patel Field Marshal (supra), the Supreme Court observed that \nwhere a civil suit is pending, the jurisdiction can be exercised by a statutory \nauthority only on account of finding of the Civil Court as regards the prima \nfacie tenability of the plea of invalidity. It was further observed that such a \nfinding is a basic requirement so that false, frivolous and untenable claims of \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified\n\n--- PAGE 8 ---\n2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 8 of 16 \n \ninvalidity are not raised. \n14. \nIn Abbott Healthcare (supra), relying upon Patel Field Marshal \n(supra), a Coordinate Bench of this Court observed that mere pleading of \ninvalidity of registration would not suffice and there is a further requirement \nunder Section 124 of the Act that the party invoking Section 124 must \nsatisfy the Court that the plea regarding invalidity of the registration of the \nmark is prima facie tenable and the Court raises an issue regarding the same. \nIt was further observed that under Order XIV Rule 1 of the CPC, issues have \nto be framed on the basis of material propositions of fact or law and not on \nall propositions of fact or law raised in the pleadings. A reading of Section \n124 of the Act along with Order XIV Rule 1 of CPC shows that an issue \nwith regard to validity of the registration granted in favour of the plaintiff \ncan only be framed, when the plea to the said effect taken by the defendant \nis found prima facie tenable. Therefore, I do not find merit in the submission \nof the defendant that merely because pleadings have been made in the \nwritten statement with regard to invalidity of the plaintiff‟s trademark, an \nissue has to be necessarily framed in this regard. \n15. \nIn light of the principles of law elucidated in the aforesaid judgments, \nthis Court would have to examine whether the plea of invalidity raised on \nbehalf of the defendants is prima facie tenable or not. \n16. \n The first ground of invalidity taken by the defendants is in terms of \nSections 47(1)(b) and 47(3) of the Act. For ease of reference, Sections \n47(1)(b) and 47(3) are set out below: \n“47. Removal from register and imposition of limitations on \nground of non-use- (1) A registered trade mark may be taken \noff the register in respect of the goods or services in respect of \nwhich it is registered on application made in the prescribed \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified\n\n--- PAGE 9 ---\n2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 9 of 16 \n \nmanner to the Registrar or the [High Court] by any person \naggrieved on the ground either—.... \n  \n(a)… \n(b) that up to a date three months before the date of the \napplication, a continuous period of five years from the date \non which the trade mark is actually entered in the register or \nlonger had elapsed during which the trade mark was \nregistered and during which there was no bona fide use \nthereof in relation to those goods or services by any \nproprietor thereof for the time being: \n  \nXXX  \n \n \nXXX  \n \n \nXXX \n \n(3) An applicant shall not be entitled to rely for the purpose \nof clause (b) of sub-section (1) or for the purposes of sub-\nsection (2) on any non-use of a trade mark which is shown to \nhave been due to special circumstances in the trade, which \nincludes restrictions on the use of the trade mark in India \nimposed by any law or regulation and not to any intention to \nabandon or not to use the trade mark in relation to the goods \nor services to which the application relates.” \n \n17. \nSection 47(1)(b) of the Act provides that a registered trademark may \nbe removed from the register of trademarks if up to a date of three months \nbefore the date of cancellation application, a continuous period of five years \nor longer has elapsed from the date on which the trademark was entered in \nthe register and during which period, there was no bonafide use of the mark \nby the registered proprietor in relation to the said goods. Section 47(3) \ncontains an exception to Section 47(1)(b) and provides that if the „non-use‟ \nof a trademark is on account of special circumstances and not on account of \nintention to abandon or not to use the trademark, the provisions of Section \n47(1)(b) will not apply. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified\n\n--- PAGE 10 ---\n2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 10 of 16 \n \n18. \nThe aforesaid provisions were considered by the Supreme Court in \nHardie (supra) in the context of Sections 46(1)(b)1 and 46(3)2 of the \nTrademark Act, 1958 (hereinafter „old Act‟), which is pari materia with the \nprovisions of Section 47(1)(b) and Section 47(3) of the present Act. In \nHardie (supra), relying upon the definition of „bona fide use thereof in \nrelation to those goods” in Section 2(2)(b) of the old Act, it was observed by \nthe Supreme Court that the „use‟ may be other than physical and it need not \nbe confined to use of the goods or sale of the goods bearing the trademark. It \nwas held that the word „use‟ in Section 46(1)(b) of the old Act may include \nactions other than the actual sale of the goods bearing the trademark in \nquestion in the market. Taking note of the words „any’ and „whatsoever’ \nqualifying the words “other relation” in Section 2(2)(b) of the old Act, it was \nheld that the aforesaid words give a wider meaning to the words “other \n                                                 \n1  46. Removal from register and imposition of limitations on ground of non-\nuse.—(1) Subject to the provisions of Section 47, a registered trade mark may be \ntaken off the register in respect of any of the goods in respect of which it is \nregistered on application made in the prescribed manner to a High Court or to the \nRegistrar by any person aggrieved on the ground…. \nXXX              \n \nXXX                             XXX \n (b) \nthat up to a date one month before the date of the application, a continuous \nperiod of five years or longer had elapsed during which the trade mark was \nregistered and during which there was no bona fide use thereof in relation to those \ngoods by any proprietor thereof for the time being: \n2   46. Removal from register and imposition of limitations on ground of non-\nuse — \n  XXX              \n \nXXX                             XXX \n (3) \nAn applicant shall not be entitled to rely for the purpose of clause (b) of \nsub-section (1) … on any non-use of a trade mark which is shown to have been \ndue to special circumstances in the trade and not to any intention to abandon or \nnot to use the trade mark in relation to the goods to which the application relates. \n \n \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified\n\n--- PAGE 11 ---\n2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 11 of 16 \n \nrelation”. Section 2(2)(b)3 of the old Act is pari materia with Section \n2(2)(c)4 of the present Act. \n19. \nIt was further held in Hardie (supra) that the intention to abandon \ncould not be limited to „special circumstances of the trade‟. The intention to \nabandon is an essential component of „non-use‟ for the purposes of Section \n46(1)(b) of the old Act. Therefore, it has to be proved that there was an \nintention to either abandon or not to use the trademark. \n20. \nIn Express Bottlers (supra), it was held by the Supreme Court that the \n„non-user‟ under Section 46(1)(b) of the Old Act has to be proved by the \napplicant. It was further held that the intention to abandon by the proprietor \nof the mark has to be proved by cogent evidence. To determine whether a \nmark has been abandoned by the proprietor thereof, the surrounding \ncircumstances have to be seen and until the intention to abandon is \nestablished on account of surrounding circumstances, it cannot be stated that \nthe proprietor has decided to abandon the trademark. \n21. \nIn light of the above, it has to be examined whether there has been a \n„non-use‟ of the trademark by the plaintiff in the aforesaid period of five \nyears or an intention to abandon the said trademark. To buttress his \n                                                 \n3 2. Definitions and Interpretations – \n (2) In this Act, unless the context otherwise requires, any reference—  \n xxx                                             xxx                                           xxx \n(b) to the use of a mark in relation to goods shall be construed as a reference to the use of \nthe mark upon, or in any physical or in any other relation whatsoever, to such goods.  \n \n4 2. Definitions and Interpretations –  \n(2) In this Act, unless the context otherwise requires, any reference— \nc) to the use of a mark,—  \n(i) in relation to goods, shall be construed as a reference to the use of the mark upon, or in any \nphysical or in any other relation whatsoever, to such goods;  \n(ii) in relation to services, shall be construed as a reference to the use of the mark as or as part of \nany statement about the availability, provision or performance of such services; \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified\n\n--- PAGE 12 ---\n2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 12 of 16 \n \nsubmission that the trademark „BURGER KING‟ has been used by the \nplaintiff within the aforesaid period of five years and that there has been no \nintention to abandon the trademark, the counsel for the plaintiff has drawn \nattention of the Court to the following documents filed along with the plaint: \ni. \nResolution of Board of Directors of plaintiff company passed in \nOctober, 2013 permitting the use of „BURGER KING‟ trademark as a \npart of the company to be incorporated in India. \nii. \nIncorporation Certificate dated 11th November, 2013 in the name of \n„BURGER KING Private Limited‟ to provide restaurant services in \nIndia. \niii. \nAnnouncement dated 19th November, 2013 on the plaintiff‟s website \nthat it is entering into a joint venture to develop „BURGER KING‟ \nbrand in India and set up BURGER KING Restaurants in India.  \niv. \nVarious newspaper articles of November, 2013 with regard to \nplaintiffs entering into Indian market. \n22. \nCounsel for the defendants has placed reliance on paragraph 17 of the \nplaint to contend that the plaintiff had no intention to use the aforesaid \ntrademark in India at the time of filing of the present suit. Paragraph 17 of \nthe plaint is set out below: \n“17. On account of the inclusion of 'beef in the Plaintiff’s \nburgers, (which in the Indian context would have previously \nmade the conduct of the Plaintiff’s business unviable) the \nPlaintiff had not launched a BURGER KING restaurant in \nIndia. However, owing to globalization and transformation in \nthe Indian development and consequent on conducting \nexhaustive feasibility studies which have indicated the \nreadiness of the Indian market for the Plaintiff’s world-\nrenowned restaurants, in 2013, the Plaintiff has entered into a \nJoint Venture with Everstone Group, a leading private equity \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified\n\n--- PAGE 13 ---\n2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 13 of 16 \n \nand real estate firm in India and South East Asia, to set up a \nsupply chain in India and establish BURGER KING \nrestaurants across the country.” \n \n23. \n A reading of paragraph 17 of the plaint as a whole shows that the \nplaintiff has stated that the plaintiff has not launched BURGER KING \nrestaurant in India till date as plaintiff‟s burgers include beef. However, in \nthe latter part of the said paragraph, it has been stated that on account of \ntransformation of the Indian market, the plaintiff has set up a joint venture in \nIndia to establish BURGER KING restaurants in India. Therefore, the \naforesaid paragraph cannot be read in a manner as sought to be read by the \nthe defendant.   \n24. \nIn Radico Khaitan Ltd. v. M/s. Devans Modern Breweries Ltd., 2019 \nSCC OnLine Del 7483, relying upon Hardie (supra), it was held that the \npre-launch and preparatory activities before the launch of the product \nbearing the trademark would amount to „use‟ under the Act. In this case \nalso, the plaintiff had entered into an agreement for supply of glass bottles in \nrespect of its trademark and other preparatory work was also undertaken by \nthe plaintiff in relation to the use of its trademark. \n25. \nTherefore, in light of the discussion above, I am satisfied that there \nwas „bona fide use‟ on behalf of the plaintiff of the trademark „BURGER \nKING‟ in the relevant period between August, 2009 and August, 2014 and \nthere was no intention on behalf of the plaintiff to abandon the said \ntrademark. It may be relevant to note that as a consequence of the \npreparatory work carried out by the plaintiff, the first BURGER KING \nrestaurant was opened in India on 9th November, 2014 and as on date there \nare more than 300 BURGER KING Restaurants in India. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified\n\n--- PAGE 14 ---\n2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 14 of 16 \n \n26. \nThe other ground taken on behalf of the defendants is that the \ntrademark „BURGER KING‟ being generic and common to trade and hence, \nthe same cannot be registered. To counter the aforesaid submission, the \ncounsel for the plaintiff has drawn attention of the Court to the trademark \napplications filed on behalf of the defendants in respect of the trademark \n„BURGER KING‟ and its formative device marks. He submits that in light \nof the aforesaid, the defendants are estopped from taking the ground of „non-\nregistrability‟. \n27. \nIn Indian Hotels (supra), following the judgment in Automatic \nElectric Limited v. R.K. Dhawan, (1999) 91 PTC 81, the contention of the \nappellant of the trademark „JIVA‟ being descriptive and hence, non-\nregisterable, was rejected by the Court on the ground that the appellant itself \nhad applied for registration of the mark „JIVA‟ as a trademark and therefore, \nit did not lie in the mouth of the appellant to say that the aforesaid mark was \na generic expression.  \n28. \nTo the same effect is the finding of the Division Bench of this Court \nin PEPS Industries (supra), wherein it was observed that when the \ndefendant has sought registration of the same mark as that of the plaintiff \n(‘NO TURN’ in the said case), such a defendant is estopped from raising a \nquestion on the validity of the said mark on the ground of it being \ndescriptive in nature. \n29. \nIn Sun Pharmaceutical Industries Ltd. v. DWD Pharmaceuticals \nLtd., 2022 SCC OnLine 4015, the contention of the plaintiff therein that the \nmark „ZEST‟ was being used by various third parties and hence, the same is \na publici juris expression, was rejected by the Court on the ground that the \nplaintiff itself had sought and obtained registrations of the same mark and \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified\n\n--- PAGE 15 ---\n2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 15 of 16 \n \ntherefore, it does not lie in the mouth of the plaintiff to state that the word \n„ZEST‟ is a publici juris or a generic expression. \n30. \nA perusal of the trademark applications of the defendants shows that \nthe defendants have themselves sought for registration of the said marks and \ntherefore, in light of the dicta of the aforesaid judgments, the defendants are \nestopped from taking a plea that the trademark BURGER KING is generic \nand common to trade. Therefore, reliance placed on behalf of the defendants \non National Bell (supra) is misplaced.  \n31. \nIn my view, the defendants have failed to place any material in \nsupport of their submission that the trademark „BURGER KING‟ is either \ngeneric or common to trade. It cannot be denied that the plaintiff has used \nthe trademark „BURGER KING‟ since 1954 and holds registrations for the \nsaid mark in over 122 countries including India.  The Division Bench of this \nCourt in M.A.C Personal Care Pvt. Ltd. & Anr. v. Laverana GMBH and \nCo. K.G. & Anr., 2016 SCC OnLine Del 530, observed that the registrations \nof the plaintiff in multiple jurisdictions create an even stronger presumption \nthat the plaintiff‟s trademark has reputation in the market. It was further \nobserved that if a trademark is registered in favour of the plaintiff in a \njurisdiction abroad, the said fact suggests that the mark of the plaintiff is \ndistinctive and hence, the same is capable of distinguishing the plaintiff‟s \ntrademark from those of other businesses.  \n32. \nIn view of the discussion above, I am of the considered view that the \nplea raised by the defendant with regard to the invalidity of registrations \ngranted in favour of the plaintiff in respect of the trademark BURGER \nKING and other formative marks, is prima facie not tenable. There is no \nreasonable prospect of the defendants succeeding in the cancellation \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified\n\n--- PAGE 16 ---\n2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 16 of 16 \n \npetitions filed by them. Therefore, no issue with regard to validity of the \nregistrations of trademarks of the plaintiff is liable to be framed in the facts \nand circumstances of the present case. \n33. \nList on 20th April, 2023. \nI.A. 16492/2019 (u/s 151 of CPC) & I.A. 10536/2022 (seeking \nAmendment of the WS) \n \n34. \nList on 20th April, 2023. \n \n \n \n \n \n \n \n \n \n \n          AMIT BANSAL, J. \nMARCH 06, 2023 \nsr  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified\n"
  },
  "total_pages": 16,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "According to the PDF document \"17. Burger King vs. Ranjan Gupta.pdf\", the High Court of Delhi at New Delhi heard a trademark infringement case, CS(COMM) 229/2018, between Burger King Corporation (Plaintiff) and Ranjan Gupta & Ors (Defendants). The plaintiff sought permanent injunction against the defendants for infringing their trademark \"BURGER KING\" and its formative marks. \n\nThe court reserved judgment on February 22, 2023, and delivered it on March 6, 2023. The plaintiff's advocates, Mr. Raunaq Kamath, Mr. Aditya Gupta, Mr. Mukul Kochhar, and Mr. Rajul Bajaj, argued that the defendants' plea of invalidity of the registered trademark is not prima facie tenable. The defendants' advocates, Mr. Shailen Bhatia, Mr. Raghav Bhalla, Ms. Sreelakshmi Menon, and Mr. Nakul Mehta, raised a defense that the plaintiff's registered trademark \"BURGER KING\" is liable to be cancelled.\n\nThe court observed that an ex parte ad interim injunction was granted in favor of the plaintiff on July 25, 2014, and confirmed on September 24, 2018. The defendants had filed an appeal, which is pending before the Division Bench of the court. The court heard submissions from both parties on January 16, 2023, January 24, 2023, and February 22, 2023, regarding the prima facie tenability of the defendants' plea of invalidity of the registered trademark. (Source: 17. Burger King vs. Ranjan Gupta.pdf, 2023/DHC/001661)",
      "pdf_source": "17. Burger King vs. Ranjan Gupta.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "According to page 1 of the PDF \"17. Burger King vs. Ranjan Gupta.pdf\", a lawsuit (CS(COMM) 229/2018) was filed by Burger King Corporation against Ranjan Gupta and others in the High Court of Delhi. The plaintiff sought a permanent injunction to prevent the defendants from infringing on Burger King's trademark and passing off their goods as the plaintiff's. The court had previously granted an ex parte ad interim injunction on July 25, 2014, and later on September 24, 2018. The judgment was reserved on February 22, 2023, and delivered on March 6, 2023, by Hon'ble Mr. Justice Amit Bansal. The plaintiff was represented by Mr. Raunaq Kamath, Mr. Aditya Gupta, Mr. Mukul Kochhar, and Mr. Rajul Bajaj, while the defendants were represented by Mr. Shailen Bhatia, Mr. Raghav Bhalla, Ms. Sreelakshmi Menon, and Mr. Nakul Mehta. (Source: 17. Burger King vs. Ranjan Gupta.pdf)",
          "content": "2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 1 of 16 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n \n% \n \n \n \nJudgment reserved on   : 22nd February, 2023 \n \n \n \n \nJudgment delivered on : 6th March, 2023 \n \n+ \n \n \nCS(COMM) 229/2018  \n \n \nBURGER KING CORPORATION \n \n \n..... Plaintiff \nThrough: \nMr. \nRaunaq \nKamath, \nMr.Aditya \nGupta, Mr. Mukul Kochhar and \nMr.Rajul Bajaj, Advocates. \n \n \n \n \nversus \n \n \nRANJAN GUPTA & ORS \n \n \n \n..... Defendants \nThrough: \nMr. \nShailen \nBhatia, \nMr.Raghav \nBhalla, Ms. Sreelakshmi Menon and \nMr.Nakul Mehta, Advocates. \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \n \n \n \n \nJUDGMENT \n \n1. \nThe present suit has been filed on behalf of the plaintiff seeking relief \nof permanent injunction restraining the defendants from infringing \nplaintiff‟s trademark „BURGER KING‟ and its formative marks, passing off \ntheir goods as that of the plaintiff along with other ancillary reliefs. \n2. \nThe plaintiff has obtained various registrations in respect of its mark \n„BURGER KING‟ and its formative marks in various classes. Details of the \nregistration of the said marks are given in Annexure A annexed to the plaint. \n3. \nVide order dated 25th July, 2014, an ex parte ad interim injunction \nwas granted in favour of the plaintiff restraining the defendants from using \nthe trademark „BURGER KING‟ or any other deceptively similar mark. \nSubsequently, vide order dated 24th September, 2018, the aforesaid interim \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified",
          "pdf_source": "17. Burger King vs. Ranjan Gupta.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "According to page 2 of the PDF \"17. Burger King vs. Ranjan Gupta.pdf\", the court heard submissions from both parties on January 16, 2023, January 24, 2023, and February 22, 2023. The plaintiff's counsel argued that the court should determine the prima facie tenability of the defendant's plea to invalidate the registered trademark \"BURGER KING\" under Section 124(1)(b)(ii) of the Trademarks Act, 1999. The counsel cited Supreme Court judgments, including Patel Field Marshal Agencies v. P.M., to support the argument that this determination is necessary to prevent defendants from instituting rectification proceedings as a countermeasure to infringement actions. The judgment was reserved on February 22, 2023, and delivered on March 6, 2023. (Source: 2023/DHC/001661, CS(COMM) 229/2018)",
          "content": "2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 2 of 16 \n \norder was confirmed till the final adjudication of the present suit. Appeal is \nstated to have been filed on behalf of the defendant, which is pending before \nthe Division Bench of this Court. \n4. \nIt was noted in the order dated 18th February, 2020 passed in the suit \nthat one of the defences raised by the defendants in their written statement is \nthat the plaintiff‟s registered trademark „BURGER KING‟ is liable to be \ncancelled. It was observed that the first question that is required to be \nadjudicated in the present case is whether the case of the defendants on this \naccount is prima facie tenable.  \n5. \nSubmissions on behalf of the parties on the aforesaid aspect were \nheard on 16th January, 2023, 24th January, 2023 and 22nd February, 2023.  \n6. \nCounsel appearing for the plaintiff has made the following \nsubmissions:  \nI. \nIn terms of Section 124(1)(b)(ii) of the Trademarks Act, 1999 \n(hereinafter „Act‟), the Court shall raise an issue regarding the plea of \ninvalidity of a registered trademark only upon being satisfied that \nsuch a plea is prima facie tenable. From the date of framing of the \nsaid issue, the Court shall adjourn the case for a period of three \nmonths in order to enable the concerned party to apply for \nrectification of the register.  \nII. \nIt is necessary for the Court to determine the prima facie tenability of \nthe plea of invalidity of the registered trademark raised by the \ndefendant in order to ensure that the defendants do not institute \nrectification proceedings as a counter blast to the infringement actions \nfiled against them. Reliance in this regard is placed on the judgments \nof the Supreme Court in Patel Field Marshal Agencies v. P.M. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified",
          "pdf_source": "17. Burger King vs. Ranjan Gupta.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0007",
      "start_index": 3,
      "end_index": 5,
      "summary": "According to the PDF document \"17. Burger King vs. Ranjan Gupta.pdf\", a legal proceeding (CS(COMM) 229/2018) was held in the High Court of Delhi at New Delhi. The plaintiff, Burger King Corporation, was represented by advocates Mr. Raunaq Kamath, Mr. Aditya Gupta, Mr. Mukul Kochhar, and Mr. Rajul Bajaj. The defendant, Ranjan Gupta, filed 13 rectification petitions seeking cancellation of Burger King's trademark registrations.\n\nThe court heard arguments from both parties, with the defendants claiming that the trademark \"BURGER KING\" is generic and common to trade, and therefore cannot be registered. However, the plaintiff argued that they have used the trademark since 1954 and have acquired secondary meaning, making it exclusively associated with them. The plaintiff also pointed out that the defendants had applied for registration of the same trademark, which estops them from claiming it is generic.\n\nThe court considered the grounds of \"non-use\" under Section 47 of the Act, but found that the defendants failed to show that the plaintiff had an intention to abandon the use of their trademark in India. The plaintiff had taken steps towards launching their restaurant in India prior to November 2014, which constitutes \"use\" under the Act. The judgment was reserved on February 22, 2023, and delivered on March 6, 2023. (Source: 2023/DHC/001661, PDF document)",
      "pdf_source": "17. Burger King vs. Ranjan Gupta.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "According to page 3 of the PDF \"17. Burger King vs. Ranjan Gupta.pdf\", the court case CS(COMM) 229/2018 involves Burger King Corporation as the plaintiff and Ranjan Gupta as the defendant. The defendants filed 13 rectification petitions to cancel the plaintiff's trademark registrations, with four being heard in court. The defendants' grounds for invalidity of the registrations were deemed not tenable, including the claim of non-use under Section 47 of the Act. The plaintiff had taken steps to launch their restaurant in India before November 2014, constituting \"use\" under the Act. The court referenced cases such as Hardie Trading Ltd. & Anr. v. Addissons Paint & Chemical Ltd. and Express Bottlers Services Private Ltd. v. Pepsico Inc. & Ors. to support their decision. (Source: 17. Burger King vs. Ranjan Gupta.pdf, 2023/DHC/001661)",
          "content": "2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 3 of 16 \n \nDiesels Ltd, (2018) 2 SCC 112 and Abbott Healthcare Pvt. Ltd. v. \nRaj Kumar Prasad & Anr., 2018 SCC OnLine Del 6657. \nIII. \nA total of 13 rectification petitions have been filed on behalf of the \ndefendants seeking cancellation of the trademark registrations of the \nplaintiff, of which four are listed before this Court today. The \nremaining nine were filed before different benches of Intellectual \nProperty Appellate Board (IPAB) and are liable to be transferred \nbefore different High Courts after coming into effect of the Tribunals \nReforms Act, 2021. \nIV. \nThe grounds taken by the defendants in their written statement with \nregard to invalidity of the registration of the trademarks of the \nplaintiff are not tenable at all. The ground of „non-use‟ of the \nregistered trademark of the plaintiff taken by the defendants under \nSection 47 of the Act, is not tenable as the defendants have failed to \nshow that the plaintiff had an intention to abandon the use of their \ntrademark in India. Reliance in this regard is placed on Hardie \nTrading Ltd. & Anr. v. Addissons Paint & Chemical Ltd., (2003) 11 \nSCC 92, and Express Bottlers Services Private Ltd. v. Pepsico Inc. & \nOrs., 1988 SCC OnLine Cal 62. \nV. \nPrior to the launch of BURGER KING restaurant in India in \nNovember, 2014, the plaintiff had taken various steps towards the \nlaunch of the said restaurant in India, which would constitute „use‟ \nunder Section 47 of the Act. \nVI. \nThe defendants are estopped from taking the defence that the \ntrademark „BURGER KING‟ is generic and common to the trade and \nhence, cannot be registered as a trademark, as the defendants \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified",
          "pdf_source": "17. Burger King vs. Ranjan Gupta.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "According to page 4 of the PDF \"17. Burger King vs. Ranjan Gupta.pdf\", the plaintiff, Burger King Corporation, has used the trademark \"BURGER KING\" since 1954 and has obtained registrations in over 122 countries. The defendant's counsel argued that the plaintiff has no exclusive right to the words \"BURGER\" and \"KING\" as they are generic and laudatory. The defendant also claimed that the plaintiff's registrations are liable to be rectified due to non-user under Section 47 of the Act. The case, CS(COMM) 229/2018, was heard in the High Court of Delhi, with judgment reserved on February 22, 2023, and delivered on March 6, 2023. The plaintiff's counsel relied on judgments in Indian Hotels Company Limited and PEPS Industries Private Limited, while the defendant's counsel cited National Bell Co. v. Gupta Industrial Corporation. (Source: 17. Burger King vs. Ranjan Gupta.pdf)",
          "content": "2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 4 of 16 \n \nthemselves have applied for registration of the said trademark. \nReliance in this regard is placed on the judgments of the Division \nBench of this Court in Indian Hotels Company Limited & Anr. v. \nJiva Institute of Vedic Science & Culture, 2008 SCC OnLine Del \n1758 and PEPS Industries Private Limited v. Kurlon Limited, 2022 \nSCC OnLine 3275. \nVII. The plaintiff has used the trademark „BURGER KING‟ since 1954 \nand the said mark has acquired secondary meaning and is exclusively \nassociated with the plaintiff. Further, the plaintiff has obtained \nregistrations of the trademark „BURGER KING‟ in over 122 \ncountries. \n7. \nCounsel appearing for the defendants has made the following \nsubmissions: \nI. \nThe defendant no.2 through its predecessor adopted the trademark \nBURGER KING in the year 1970. Since then the defendants have \nextensively used the said mark in respect of their business.  \nII. \nThe plaintiff has no exclusive right in the word „BURGER‟ as the \nsame is generic and common to trade and the word „KING‟ is \nlaudatory. Two generic/laudatory words cannot create a distinctive \ntrademark. Therefore, the trademark „BURGER KING‟ cannot be \nregistered. Reliance in this regard is placed on the judgment in \nNational Bell Co. v. Gupta Industrial Corporation, 1970 (3) SCC \n665.  \nIII. \nThe registrations of the plaintiff are liable to be rectified on various \ngrounds including on the ground of „non-user‟ under Section 47 of the \nAct. It has been averred by the plaintiff in paragraph 17 of the plaint \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified",
          "pdf_source": "17. Burger King vs. Ranjan Gupta.pdf",
          "nodes": []
        },
        {
          "title": "Page 5",
          "node_id": "0006",
          "start_index": 5,
          "end_index": 5,
          "summary": "According to page 5 of the PDF \"17. Burger King vs. Ranjan Gupta.pdf\", the court proceedings involve a trademark dispute between Burger King Corporation and Ranjan Gupta. The defendant argues that the plaintiff was not using the trademark \"Burger King\" in India at the time of filing the suit. The relevant period for consideration is August 2009 to August 2014, during which the plaintiff failed to provide evidence of using the trademark in India. The court refers to Section 124 of the Act and the judgment in Abbott Healthcare. The counsels for both parties have been heard, and the court is considering the validity of the plaintiff's trademarks. (Source: 17. Burger King vs. Ranjan Gupta.pdf, 2023/DHC/001661, CS(COMM) 229/2018)",
          "content": "2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 5 of 16 \n \nthat the plaintiff was not using the said trademark in India at the time \nof filing of the present suit.  \nIV. \nThe rectification petitions have been filed by the defendants in \nNovember, 2014 and therefore, the relevant period of five years to be \nconsidered in terms of Section 47 (1) (b) of the Act would commence \nfrom three months before the date of filing of the aforesaid \nrectification petitions, i.e., August, 2009 to August, 2014. In the said \nperiod, the plaintiff has failed to give evidence of its user of the \ntrademark BURGER KING in India. \nV. \n  The issues with regard to the invalidity of the plaintiff‟s trademarks \narise out of the pleadings and therefore, the said issue has to be \nframed in terms of Order XIV of the Code of Civil Procedure, 1908 \n(CPC) as well as Section 124 of the Act. Reliance in this regard is \nplaced on the judgment in Abbott Healthcare (supra).  \nVI. \nThe judgments cited on behalf of the plaintiff are distinguishable on \nfacts and therefore, not applicable to the present case. \n8. \nI have heard the counsels for the parties. \n9. \nAt the outset, a reference may be made to the relevant portion of \nSection 124 of the Act, which is set out below:  \n“124. Stay of proceedings where the validity of registration \nof the trade mark is questioned, etc.—(1) Where in any suit \nfor infringement of a trade mark—  \n \n(a) the defendant pleads that registration of the plaintiff’s \ntrade mark is invalid; or \n  \n(b) the defendant raises a defence under clause (e) of sub-\nsection (2) of section 30 and the plaintiff pleads the invalidity \nof registration of the defendant’s trade mark, \n  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified",
          "pdf_source": "17. Burger King vs. Ranjan Gupta.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0017",
      "start_index": 6,
      "end_index": 14,
      "summary": "According to the PDF document \"17. Burger King vs. Ranjan Gupta.pdf\", a legal case (CS(COMM) 229/2018) was heard in the High Court of Delhi. The plaintiff, Burger King Corporation, was represented by advocates Mr. Raunaq Kamath, Mr. Aditya Gupta, Mr. Mukul Kochhar, and Mr. Rajul Bajaj. The court reserved judgment on February 22, 2023, and delivered it on March 6, 2023.\n\nThe case involved a trademark dispute, and the defendant, Ranjan Gupta, pleaded that the registration of Burger King's trademark was invalid. The court considered Section 124 of the Act, which deals with the situation where a defendant challenges the validity of a plaintiff's trademark registration.\n\nThe court noted that since the rectification proceedings were filed after the suit, Sub clause (b) (ii) of Section 124(1) was applicable. This clause requires the court to be satisfied that the plea regarding the invalidity of the registration is prima facie tenable before raising an issue and adjourning the case.\n\nThe court agreed with the plaintiff's submission that the finding of prima facie tenability is a statutory safeguard to prevent defendants from filing rectification proceedings on frivolous grounds. The court observed that this safeguard is only applicable when rectification proceedings are filed after a suit for infringement has been filed. (Source: 17. Burger King vs. Ranjan Gupta.pdf, pages 6-7)",
      "pdf_source": "17. Burger King vs. Ranjan Gupta.pdf",
      "nodes": [
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "According to page 6 of the PDF \"17. Burger King vs. Ranjan Gupta.pdf\", the court discusses Section 124 of the Act, which deals with the situation where a defendant pleads that the registration of the plaintiff's trademark is invalid. Sub clause (b) (ii) of Section 124(1) is applicable in this case, as the rectification proceedings were filed after the suit. The court must be satisfied that the plea regarding the invalidity of the registration is prima facie tenable. If so, the court will raise an issue and adjourn the case for three months to enable the party to apply for rectification of the register. The trial of the suit will stand stayed until the final disposal of the rectification proceedings. (Source: 17. Burger King vs. Ranjan Gupta.pdf, 2023/DHC/001661, CS(COMM) 229/2018)",
          "content": "2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 6 of 16 \n \nthe court trying the suit (hereinafter referred to as the court), \nshall,—  \n \n(i) if any proceedings for rectification of the register in \nrelation to the plaintiff’s or defendant’s trade mark are \npending before the Registrar or the [High Court], stay the suit \npending the final disposal of such proceedings; \n  \n(ii) if no such proceedings are pending and the court is \nsatisfied that the plea regarding the invalidity of the \nregistration of the plaintiff’s or defendant’s trade mark is \nprima facie tenable, raise an issue regarding the same and \nadjourn the case for a period of three months from the date \nof the framing of the issue in order to enable the party \nconcerned to apply to the [High Court] for rectification of \nthe register. \n  \n(2) If the party concerned proves to the court that he has made \nany such application as is referred to in clause (b) (ii) of sub-\nsection (1) within the time specified therein or within such \nextended time as the court may for sufficient cause allow, the \ntrial of the suit shall stand stayed until the final disposal of the \nrectification proceedings.” \n \n10. \nSub clause (a) of Sub Section (1) of Section 124 of the Act deals with \nthe situation where a defendant pleads that the registration of the plaintiff‟s \ntrademark is invalid, as in the present case. Sub clause (b) (i) envisages a \nsituation where the rectification proceedings are pending on the date of \nfiling of the suit, which is not the situation in the present case. Sub clause (b) \n(ii) deals with the situation where the rectification proceedings have been \nfiled subsequent to the filing of the suit and therefore, this sub clause would \nbe applicable in the present case as admittedly, the rectification proceedings \nwere filed on behalf of the defendants after filing of the present suit. \n11. \nA perusal of sub clause (b) (ii) of Section 124(1) of the Act shows that \nthe Court has to be satisfied that the plea regarding the invalidity of \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified",
          "pdf_source": "17. Burger King vs. Ranjan Gupta.pdf",
          "nodes": []
        },
        {
          "title": "Page 7",
          "node_id": "0009",
          "start_index": 7,
          "end_index": 7,
          "summary": "According to page 7 of the PDF \"17. Burger King vs. Ranjan Gupta.pdf\", the court discusses the concept of prima facie tenability in trademark registration. The court states that if a plea of invalidity is prima facie tenable, it may raise an issue and adjourn the case for three months to allow the concerned party to apply for rectification. The plaintiff argues that the finding of prima facie tenability is a statutory safeguard to prevent defendants from filing rectification proceedings on frivolous grounds. The court agrees, citing the Supreme Court's observation in Patel Field Marshal that a finding of prima facie tenability is a basic requirement to prevent false and untenable claims. The case, CS(COMM) 229/2018, involves Burger King Corporation as the plaintiff and Ranjan Gupta as the defendant, with judgment reserved on February 22, 2023, and delivered on March 6, 2023. (Source: 17. Burger King vs. Ranjan Gupta.pdf)",
          "content": "2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 7 of 16 \n \nregistration of the trademark is prima facie tenable. Thereupon, the Court \nmay raise an issue regarding the same and adjourn the case for a period of \nthree months from the date of framing of the said issue to enable the \nconcerned party to apply for rectification of the register. It is significant to \nnote that there is no “or” between the words “prima facie tenable” and \n“raise an issue regarding the same”. In fact, the aforesaid phrases are \nseparated by “,” which means that the Court will proceed to frame the issue \nwith regard to invalidity of the registration of the trademark only upon being \nsatisfied that the plea of invalidity is prima facie tenable. Thereupon, the \ndefendant can file a rectification petition. \n12. \nI am in agreement with the submission of the plaintiff that the finding \nof prima facie tenability is a statutory safeguard to ensure that the \ndefendants do not file rectification proceedings as a counter blast to the \ninfringement actions against them, unless their plea of invalidity is prima \nfacie tenable. If this were not so, the defendants would be permitted to \nchallenge the registrations of the plaintiff by filing rectification petitions on \nfrivolous and untenable grounds. It is for this reason that the legislature has \nplaced the safeguard of prima facie tenability in cases where the rectification \nproceedings are filed after a suit for infringement has been filed, whereas no \nsuch safeguard is there in cases where rectification proceedings have been \nfiled before the suit. \n13. \nIn Patel Field Marshal (supra), the Supreme Court observed that \nwhere a civil suit is pending, the jurisdiction can be exercised by a statutory \nauthority only on account of finding of the Civil Court as regards the prima \nfacie tenability of the plea of invalidity. It was further observed that such a \nfinding is a basic requirement so that false, frivolous and untenable claims of \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified",
          "pdf_source": "17. Burger King vs. Ranjan Gupta.pdf",
          "nodes": []
        },
        {
          "title": "Page 8",
          "node_id": "0010",
          "start_index": 8,
          "end_index": 8,
          "summary": "According to page 8 of the PDF \"17. Burger King vs. Ranjan Gupta.pdf\", the court discusses the invalidity of the plaintiff's trademark registration. The defendant's plea of invalidity must be prima facie tenable for an issue to be framed under Section 124 of the Act and Order XIV Rule 1 of the CPC. The court refers to the judgments in Abbott Healthcare and Patel Field Marshal, which state that mere pleading of invalidity is not sufficient. The defendant's first ground of invalidity is based on Sections 47(1)(b) and 47(3) of the Act, regarding removal from the register due to non-use. The court will examine whether this plea is prima facie tenable. (Source: 2023/DHC/001661, CS(COMM) 229/2018, Page 8 of 16)",
          "content": "2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 8 of 16 \n \ninvalidity are not raised. \n14. \nIn Abbott Healthcare (supra), relying upon Patel Field Marshal \n(supra), a Coordinate Bench of this Court observed that mere pleading of \ninvalidity of registration would not suffice and there is a further requirement \nunder Section 124 of the Act that the party invoking Section 124 must \nsatisfy the Court that the plea regarding invalidity of the registration of the \nmark is prima facie tenable and the Court raises an issue regarding the same. \nIt was further observed that under Order XIV Rule 1 of the CPC, issues have \nto be framed on the basis of material propositions of fact or law and not on \nall propositions of fact or law raised in the pleadings. A reading of Section \n124 of the Act along with Order XIV Rule 1 of CPC shows that an issue \nwith regard to validity of the registration granted in favour of the plaintiff \ncan only be framed, when the plea to the said effect taken by the defendant \nis found prima facie tenable. Therefore, I do not find merit in the submission \nof the defendant that merely because pleadings have been made in the \nwritten statement with regard to invalidity of the plaintiff‟s trademark, an \nissue has to be necessarily framed in this regard. \n15. \nIn light of the principles of law elucidated in the aforesaid judgments, \nthis Court would have to examine whether the plea of invalidity raised on \nbehalf of the defendants is prima facie tenable or not. \n16. \n The first ground of invalidity taken by the defendants is in terms of \nSections 47(1)(b) and 47(3) of the Act. For ease of reference, Sections \n47(1)(b) and 47(3) are set out below: \n“47. Removal from register and imposition of limitations on \nground of non-use- (1) A registered trade mark may be taken \noff the register in respect of the goods or services in respect of \nwhich it is registered on application made in the prescribed \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified",
          "pdf_source": "17. Burger King vs. Ranjan Gupta.pdf",
          "nodes": []
        },
        {
          "title": "Page 9",
          "node_id": "0011",
          "start_index": 9,
          "end_index": 9,
          "summary": "According to page 9 of the PDF \"17. Burger King vs. Ranjan Gupta.pdf\", Section 47(1)(b) of the Act states that a registered trademark can be removed if there's no bonafide use for 5 years or longer. However, Section 47(3) provides an exception if non-use is due to special circumstances, not intention to abandon. The case CS(COMM) 229/2018, Burger King Corporation vs. Ranjan Gupta, was judged in the High Court of Delhi, with judgment reserved on February 22, 2023, and delivered on March 6, 2023. The plaintiff was represented by advocates Raunaq Kamath, Aditya Gupta, Mukul Kochhar, and Rajul Bajaj. The document was digitally signed by Amit Bansal on March 6, 2023. (Source: 17. Burger King vs. Ranjan Gupta.pdf, page 9)",
          "content": "2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 9 of 16 \n \nmanner to the Registrar or the [High Court] by any person \naggrieved on the ground either—.... \n  \n(a)… \n(b) that up to a date three months before the date of the \napplication, a continuous period of five years from the date \non which the trade mark is actually entered in the register or \nlonger had elapsed during which the trade mark was \nregistered and during which there was no bona fide use \nthereof in relation to those goods or services by any \nproprietor thereof for the time being: \n  \nXXX  \n \n \nXXX  \n \n \nXXX \n \n(3) An applicant shall not be entitled to rely for the purpose \nof clause (b) of sub-section (1) or for the purposes of sub-\nsection (2) on any non-use of a trade mark which is shown to \nhave been due to special circumstances in the trade, which \nincludes restrictions on the use of the trade mark in India \nimposed by any law or regulation and not to any intention to \nabandon or not to use the trade mark in relation to the goods \nor services to which the application relates.” \n \n17. \nSection 47(1)(b) of the Act provides that a registered trademark may \nbe removed from the register of trademarks if up to a date of three months \nbefore the date of cancellation application, a continuous period of five years \nor longer has elapsed from the date on which the trademark was entered in \nthe register and during which period, there was no bonafide use of the mark \nby the registered proprietor in relation to the said goods. Section 47(3) \ncontains an exception to Section 47(1)(b) and provides that if the „non-use‟ \nof a trademark is on account of special circumstances and not on account of \nintention to abandon or not to use the trademark, the provisions of Section \n47(1)(b) will not apply. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified",
          "pdf_source": "17. Burger King vs. Ranjan Gupta.pdf",
          "nodes": []
        },
        {
          "title": "Page 10",
          "node_id": "0012",
          "start_index": 10,
          "end_index": 10,
          "summary": "According to page 10 of the PDF \"17. Burger King vs. Ranjan Gupta.pdf\", the Supreme Court in Hardie (supra) considered provisions related to non-use of trademarks. The court observed that \"use\" may not be limited to physical use or sale of goods bearing the trademark. The word \"use\" in Section 46(1)(b) of the old Act may include actions other than actual sale. The court also noted that special circumstances in the trade can justify non-use of a trademark, as stated in Section 46(3). This case, CS(COMM) 229/2018, involves Burger King Corporation as the plaintiff, with judgment reserved on February 22, 2023, and delivered on March 6, 2023. (Source: 2023/DHC/001661, PDF \"17. Burger King vs. Ranjan Gupta.pdf\", page 10)",
          "content": "2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 10 of 16 \n \n18. \nThe aforesaid provisions were considered by the Supreme Court in \nHardie (supra) in the context of Sections 46(1)(b)1 and 46(3)2 of the \nTrademark Act, 1958 (hereinafter „old Act‟), which is pari materia with the \nprovisions of Section 47(1)(b) and Section 47(3) of the present Act. In \nHardie (supra), relying upon the definition of „bona fide use thereof in \nrelation to those goods” in Section 2(2)(b) of the old Act, it was observed by \nthe Supreme Court that the „use‟ may be other than physical and it need not \nbe confined to use of the goods or sale of the goods bearing the trademark. It \nwas held that the word „use‟ in Section 46(1)(b) of the old Act may include \nactions other than the actual sale of the goods bearing the trademark in \nquestion in the market. Taking note of the words „any’ and „whatsoever’ \nqualifying the words “other relation” in Section 2(2)(b) of the old Act, it was \nheld that the aforesaid words give a wider meaning to the words “other \n                                                 \n1  46. Removal from register and imposition of limitations on ground of non-\nuse.—(1) Subject to the provisions of Section 47, a registered trade mark may be \ntaken off the register in respect of any of the goods in respect of which it is \nregistered on application made in the prescribed manner to a High Court or to the \nRegistrar by any person aggrieved on the ground…. \nXXX              \n \nXXX                             XXX \n (b) \nthat up to a date one month before the date of the application, a continuous \nperiod of five years or longer had elapsed during which the trade mark was \nregistered and during which there was no bona fide use thereof in relation to those \ngoods by any proprietor thereof for the time being: \n2   46. Removal from register and imposition of limitations on ground of non-\nuse — \n  XXX              \n \nXXX                             XXX \n (3) \nAn applicant shall not be entitled to rely for the purpose of clause (b) of \nsub-section (1) … on any non-use of a trade mark which is shown to have been \ndue to special circumstances in the trade and not to any intention to abandon or \nnot to use the trade mark in relation to the goods to which the application relates. \n \n \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified",
          "pdf_source": "17. Burger King vs. Ranjan Gupta.pdf",
          "nodes": []
        },
        {
          "title": "Page 11",
          "node_id": "0013",
          "start_index": 11,
          "end_index": 11,
          "summary": "According to page 11 of the PDF \"17. Burger King vs. Ranjan Gupta.pdf\", the court discusses the concept of \"non-use\" of a trademark under Section 46(1)(b) of the old Act. It references the Hardie and Express Bottlers cases, which held that the intention to abandon a trademark must be proved by cogent evidence, considering surrounding circumstances. The court must examine if there was \"non-use\" of the trademark by the plaintiff, Burger King Corporation, over a five-year period or an intention to abandon it. The case, CS(COMM) 229/2018, was heard in the High Court of Delhi, with judgment reserved on February 22, 2023, and delivered on March 6, 2023. (Source: 17. Burger King vs. Ranjan Gupta.pdf, page 11)",
          "content": "2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 11 of 16 \n \nrelation”. Section 2(2)(b)3 of the old Act is pari materia with Section \n2(2)(c)4 of the present Act. \n19. \nIt was further held in Hardie (supra) that the intention to abandon \ncould not be limited to „special circumstances of the trade‟. The intention to \nabandon is an essential component of „non-use‟ for the purposes of Section \n46(1)(b) of the old Act. Therefore, it has to be proved that there was an \nintention to either abandon or not to use the trademark. \n20. \nIn Express Bottlers (supra), it was held by the Supreme Court that the \n„non-user‟ under Section 46(1)(b) of the Old Act has to be proved by the \napplicant. It was further held that the intention to abandon by the proprietor \nof the mark has to be proved by cogent evidence. To determine whether a \nmark has been abandoned by the proprietor thereof, the surrounding \ncircumstances have to be seen and until the intention to abandon is \nestablished on account of surrounding circumstances, it cannot be stated that \nthe proprietor has decided to abandon the trademark. \n21. \nIn light of the above, it has to be examined whether there has been a \n„non-use‟ of the trademark by the plaintiff in the aforesaid period of five \nyears or an intention to abandon the said trademark. To buttress his \n                                                 \n3 2. Definitions and Interpretations – \n (2) In this Act, unless the context otherwise requires, any reference—  \n xxx                                             xxx                                           xxx \n(b) to the use of a mark in relation to goods shall be construed as a reference to the use of \nthe mark upon, or in any physical or in any other relation whatsoever, to such goods.  \n \n4 2. Definitions and Interpretations –  \n(2) In this Act, unless the context otherwise requires, any reference— \nc) to the use of a mark,—  \n(i) in relation to goods, shall be construed as a reference to the use of the mark upon, or in any \nphysical or in any other relation whatsoever, to such goods;  \n(ii) in relation to services, shall be construed as a reference to the use of the mark as or as part of \nany statement about the availability, provision or performance of such services; \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified",
          "pdf_source": "17. Burger King vs. Ranjan Gupta.pdf",
          "nodes": []
        },
        {
          "title": "Page 12",
          "node_id": "0014",
          "start_index": 12,
          "end_index": 12,
          "summary": "According to page 12 of the PDF \"17. Burger King vs. Ranjan Gupta.pdf\", the plaintiff, Burger King Corporation, submitted documents to prove the use of the trademark \"BURGER KING\" within the five-year period. These documents include a board resolution (2013), incorporation certificate (November 11, 2013), and a joint venture announcement (November 19, 2013). The defendant's counsel relied on paragraph 17 of the plaint, stating that the plaintiff had no intention to use the trademark in India due to the inclusion of beef in their burgers. However, the plaintiff countered that they had entered into a joint venture in 2013 after conducting feasibility studies, indicating the Indian market's readiness for their restaurants. The case, CS(COMM) 229/2018, was heard in the High Court of Delhi, with judgment reserved on February 22, 2023, and delivered on March 6, 2023. (Source: 17. Burger King vs. Ranjan Gupta.pdf)",
          "content": "2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 12 of 16 \n \nsubmission that the trademark „BURGER KING‟ has been used by the \nplaintiff within the aforesaid period of five years and that there has been no \nintention to abandon the trademark, the counsel for the plaintiff has drawn \nattention of the Court to the following documents filed along with the plaint: \ni. \nResolution of Board of Directors of plaintiff company passed in \nOctober, 2013 permitting the use of „BURGER KING‟ trademark as a \npart of the company to be incorporated in India. \nii. \nIncorporation Certificate dated 11th November, 2013 in the name of \n„BURGER KING Private Limited‟ to provide restaurant services in \nIndia. \niii. \nAnnouncement dated 19th November, 2013 on the plaintiff‟s website \nthat it is entering into a joint venture to develop „BURGER KING‟ \nbrand in India and set up BURGER KING Restaurants in India.  \niv. \nVarious newspaper articles of November, 2013 with regard to \nplaintiffs entering into Indian market. \n22. \nCounsel for the defendants has placed reliance on paragraph 17 of the \nplaint to contend that the plaintiff had no intention to use the aforesaid \ntrademark in India at the time of filing of the present suit. Paragraph 17 of \nthe plaint is set out below: \n“17. On account of the inclusion of 'beef in the Plaintiff’s \nburgers, (which in the Indian context would have previously \nmade the conduct of the Plaintiff’s business unviable) the \nPlaintiff had not launched a BURGER KING restaurant in \nIndia. However, owing to globalization and transformation in \nthe Indian development and consequent on conducting \nexhaustive feasibility studies which have indicated the \nreadiness of the Indian market for the Plaintiff’s world-\nrenowned restaurants, in 2013, the Plaintiff has entered into a \nJoint Venture with Everstone Group, a leading private equity \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified",
          "pdf_source": "17. Burger King vs. Ranjan Gupta.pdf",
          "nodes": []
        },
        {
          "title": "Page 13",
          "node_id": "0015",
          "start_index": 13,
          "end_index": 13,
          "summary": "According to page 13 of the PDF \"17. Burger King vs. Ranjan Gupta.pdf\", the court analyzed the plaintiff's (Burger King Corporation) use of the trademark \"BURGER KING\" in India. The plaintiff had not launched restaurants in India until 2014 due to beef being an ingredient in their burgers. However, they had set up a joint venture to establish restaurants in India. The court cited Radico Khaitan Ltd. v. M/s. Devans Modern Breweries Ltd. (2019) to support that pre-launch activities, such as supply agreements and preparatory work, constitute \"use\" under the Act. The court found that Burger King had \"bona fide use\" of the trademark between August 2009 and August 2014, with no intention to abandon it. The first Burger King restaurant in India was opened on November 9, 2014, and over 300 restaurants are now operating in the country. (Source: 17. Burger King vs. Ranjan Gupta.pdf, 2023/DHC/001661, CS(COMM) 229/2018)",
          "content": "2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 13 of 16 \n \nand real estate firm in India and South East Asia, to set up a \nsupply chain in India and establish BURGER KING \nrestaurants across the country.” \n \n23. \n A reading of paragraph 17 of the plaint as a whole shows that the \nplaintiff has stated that the plaintiff has not launched BURGER KING \nrestaurant in India till date as plaintiff‟s burgers include beef. However, in \nthe latter part of the said paragraph, it has been stated that on account of \ntransformation of the Indian market, the plaintiff has set up a joint venture in \nIndia to establish BURGER KING restaurants in India. Therefore, the \naforesaid paragraph cannot be read in a manner as sought to be read by the \nthe defendant.   \n24. \nIn Radico Khaitan Ltd. v. M/s. Devans Modern Breweries Ltd., 2019 \nSCC OnLine Del 7483, relying upon Hardie (supra), it was held that the \npre-launch and preparatory activities before the launch of the product \nbearing the trademark would amount to „use‟ under the Act. In this case \nalso, the plaintiff had entered into an agreement for supply of glass bottles in \nrespect of its trademark and other preparatory work was also undertaken by \nthe plaintiff in relation to the use of its trademark. \n25. \nTherefore, in light of the discussion above, I am satisfied that there \nwas „bona fide use‟ on behalf of the plaintiff of the trademark „BURGER \nKING‟ in the relevant period between August, 2009 and August, 2014 and \nthere was no intention on behalf of the plaintiff to abandon the said \ntrademark. It may be relevant to note that as a consequence of the \npreparatory work carried out by the plaintiff, the first BURGER KING \nrestaurant was opened in India on 9th November, 2014 and as on date there \nare more than 300 BURGER KING Restaurants in India. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified",
          "pdf_source": "17. Burger King vs. Ranjan Gupta.pdf",
          "nodes": []
        },
        {
          "title": "Page 14",
          "node_id": "0016",
          "start_index": 14,
          "end_index": 14,
          "summary": "According to page 14 of the PDF \"17. Burger King vs. Ranjan Gupta.pdf\", the defendants argued that the trademark \"BURGER KING\" is generic and common to trade, making it non-registrable. However, the plaintiff's counsel countered that the defendants had filed trademark applications for the same mark, estopping them from claiming non-registrability. The court cited precedents such as Indian Hotels, Automatic Electric Limited, and PEPS Industries, which held that a party cannot claim a mark is non-registrable if they have applied for its registration. The court also referenced Sun Pharmaceutical Industries Ltd. v. DWD Pharmaceuticals Ltd., where a plaintiff's claim that a mark was publici juris was rejected because they had obtained registrations for the same mark. (Source: 17. Burger King vs. Ranjan Gupta.pdf, 2023/DHC/001661, CS(COMM) 229/2018)",
          "content": "2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 14 of 16 \n \n26. \nThe other ground taken on behalf of the defendants is that the \ntrademark „BURGER KING‟ being generic and common to trade and hence, \nthe same cannot be registered. To counter the aforesaid submission, the \ncounsel for the plaintiff has drawn attention of the Court to the trademark \napplications filed on behalf of the defendants in respect of the trademark \n„BURGER KING‟ and its formative device marks. He submits that in light \nof the aforesaid, the defendants are estopped from taking the ground of „non-\nregistrability‟. \n27. \nIn Indian Hotels (supra), following the judgment in Automatic \nElectric Limited v. R.K. Dhawan, (1999) 91 PTC 81, the contention of the \nappellant of the trademark „JIVA‟ being descriptive and hence, non-\nregisterable, was rejected by the Court on the ground that the appellant itself \nhad applied for registration of the mark „JIVA‟ as a trademark and therefore, \nit did not lie in the mouth of the appellant to say that the aforesaid mark was \na generic expression.  \n28. \nTo the same effect is the finding of the Division Bench of this Court \nin PEPS Industries (supra), wherein it was observed that when the \ndefendant has sought registration of the same mark as that of the plaintiff \n(‘NO TURN’ in the said case), such a defendant is estopped from raising a \nquestion on the validity of the said mark on the ground of it being \ndescriptive in nature. \n29. \nIn Sun Pharmaceutical Industries Ltd. v. DWD Pharmaceuticals \nLtd., 2022 SCC OnLine 4015, the contention of the plaintiff therein that the \nmark „ZEST‟ was being used by various third parties and hence, the same is \na publici juris expression, was rejected by the Court on the ground that the \nplaintiff itself had sought and obtained registrations of the same mark and \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified",
          "pdf_source": "17. Burger King vs. Ranjan Gupta.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0020",
      "start_index": 15,
      "end_index": 16,
      "summary": "According to the PDF document \"Burger King vs. Ranjan Gupta.pdf\" (2023/DHC/001661, CS(COMM) 229/2018), the High Court of Delhi at New Delhi delivered a judgment on March 6, 2023, in a case between Burger King Corporation (plaintiff) and Ranjan Gupta (defendant). The court reserved its judgment on February 22, 2023. \n\nThe plaintiff, represented by advocates Raunaq Kamath, Aditya Gupta, Mukul Kochhar, and Rajul Bajaj, sought to protect its trademark \"BURGER KING.\" The defendant argued that the trademark is generic and common to trade. However, the court found that the defendant's argument was not tenable, as the plaintiff has used the trademark since 1954 and holds registrations in over 122 countries, including India.\n\nThe court observed that the defendant's own trademark applications and the plaintiff's registrations in multiple jurisdictions create a stronger presumption that the plaintiff's trademark has reputation in the market. The court ruled that the plea raised by the defendant regarding the invalidity of the plaintiff's trademark registrations is not liable to be framed. The court listed the matter for April 20, 2023, for further proceedings.\n\nThe judgment, delivered by Judge Amit Bansal, states that the defendant failed to provide material supporting their claim that the trademark \"BURGER KING\" is generic or common to trade. The court's decision is based on the facts and circumstances of the case, as presented in the PDF document.",
      "pdf_source": "17. Burger King vs. Ranjan Gupta.pdf",
      "nodes": [
        {
          "title": "Page 15",
          "node_id": "0018",
          "start_index": 15,
          "end_index": 15,
          "summary": "According to page 15 of the PDF \"17. Burger King vs. Ranjan Gupta.pdf\", the court ruled on the trademark dispute between Burger King Corporation and Ranjan Gupta. The plaintiff, Burger King, has used the trademark \"BURGER KING\" since 1954 and holds registrations in over 122 countries, including India. The court stated that the defendants' argument that the trademark is generic or common to trade is not tenable. The defendants' own trademark applications and the plaintiff's registrations in multiple jurisdictions create a strong presumption of the plaintiff's trademark reputation. The court cited the case of M.A.C Personal Care Pvt. Ltd. & Anr. v. Laverana GMBH and Co. K.G. & Anr. (2016 SCC OnLine Del 530) to support its decision. The judgment was delivered on March 6, 2023, by the High Court of Delhi. (Source: 2023/DHC/001661, CS(COMM) 229/2018)",
          "content": "2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 15 of 16 \n \ntherefore, it does not lie in the mouth of the plaintiff to state that the word \n„ZEST‟ is a publici juris or a generic expression. \n30. \nA perusal of the trademark applications of the defendants shows that \nthe defendants have themselves sought for registration of the said marks and \ntherefore, in light of the dicta of the aforesaid judgments, the defendants are \nestopped from taking a plea that the trademark BURGER KING is generic \nand common to trade. Therefore, reliance placed on behalf of the defendants \non National Bell (supra) is misplaced.  \n31. \nIn my view, the defendants have failed to place any material in \nsupport of their submission that the trademark „BURGER KING‟ is either \ngeneric or common to trade. It cannot be denied that the plaintiff has used \nthe trademark „BURGER KING‟ since 1954 and holds registrations for the \nsaid mark in over 122 countries including India.  The Division Bench of this \nCourt in M.A.C Personal Care Pvt. Ltd. & Anr. v. Laverana GMBH and \nCo. K.G. & Anr., 2016 SCC OnLine Del 530, observed that the registrations \nof the plaintiff in multiple jurisdictions create an even stronger presumption \nthat the plaintiff‟s trademark has reputation in the market. It was further \nobserved that if a trademark is registered in favour of the plaintiff in a \njurisdiction abroad, the said fact suggests that the mark of the plaintiff is \ndistinctive and hence, the same is capable of distinguishing the plaintiff‟s \ntrademark from those of other businesses.  \n32. \nIn view of the discussion above, I am of the considered view that the \nplea raised by the defendant with regard to the invalidity of registrations \ngranted in favour of the plaintiff in respect of the trademark BURGER \nKING and other formative marks, is prima facie not tenable. There is no \nreasonable prospect of the defendants succeeding in the cancellation \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified",
          "pdf_source": "17. Burger King vs. Ranjan Gupta.pdf",
          "nodes": []
        },
        {
          "title": "Page 16",
          "node_id": "0019",
          "start_index": 16,
          "end_index": 16,
          "summary": "According to page 16 of the PDF \"17. Burger King vs. Ranjan Gupta.pdf\", the court ruled that there is no issue with the validity of the plaintiff's (Burger King Corporation) trademark registrations. The court stated that the defendants did not raise any objections to the registrations in their petitions. The matter is listed for further proceedings on April 20, 2023. The court also mentioned two interim applications (I.A. 16492/2019 and I.A. 10536/2022) which are also listed for hearing on the same date. The judgment was delivered by Amit Bansal, J. on March 6, 2023. (Source: 17. Burger King vs. Ranjan Gupta.pdf, page 16)",
          "content": "2023/DHC/001661 \n \nCS(COMM) 229/2018                                                                                     Page 16 of 16 \n \npetitions filed by them. Therefore, no issue with regard to validity of the \nregistrations of trademarks of the plaintiff is liable to be framed in the facts \nand circumstances of the present case. \n33. \nList on 20th April, 2023. \nI.A. 16492/2019 (u/s 151 of CPC) & I.A. 10536/2022 (seeking \nAmendment of the WS) \n \n34. \nList on 20th April, 2023. \n \n \n \n \n \n \n \n \n \n \n          AMIT BANSAL, J. \nMARCH 06, 2023 \nsr  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:06.03.2023 16:14:37\nSignature Not Verified",
          "pdf_source": "17. Burger King vs. Ranjan Gupta.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-15T18:33:02.122741",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}