{
  "doc_name": "18. Bennet Coleman & Co. Ltd vs. ARG Outlier Media Pvt. Ltd & Ors",
  "pdf_source": "18. Bennet Coleman & Co. Ltd vs. ARG Outlier Media Pvt. Ltd & Ors.pdf",
  "metadata": {
    "document_name": "18. Bennet Coleman & Co. Ltd vs. ARG Outlier Media Pvt. Ltd & Ors",
    "source_pdf": "18. Bennet Coleman & Co. Ltd vs. ARG Outlier Media Pvt. Ltd & Ors.pdf",
    "judges": [
      "AMIT BANSAL"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "434/2017",
      "434/2017",
      "434/2017",
      "434/2017",
      "434/2017",
      "434/2017",
      "434/2017",
      "434/2017",
      "1464/2018"
    ],
    "dhc_numbers": [
      "2023/DHC/001726",
      "2023/DHC/001726",
      "2023/DHC/001726",
      "2023/DHC/001726",
      "2023/DHC/001726",
      "2023/DHC/001726"
    ],
    "ia_numbers": [],
    "decision_date": "6 March, 2023",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      "Bennett Coleman & Co. Ltd."
    ],
    "defendants": [
      "ARG Outlier Media Pvt Ltd & Ors."
    ],
    "appellants": [],
    "respondents": [],
    "plaintiff_advocates": [
      "Mr. Hemant Singh",
      "Ms. Mamta Rani Jha",
      "Mr. Shakti Priyan Nair",
      "Ms. Pragya Jain"
    ],
    "defendant_advocates": [
      "Ms. Malvika Trivedi",
      "Mr. Gaurav Dudeja",
      "Ms. Bani Dixit",
      "Mr. Dhruval Singh",
      "Mr. Shailendra Slaria",
      "Ms. Sujal Gupta"
    ],
    "appellant_advocates": [],
    "respondent_advocates": [],
    "damages_claimed": "20,000",
    "damages_awarded": null,
    "key_issues": [
      "Whether the plaintiff is entitled to file additional documents under Order XI Rule 5 of the Code of Civil Procedure, 1908, as applicable to commercial suits under the Commercial Courts Act, 2015.",
      "The relevance of the additional documents sought to be filed by the plaintiff, particularly those related to the existence of defendant no.1, which has already been deleted from the array of parties.",
      "The admissibility of documents that were in the power, possession, control, and custody of the plaintiff at the time of filing the present suit, but were not filed along with the suit.",
      "The contradiction between the stands taken by the defendants in their written statements and in the replies to the examination reports of the Registry, particularly regarding the nature of the trademarks/taglines.",
      "The applicability of Order XI Rule (1) (c)(ii) of the CPC, which allows for the filing of additional documents to demonstrate a contrary stand taken by the opposite party.",
      "The implications of the judgments of the Supreme Court in Sudhir Kumar v. Vinay Kumar and a Co-ordinate Bench of the Delhi High Court in Nitin Gupta v. Taxmaco Infrastructure & Holding Ltd. on the filing of additional documents.",
      "The plaintiff's justification for filing additional documents to demonstrate the existence of defendant no.1, despite the defendant's claim that it was not in existence at the time of filing the suit.",
      "The defendants' contention that there is no contradiction in their stands taken before the Trade Mark Registry and in the written statement filed in the present suit.",
      "The court's discretion in allowing or rejecting the application to file additional documents under Order XI Rule 5 of the CPC.",
      "The potential impact of the court's decision on the admissibility of additional documents on the outcome of the suit, particularly with regard to the plaintiff's claims regarding the trademarks/taglines."
    ],
    "decision_summary": "**Case Summary: Bennett Coleman & Co. Ltd. vs. Arg Outlier Media Pvt Ltd & Ors. (CS(COMM) 434/2017)**\n\n**Background:**\nThe present case is a commercial suit filed by Bennett Coleman & Co. Ltd. (the plaintiff) against Arg Outlier Media Pvt Ltd & Ors. (the defendants) in the High Court of Delhi. The plaintiff has filed an application under Order XI Rule 5 of the Code of Civil Procedure, 1908 (CPC) to place additional documents on record.\n\n**Legal Issues:**\nThe primary issue in this case is whether the plaintiff is entitled to file additional documents, which were not part of the original suit, to counter the arguments raised by the defendants in their written statement. The plaintiff argues that these documents are necessary to demonstrate the existence of the defendant company at the time of filing the suit and to show that the defendants have taken contrary stands on the nature of the trademarks/taglines in question.\n\n**Arguments:**\n\n* The plaintiff argues that the additional documents are necessary to meet the arguments raised by the defendants in their written statement and to demonstrate the existence of the defendant company.\n* The plaintiff relies on Order XI Rule (1) (c)(ii) of the CPC, which allows for the filing of additional documents to prove a fact that is relevant to the case.\n* The defendants argue that the documents are no longer relevant as the defendant company has already been deleted from the array of parties.\n* The defendants also argue that there is no contradiction in their stands on the nature of the trademarks/taglines and that the documents sought to be filed were in the power, possession, control, and custody of the plaintiff at the time of filing the suit.\n\n**Court Findings:**\nThe court has examined the additional documents sought to be placed on record by the plaintiff, which include examination reports of the Registry and responses thereto by the defendants. The court notes that these documents pertain to the defendants and are relevant to the case.\n\n**Decision:**\nThe decision of the court is not explicitly stated in the provided pages. However, based on the arguments and the court's examination of the documents, it can be inferred that the court is likely to allow the plaintiff to file the additional documents, as they appear to be relevant to the case and are necessary to meet the arguments raised by the defendants.\n\n**Relevant Precedents:**\nThe defendants have relied on two judgments: Sudhir Kumar v. Vinay Kumar (2021 SCC OnLine SC 734) and Nitin Gupta v. Taxmaco Infrastructure & Holding Ltd. (2019 SCC OnLine Del 8367). However, the court's consideration of these precedents is not explicitly stated in the provided pages.\n\nOverall, the case highlights the importance of filing relevant documents in a timely manner and the court's discretion in allowing additional documents to be placed on record. The decision of the court will depend on the specific facts and circumstances of the case, as well as the applicable laws and precedents.",
    "legal_precedents": [
      "Sudhir \nKumar Vinay Kumar",
      "Nitin Gupta Taxmaco Infrastructure"
    ],
    "full_text": "\n--- PAGE 1 ---\n2023/DHC/001726 \n \nCS(COMM) 434/2017                                                                                                      Page 1 of 6 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n \n% \n \n \n \n \n \nDate of Decision : 6th March, 2023 \n \n+  \n \n \n \nCS(COMM) 434/2017  \n \n \nBENNETT COLEMAN & CO. LTD.  \n \n..... Plaintiff \nThrough: \nMr. Hemant Singh with Ms. Mamta \nRani Jha, Mr. Shakti Priyan Nair and \nMs. Pragya Jain, Advocates. \n \n \n \n \n \nversus \n \n \nARG OUTLIER MEDIA PVT LTD & ORS. \n..... Defendants \nThrough: \nMs. \nMalvika \nTrivedi, \nSenior \nAdvocate with Mr. Gaurav Dudeja, \nMs. Bani Dixit, Mr. Dhruval Singh, \nMr. Shailendra Slaria and Ms. Sujal \nGupta, Advocates. \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nAMIT BANSAL, J. (Oral) \nI.A. 1464/2018 (O-XI R-5 of the CPC) \n1. \nThe present application has been filed on behalf of the plaintiff under \nOrder XI Rule 5 of the Code of Civil Procedure, 1908 (CPC) as applicable \nto commercial suits under the Commercial Courts Act, 2015 for placing on \nrecord additional documents.  \n2. \nReply has been filed on behalf of the defendants opposing the present \napplication. Rejoinder thereto, has been filed on behalf of the plaintiff.  \n3. \nIt is the case of the plaintiff that the aforesaid additional documents \nwere filed by the plaintiff on 17th October, 2017 on the same date as the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.03.2023 19:21:29\nSignature Not Verified\n\n--- PAGE 2 ---\n2023/DHC/001726 \n \nCS(COMM) 434/2017                                                                                                      Page 2 of 6 \n \nreplication. Counsel for the plaintiff submits that the filing of the aforesaid \ndocuments was necessitated on account of the statement made on behalf of \nthe defendants, as noted in the order dated 26th September, 2017, that the \ndefendant no.1 was not in existence at the time of the filing of the present \nsuit and some of the additional documents sought to be filed are to \ndemonstrate that the defendant no.1 was in existence at the time of filing of \nthe present suit. \n4. \nYet another justification given on behalf of the plaintiff for filing \nadditional documents is to demonstrate the contrary stands taken by the \ndefendants in their written statements and in the replies to the examination \nreports of the Registry. It is stated that in the written statements the \ndefendants have taken a stand that the trademarks/taglines, which are the \nsubject matter of the present suit are descriptive and generic in nature. \nHowever, in various replies to the examination reports of the Registry, the \ndefendants have taken a contrary stand. Therefore, it is necessary to place \nthe aforesaid documents on record. Reliance is placed on Order XI Rule (1) \n(c)(ii) of the CPC.  \n5. \nPer contra, senior counsel appearing on behalf of the defendants \nsubmits that since the defendant no.1 has already been deleted from the \narray of parties, the documents with regard to the defendant no.1 are no \nlonger relevant in the present suit. It is further submitted that there is no \ncontradiction in the stand taken by the defendants before the Trade Mark \nRegistry and the written statement filed in the present suit. It is also \ncontended that the documents now sought to be filed were in the power, \npossession, control and custody of the plaintiff at the time of filing of the \npresent suit and therefore, ought to have been filed along with the suit. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.03.2023 19:21:29\nSignature Not Verified\n\n--- PAGE 3 ---\n2023/DHC/001726 \n \nCS(COMM) 434/2017                                                                                                      Page 3 of 6 \n \nReliance is being placed on the judgment of the Supreme Court in Sudhir \nKumar v. Vinay Kumar, 2021 SCC OnLine SC 734 and the judgment of a \nCo-ordinate Bench of this Court in Nitin Gupta v. Taxmaco Infrastructure \n& Holding Ltd., 2019 SCC OnLine Del 8367.  \n6. \nI have heard the counsel for the parties.  \n7. \nA perusal of the additional documents sought to be placed on record \nby the plaintiff would show that the said documents are the examination \nreports of the Registry and the responses thereto by the defendants. All the \naforesaid documents pertain to the defendants. Attention of the Court has \nbeen drawn by the counsel for the plaintiff to paragraph 18 of the written \nstatement filed by the defendant no.2, where a specific stand has been taken \nby the defendants that the trademark/taglines, which are the subject matter \nof the present suit are descriptive in nature. The aforesaid contention has \nbeen rebutted by the plaintiff in its replication. In order to meet the aforesaid \ncontention of the defendants, the plaintiff seeks to place on record the \naforesaid documents to show that in their replies to the examination reports, \nthe defendants have claimed the trademark to be distinctive. The aforesaid \ndocuments are covered within the ambit of sub-rule (1)(c)(ii) of Rule (1) of \nOrder XI of the CPC in terms of which the plaintiff would be entitled to file \nthe documents in response to a case set up by the defendants after filing of \nthe plaint. Therefore, there is no merit in the submission of the defendants \nthat the aforesaid documents were available in public domain and could \nhave been filed along with the plaint. Even if the said documents were \navailable in public domain at the time of filing of the suit, the need for filing \nthe aforesaid documents arose only on account of the stand taken by the \ndefendants in the written statement.  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.03.2023 19:21:29\nSignature Not Verified\n\n--- PAGE 4 ---\n2023/DHC/001726 \n \nCS(COMM) 434/2017                                                                                                      Page 4 of 6 \n \n8. \nInsofar as the objection of the defendants that the documents in \nrespect of the defendant no.1 are not relevant as the defendant no.1 has been \ndeleted from the array of the parties, it is the contention of the plaintiff that \ndespite the defendants claiming that the defendant no.1 was not in existence, \ncertain replies were filed on behalf of the defendant no.1 before the Trade \nMark Registry. Therefore, the aforesaid documents are relevant for \ndetermining whether an incorrect stand has been taken by the defendant or \nnot.   \n9. \nIn Sudhir Kumar (supra), relied upon by the defendants, the Supreme \nCourt was dealing with the provisions of Order XI Rule 1(4) read with Order \nXI Rule 1(5) of the CPC in respect of filing additional documents after filing \nof the plaint in case of urgent listings. It was further observed that the rigour \nof establishing reasonable cause for non-disclosure of the documents along \nwith the plaint may not arise in cases where additional documents are \ndiscovered subsequent to filing of the plaint. The aforesaid judgment does \nnot in any manner curtail the power of the Court to permit additional \ndocuments to be taken on record if a party gives sufficient cause for not \nfiling the said documents along with the plaint.  \n10. \nThe judgment in Nitin Gupta (supra) relied upon by the defendants \nhas been distinguished in other judgments of the Co-ordinate Benches of this \nCourt in Hassad Food Company Q.S.C. v. Bank of India, 2019 SCC \nOnLine Del 10647 and Mahesh Chaudhri v. IMV India Pvt. Ltd., 2019 \nSCC OnLine Del 9813 on the ground that the issues in the said suit had \nalready been framed and the documents were inconsistent with the pleadings \nin the suit. In both the aforesaid cases, the additional documents were \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.03.2023 19:21:29\nSignature Not Verified\n\n--- PAGE 5 ---\n2023/DHC/001726 \n \nCS(COMM) 434/2017                                                                                                      Page 5 of 6 \n \nallowed to be taken on record on the ground that the issues were yet to be \nframed in the suit and additional documents sought to be filed by the \nplaintiff were relevant for the adjudication of the case.  \n11. \nThe judgments in Hassad Food Company (supra), Mahesh \nChaudhri  (supra) and Nitin Gupta (supra) were considered by me in \nKhurmi Associates (P) Ltd. v. Maharishi Dayanand Co-Operative Group \nHousing Society, 2022 SCC OnLine Del 1011. Relying upon the judgments \nin Hassad Food Company (supra) and Mahesh Chaudhary (supra), the \nadditional documents were permitted to be taken on record on the ground \nthat issues were yet to be framed in the suit and the documents were in \nsupport of the pleadings of the plaintiff company.  \n12. \nThe facts in the present case are very similar to the facts in Khurmi \nAssociates (supra). Issues are yet to be framed in the suit. It is an admitted \nposition that the additional documents were filed on behalf of the plaintiff \non the same date as the replication. A perusal of the pleadings in the suit \nwould also show that the aforesaid documents sought to be filed are not \ncontrary to the pleadings of the plaintiff in the suit. In my considered view, \nthe aforesaid documents would be relevant for the adjudication of the \npresent suit.  \n13. \nAccordingly, the present application is allowed and the plaintiff is \npermitted to place the additional documents on record, subject to payment of \ncosts of Rs.20,000/- to the defendants. \nCS(COMM) 434/2017 \n14. \nAffidavit of admission/denial in respect of additional documents \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.03.2023 19:21:29\nSignature Not Verified\n\n--- PAGE 6 ---\n2023/DHC/001726 \n \nCS(COMM) 434/2017                                                                                                      Page 6 of 6 \n \npermitted to be taken on record shall be filed by the defendants within three \nweeks from today. \n15. \nList before the Joint Registrar on 19th April, 2023 for \nadmission/denial of the documents. \n \n \nAMIT BANSAL, J \nMARCH 6, 2023 \nat \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.03.2023 19:21:29\nSignature Not Verified\n"
  },
  "total_pages": 6,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "According to the PDF document \"Bennet Coleman & Co. Ltd vs. ARG Outlier Media Pvt. Ltd & Ors.pdf\" (2023/DHC/001726), a legal proceeding is underway in the High Court of Delhi. The case, CS(COMM) 434/2017, involves Bennet Coleman & Co. Ltd. as the plaintiff and ARG Outlier Media Pvt Ltd & Ors. as the defendants. The decision date is March 6, 2023.\n\nThe plaintiff filed an application under Order XI Rule 5 of the Code of Civil Procedure, 1908, to place additional documents on record. The defendants opposed this application, and a rejoinder was filed by the plaintiff. The plaintiff's counsel argued that the additional documents were necessary to demonstrate the existence of the defendant company at the time of filing the suit and to highlight contradictory stands taken by the defendants.\n\nThe defendants' senior counsel countered that the documents related to the first defendant were no longer relevant since it had been deleted from the array of parties. They also argued that there was no contradiction in their stands before the Trade Mark Registry and the written statement filed in the suit. The court is considering the application, with the plaintiff relying on Order XI Rule (1) (c)(ii) of the CPC.\n\nThe case is being heard by Hon'ble Mr. Justice Amit Bansal, with the plaintiff represented by Mr. Hemant Singh and the defendants represented by Ms. Malvika Trivedi, Senior Advocate. The PDF document provides further details on the legal proceedings, arguments, and decisions in this case.",
      "pdf_source": "18. Bennet Coleman & Co. Ltd vs. ARG Outlier Media Pvt. Ltd & Ors.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "According to the PDF \"18. Bennet Coleman & Co. Ltd vs. ARG Outlier Media Pvt. Ltd & Ors.pdf\", a commercial suit (CS(COMM) 434/2017) is being heard in the High Court of Delhi. The plaintiff, Bennett Coleman & Co. Ltd, has filed an application (I.A. 1464/2018) under Order XI Rule 5 of the CPC to place additional documents on record. The defendants, ARG Outlier Media Pvt Ltd & Ors, have opposed this application. The case is being heard by Hon'ble Mr. Justice Amit Bansal. The application was filed on behalf of the plaintiff on October 17, 2017. The decision was made on March 6, 2023. The plaintiff is represented by Mr. Hemant Singh and others, while the defendants are represented by Ms. Malvika Trivedi, Senior Advocate, and others. (Source: 2023/DHC/001726, Page 1 of 6)",
          "content": "2023/DHC/001726 \n \nCS(COMM) 434/2017                                                                                                      Page 1 of 6 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n \n% \n \n \n \n \n \nDate of Decision : 6th March, 2023 \n \n+  \n \n \n \nCS(COMM) 434/2017  \n \n \nBENNETT COLEMAN & CO. LTD.  \n \n..... Plaintiff \nThrough: \nMr. Hemant Singh with Ms. Mamta \nRani Jha, Mr. Shakti Priyan Nair and \nMs. Pragya Jain, Advocates. \n \n \n \n \n \nversus \n \n \nARG OUTLIER MEDIA PVT LTD & ORS. \n..... Defendants \nThrough: \nMs. \nMalvika \nTrivedi, \nSenior \nAdvocate with Mr. Gaurav Dudeja, \nMs. Bani Dixit, Mr. Dhruval Singh, \nMr. Shailendra Slaria and Ms. Sujal \nGupta, Advocates. \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nAMIT BANSAL, J. (Oral) \nI.A. 1464/2018 (O-XI R-5 of the CPC) \n1. \nThe present application has been filed on behalf of the plaintiff under \nOrder XI Rule 5 of the Code of Civil Procedure, 1908 (CPC) as applicable \nto commercial suits under the Commercial Courts Act, 2015 for placing on \nrecord additional documents.  \n2. \nReply has been filed on behalf of the defendants opposing the present \napplication. Rejoinder thereto, has been filed on behalf of the plaintiff.  \n3. \nIt is the case of the plaintiff that the aforesaid additional documents \nwere filed by the plaintiff on 17th October, 2017 on the same date as the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.03.2023 19:21:29\nSignature Not Verified",
          "pdf_source": "18. Bennet Coleman & Co. Ltd vs. ARG Outlier Media Pvt. Ltd & Ors.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "According to page 2 of the PDF \"18. Bennet Coleman & Co. Ltd vs. ARG Outlier Media Pvt. Ltd & Ors.pdf\", the plaintiff, Bennet Coleman & Co. Ltd, is seeking to file additional documents in the case CS(COMM) 434/2017. The plaintiff's counsel justifies this by stating that the documents are necessary to demonstrate the existence of defendant no.1 at the time of filing the suit and to highlight the contradictory stands taken by the defendants. The defendants' counsel argues that the documents are no longer relevant since defendant no.1 has been deleted from the case and that there is no contradiction in their stands. The plaintiff relies on Order XI Rule (1) (c)(ii) of the CPC to support their claim. The case is being heard in the High Court of Delhi, with the decision date being 6th March, 2023. (Source: 2023/DHC/001726)",
          "content": "2023/DHC/001726 \n \nCS(COMM) 434/2017                                                                                                      Page 2 of 6 \n \nreplication. Counsel for the plaintiff submits that the filing of the aforesaid \ndocuments was necessitated on account of the statement made on behalf of \nthe defendants, as noted in the order dated 26th September, 2017, that the \ndefendant no.1 was not in existence at the time of the filing of the present \nsuit and some of the additional documents sought to be filed are to \ndemonstrate that the defendant no.1 was in existence at the time of filing of \nthe present suit. \n4. \nYet another justification given on behalf of the plaintiff for filing \nadditional documents is to demonstrate the contrary stands taken by the \ndefendants in their written statements and in the replies to the examination \nreports of the Registry. It is stated that in the written statements the \ndefendants have taken a stand that the trademarks/taglines, which are the \nsubject matter of the present suit are descriptive and generic in nature. \nHowever, in various replies to the examination reports of the Registry, the \ndefendants have taken a contrary stand. Therefore, it is necessary to place \nthe aforesaid documents on record. Reliance is placed on Order XI Rule (1) \n(c)(ii) of the CPC.  \n5. \nPer contra, senior counsel appearing on behalf of the defendants \nsubmits that since the defendant no.1 has already been deleted from the \narray of parties, the documents with regard to the defendant no.1 are no \nlonger relevant in the present suit. It is further submitted that there is no \ncontradiction in the stand taken by the defendants before the Trade Mark \nRegistry and the written statement filed in the present suit. It is also \ncontended that the documents now sought to be filed were in the power, \npossession, control and custody of the plaintiff at the time of filing of the \npresent suit and therefore, ought to have been filed along with the suit. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.03.2023 19:21:29\nSignature Not Verified",
          "pdf_source": "18. Bennet Coleman & Co. Ltd vs. ARG Outlier Media Pvt. Ltd & Ors.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0005",
      "start_index": 3,
      "end_index": 3,
      "summary": "According to the PDF document \"Bennet Coleman & Co. Ltd vs. ARG Outlier Media Pvt. Ltd & Ors.pdf\" (2023/DHC/001726), a legal proceeding (CS(COMM) 434/2017) took place in the High Court of Delhi at New Delhi. The plaintiff, Bennett Coleman & Co. Ltd, was represented by Mr. Hemant Singh and other advocates, while the defendants were ARG Outlier Media Pvt Ltd and others.\n\nThe court considered the plaintiff's application to place additional documents on record, which included examination reports of the Registry and responses from the defendants. The documents pertained to the defendants' claim that the trademark/taglines in question were descriptive in nature. The plaintiff sought to rebut this contention by showing that the defendants had previously claimed the trademark to be distinctive in their replies to the examination reports.\n\nThe court allowed the plaintiff to file the additional documents, citing sub-rule (1)(c)(ii) of Rule 1 of Order XI of the CPC, which permits the filing of documents in response to a case set up by the defendants after the plaint has been filed. The court rejected the defendants' argument that the documents were available in the public domain and could have been filed with the plaint, stating that the need to file them arose only after the defendants' written statement was filed.\n\nThe decision was made on March 6, 2023, and the court relied on judgments from the Supreme Court (Sudhir Kumar v. Vinay Kumar, 2021 SCC OnLine SC 734) and a coordinate bench of the Delhi High Court (Nitin Gupta v. Taxmaco Infrastructure & Holding Ltd., 2019 SCC OnLine Del 8367). (Source: Bennet Coleman & Co. Ltd vs. ARG Outlier Media Pvt. Ltd & Ors.pdf)",
      "pdf_source": "18. Bennet Coleman & Co. Ltd vs. ARG Outlier Media Pvt. Ltd & Ors.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "According to page 3 of the PDF \"18. Bennet Coleman & Co. Ltd vs. ARG Outlier Media Pvt. Ltd & Ors.pdf\", the court considered the plaintiff's request to place additional documents on record. The plaintiff relied on Supreme Court judgments in Sudhir Kumar v. Vinay Kumar (2021) and a Co-ordinate Bench judgment in Nitin Gupta v. Taxmaco Infrastructure & Holding Ltd. (2019). The court allowed the documents, which included examination reports and responses, as they pertained to the defendants' claim that the trademark/taglines were descriptive in nature. The plaintiff sought to rebut this contention and the documents were covered under Order XI of the CPC. The court decided in favor of the plaintiff, rejecting the defendants' argument that the documents were available in the public domain and could have been filed earlier. (Source: 2023/DHC/001726, CS(COMM) 434/2017)",
          "content": "2023/DHC/001726 \n \nCS(COMM) 434/2017                                                                                                      Page 3 of 6 \n \nReliance is being placed on the judgment of the Supreme Court in Sudhir \nKumar v. Vinay Kumar, 2021 SCC OnLine SC 734 and the judgment of a \nCo-ordinate Bench of this Court in Nitin Gupta v. Taxmaco Infrastructure \n& Holding Ltd., 2019 SCC OnLine Del 8367.  \n6. \nI have heard the counsel for the parties.  \n7. \nA perusal of the additional documents sought to be placed on record \nby the plaintiff would show that the said documents are the examination \nreports of the Registry and the responses thereto by the defendants. All the \naforesaid documents pertain to the defendants. Attention of the Court has \nbeen drawn by the counsel for the plaintiff to paragraph 18 of the written \nstatement filed by the defendant no.2, where a specific stand has been taken \nby the defendants that the trademark/taglines, which are the subject matter \nof the present suit are descriptive in nature. The aforesaid contention has \nbeen rebutted by the plaintiff in its replication. In order to meet the aforesaid \ncontention of the defendants, the plaintiff seeks to place on record the \naforesaid documents to show that in their replies to the examination reports, \nthe defendants have claimed the trademark to be distinctive. The aforesaid \ndocuments are covered within the ambit of sub-rule (1)(c)(ii) of Rule (1) of \nOrder XI of the CPC in terms of which the plaintiff would be entitled to file \nthe documents in response to a case set up by the defendants after filing of \nthe plaint. Therefore, there is no merit in the submission of the defendants \nthat the aforesaid documents were available in public domain and could \nhave been filed along with the plaint. Even if the said documents were \navailable in public domain at the time of filing of the suit, the need for filing \nthe aforesaid documents arose only on account of the stand taken by the \ndefendants in the written statement.  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.03.2023 19:21:29\nSignature Not Verified",
          "pdf_source": "18. Bennet Coleman & Co. Ltd vs. ARG Outlier Media Pvt. Ltd & Ors.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0009",
      "start_index": 4,
      "end_index": 6,
      "summary": "According to the PDF document \"Bennet Coleman & Co. Ltd vs. ARG Outlier Media Pvt. Ltd & Ors.pdf\", the legal proceedings involve a commercial suit (CS(COMM) 434/2017) in the High Court of Delhi at New Delhi. The plaintiff, Bennett Coleman & Co. Ltd, is represented by advocates Mr. Hemant Singh, Ms. Mamta Rani Jha, Mr. Shakti Priyan Nair, and Ms. Pragya Jain. \n\nThe defendants, ARG Outlier Media Pvt Ltd, and others, objected to the plaintiff's application to file additional documents, citing that the documents related to defendant no.1, which had been deleted from the array of parties. The plaintiff argued that these documents were relevant to determine if the defendant had taken an incorrect stand.\n\nThe court considered judgments in Sudhir Kumar, Nitin Gupta, Hassad Food Company, and Mahesh Chaudhri, and determined that the additional documents were admissible as issues had not been framed in the suit and the documents supported the plaintiff's pleadings. The court allowed the plaintiff's application to file additional documents, subject to a payment of Rs.20,000/- to the defendants.\n\nThe decision was made on March 6, 2023, and the order was digitally signed by Amit Bansal on March 7, 2023. The PDF document (2023/DHC/001726) provides the details of the court proceedings, including the legal arguments and the court's decision. The case highlights the importance of filing relevant documents in a timely manner and the court's discretion in permitting additional documents to be taken on record.",
      "pdf_source": "18. Bennet Coleman & Co. Ltd vs. ARG Outlier Media Pvt. Ltd & Ors.pdf",
      "nodes": [
        {
          "title": "Page 4",
          "node_id": "0006",
          "start_index": 4,
          "end_index": 4,
          "summary": "According to page 4 of the PDF \"18. Bennet Coleman & Co. Ltd vs. ARG Outlier Media Pvt. Ltd & Ors.pdf\", the plaintiff argues that documents related to defendant no.1 are relevant to determine if the defendant took an incorrect stand. The court refers to the Supreme Court's judgment in Sudhir Kumar, which deals with filing additional documents after the plaint is filed. The court also distinguishes the judgment in Nitin Gupta, relied upon by the defendants, citing other judgments of the Co-ordinate Benches of the Delhi High Court. The case, CS(COMM) 434/2017, was decided on March 6, 2023. The plaintiff, Bennett Coleman & Co. Ltd, is represented by advocates Mr. Hemant Singh, Ms. Mamta Rani Jha, Mr. Shakti Priyan Nair, and Ms. Pragya Jain. (Source: 2023/DHC/001726, PDF page 4)",
          "content": "2023/DHC/001726 \n \nCS(COMM) 434/2017                                                                                                      Page 4 of 6 \n \n8. \nInsofar as the objection of the defendants that the documents in \nrespect of the defendant no.1 are not relevant as the defendant no.1 has been \ndeleted from the array of the parties, it is the contention of the plaintiff that \ndespite the defendants claiming that the defendant no.1 was not in existence, \ncertain replies were filed on behalf of the defendant no.1 before the Trade \nMark Registry. Therefore, the aforesaid documents are relevant for \ndetermining whether an incorrect stand has been taken by the defendant or \nnot.   \n9. \nIn Sudhir Kumar (supra), relied upon by the defendants, the Supreme \nCourt was dealing with the provisions of Order XI Rule 1(4) read with Order \nXI Rule 1(5) of the CPC in respect of filing additional documents after filing \nof the plaint in case of urgent listings. It was further observed that the rigour \nof establishing reasonable cause for non-disclosure of the documents along \nwith the plaint may not arise in cases where additional documents are \ndiscovered subsequent to filing of the plaint. The aforesaid judgment does \nnot in any manner curtail the power of the Court to permit additional \ndocuments to be taken on record if a party gives sufficient cause for not \nfiling the said documents along with the plaint.  \n10. \nThe judgment in Nitin Gupta (supra) relied upon by the defendants \nhas been distinguished in other judgments of the Co-ordinate Benches of this \nCourt in Hassad Food Company Q.S.C. v. Bank of India, 2019 SCC \nOnLine Del 10647 and Mahesh Chaudhri v. IMV India Pvt. Ltd., 2019 \nSCC OnLine Del 9813 on the ground that the issues in the said suit had \nalready been framed and the documents were inconsistent with the pleadings \nin the suit. In both the aforesaid cases, the additional documents were \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.03.2023 19:21:29\nSignature Not Verified",
          "pdf_source": "18. Bennet Coleman & Co. Ltd vs. ARG Outlier Media Pvt. Ltd & Ors.pdf",
          "nodes": []
        },
        {
          "title": "Page 5",
          "node_id": "0007",
          "start_index": 5,
          "end_index": 5,
          "summary": "According to page 5 of the PDF \"18. Bennet Coleman & Co. Ltd vs. ARG Outlier Media Pvt. Ltd & Ors.pdf\" (2023/DHC/001726), the court allowed the plaintiff to file additional documents. The court relied on previous judgments in Hassad Food Company, Mahesh Chaudhri, and Nitin Gupta, which permitted additional documents to be filed when issues were yet to be framed in the suit. The court found the facts in this case similar to Khurmi Associates (2022 SCC OnLine Del 1011) and allowed the additional documents to be taken on record, subject to a cost of Rs.20,000/- to the defendants. The decision was made on March 6, 2023, in CS(COMM) 434/2017, Bennet Coleman & Co. Ltd vs. ARG Outlier Media Pvt Ltd & Ors. The plaintiff's advocates included Mr. Hemant Singh and others.",
          "content": "2023/DHC/001726 \n \nCS(COMM) 434/2017                                                                                                      Page 5 of 6 \n \nallowed to be taken on record on the ground that the issues were yet to be \nframed in the suit and additional documents sought to be filed by the \nplaintiff were relevant for the adjudication of the case.  \n11. \nThe judgments in Hassad Food Company (supra), Mahesh \nChaudhri  (supra) and Nitin Gupta (supra) were considered by me in \nKhurmi Associates (P) Ltd. v. Maharishi Dayanand Co-Operative Group \nHousing Society, 2022 SCC OnLine Del 1011. Relying upon the judgments \nin Hassad Food Company (supra) and Mahesh Chaudhary (supra), the \nadditional documents were permitted to be taken on record on the ground \nthat issues were yet to be framed in the suit and the documents were in \nsupport of the pleadings of the plaintiff company.  \n12. \nThe facts in the present case are very similar to the facts in Khurmi \nAssociates (supra). Issues are yet to be framed in the suit. It is an admitted \nposition that the additional documents were filed on behalf of the plaintiff \non the same date as the replication. A perusal of the pleadings in the suit \nwould also show that the aforesaid documents sought to be filed are not \ncontrary to the pleadings of the plaintiff in the suit. In my considered view, \nthe aforesaid documents would be relevant for the adjudication of the \npresent suit.  \n13. \nAccordingly, the present application is allowed and the plaintiff is \npermitted to place the additional documents on record, subject to payment of \ncosts of Rs.20,000/- to the defendants. \nCS(COMM) 434/2017 \n14. \nAffidavit of admission/denial in respect of additional documents \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.03.2023 19:21:29\nSignature Not Verified",
          "pdf_source": "18. Bennet Coleman & Co. Ltd vs. ARG Outlier Media Pvt. Ltd & Ors.pdf",
          "nodes": []
        },
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "According to page 6 of the PDF \"18. Bennet Coleman & Co. Ltd vs. ARG Outlier Media Pvt. Ltd & Ors.pdf\", the court proceedings are as follows: \n\n* The defendants are directed to file documents to be taken on record within three weeks.\n* The case is listed before the Joint Registrar on April 19, 2023, for admission/denial of documents.\n* The decision was made by Judge Amit Bansal on March 6, 2023.\n* The document was digitally signed by Judge Amit Bansal on March 7, 2023.\n\nSource: 18. Bennet Coleman & Co. Ltd vs. ARG Outlier Media Pvt. Ltd & Ors.pdf (2023/DHC/001726, CS(COMM) 434/2017)",
          "content": "2023/DHC/001726 \n \nCS(COMM) 434/2017                                                                                                      Page 6 of 6 \n \npermitted to be taken on record shall be filed by the defendants within three \nweeks from today. \n15. \nList before the Joint Registrar on 19th April, 2023 for \nadmission/denial of the documents. \n \n \nAMIT BANSAL, J \nMARCH 6, 2023 \nat \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.03.2023 19:21:29\nSignature Not Verified",
          "pdf_source": "18. Bennet Coleman & Co. Ltd vs. ARG Outlier Media Pvt. Ltd & Ors.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0010",
      "start_index": 7,
      "end_index": 6,
      "summary": "Section 'Court Decision' from 18. Bennet Coleman & Co. Ltd vs. ARG Outlier Media Pvt. Ltd & Ors.pdf - No extractable content",
      "pdf_source": "18. Bennet Coleman & Co. Ltd vs. ARG Outlier Media Pvt. Ltd & Ors.pdf",
      "nodes": []
    }
  ],
  "created_at": "2025-07-15T18:39:03.665830",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}