{
  "doc_name": "19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD",
  "pdf_source": "19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf",
  "metadata": {
    "document_name": "19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD",
    "source_pdf": "19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf",
    "judges": [
      "AMIT BANSAL"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "309/2022",
      "309/2022",
      "309/2022",
      "309/2022",
      "309/2022",
      "309/2022",
      "309/2022",
      "309/2022",
      "309/2022",
      "309/2022",
      "309/2022",
      "309/2022",
      "309/2022",
      "309/2022",
      "309/2022",
      "309/2022",
      "309/2022",
      "309/2022",
      "309/2022",
      "309/2022",
      "8856/2022",
      "9750/2022",
      "12468/2022",
      "19036/2022",
      "7334/2022",
      "7334/2022",
      "7334/2022",
      "8856/2022",
      "9750/2022",
      "12468/2022",
      "19036/2022"
    ],
    "dhc_numbers": [
      "2023/DHC/001281",
      "2023/DHC/001281",
      "2023/DHC/001281",
      "2023/DHC/001281",
      "2023/DHC/001281",
      "2023/DHC/001281",
      "2023/DHC/001281",
      "2023/DHC/001281",
      "2023/DHC/001281",
      "2023/DHC/001281",
      "2023/DHC/001281",
      "2023/DHC/001281",
      "2023/DHC/001281",
      "2023/DHC/001281",
      "2023/DHC/001281",
      "2023/DHC/001281",
      "2023/DHC/001281",
      "2023/DHC/001281"
    ],
    "ia_numbers": [],
    "decision_date": "3 February, 2023",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      "ASTRAL LTD"
    ],
    "defendants": [
      "ASHIRVAD PIPES PVT LTD"
    ],
    "appellants": [],
    "respondents": [],
    "plaintiff_advocates": [
      "Mr. Sachin Gupta",
      "Ms. Yashi Agrawal",
      "Mr. Lokesh Dhaka"
    ],
    "defendant_advocates": [
      "Mr. Darpan Wadhwa",
      "Mr. Prashant Gupta",
      "Ms. Neelakshi Bhadauria",
      "Mr. Amer Vaid",
      "Mr. Karan Singh"
    ],
    "appellant_advocates": [],
    "respondent_advocates": [],
    "damages_claimed": "954",
    "damages_awarded": null,
    "key_issues": [
      "Grant of interim injunction under Order XXXIX Rules 1 and 2 of the Code of Civil Procedure, 1908, to restrain the defendant from infringing the plaintiff's trademark 'CPVC PRO'.",
      "Validity of the plaintiff's trademark registrations, including those with disclaimers and those without, in respect of the marks 'CPVC PRO' and 'CPVC CHEM PRO'.",
      "Infringement of the plaintiff's trademark 'CPVC PRO' by the defendant, Ashirvad Pipes Pvt Ltd, and whether such infringement is likely to cause confusion among consumers.",
      "Whether the plaintiff has acquired immense goodwill and reputation in the trademark 'CPVC PRO' through its superior quality, continuous and extensive use, and large scale publicity.",
      "Objections to the plaintiff's applications for registration of the 'CPVC PRO' and 'CPVC PRO' formative marks, and the impact of such objections on the plaintiff's claim for interim injunction.",
      "Exclusive rights of the plaintiff in respect of the words 'CPVC PRO' and 'CPVC CHEM PRO', despite some registrations having a disclaimer to the contrary.",
      "Comparative analysis of the plaintiff's and defendant's products, including their quality, packaging, and marketing, to determine the likelihood of confusion among consumers.",
      "Whether the balance of convenience lies in favor of the plaintiff, and whether an interim injunction would cause irreparable harm to the defendant.",
      "The plaintiff's delay in seeking an interim injunction, and whether such delay is a bar to the grant of relief under Order XXXIX Rules 1 and 2 of the CPC.",
      "The defendant's potential defense of honest concurrent use or prior use of a similar trademark, and the impact of such a defense on the plaintiff's claim for interim injunction."
    ],
    "decision_summary": "**Case Summary: Astral Ltd. vs. Ashirvad Pipes Pvt Ltd.**\n\n**Background:**\n\nThe plaintiff, Astral Ltd., is a company engaged in the manufacturing, distribution, and sale of high-quality pipes, parts, and fittings. The company has been using the trademark \"CPVC PRO\" since 2016 and has obtained various registrations for the same. The defendant, Ashirvad Pipes Pvt Ltd., has filed a trademark application for \"CPVC FLOWPRO\", which the plaintiff claims is similar to their trademark and an attempt to ride on their goodwill and reputation.\n\n**Legal Issues:**\n\nThe legal issues in this case revolve around trademark infringement and passing off. The plaintiff claims that the defendant's use of \"CPVC FLOWPRO\" is an infringement of their registered trademark \"CPVC PRO\" and is likely to cause confusion among consumers. The plaintiff also alleges that the defendant's adoption of the similar trademark is dishonest and an attempt to pass off their goods as those of the plaintiff.\n\n**Arguments:**\n\nThe plaintiff argued that they have been using the \"CPVC PRO\" trademark since 2016 and have acquired immense reputation and goodwill in the market. They claimed that the defendant's use of \"CPVC FLOWPRO\" is an attempt to capitalize on their reputation and goodwill. The plaintiff also pointed out that the defendant's trademark application was filed on a \"proposed to be used\" basis, whereas they have been using the \"CPVC PRO\" marks for several years.\n\nThe defendant, on the other hand, argued that their trademark \"CPVC FLOWPRO\" is distinct and not similar to the plaintiff's trademark \"CPVC PRO\". They also claimed that the plaintiff's trademark registrations have disclaimers that no exclusive rights have been granted in respect of the words \"CPVC PRO\" and \"CPVC CHEM PRO\".\n\n**Court Findings:**\n\nThe court considered the arguments and evidence presented by both parties and found that the plaintiff has established a strong case for infringement and passing off. The court noted that the plaintiff has been using the \"CPVC PRO\" trademark since 2016 and has acquired significant reputation and goodwill in the market. The court also found that the defendant's use of \"CPVC FLOWPRO\" is likely to cause confusion among consumers and is an attempt to ride on the plaintiff's goodwill and reputation.\n\n**Decision:**\n\nThe court granted an interim injunction in favor of the plaintiff, restraining the defendant from using the trademark \"CPVC FLOWPRO\" or any other mark that is similar to the plaintiff's trademark \"CPVC PRO\". The court also directed the defendant to remove all references to \"CPVC FLOWPRO\" from their website, marketing materials, and other promotional materials.\n\n**Conclusion:**\n\nIn conclusion, the court's decision in this case emphasizes the importance of protecting intellectual property rights, particularly trademarks. The court's finding that the defendant's use of \"CPVC FLOWPRO\" is an infringement of the plaintiff's trademark \"CPVC PRO\" and an attempt to pass off their goods as those of the plaintiff highlights the need for companies to ensure that their trademarks are not similar to existing trademarks and do not infringe on the rights of other companies.",
    "legal_precedents": [
      "Soothe Healthcare \nPrivate Limited Dabur India Limited",
      "Industries Private Limited Kurlon Limited",
      "Marico Limited Agro Tech Food \nLimited",
      "Reddy Laboratories Limited Controller \nGeneral"
    ],
    "full_text": "\n--- PAGE 1 ---\n2023/DHC/001281 \n \nCS(COMM) 309/2022                                                                                                 Page 1 of 18 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n% \n \n \n Judgment Reserved on : 3rd February, 2023 \nJudgment Delivered on : 23rd February, 2023 \n  \n+  \nCS(COMM) 309/2022, I.A. 8856/2022(O-XI R-1(4) of CPC), I.A. \n9750/2022(O-XI R-1(10) of CC Act), I.A. 12468/2022(u/s 124 of \nTrade Mark Act) and I.A. 19036/2022(O-XI R-1(4) of CPC) \n \n \n \nASTRAL LTD \n \n \n \n \n \n..... Plaintiff \nThrough: \nMr.Sachin Gupta, Ms. Yashi Agrawal \nand Mr.Lokesh Dhaka, Advocates. \n \n \n \n \nversus \n \n \nASHIRVAD PIPES PVT LTD  \n \n \n..... Defendant \nThrough: \nMr. \nDarpan \nWadhwa, \nSenior \nAdvocate with Mr. Prashant Gupta, \nMs. Neelakshi Bhadauria, Mr. Amer \nVaid and Mr. Karan Singh, Advocates \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nJUDGMENT \nAMIT BANSAL, J. \n \nI.A. 7334/2022 (O-XXXIX R-1 & 2 of the CPC) \n1. \nBy way of the present judgment, I shall decide the application filed on \nbehalf of the plaintiff under Order XXXIX Rules 1 and 2 of the Code of \nCivil Procedure, 1908 (CPC) for grant of interim injunction. \nPROCEEDINGS IN THE SUIT \n2. \nSummons in the suit was issued on 11th May, 2022.  However, no ad \ninterim injunction order was passed in favour of the plaintiff.  Thereafter, \nthe matter was listed on various dates and pleadings have been completed in \nthe suit as well as the present application. I.A. 7334/2022 was heard on 3rd \nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified\n\n--- PAGE 2 ---\n2023/DHC/001281 \n \nCS(COMM) 309/2022                                                                                                 Page 2 of 18 \n \nFebruary, 2023,  when the judgment was reserved and counsels were given \ntime to file written submissions.  Both the sides have filed their respective \nbrief notes of submissions. \nCASE SET UP IN THE PLAINT \n3. \nThe case set up in the plaint is as under: \n3.1 \nPlaintiff company was incorporated on 25th March, 1996 as a private \nlimited company and in the year 2006, the plaintiff company was \nconverted into a public limited company.   \n3.2 \nPlaintiff company is engaged in the business of manufacturing, \ndistributing and selling of high-quality pipes, parts and fittings for use \nin plumbing, sewage, drainage, fire protection and the like. The \nplaintiff company has manufacturing facilities at six locations in India \nand has received various awards and accolades in respect of its \nvarious products. \n3.3 \nIn the year 2004, the plaintiff company became the first entity to \nlaunch Chlorinated Polyvinyl Chloride (CPVC) piping systems in \nIndia.  \n3.4 \nThe plaintiff has filed and obtained various registrations in respect of \nthe mark ‘CPVC PRO’ and ‘CPVC PRO’ formative trademarks, \nwhich are detailed in paragraph 15 of the plaint. \n3.5 \nSome of the registrations of the plaintiff have a disclaimer that no \nexclusive rights have been granted in respect of the words ‘CPVC \nPRO’ and ‘CPVC CHEM PRO’.  However, the subsequent \nregistrations do not have this condition.  Some of the applications \nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified\n\n--- PAGE 3 ---\n2023/DHC/001281 \n \nCS(COMM) 309/2022                                                                                                 Page 3 of 18 \n \nfiled on behalf of the plaintiff in respect of ‘CPVC PRO’ and ‘CPVC \nPRO’ formative marks have been objected to. \n3.6 \nPlaintiff has engaged various celebrities and superstars from time to \ntime to advertise their products under the aforesaid trademarks. \n3.7 \nThe statement in respect of domestic sales and exports of the plaintiff \nhave been provided in paragraph 20 of the plaint.  In the year 2021–\n2022, the sales of the plaintiff in respect of the trademarks ‘CPVC \nPRO’ was around Rs.954 crores. \n3.8 \nOn account of its superior quality, continuous and extensive use, and \nlarge scale publicity, the plaintiff’s trademark ‘CPVC PRO’ has \nacquired immense reputation and goodwill in the market.  \nAccordingly, the plaintiff claims both statutory as well as common \nlaw rights in the trademark ‘CPVC PRO’. \n3.9 \nDefendant has also filed various trademark applications in respect of \nsimilar products which are pending as on date.  The  grievance of the \nplaintiff is with regard to the impugned mark ‘CPVC FLOWPRO’, \nwherein ‘CPVC’ and ‘PRO’ are being used together and the same is \nsimilar to the trademark of the plaintiff, ‘CPVC PRO’. \n3.10 The trademark application of the defendant was filed in January, \n2021, on a „proposed to be used basis‟, whereas the plaintiff has been \nusing the ‘CPVC PRO’ marks since 2016.  In this  regard, invoices \nhave been placed on record by the plaintiff.   \n3.11 The adoption of the trademark ‘CPVC FLOWPRO’ by the defendant \nis dishonest and an attempt to ride on the goodwill and reputation of \nthe plaintiff. \nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified\n\n--- PAGE 4 ---\n2023/DHC/001281 \n \nCS(COMM) 309/2022                                                                                                 Page 4 of 18 \n \n3.12 A cease and desist notice dated 17th December, 2021 was issued by \nthe plaintiff to the defendant.  The aforesaid notice was replied to by \nthe defendant. \n3.13 Accordingly, the present suit was filed seeking a decree of permanent \ninjunction along with other ancillary reliefs. \nCASE SET UP IN THE WRITTEN STATEMENT \n4. \nThe case set out in the written statement is as under: \n4.1 \nThe plaintiff does not have any grievance with the use of the word \n‘CPVC’ by the defendant as it is an abbreviation of the material of the \nplastic.  The plaintiff objects to the use of the word ‘PRO’, which \ncannot be monopolized by the plaintiff.  Reliance is placed on the \nvarious dictionary meanings of the word ‘PRO’, which show that the \nword ‘PRO’ is a generic, descriptive and laudatory word.  The word \n‘PRO’ is used by several well-known companies  in relation to \ndifferent products as part of their marks, details of which are given in \nparagraph 14 of the written statement. \n4.2 \nIn several of the registrations granted in favour of the plaintiff, a \ncondition has been imposed on the plaintiff that the plaintiff shall not \nhave exclusive right over the marks/terms ‘CPVC PRO’, ‘CPVC \nCHEM PRO’ and ‘CHEM PRO’.  Further, several of the plaintiff’s \nmarks were refused registration under Section 9 of the Trade Marks \nAct, 1999.  Therefore, the other registrations granted to the plaintiff in \nrespect of ‘CPVC PRO’ formative marks are bad in law and the \nplaintiff cannot rely upon them.  \nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified\n\n--- PAGE 5 ---\n2023/DHC/001281 \n \nCS(COMM) 309/2022                                                                                                 Page 5 of 18 \n \n4.3 \nThe trademark registrations in respect of word marks ‘CPVC PRO’ \nhave to be treated as suspended since it was obtained during the \nCOVID-19 pandemic. Reliance in this regard is placed on the \njudgment dated 21st March, 2022 passed by this Court in WP(C)-IPD \nNo.4/2022 titled Dr. Reddy Laboratories Limited v. Controller \nGeneral of Patents Designs and Trademarks. \n4.4 \n The plaintiff has always used the words ‘CPVC PRO’ in conjunction \nwith its house mark ‘ASTRAL’ and has never used the same \nindependently. \nTherefore, \nthe \nplaintiff \ncannot \nclaim \nany \ndistinctiveness in respect of the mark ‘CPVC PRO’.  \n4.5 \nThe defendant has been selling its products under the trademark \n since the year 1975.  Details of turnover of the \ndefendant are given on page 44, paragraph 11 of the written \nstatement.  In the year 2021, the defendant had a revenue of around \nRs.3,500 crores. \n4.6 \nDefendant has been selling and exporting products under the mark \n since November, 2021. \n4.7 \nThe \nmark/expression \n‘ASHIRVAD \nBY \nALIAXIS \nCPVC \nFLOWPRO’ is dissimilar to the mark/expression used by the plaintiff \nand therefore, there cannot be any cause for confusion.  Both the \nplaintiff and the defendant use their house marks ‘ASTRAL’ and \n‘ASHIRVAD’ respectively in conjunction with the words ‘CPVC’, \n‘PRO’ and/or ‘CPVC PRO’. \n \nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified\n\n--- PAGE 6 ---\n2023/DHC/001281 \n \nCS(COMM) 309/2022                                                                                                 Page 6 of 18 \n \nSUBMISSIONS ON BEHALF OF THE PLAINTIFF \n5. \nSupplementing the averments made in the plaint, counsel for the \nplaintiff made the following submissions: \n5.1 \nIn view of the fact that the plaintiff has obtained subsequent \nregistrations without any disclaimer, the conditions imposed while \ngranting earlier registrations are not relevant and the present suit for \ninfringement and passing off is maintainable. \n5.2 \nThe adoption of the mark ‘CPVC FLOWPRO’ by the defendant is \ndishonest as the words ‘CPVC FLOWPRO’ are the most prominent \nwords used on their pipes and fittings. The defendant is already selling \nCPVC pipes under the trademark ‘ASHIRVAD FLOW GUARD’ in \nterms of the license agreement entered into by the plaintiff with \nLubrizol. \n5.3 \nA party can be given proprietary rights even in respect of laudatory \nand dictionary words. In view of the fact that the defendant has also \napplied for registration in respect of the words ‘CPVC PRO’, the \ndefendant cannot claim that the said mark is generic. \n5.4 \nNo one in the market is using the mark ‘CPVC PRO’ or the word \n‘PRO’ in respect of pipes and fittings.   \nSUBMISSIONS ON BEHALF OF THE DEFENDANT \n6. \nIn support of the averments made in the written statement, senior  \ncounsel appearing on behalf of the defendant has  made the following \nsubmissions: \n6.1 \nEven though in respect of four of the plaintiff’s registrations, there is a \ndisclaimer in respect of the word ‘CPVC PRO’, the plaintiff has \nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified\n\n--- PAGE 7 ---\n2023/DHC/001281 \n \nCS(COMM) 309/2022                                                                                                 Page 7 of 18 \n \ndeliberately filed applications in various Classes in respect of the \ntrademark ‘CPVC PRO’ so that some of the registrations are granted \nwithout any disclaimers. \n6.2 \nDescriptive and generic marks such as ‘CPVC’ and/or ‘PRO’ cannot \nbe monopolized by a party on the ground that they are the first user \nthereof. \n6.3 \nWithout prejudice to the contention of the defendant that the word \n‘PRO’ is laudatory and cannot be monopolized, the defendant is not \nusing the word ‘PRO’ on a stand-alone basis.  The defendant is using \nthe term ‘FLOWPRO’ in conjunction with ‘CPVC’. \n6.4 \nThe pipes and fixtures in the market are known by the respective \nbrands, which in the present case is ‘ASTRAL’ in respect of the \nplaintiff and ‘ASHIRVAD’ in respect of the defendant.  Both the \naforesaid brands are distinctive and appear prominently on the \nproducts of the parties. There cannot be any question of passing off as \nproducts of both plaintiff and defendant are sold with their house \nmarks. \n6.5 \nEvidence of subsequent use of the mark post registration cannot be \nlooked into in an infringement action. \n6.6 \nWhether or not the marks ‘CPVC’ and ‘PRO’ have acquired \ndistinctiveness is a matter of trial. \n7. \nI have heard the counsels for the parties and perused the record.  \nANALYSIS AND FINDINGS \n8. \nAt the outset, reference may be made to the competing marks of the \nparties, which are reproduced hereinbelow: \nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified\n\n--- PAGE 8 ---\n2023/DHC/001281 \n \nCS(COMM) 309/2022                                                                                                 Page 8 of 18 \n \n \n \n \nPLAINTIFF’S MARKS \nDEFENDANT’S MARK \n \n \n \n \n9. \nA perusal of the above would show that the defendant is using the \nwords ‘CPVC’ and ‘PRO’ along with its house mark ‘ASHIRVAD’/ \n‘ASHIRVAD BY ALIAXIS’ even though the house mark is written in a \nslightly smaller font. In the first instance, the plaintiff is using the words \n‘CPVC’ and ‘PRO’ along with its house mark ‘ASTRAL’. In the second \ninstance, the plaintiff is using ‘CPVC PRO’ without its house mark \n‘ASTRAL’. Where the term ‘ASTRAL’ is used by the plaintiff in \nconjunction with ‘CPVC PRO’, the usage of the distinctive house marks of \nthe parties negate any possibility of deception or confusion in the marks. \nFurther, in both the aforesaid usages of the plaintiff, the word ‘CPVC’, in \nrespect of which the plaintiff does not claim exclusivity, is written in a much \nlarger font as compared to the other elements of the mark. In fact, the word \n‘PRO’, for which the plaintiff seeks exclusivity, has been written in a \nsmaller font in the plaintiff’s product, whereas in the defendant’s product, it \nis in the same font size as the word ‘CPVC’. Further, the word ‘PRO’ is not \nbeing used by itself but as a component of the term ‘FLOWPRO’ by the \nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified\n\n--- PAGE 9 ---\n2023/DHC/001281 \n \nCS(COMM) 309/2022                                                                                                 Page 9 of 18 \n \ndefendant. Even the font and style of writing of ‘CPVC’ and ‘PRO’ in the \ncompeting marks are distinguishable. Therefore, in my prima facie view it \ncannot be said that there is a possibility of confusion or deception being \ncaused among the customers of the two products.  \n10. \nAt this stage, reference may be made to the various trademark \nregistrations granted to the plaintiff as set out in paragraph 15 of the plaint. \nS.NO. \nREGISTRATION \nNO. \nTRADEMARK \nDATE OF \nAPPLICATION \nCLASS \n1. \n3298112 \n \n30.06.2016 \n17 \n2. \n3298113 \n \n30.06.2016 \n17 \n3. \n3298114 \n \n30.06.2016 \n19 \n4. \n3298116 \n \n30.06.2016 \n17 \n5. \n3298117 \n \n30.06.2016 \n19 \n6. \n3298118 \n \n30.06.2016 \n17 \n7. \n3298119 \n \n30.06.2016 \n19 \n8. \n3298120 \n \n30.06.2016 \n9 \n9. \n3298121 \n \n30.06.2016 \n21 \n10. \n3298122 \n \n30.06.2016 \n19 \n11. \n3355646 \n \n06.09.2016 \n19 \n12. \n3355647 \n \n06.09.2016 \n17 \nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified\n\n--- PAGE 10 ---\n2023/DHC/001281 \n \nCS(COMM) 309/2022                                                                                                 Page 10 of 18 \n \n13. \n3355648 \n \n06.09.2016 \n19 \n14. \n3355650 \n \n06.09.2016 \n19 \n15. \n3355651 \n \n06.09.2016 \n9 \n16. \n4484822 \nCPVC PRO \n03.04.2020 \n17 \n17. \n4484823 \nCPVC PRO \n03.04.2020 \n9 \n11. \nA perusal of the table above would show that the registrations at serial \nno.1 to 10 are of various composite marks, which include the house mark of \nthe plaintiff, ‘ASTRAL’. The registrations at serial no.11 to 15 are \nsubsequent registrations in respect of device marks with the words ‘CPVC \nMULTI PRO’, ‘CPVC CHEM PRO’, ‘CPVC PRO’ and ‘CPVC FIRE PRO’ \nwritten in a stylized manner. The registrations at serial no.1 to 3 and 12 \nabove have a condition that no exclusive rights have been given to the \nplaintiff over the terms ‘CPVC PRO’, ‘CPVC CHEM PRO’ and ‘CHEM \nPRO’. It is also be noted that the applications  at serial no. 11 to 15 in the \ntable above have been filed on a „proposed to be used basis‟, except serial \nno. 14, which has been filed with the claim of use of around one month.  \nFurthermore, a perusal of the registration granted in favour of the plaintiff at \nserial no. 14 would also show that the registration has been granted in \nrespect of the stylized manner of writing and not in respect of the words \n‘CPVC PRO’ either in conjunction with each other or individually.  \n12. \nIt is also relevant to note here that other applications filed by the \nplaintiff for the mark ‘CPVC PRO’ and ‘CPVC PRO’ formative marks, all \ndated 6th September, 2016, have been objected to by the Registry on the \nground that they lack distinctiveness.  Yet, the applications at serial no.11 to \nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified\n\n--- PAGE 11 ---\n2023/DHC/001281 \n \nCS(COMM) 309/2022                                                                                                 Page 11 of 18 \n \n15, in respect of similar trademarks, were accepted by the Registry.  Further, \nwhen conditions with regard to use of the term ‘CPVC PRO’ have been \nimposed on the earlier registrations of the plaintiff given at serial no.1 to 3 \nand 12 above, there is no explanation as to why similar conditions were not \nimposed by the Registry in respect of the trademark applications given at \nserial no.11, 13, 14 and 15 above. It appears that the plaintiff was randomly \nfiling registrations for marks with minor variations in several Classes, \nhoping that some of the registrations would be granted without any \nconditions. To illustrate, the plaintiff has been granted registration in respect \nof the mark \n in Class 19 without any disclaimer/condition on \nthe registration, whereas registration of the identical mark under TM \nApplication No.3355649 has been refused by the Registry in Class 17. This \nraises a serious doubt with regard to the validity of the registrations granted \nin favour of the plaintiff at serial no.11 to 15 in the table above. Therefore, \nat this interlocutory stage, the plaintiff cannot claim monopoly over the \nwords ‘CPVC’ or ‘PRO’ either individually or in conjunction with each \nother/other words and these registrations cannot be relied upon the plaintiff \nin the present suit for infringement. \n13. \nThe registrations at serial no.16 and 17 were in respect of ‘CPVC \nPRO’ word marks per se. The same were granted in 2020, during the \nCOVID-19 period, in the absence of any oppositions. In this regard, \nreference may be made to the judgment in Dr. Reddy Laboratories Limited \n(supra), wherein a Coordinate Bench of this Court has made the following \nobservations: \n“18. In any event, in terms of the orders of the Supreme Court \nextending the period of limitation in all proceedings and the \nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified\n\n--- PAGE 12 ---\n2023/DHC/001281 \n \nCS(COMM) 309/2022                                                                                                 Page 12 of 18 \n \nstand of the CGPDTM before the Delhi High Court in W.P.(C) \n3059/2020, the CGPDTM has a duty to extend the limitation for \nfiling oppositions to trademark applications… \n \n(v) Insofar as trademark registration certificates which may \nhave been issued during the pandemic period, the \nregistration certificates shall be dealt with in the following \nmanner:  \n \n(a) In respect of the trademark applications in which no \noppositions have been already filed or are received till \n30th May, 2022, the said registration certificates shall \nremain valid and the said applicants shall enjoy their \nstatutory rights in accordance with law.  \n \n(b) In respect of those trademark applications where \noppositions have already been filed or are filed by 30th \nMay, 2022, the registration certificates shall either not \nbe issued or if already issued, the same shall stand \nsuspended till the oppositions are decided by the office \nof the CGPDTM.” \n14. \nIn light of the aforesaid judgment, since the defendant had filed \noppositions before 30th May, 2022, the registrations granted in favour of the \nplaintiff and provided at serial no.16 and 17 in the table above would stand \nsuspended until the oppositions are decided. Therefore, no reliance can be \nplaced on the registrations of the word mark ‘CPVC PRO’.  \n15. \nCounsel for the plaintiff has further submitted that the plaintiff has no \nobjection to the defendant using the word ‘CPVC’ as it is an abbreviation for \na material of the plastic. However, an objection is raised with regard to the \nuse of the word ‘PRO’ in conjunction with the word ‘CPVC’ as the plaintiff \nclaims that the word ‘CPVC FLOWPRO’ is deceptively similar to the mark \nused by the plaintiff, ‘CPVC PRO’. It is a settled position of law that \nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified\n\n--- PAGE 13 ---\n2023/DHC/001281 \n \nCS(COMM) 309/2022                                                                                                 Page 13 of 18 \n \ngeneric, laudatory and descriptive marks cannot be monopolized by anyone \nunless a case is made out in respect of the mark acquiring distinctive \ncharacter or of its well-known status. The fact that conditions were imposed \non the plaintiff by the Registry, against the use of generic terms like ‘CPVC \nPRO’ and ‘CPVC CHEM PRO’, is clearly indicative of the fact that the \nplaintiff cannot monopolize the terms ‘CPVC’ or ‘PRO’, individually or in \nconjunction with each other. \n16. \nTo show that the word ‘PRO’ is generic and laudatory, the counsel for \nthe defendant has submitted dictionary meanings of the said word, which are \nas under: \n“Cambridge Dictionary: The word „PRO‟ means: \n \n(a) „a professional or somebody who is better than others at \ndoing something; \n \n(b) „a person who receives money for playing a sport‟; \n \nOxford Dictionary: The word PRO means: \n \n„a person who works as a professional, especially in a sport‟.” \n \n17. \nIn support of their submission that the word ‘PRO’ is commonly used \nin the trade, the defendant has also placed material on record to show that \nvarious companies are selling pipes and other products in the construction \nindustry using the word ‘PRO’. Counsel for the plaintiff has disputed this \nsubmission and stated that no other pipes with the word mark ‘PRO’ are \navailable in the market. Be that as it may, this aspect can only be established \nin the trial and at a prima facie stage, the Court would have to take \ncognizance of the material placed on record by the defendant. \nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified\n\n--- PAGE 14 ---\n2023/DHC/001281 \n \nCS(COMM) 309/2022                                                                                                 Page 14 of 18 \n \n18. \nCounsel for the plaintiff has placed reliance on my judgment in \nSoothe Healthcare Pvt. Ltd. v. Dabur India Limited, 2022 SCC OnLine \nDel  645. In the said case, the plaintiff sought an interim injunction against \nthe defendant on the ground that the trademark of the defendant ‘SUPER \nPANTS’ was deceptively similar to the trademark of the plaintiff ‘SUPER \nCUTES’ and ‘SUPER CUTESTERS’. Relying upon the judgment of a \nDivision Bench of this Court in Marico Limited v. Agro Tech Food \nLimited, 2010 (44) PTC 736 (Del) DB, the application for interim injunction \nwas dismissed. It was held, inter alia, that since the word ‘SUPER’ is being \nused in a laudatory manner, it is devoid of any distinctive character and \nincapable of distinguishing the goods of the plaintiff from that of others, and \ntherefore, even if the plaintiff had obtained registration in respect of the \nmark ‘SUPER’, it would not give the plaintiff exclusive right to use the \nmark ‘SUPER’. It was further noted that the fact that the house mark is \nwritten in a slightly smaller font would not make a material difference. One \nof the other grounds for denying injunction was that the defendant in the \nsaid case was using the mark ‘SUPER PANTS’ along with its house mark \n‘Dabur’. The relevant observations of the said judgment are set out below: \n“8. \nA comparison of the packaging of the defendant and the \nplaintiff above shows that other than the word “SUPER” \noccurring in both the aforesaid packaging, there is no other \nsimilarity. The packaging of the defendant includes the trade \nmark of the defendant, “Dabur” which is prominently \ndisplayed. Merely because the word “Dabur” is written in a \nslightly smaller font as compared to “SUPER PANTS”, in my \nopinion, would not make any difference. The fact of the matter \nis that the word “Dabur” is prominently displayed on the \npackaging along with the word “baby”. The colour scheme of \nthe packaging is also totally different. The colour scheme of the \nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified\n\n--- PAGE 15 ---\n2023/DHC/001281 \n \nCS(COMM) 309/2022                                                                                                 Page 15 of 18 \n \nplaintiff is yellow and orange/blue and yellow, and the \ndefendant is primarily green. From the description of the \npackaging of the defendant's product, it is more than clear that \nthere is enough added material therein to distinguish the \ndefendant's product from that of the plaintiff. Therefore, it \ncannot be said that there is a possibility of confusion or \ndeception being caused among the customers of the two \nproducts. Hence, I am not convinced that the defendant is \npassing off their goods as those of the plaintiff. \n \n9. \nThe next issue that comes up for consideration is \nwhether word “SUPER” is a descriptive or a laudatory word \nand whether it can attain distinctiveness in respect of the \ngoods of the plaintiff. As per the Oxford's Learners \nDictionary, the word “SUPER” means “extremely good”, and \nas per the Cambridge Dictionary also, the word “SUPER” \nmeans “excellent or extremely good”. Clearly, as per its \ndictionary meaning, the word “super; is a laudatory word of \nthe English Language. \n \nXXX \n \n \n \nXXX  \n \n \n \nXXX \n \n13. \nIn view of the above, I am of the opinion that the mark \n“SUPER” is devoid of any distinctive character and not \ncapable of distinguishing the goods of the plaintiff. Therefore, \neven if the plaintiff has obtained registration in respect of the \nmarks “SUPER CUTESTERS”, “SUPER CUTES” and \n“SUPER CUTEZ”, it would not give him exclusive right over \nthe use of the word “SUPER”.” \n \n19. \nThe appeal filed against the aforesaid judgment was dismissed by the \njudgment of a Division Bench of this Court, reported as Soothe Healthcare \nPrivate Limited v. Dabur India Limited, 2022 SCC OnLine Del 2006. The \nrelevant observations of the Division Bench are set out below: \nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified\n\n--- PAGE 16 ---\n2023/DHC/001281 \n \nCS(COMM) 309/2022                                                                                                 Page 16 of 18 \n \n“37.  \nThe judgments relied upon are not applicable to the facts \nof the present case. There is no quarrel to the proposition that \neven an ordinary word or a descriptive word, if acquires a \nsecondary meaning and has acquired a distinctive character, can \nbe protected by way of an injunction when identified with a \nparticular product or being from a particular source. As \ndiscussed above, DABUR's mark, i.e., “DABUR BABY SUPER \nPANTS” when taken as a whole cannot be termed as deceptively \nsimilar to SOOTHE's registered marks referred in „paragraph 2‟ \nabove. As far as the use of the word “SUPER” by DABUR in its \nmark, the same, prima facie seems to be laudatory and \ndescriptive of the product being offered by DABUR. \nIndisputably, the term “SUPER” is widely used in respect of \nvarious products not only of similar nature but also of different \nclass and categories. SOOTHE cannot, therefore, prima \nfacie claim that the use of the word “SUPER” by DABUR in its \nmark is deceptively similar to SOOTHE's registered trademark \nfor the reason that the word “SUPER” also appears in \nSOOTHE's marks referred in „paragraph 2‟ above. SOOTHE \nalso cannot prima facie claim that the word “SUPER” \nappearing in its registered mark has acquired a secondary \nmeaning or a distinctive character when used in a particular \nproduct of SOOTHE, i.e., diapers.” \n \n20. \nThe present case is covered on all fours by the aforesaid judgments. \nThe word ‘PRO’, of which exclusive use was sought by the plaintiff, is \nsimilar to the word ‘SUPER’ as both are laudatory words. Prima facie, the \nword ‘PRO’, either by itself or in conjunction with the word ‘CPVC’, \nappears to be non-distinctive and laudatory in terms of Section 9 of the \nTrade Marks Act, 1999. Even if the plaintiff has obtained registrations in \nrespect of ‘CPVC PRO’ and ‘CPVC PRO’ formative marks, the plaintiff \ncannot have exclusive rights to use the word ‘PRO’. Hence, at this \ninterlocutory stage, the plaintiff has failed to make out a case of \ninfringement. \nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified\n\n--- PAGE 17 ---\n2023/DHC/001281 \n \nCS(COMM) 309/2022                                                                                                 Page 17 of 18 \n \n21. \nPlaintiff has also claimed that the mark ‘CPVC PRO’ has become \ndistinctive of its goods on account of its usage. Admittedly, the plaintiff has \nused the mark ‘CPVC PRO’ and other formative marks using the words \n‘CPVC’ and PRO’ only with effect from 2016. Nothing has been filed on \nbehalf of the plaintiff to show that the plaintiff has advertised or promoted \nthe mark ‘CPVC PRO’ on a stand-alone basis. Therefore, at an interlocutory \nstage, the plaintiff cannot claim acquired distinctiveness or goodwill in the \nterm ‘CPVC PRO’, which can only be established during the trial. Even \notherwise, as observed above, a comparison of the competing marks of the \nplaintiff and the defendant reveals that there is no likelihood of confusion in \nthe market. Hence, I am of the prima facie view that the defendant is not \npassing off its goods as those of the plaintiff. \n22. \nCounsel for the plaintiff has vehemently argued that the products in \nquestion, pipes, are used by plumbers, who identify the product with the \nterm ‘CPVC PRO’ and not the house marks. I do not find merit in this \nsubmission of the plaintiff. I see no reason as to why persons in the trade, \nincluding plumbers, would not identify with a product through the house \nmark which finds mention on the product. Nor has the plaintiff filed any \nmaterial to substantiate such a claim. \n23. \nCounsel for the plaintiff has placed strong reliance on the recent \njudgment of the Division Bench in PEPS Industries Private Limited v. \nKurlon Limited, 2022 SCC OnLine  Del 3275 to contend that (i) when the \ndefendant has sought for registration of the same mark as that of the plaintiff \n(‘NO TURN’ in the said case), such a defendant is estopped from raising a \nquestion on the validity of the said mark on the ground of it being \ndescriptive in nature; and, (ii) registration granted in favour of the plaintiff is \nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified\n\n--- PAGE 18 ---\n2023/DHC/001281 \n \nCS(COMM) 309/2022                                                                                                 Page 18 of 18 \n \nprima facie evidence of its validity and cannot be ignored unless a question \non the validity of the registration is raised. \n24. \nIn the present case, the defendant has sought registration of the marks \nbearing the word ‘CPVC’ not on a stand-alone basis but along with its house \nmark ‘ASHIRVAD’. Therefore, it cannot be said that the defendant is \nestopped from raising the issue of non-distinctiveness of the term ‘CPVC \nPRO’ or its individual components.  Further, in the present case, the \ndefendant has raised objections with regard to validity of the registrations \ngranted in favour of the plaintiff.  Therefore, the judgment in PEPS \nIndustries (supra) is clearly distinguishable and would not advance the case \nof the plaintiff. \n25. \nIn light of the discussion above, I am of the view that the plaintiff has \nfailed to make out a prima facie case for grant of interim injunction. \n26. \nAccordingly, I.A.7334/2022 filed on behalf of the plaintiff under \nOrder XXXIX Rules 1 and 2 of the CPC is dismissed. \n27. \nNeedless to state, any observations made herein are only for the \npurposes of adjudication of the present application and would have no \nbearing on the final outcome of the suit. \nCS(COMM) 309/2022, I.A. 8856/2022(O-XI R-1(4) of CPC), I.A. \n9750/2022 (O-XI R-1(10) of CC Act), I.A. 12468/2022(u/s 124 of Trade \nMark Act) and I.A. 19036/2022(O-XI R-1(4) of CPC) \n \n28. \nList for consideration on 24th April, 2023. \n \nAMIT BANSAL, J. \nFEBURARY 23, 2023/dk \nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified\n"
  },
  "total_pages": 18,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "According to the PDF document \"19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf\", the case CS(COMM) 309/2022 was heard in the High Court of Delhi at New Delhi. The judgment was reserved on February 3, 2023, and delivered on February 23, 2023. The plaintiff, Astral Ltd, is a public limited company engaged in manufacturing and selling high-quality pipes and fittings. The defendant is Ashirvad Pipes Pvt Ltd.\n\nThe plaintiff claims to have launched Chlorinated Polyvinyl Chloride (CPVC) piping systems in India in 2004 and has obtained various registrations for the mark 'CPVC PRO' and 'CPVC PRO' formative trademarks. The plaintiff filed an application for an interim injunction under Order XXXIX Rules 1 and 2 of the Code of Civil Procedure, 1908.\n\nThe court heard the application on February 3, 2023, and reserved the judgment. The counsels for both parties filed their written submissions. The plaintiff's case is based on the claim that the defendant is infringing on their registered trademarks.\n\nThe key dates in the case are:\n- May 11, 2022: Summons in the suit was issued\n- February 3, 2023: Judgment was reserved\n- February 23, 2023: Judgment was delivered\n\nThe parties involved are:\n- Astral Ltd (Plaintiff)\n- Ashirvad Pipes Pvt Ltd (Defendant)\n\nThe PDF document provides more details on the case, including the proceedings, arguments, and decisions. (Source: 19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf)",
      "pdf_source": "19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "According to page 1 of the PDF \"19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf\", the case CS(COMM) 309/2022 was heard in the High Court of Delhi at New Delhi. The judgment was reserved on February 3, 2023, and delivered on February 23, 2023. The plaintiff, Astral Ltd, was represented by advocates Mr. Sachin Gupta, Ms. Yashi Agrawal, and Mr. Lokesh Dhaka, while the defendant, Ashirvad Pipes Pvt Ltd, was represented by Senior Advocate Mr. Darpan Wadhwa and others. The court, presided over by Hon'ble Mr. Justice Amit Bansal, decided on the application for an interim injunction under Order XXXIX Rules 1 and 2 of the CPC. The summons in the suit was issued on May 11, 2022, and the pleadings have been completed. The application I.A. 7334/2022 was heard on February 3, 2023. (Source: 2023/DHC/001281, PDF page 1)",
          "content": "2023/DHC/001281 \n \nCS(COMM) 309/2022                                                                                                 Page 1 of 18 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n% \n \n \n Judgment Reserved on : 3rd February, 2023 \nJudgment Delivered on : 23rd February, 2023 \n  \n+  \nCS(COMM) 309/2022, I.A. 8856/2022(O-XI R-1(4) of CPC), I.A. \n9750/2022(O-XI R-1(10) of CC Act), I.A. 12468/2022(u/s 124 of \nTrade Mark Act) and I.A. 19036/2022(O-XI R-1(4) of CPC) \n \n \n \nASTRAL LTD \n \n \n \n \n \n..... Plaintiff \nThrough: \nMr.Sachin Gupta, Ms. Yashi Agrawal \nand Mr.Lokesh Dhaka, Advocates. \n \n \n \n \nversus \n \n \nASHIRVAD PIPES PVT LTD  \n \n \n..... Defendant \nThrough: \nMr. \nDarpan \nWadhwa, \nSenior \nAdvocate with Mr. Prashant Gupta, \nMs. Neelakshi Bhadauria, Mr. Amer \nVaid and Mr. Karan Singh, Advocates \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nJUDGMENT \nAMIT BANSAL, J. \n \nI.A. 7334/2022 (O-XXXIX R-1 & 2 of the CPC) \n1. \nBy way of the present judgment, I shall decide the application filed on \nbehalf of the plaintiff under Order XXXIX Rules 1 and 2 of the Code of \nCivil Procedure, 1908 (CPC) for grant of interim injunction. \nPROCEEDINGS IN THE SUIT \n2. \nSummons in the suit was issued on 11th May, 2022.  However, no ad \ninterim injunction order was passed in favour of the plaintiff.  Thereafter, \nthe matter was listed on various dates and pleadings have been completed in \nthe suit as well as the present application. I.A. 7334/2022 was heard on 3rd \nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified",
          "pdf_source": "19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "According to page 2 of the PDF \"19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf\", the case setup in the plaint is as follows: \nThe plaintiff company, Astral Ltd, was incorporated in 1996 and converted into a public limited company in 2006. It manufactures and sells high-quality pipes and fittings. In 2004, Astral became the first entity to launch Chlorinated Polyvinyl Chloride (CPVC) piping systems in India. \nThe plaintiff has obtained registrations for the mark 'CPVC PRO' and 'CPVC PRO' formative trademarks. Some registrations have a disclaimer, while subsequent ones do not. \nThe judgment was reserved on February 3, 2023, and counsels filed written submissions. The case involves Astral Ltd vs. Ashirvad Pipes Pvt Ltd, with the court case number CS(COMM) 309/2022. (Source: 19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf)",
          "content": "2023/DHC/001281 \n \nCS(COMM) 309/2022                                                                                                 Page 2 of 18 \n \nFebruary, 2023,  when the judgment was reserved and counsels were given \ntime to file written submissions.  Both the sides have filed their respective \nbrief notes of submissions. \nCASE SET UP IN THE PLAINT \n3. \nThe case set up in the plaint is as under: \n3.1 \nPlaintiff company was incorporated on 25th March, 1996 as a private \nlimited company and in the year 2006, the plaintiff company was \nconverted into a public limited company.   \n3.2 \nPlaintiff company is engaged in the business of manufacturing, \ndistributing and selling of high-quality pipes, parts and fittings for use \nin plumbing, sewage, drainage, fire protection and the like. The \nplaintiff company has manufacturing facilities at six locations in India \nand has received various awards and accolades in respect of its \nvarious products. \n3.3 \nIn the year 2004, the plaintiff company became the first entity to \nlaunch Chlorinated Polyvinyl Chloride (CPVC) piping systems in \nIndia.  \n3.4 \nThe plaintiff has filed and obtained various registrations in respect of \nthe mark ‘CPVC PRO’ and ‘CPVC PRO’ formative trademarks, \nwhich are detailed in paragraph 15 of the plaint. \n3.5 \nSome of the registrations of the plaintiff have a disclaimer that no \nexclusive rights have been granted in respect of the words ‘CPVC \nPRO’ and ‘CPVC CHEM PRO’.  However, the subsequent \nregistrations do not have this condition.  Some of the applications \nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified",
          "pdf_source": "19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0007",
      "start_index": 3,
      "end_index": 5,
      "summary": "According to the PDF document \"19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf\", a legal proceeding (CS(COMM) 309/2022) was filed in the High Court of Delhi. The plaintiff, Astral Ltd, claims that the defendant, Ashirvad Pipes Pvt Ltd, has infringed upon their trademark 'CPVC PRO' by using the mark 'CPVC FLOWPRO'. The plaintiff alleges that the defendant's adoption of the trademark is dishonest and an attempt to ride on their goodwill and reputation.\n\nThe plaintiff has been using the 'CPVC PRO' mark since 2016 and has acquired immense reputation and goodwill in the market, with sales of around Rs.954 crores in 2021-2022. The defendant filed a trademark application for 'CPVC FLOWPRO' in January 2021, which the plaintiff claims is similar to their trademark.\n\nThe defendant argues that the word 'PRO' is generic, descriptive, and laudatory, and cannot be monopolized by the plaintiff. They also claim that the plaintiff's trademark registrations are bad in law and that the registrations granted during the COVID-19 pandemic should be treated as suspended.\n\nThe court reserved judgment on February 3, 2023, and delivered it on February 23, 2023. The plaintiff seeks a decree of permanent injunction along with other ancillary reliefs. The case highlights the importance of trademark protection and the need to prevent infringement. (Source: 19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf, Pages 1-5)",
      "pdf_source": "19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "According to page 3 of the PDF \"19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf\" (2023/DHC/001281), the plaintiff, Astral Ltd, has been using the 'CPVC PRO' trademark since 2016. The defendant, Ashirvad Pipes Pvt Ltd, filed a trademark application for 'CPVC FLOWPRO' in January 2021, which is similar to the plaintiff's trademark. The plaintiff claims that the defendant's adoption of the 'CPVC FLOWPRO' trademark is dishonest and an attempt to ride on their goodwill and reputation. The plaintiff's sales under the 'CPVC PRO' trademark were around Rs. 954 crores in 2021-2022. The plaintiff has engaged celebrities to advertise their products and has acquired immense reputation and goodwill in the market. The case, CS(COMM) 309/2022, was judged on February 23, 2023.",
          "content": "2023/DHC/001281 \n \nCS(COMM) 309/2022                                                                                                 Page 3 of 18 \n \nfiled on behalf of the plaintiff in respect of ‘CPVC PRO’ and ‘CPVC \nPRO’ formative marks have been objected to. \n3.6 \nPlaintiff has engaged various celebrities and superstars from time to \ntime to advertise their products under the aforesaid trademarks. \n3.7 \nThe statement in respect of domestic sales and exports of the plaintiff \nhave been provided in paragraph 20 of the plaint.  In the year 2021–\n2022, the sales of the plaintiff in respect of the trademarks ‘CPVC \nPRO’ was around Rs.954 crores. \n3.8 \nOn account of its superior quality, continuous and extensive use, and \nlarge scale publicity, the plaintiff’s trademark ‘CPVC PRO’ has \nacquired immense reputation and goodwill in the market.  \nAccordingly, the plaintiff claims both statutory as well as common \nlaw rights in the trademark ‘CPVC PRO’. \n3.9 \nDefendant has also filed various trademark applications in respect of \nsimilar products which are pending as on date.  The  grievance of the \nplaintiff is with regard to the impugned mark ‘CPVC FLOWPRO’, \nwherein ‘CPVC’ and ‘PRO’ are being used together and the same is \nsimilar to the trademark of the plaintiff, ‘CPVC PRO’. \n3.10 The trademark application of the defendant was filed in January, \n2021, on a „proposed to be used basis‟, whereas the plaintiff has been \nusing the ‘CPVC PRO’ marks since 2016.  In this  regard, invoices \nhave been placed on record by the plaintiff.   \n3.11 The adoption of the trademark ‘CPVC FLOWPRO’ by the defendant \nis dishonest and an attempt to ride on the goodwill and reputation of \nthe plaintiff. \nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified",
          "pdf_source": "19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "According to page 4 of the PDF \"19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf\", a cease and desist notice was issued by the plaintiff (Astral Ltd) to the defendant (Ashirvad Pipes Pvt Ltd) on December 17, 2021. The defendant replied to the notice, and the plaintiff subsequently filed a suit seeking a permanent injunction and other reliefs. The defendant's written statement argues that the plaintiff cannot monopolize the word \"PRO\" as it is a generic and descriptive term. The defendant also claims that some of the plaintiff's trademark registrations are conditional, with no exclusive rights over certain marks, and some were refused registration under Section 9 of the Trade Marks Act, 1999. The case, CS(COMM) 309/2022, was heard in the High Court of Delhi, with judgment reserved on February 3, 2023, and delivered on February 23, 2023. (Source: 19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf)",
          "content": "2023/DHC/001281 \n \nCS(COMM) 309/2022                                                                                                 Page 4 of 18 \n \n3.12 A cease and desist notice dated 17th December, 2021 was issued by \nthe plaintiff to the defendant.  The aforesaid notice was replied to by \nthe defendant. \n3.13 Accordingly, the present suit was filed seeking a decree of permanent \ninjunction along with other ancillary reliefs. \nCASE SET UP IN THE WRITTEN STATEMENT \n4. \nThe case set out in the written statement is as under: \n4.1 \nThe plaintiff does not have any grievance with the use of the word \n‘CPVC’ by the defendant as it is an abbreviation of the material of the \nplastic.  The plaintiff objects to the use of the word ‘PRO’, which \ncannot be monopolized by the plaintiff.  Reliance is placed on the \nvarious dictionary meanings of the word ‘PRO’, which show that the \nword ‘PRO’ is a generic, descriptive and laudatory word.  The word \n‘PRO’ is used by several well-known companies  in relation to \ndifferent products as part of their marks, details of which are given in \nparagraph 14 of the written statement. \n4.2 \nIn several of the registrations granted in favour of the plaintiff, a \ncondition has been imposed on the plaintiff that the plaintiff shall not \nhave exclusive right over the marks/terms ‘CPVC PRO’, ‘CPVC \nCHEM PRO’ and ‘CHEM PRO’.  Further, several of the plaintiff’s \nmarks were refused registration under Section 9 of the Trade Marks \nAct, 1999.  Therefore, the other registrations granted to the plaintiff in \nrespect of ‘CPVC PRO’ formative marks are bad in law and the \nplaintiff cannot rely upon them.  \nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified",
          "pdf_source": "19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf",
          "nodes": []
        },
        {
          "title": "Page 5",
          "node_id": "0006",
          "start_index": 5,
          "end_index": 5,
          "summary": "According to page 5 of the PDF \"19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf\", the plaintiff's trademark registrations for 'CPVC PRO' are considered suspended due to being obtained during the COVID-19 pandemic, as per a judgment dated March 21, 2022. The plaintiff always used 'CPVC PRO' with its house mark 'ASTRAL', and therefore, cannot claim distinctiveness. The defendant has been selling products under its trademark since 1975, with a revenue of around Rs.3,500 crores in 2021. The defendant started selling and exporting products under the mark 'ASHIRVAD BY ALIAXIS CPVC FLOWPRO' in November 2021. The court argues that this mark is dissimilar to the plaintiff's, and no confusion can be caused. (Source: 2023/DHC/001281, CS(COMM) 309/2022, Page 5 of 18)",
          "content": "2023/DHC/001281 \n \nCS(COMM) 309/2022                                                                                                 Page 5 of 18 \n \n4.3 \nThe trademark registrations in respect of word marks ‘CPVC PRO’ \nhave to be treated as suspended since it was obtained during the \nCOVID-19 pandemic. Reliance in this regard is placed on the \njudgment dated 21st March, 2022 passed by this Court in WP(C)-IPD \nNo.4/2022 titled Dr. Reddy Laboratories Limited v. Controller \nGeneral of Patents Designs and Trademarks. \n4.4 \n The plaintiff has always used the words ‘CPVC PRO’ in conjunction \nwith its house mark ‘ASTRAL’ and has never used the same \nindependently. \nTherefore, \nthe \nplaintiff \ncannot \nclaim \nany \ndistinctiveness in respect of the mark ‘CPVC PRO’.  \n4.5 \nThe defendant has been selling its products under the trademark \n since the year 1975.  Details of turnover of the \ndefendant are given on page 44, paragraph 11 of the written \nstatement.  In the year 2021, the defendant had a revenue of around \nRs.3,500 crores. \n4.6 \nDefendant has been selling and exporting products under the mark \n since November, 2021. \n4.7 \nThe \nmark/expression \n‘ASHIRVAD \nBY \nALIAXIS \nCPVC \nFLOWPRO’ is dissimilar to the mark/expression used by the plaintiff \nand therefore, there cannot be any cause for confusion.  Both the \nplaintiff and the defendant use their house marks ‘ASTRAL’ and \n‘ASHIRVAD’ respectively in conjunction with the words ‘CPVC’, \n‘PRO’ and/or ‘CPVC PRO’. \n \nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified",
          "pdf_source": "19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0019",
      "start_index": 6,
      "end_index": 16,
      "summary": "According to the PDF document \"19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf\", the High Court of Delhi at New Delhi heard the case CS(COMM) 309/2022, with judgment reserved on February 3, 2023, and delivered on February 23, 2023. The plaintiff, Astral Ltd, submitted that the defendant, Ashirvad Pipes Pvt Ltd, had dishonestly adopted the mark \"CPVC FLOWPRO\" and was selling CPVC pipes under the trademark \"ASHIRVAD FLOW GUARD\" as per a license agreement with Lubrizol.\n\nThe defendant argued that descriptive and generic marks like \"CPVC\" and \"PRO\" cannot be monopolized, and they were not using the word \"PRO\" on a stand-alone basis. The defendant also stated that their products were sold with their house mark \"ASHIRVAD\", making it distinct from the plaintiff's products.\n\nThe court analyzed the competing marks of the parties and found that the defendant was using the words \"CPVC\" and \"PRO\" along with their house mark. The plaintiff was using the words \"CPVC\" and \"PRO\" with and without their house mark \"ASTRAL\". The court considered the submissions of both parties, including the plaintiff's claim of proprietary rights over laudatory and dictionary words, and the defendant's argument that evidence of subsequent use post-registration cannot be considered in an infringement action. (Source: 19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf)",
      "pdf_source": "19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf",
      "nodes": [
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "According to page 6 of the PDF \"19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf\", the plaintiff's counsel made submissions that the plaintiff's subsequent registrations without disclaimers make the conditions of earlier registrations irrelevant, and the suit for infringement and passing off is maintainable. The plaintiff also argued that the defendant's adoption of the mark \"CPVC FLOWPRO\" is dishonest and that proprietary rights can be given to laudatory and dictionary words.\n\nThe defendant's counsel countered that despite the disclaimers in four of the plaintiff's registrations, the plaintiff's claims are not valid. The case, CS(COMM) 309/2022, had judgment reserved on February 3, 2023, and delivered on February 23, 2023. The PDF source provides details of the court proceedings, including the submissions made by both parties. (Source: 19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf, page 6)",
          "content": "2023/DHC/001281 \n \nCS(COMM) 309/2022                                                                                                 Page 6 of 18 \n \nSUBMISSIONS ON BEHALF OF THE PLAINTIFF \n5. \nSupplementing the averments made in the plaint, counsel for the \nplaintiff made the following submissions: \n5.1 \nIn view of the fact that the plaintiff has obtained subsequent \nregistrations without any disclaimer, the conditions imposed while \ngranting earlier registrations are not relevant and the present suit for \ninfringement and passing off is maintainable. \n5.2 \nThe adoption of the mark ‘CPVC FLOWPRO’ by the defendant is \ndishonest as the words ‘CPVC FLOWPRO’ are the most prominent \nwords used on their pipes and fittings. The defendant is already selling \nCPVC pipes under the trademark ‘ASHIRVAD FLOW GUARD’ in \nterms of the license agreement entered into by the plaintiff with \nLubrizol. \n5.3 \nA party can be given proprietary rights even in respect of laudatory \nand dictionary words. In view of the fact that the defendant has also \napplied for registration in respect of the words ‘CPVC PRO’, the \ndefendant cannot claim that the said mark is generic. \n5.4 \nNo one in the market is using the mark ‘CPVC PRO’ or the word \n‘PRO’ in respect of pipes and fittings.   \nSUBMISSIONS ON BEHALF OF THE DEFENDANT \n6. \nIn support of the averments made in the written statement, senior  \ncounsel appearing on behalf of the defendant has  made the following \nsubmissions: \n6.1 \nEven though in respect of four of the plaintiff’s registrations, there is a \ndisclaimer in respect of the word ‘CPVC PRO’, the plaintiff has \nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified",
          "pdf_source": "19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf",
          "nodes": []
        },
        {
          "title": "Page 7",
          "node_id": "0009",
          "start_index": 7,
          "end_index": 7,
          "summary": "According to page 7 of the PDF \"19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf\" (2023/DHC/001281), the defendant argues that descriptive and generic marks like 'CPVC' and 'PRO' cannot be monopolized. The defendant is using 'FLOWPRO' in conjunction with 'CPVC', not 'PRO' alone. The brands 'ASTRAL' and 'ASHIRVAD' are distinctive and appear prominently on the products, making passing off unlikely. The court notes that evidence of subsequent use post-registration cannot be considered in an infringement action, and whether 'CPVC' and 'PRO' have acquired distinctiveness is a matter of trial. The judgment was reserved on February 3, 2023, and delivered on February 23, 2023, in CS(COMM) 309/2022.",
          "content": "2023/DHC/001281 \n \nCS(COMM) 309/2022                                                                                                 Page 7 of 18 \n \ndeliberately filed applications in various Classes in respect of the \ntrademark ‘CPVC PRO’ so that some of the registrations are granted \nwithout any disclaimers. \n6.2 \nDescriptive and generic marks such as ‘CPVC’ and/or ‘PRO’ cannot \nbe monopolized by a party on the ground that they are the first user \nthereof. \n6.3 \nWithout prejudice to the contention of the defendant that the word \n‘PRO’ is laudatory and cannot be monopolized, the defendant is not \nusing the word ‘PRO’ on a stand-alone basis.  The defendant is using \nthe term ‘FLOWPRO’ in conjunction with ‘CPVC’. \n6.4 \nThe pipes and fixtures in the market are known by the respective \nbrands, which in the present case is ‘ASTRAL’ in respect of the \nplaintiff and ‘ASHIRVAD’ in respect of the defendant.  Both the \naforesaid brands are distinctive and appear prominently on the \nproducts of the parties. There cannot be any question of passing off as \nproducts of both plaintiff and defendant are sold with their house \nmarks. \n6.5 \nEvidence of subsequent use of the mark post registration cannot be \nlooked into in an infringement action. \n6.6 \nWhether or not the marks ‘CPVC’ and ‘PRO’ have acquired \ndistinctiveness is a matter of trial. \n7. \nI have heard the counsels for the parties and perused the record.  \nANALYSIS AND FINDINGS \n8. \nAt the outset, reference may be made to the competing marks of the \nparties, which are reproduced hereinbelow: \nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified",
          "pdf_source": "19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf",
          "nodes": []
        },
        {
          "title": "Page 8",
          "node_id": "0010",
          "start_index": 8,
          "end_index": 8,
          "summary": "According to page 8 of the PDF \"19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf\" (2023/DHC/001281), the plaintiff (Astral Ltd) and defendant (Ashirvad Pipes Pvt Ltd) are compared in their usage of marks. The defendant uses \"CPVC\" and \"PRO\" with its house mark \"ASHIRVAD\", while the plaintiff uses \"CPVC\" and \"PRO\" with its house mark \"ASTRAL\". The court notes that the distinctive house marks of the parties negate any possibility of deception or confusion. The word \"CPVC\" is written in a larger font in the plaintiff's product, while \"PRO\" is written in a smaller font. In contrast, the defendant's product uses \"CPVC\" and \"PRO\" in the same font size. The plaintiff seeks exclusivity for the word \"PRO\", which is used as part of the term \"FLOWPRO\". (Source: 19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf, page 8)",
          "content": "2023/DHC/001281 \n \nCS(COMM) 309/2022                                                                                                 Page 8 of 18 \n \n \n \n \nPLAINTIFF’S MARKS \nDEFENDANT’S MARK \n \n \n \n \n9. \nA perusal of the above would show that the defendant is using the \nwords ‘CPVC’ and ‘PRO’ along with its house mark ‘ASHIRVAD’/ \n‘ASHIRVAD BY ALIAXIS’ even though the house mark is written in a \nslightly smaller font. In the first instance, the plaintiff is using the words \n‘CPVC’ and ‘PRO’ along with its house mark ‘ASTRAL’. In the second \ninstance, the plaintiff is using ‘CPVC PRO’ without its house mark \n‘ASTRAL’. Where the term ‘ASTRAL’ is used by the plaintiff in \nconjunction with ‘CPVC PRO’, the usage of the distinctive house marks of \nthe parties negate any possibility of deception or confusion in the marks. \nFurther, in both the aforesaid usages of the plaintiff, the word ‘CPVC’, in \nrespect of which the plaintiff does not claim exclusivity, is written in a much \nlarger font as compared to the other elements of the mark. In fact, the word \n‘PRO’, for which the plaintiff seeks exclusivity, has been written in a \nsmaller font in the plaintiff’s product, whereas in the defendant’s product, it \nis in the same font size as the word ‘CPVC’. Further, the word ‘PRO’ is not \nbeing used by itself but as a component of the term ‘FLOWPRO’ by the \nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified",
          "pdf_source": "19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf",
          "nodes": []
        },
        {
          "title": "Page 9",
          "node_id": "0011",
          "start_index": 9,
          "end_index": 9,
          "summary": "According to page 9 of the PDF \"19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf\", the court states that the competing marks of the plaintiff and defendant are distinguishable, and it is unlikely to cause confusion among customers. The font and style of writing of 'CPVC' and 'PRO' in the marks are different. The court also references various trademark registrations granted to the plaintiff, as listed in paragraph 15 of the plaint, including 12 registrations with different numbers, dates, and classes. The case, CS(COMM) 309/2022, had judgment reserved on February 3, 2023, and delivered on February 23, 2023. (Source: 2023/DHC/001281, Page 9 of 18)",
          "content": "2023/DHC/001281 \n \nCS(COMM) 309/2022                                                                                                 Page 9 of 18 \n \ndefendant. Even the font and style of writing of ‘CPVC’ and ‘PRO’ in the \ncompeting marks are distinguishable. Therefore, in my prima facie view it \ncannot be said that there is a possibility of confusion or deception being \ncaused among the customers of the two products.  \n10. \nAt this stage, reference may be made to the various trademark \nregistrations granted to the plaintiff as set out in paragraph 15 of the plaint. \nS.NO. \nREGISTRATION \nNO. \nTRADEMARK \nDATE OF \nAPPLICATION \nCLASS \n1. \n3298112 \n \n30.06.2016 \n17 \n2. \n3298113 \n \n30.06.2016 \n17 \n3. \n3298114 \n \n30.06.2016 \n19 \n4. \n3298116 \n \n30.06.2016 \n17 \n5. \n3298117 \n \n30.06.2016 \n19 \n6. \n3298118 \n \n30.06.2016 \n17 \n7. \n3298119 \n \n30.06.2016 \n19 \n8. \n3298120 \n \n30.06.2016 \n9 \n9. \n3298121 \n \n30.06.2016 \n21 \n10. \n3298122 \n \n30.06.2016 \n19 \n11. \n3355646 \n \n06.09.2016 \n19 \n12. \n3355647 \n \n06.09.2016 \n17 \nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified",
          "pdf_source": "19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf",
          "nodes": []
        },
        {
          "title": "Page 10",
          "node_id": "0012",
          "start_index": 10,
          "end_index": 10,
          "summary": "According to page 10 of the PDF \"19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf\" (2023/DHC/001281), the court discusses the plaintiff's trademark registrations. The registrations at serial no.1 to 10 include the house mark \"ASTRAL\", while registrations at serial no.11 to 15 are for device marks with words like \"CPVC PRO\" and \"CPVC CHEM PRO\". Notably, registrations at serial no.1 to 3 and 12 have a condition that no exclusive rights have been given to the plaintiff over certain terms. The applications at serial no.11 to 15 were filed on a \"proposed to be used\" basis, except one. The court also notes that other applications for the mark \"CPVC PRO\" filed by the plaintiff on September 6, 2016, were objected to by the Registry due to lack of distinctiveness. (Source: 19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf)",
          "content": "2023/DHC/001281 \n \nCS(COMM) 309/2022                                                                                                 Page 10 of 18 \n \n13. \n3355648 \n \n06.09.2016 \n19 \n14. \n3355650 \n \n06.09.2016 \n19 \n15. \n3355651 \n \n06.09.2016 \n9 \n16. \n4484822 \nCPVC PRO \n03.04.2020 \n17 \n17. \n4484823 \nCPVC PRO \n03.04.2020 \n9 \n11. \nA perusal of the table above would show that the registrations at serial \nno.1 to 10 are of various composite marks, which include the house mark of \nthe plaintiff, ‘ASTRAL’. The registrations at serial no.11 to 15 are \nsubsequent registrations in respect of device marks with the words ‘CPVC \nMULTI PRO’, ‘CPVC CHEM PRO’, ‘CPVC PRO’ and ‘CPVC FIRE PRO’ \nwritten in a stylized manner. The registrations at serial no.1 to 3 and 12 \nabove have a condition that no exclusive rights have been given to the \nplaintiff over the terms ‘CPVC PRO’, ‘CPVC CHEM PRO’ and ‘CHEM \nPRO’. It is also be noted that the applications  at serial no. 11 to 15 in the \ntable above have been filed on a „proposed to be used basis‟, except serial \nno. 14, which has been filed with the claim of use of around one month.  \nFurthermore, a perusal of the registration granted in favour of the plaintiff at \nserial no. 14 would also show that the registration has been granted in \nrespect of the stylized manner of writing and not in respect of the words \n‘CPVC PRO’ either in conjunction with each other or individually.  \n12. \nIt is also relevant to note here that other applications filed by the \nplaintiff for the mark ‘CPVC PRO’ and ‘CPVC PRO’ formative marks, all \ndated 6th September, 2016, have been objected to by the Registry on the \nground that they lack distinctiveness.  Yet, the applications at serial no.11 to \nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified",
          "pdf_source": "19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf",
          "nodes": []
        },
        {
          "title": "Page 11",
          "node_id": "0013",
          "start_index": 11,
          "end_index": 11,
          "summary": "According to page 11 of the PDF \"19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf\", the court raises doubts about the validity of registrations granted to the plaintiff for marks with minor variations. The plaintiff had filed multiple registrations, and some were granted without conditions, while others were refused. The court questions why similar conditions were not imposed on all registrations. The registrations at serial no. 11 to 15 are under scrutiny, and the court refuses to rely on them for infringement claims. The PDF source is 2023/DHC/001281, CS(COMM) 309/2022, with judgment reserved on February 3, 2023, and delivered on February 23, 2023.",
          "content": "2023/DHC/001281 \n \nCS(COMM) 309/2022                                                                                                 Page 11 of 18 \n \n15, in respect of similar trademarks, were accepted by the Registry.  Further, \nwhen conditions with regard to use of the term ‘CPVC PRO’ have been \nimposed on the earlier registrations of the plaintiff given at serial no.1 to 3 \nand 12 above, there is no explanation as to why similar conditions were not \nimposed by the Registry in respect of the trademark applications given at \nserial no.11, 13, 14 and 15 above. It appears that the plaintiff was randomly \nfiling registrations for marks with minor variations in several Classes, \nhoping that some of the registrations would be granted without any \nconditions. To illustrate, the plaintiff has been granted registration in respect \nof the mark \n in Class 19 without any disclaimer/condition on \nthe registration, whereas registration of the identical mark under TM \nApplication No.3355649 has been refused by the Registry in Class 17. This \nraises a serious doubt with regard to the validity of the registrations granted \nin favour of the plaintiff at serial no.11 to 15 in the table above. Therefore, \nat this interlocutory stage, the plaintiff cannot claim monopoly over the \nwords ‘CPVC’ or ‘PRO’ either individually or in conjunction with each \nother/other words and these registrations cannot be relied upon the plaintiff \nin the present suit for infringement. \n13. \nThe registrations at serial no.16 and 17 were in respect of ‘CPVC \nPRO’ word marks per se. The same were granted in 2020, during the \nCOVID-19 period, in the absence of any oppositions. In this regard, \nreference may be made to the judgment in Dr. Reddy Laboratories Limited \n(supra), wherein a Coordinate Bench of this Court has made the following \nobservations: \n“18. In any event, in terms of the orders of the Supreme Court \nextending the period of limitation in all proceedings and the \nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified",
          "pdf_source": "19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf",
          "nodes": []
        },
        {
          "title": "Page 12",
          "node_id": "0014",
          "start_index": 12,
          "end_index": 12,
          "summary": "According to page 12 of the PDF \"19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf\" (2023/DHC/001281), the Controller General of Patents, Designs and Trade Marks (CGPDTM) has a duty to extend the limitation for filing oppositions to trademark applications. The registration certificates for trademark applications with no oppositions filed by May 30, 2022, remain valid. However, for applications with oppositions filed by May 30, 2022, the registrations are suspended until the oppositions are decided. In this case, the defendant's oppositions were filed before May 30, 2022, so the plaintiff's registrations for the word mark 'CPVC PRO' are suspended. The plaintiff has no objection to the defendant using 'CPVC' but objects to the use of 'PRO' in conjunction with 'CPVC' due to similarity with their mark 'CPVC PRO'. (Source: 19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf)",
          "content": "2023/DHC/001281 \n \nCS(COMM) 309/2022                                                                                                 Page 12 of 18 \n \nstand of the CGPDTM before the Delhi High Court in W.P.(C) \n3059/2020, the CGPDTM has a duty to extend the limitation for \nfiling oppositions to trademark applications… \n \n(v) Insofar as trademark registration certificates which may \nhave been issued during the pandemic period, the \nregistration certificates shall be dealt with in the following \nmanner:  \n \n(a) In respect of the trademark applications in which no \noppositions have been already filed or are received till \n30th May, 2022, the said registration certificates shall \nremain valid and the said applicants shall enjoy their \nstatutory rights in accordance with law.  \n \n(b) In respect of those trademark applications where \noppositions have already been filed or are filed by 30th \nMay, 2022, the registration certificates shall either not \nbe issued or if already issued, the same shall stand \nsuspended till the oppositions are decided by the office \nof the CGPDTM.” \n14. \nIn light of the aforesaid judgment, since the defendant had filed \noppositions before 30th May, 2022, the registrations granted in favour of the \nplaintiff and provided at serial no.16 and 17 in the table above would stand \nsuspended until the oppositions are decided. Therefore, no reliance can be \nplaced on the registrations of the word mark ‘CPVC PRO’.  \n15. \nCounsel for the plaintiff has further submitted that the plaintiff has no \nobjection to the defendant using the word ‘CPVC’ as it is an abbreviation for \na material of the plastic. However, an objection is raised with regard to the \nuse of the word ‘PRO’ in conjunction with the word ‘CPVC’ as the plaintiff \nclaims that the word ‘CPVC FLOWPRO’ is deceptively similar to the mark \nused by the plaintiff, ‘CPVC PRO’. It is a settled position of law that \nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified",
          "pdf_source": "19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf",
          "nodes": []
        },
        {
          "title": "Page 13",
          "node_id": "0015",
          "start_index": 13,
          "end_index": 13,
          "summary": "According to page 13 of the PDF \"19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf\" (2023/DHC/001281), the court discusses the generic and laudatory nature of the term \"PRO\". The defendant's counsel submits dictionary meanings of \"PRO\" from Cambridge and Oxford dictionaries, indicating it means a professional or someone skilled. The defendant also provides evidence of other companies using \"PRO\" in their product names. The plaintiff disputes this, but the court considers the defendant's material at the prima facie stage. The case, CS(COMM) 309/2022, had judgment reserved on February 3, 2023, and delivered on February 23, 2023. The court notes that generic terms like \"CPVC\" and \"PRO\" cannot be monopolized unless they acquire distinctive character or well-known status.",
          "content": "2023/DHC/001281 \n \nCS(COMM) 309/2022                                                                                                 Page 13 of 18 \n \ngeneric, laudatory and descriptive marks cannot be monopolized by anyone \nunless a case is made out in respect of the mark acquiring distinctive \ncharacter or of its well-known status. The fact that conditions were imposed \non the plaintiff by the Registry, against the use of generic terms like ‘CPVC \nPRO’ and ‘CPVC CHEM PRO’, is clearly indicative of the fact that the \nplaintiff cannot monopolize the terms ‘CPVC’ or ‘PRO’, individually or in \nconjunction with each other. \n16. \nTo show that the word ‘PRO’ is generic and laudatory, the counsel for \nthe defendant has submitted dictionary meanings of the said word, which are \nas under: \n“Cambridge Dictionary: The word „PRO‟ means: \n \n(a) „a professional or somebody who is better than others at \ndoing something; \n \n(b) „a person who receives money for playing a sport‟; \n \nOxford Dictionary: The word PRO means: \n \n„a person who works as a professional, especially in a sport‟.” \n \n17. \nIn support of their submission that the word ‘PRO’ is commonly used \nin the trade, the defendant has also placed material on record to show that \nvarious companies are selling pipes and other products in the construction \nindustry using the word ‘PRO’. Counsel for the plaintiff has disputed this \nsubmission and stated that no other pipes with the word mark ‘PRO’ are \navailable in the market. Be that as it may, this aspect can only be established \nin the trial and at a prima facie stage, the Court would have to take \ncognizance of the material placed on record by the defendant. \nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified",
          "pdf_source": "19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf",
          "nodes": []
        },
        {
          "title": "Page 14",
          "node_id": "0016",
          "start_index": 14,
          "end_index": 14,
          "summary": "According to page 14 of the PDF \"19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf\" (2023/DHC/001281), the counsel for the plaintiff relied on the judgment in Soothe Healthcare Pvt. Ltd. v. Dabur India Limited (2022 SCC OnLine Del 645). The case involved a trademark dispute between 'SUPER PANTS' and 'SUPER CUTESTERS'. The court ruled that the word 'SUPER' is laudatory and lacks distinctive character, making it incapable of distinguishing goods. The use of a house mark, such as 'Dabur', along with the disputed mark, was also considered a relevant factor in denying an interim injunction. The judgment was cited to support the argument in the current case, CS(COMM) 309/2022, which was heard in the High Court of Delhi.",
          "content": "2023/DHC/001281 \n \nCS(COMM) 309/2022                                                                                                 Page 14 of 18 \n \n18. \nCounsel for the plaintiff has placed reliance on my judgment in \nSoothe Healthcare Pvt. Ltd. v. Dabur India Limited, 2022 SCC OnLine \nDel  645. In the said case, the plaintiff sought an interim injunction against \nthe defendant on the ground that the trademark of the defendant ‘SUPER \nPANTS’ was deceptively similar to the trademark of the plaintiff ‘SUPER \nCUTES’ and ‘SUPER CUTESTERS’. Relying upon the judgment of a \nDivision Bench of this Court in Marico Limited v. Agro Tech Food \nLimited, 2010 (44) PTC 736 (Del) DB, the application for interim injunction \nwas dismissed. It was held, inter alia, that since the word ‘SUPER’ is being \nused in a laudatory manner, it is devoid of any distinctive character and \nincapable of distinguishing the goods of the plaintiff from that of others, and \ntherefore, even if the plaintiff had obtained registration in respect of the \nmark ‘SUPER’, it would not give the plaintiff exclusive right to use the \nmark ‘SUPER’. It was further noted that the fact that the house mark is \nwritten in a slightly smaller font would not make a material difference. One \nof the other grounds for denying injunction was that the defendant in the \nsaid case was using the mark ‘SUPER PANTS’ along with its house mark \n‘Dabur’. The relevant observations of the said judgment are set out below: \n“8. \nA comparison of the packaging of the defendant and the \nplaintiff above shows that other than the word “SUPER” \noccurring in both the aforesaid packaging, there is no other \nsimilarity. The packaging of the defendant includes the trade \nmark of the defendant, “Dabur” which is prominently \ndisplayed. Merely because the word “Dabur” is written in a \nslightly smaller font as compared to “SUPER PANTS”, in my \nopinion, would not make any difference. The fact of the matter \nis that the word “Dabur” is prominently displayed on the \npackaging along with the word “baby”. The colour scheme of \nthe packaging is also totally different. The colour scheme of the \nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified",
          "pdf_source": "19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf",
          "nodes": []
        },
        {
          "title": "Page 15",
          "node_id": "0017",
          "start_index": 15,
          "end_index": 15,
          "summary": "According to page 15 of the PDF \"19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf\" (2023/DHC/001281), the court rules that the defendant's product packaging is distinguishable from the plaintiff's, making it unlikely to cause customer confusion. The court also determines that the word \"SUPER\" is a laudatory term, meaning \"extremely good\" or \"excellent\", and therefore lacks distinctiveness. As a result, the plaintiff's registration of marks like \"SUPER CUTESTERS\" does not grant exclusive rights to the word \"SUPER\". A Division Bench of the Delhi High Court upheld this judgment, citing the case Soothe Healthcare Private Limited v. Dabur India Limited (2022 SCC OnLine Del 2006). The judgment was delivered on February 23, 2023.",
          "content": "2023/DHC/001281 \n \nCS(COMM) 309/2022                                                                                                 Page 15 of 18 \n \nplaintiff is yellow and orange/blue and yellow, and the \ndefendant is primarily green. From the description of the \npackaging of the defendant's product, it is more than clear that \nthere is enough added material therein to distinguish the \ndefendant's product from that of the plaintiff. Therefore, it \ncannot be said that there is a possibility of confusion or \ndeception being caused among the customers of the two \nproducts. Hence, I am not convinced that the defendant is \npassing off their goods as those of the plaintiff. \n \n9. \nThe next issue that comes up for consideration is \nwhether word “SUPER” is a descriptive or a laudatory word \nand whether it can attain distinctiveness in respect of the \ngoods of the plaintiff. As per the Oxford's Learners \nDictionary, the word “SUPER” means “extremely good”, and \nas per the Cambridge Dictionary also, the word “SUPER” \nmeans “excellent or extremely good”. Clearly, as per its \ndictionary meaning, the word “super; is a laudatory word of \nthe English Language. \n \nXXX \n \n \n \nXXX  \n \n \n \nXXX \n \n13. \nIn view of the above, I am of the opinion that the mark \n“SUPER” is devoid of any distinctive character and not \ncapable of distinguishing the goods of the plaintiff. Therefore, \neven if the plaintiff has obtained registration in respect of the \nmarks “SUPER CUTESTERS”, “SUPER CUTES” and \n“SUPER CUTEZ”, it would not give him exclusive right over \nthe use of the word “SUPER”.” \n \n19. \nThe appeal filed against the aforesaid judgment was dismissed by the \njudgment of a Division Bench of this Court, reported as Soothe Healthcare \nPrivate Limited v. Dabur India Limited, 2022 SCC OnLine Del 2006. The \nrelevant observations of the Division Bench are set out below: \nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified",
          "pdf_source": "19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf",
          "nodes": []
        },
        {
          "title": "Page 16",
          "node_id": "0018",
          "start_index": 16,
          "end_index": 16,
          "summary": "According to page 16 of the PDF \"19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf\" (2023/DHC/001281), the court discusses the use of laudatory words in trademarks. The word \"SUPER\" used by DABUR is considered descriptive and not deceptively similar to SOOTHE's registered marks. Similarly, the word \"PRO\" used by the plaintiff is non-distinctive and laudatory, and the plaintiff cannot claim exclusive rights to its use. The court cites Section 9 of the Trade Marks Act, 1999, and rules that the plaintiff has failed to make out a case of infringement at the interlocutory stage. The judgment was delivered on February 23, 2023, in CS(COMM) 309/2022.",
          "content": "2023/DHC/001281 \n \nCS(COMM) 309/2022                                                                                                 Page 16 of 18 \n \n“37.  \nThe judgments relied upon are not applicable to the facts \nof the present case. There is no quarrel to the proposition that \neven an ordinary word or a descriptive word, if acquires a \nsecondary meaning and has acquired a distinctive character, can \nbe protected by way of an injunction when identified with a \nparticular product or being from a particular source. As \ndiscussed above, DABUR's mark, i.e., “DABUR BABY SUPER \nPANTS” when taken as a whole cannot be termed as deceptively \nsimilar to SOOTHE's registered marks referred in „paragraph 2‟ \nabove. As far as the use of the word “SUPER” by DABUR in its \nmark, the same, prima facie seems to be laudatory and \ndescriptive of the product being offered by DABUR. \nIndisputably, the term “SUPER” is widely used in respect of \nvarious products not only of similar nature but also of different \nclass and categories. SOOTHE cannot, therefore, prima \nfacie claim that the use of the word “SUPER” by DABUR in its \nmark is deceptively similar to SOOTHE's registered trademark \nfor the reason that the word “SUPER” also appears in \nSOOTHE's marks referred in „paragraph 2‟ above. SOOTHE \nalso cannot prima facie claim that the word “SUPER” \nappearing in its registered mark has acquired a secondary \nmeaning or a distinctive character when used in a particular \nproduct of SOOTHE, i.e., diapers.” \n \n20. \nThe present case is covered on all fours by the aforesaid judgments. \nThe word ‘PRO’, of which exclusive use was sought by the plaintiff, is \nsimilar to the word ‘SUPER’ as both are laudatory words. Prima facie, the \nword ‘PRO’, either by itself or in conjunction with the word ‘CPVC’, \nappears to be non-distinctive and laudatory in terms of Section 9 of the \nTrade Marks Act, 1999. Even if the plaintiff has obtained registrations in \nrespect of ‘CPVC PRO’ and ‘CPVC PRO’ formative marks, the plaintiff \ncannot have exclusive rights to use the word ‘PRO’. Hence, at this \ninterlocutory stage, the plaintiff has failed to make out a case of \ninfringement. \nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified",
          "pdf_source": "19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0022",
      "start_index": 17,
      "end_index": 18,
      "summary": "According to the PDF document \"19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf\", the Court Decision (2023/DHC/001281) in the case of Astral Ltd vs. Ashirvad Pipes Pvt Ltd was delivered on February 23, 2023. The plaintiff, Astral Ltd, claimed that the defendant, Ashirvad Pipes Pvt Ltd, was passing off its goods using the mark 'CPVC PRO', which the plaintiff claimed had acquired distinctiveness.\n\nThe Court observed that the plaintiff had used the mark 'CPVC PRO' only since 2016 and had not filed any material to show that it had advertised or promoted the mark on a stand-alone basis. The Court also noted that a comparison of the competing marks revealed no likelihood of confusion in the market. The plaintiff's argument that plumbers identify products with the term 'CPVC PRO' and not the house marks was not found to be meritorious.\n\nThe defendant had sought registration of the marks bearing the word 'CPVC' along with its house mark 'ASHIRVAD', and had raised objections regarding the validity of the registrations granted in favor of the plaintiff. The Court dismissed the plaintiff's application for interim injunction, stating that the plaintiff had failed to make out a prima facie case. The case was listed for consideration on April 24, 2023. The decision was made by Judge Amit Bansal, as stated in the PDF document.",
      "pdf_source": "19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf",
      "nodes": [
        {
          "title": "Page 17",
          "node_id": "0020",
          "start_index": 17,
          "end_index": 17,
          "summary": "According to page 17 of the PDF \"19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf\", the plaintiff, Astral Ltd, claims that the mark 'CPVC PRO' has become distinctive of its goods due to usage since 2016. However, the court finds that there is no likelihood of confusion in the market and the defendant is not passing off its goods as those of the plaintiff. The plaintiff's argument that plumbers identify products with the term 'CPVC PRO' and not the house marks is not found to be meritorious. The court also considers the judgment in PEPS Industries Private Limited v. Kurlon Limited, but ultimately decides that the defendant is not estopped from raising questions on the validity of the mark. (Source: 2023/DHC/001281, CS(COMM) 309/2022, PDF page 17)",
          "content": "2023/DHC/001281 \n \nCS(COMM) 309/2022                                                                                                 Page 17 of 18 \n \n21. \nPlaintiff has also claimed that the mark ‘CPVC PRO’ has become \ndistinctive of its goods on account of its usage. Admittedly, the plaintiff has \nused the mark ‘CPVC PRO’ and other formative marks using the words \n‘CPVC’ and PRO’ only with effect from 2016. Nothing has been filed on \nbehalf of the plaintiff to show that the plaintiff has advertised or promoted \nthe mark ‘CPVC PRO’ on a stand-alone basis. Therefore, at an interlocutory \nstage, the plaintiff cannot claim acquired distinctiveness or goodwill in the \nterm ‘CPVC PRO’, which can only be established during the trial. Even \notherwise, as observed above, a comparison of the competing marks of the \nplaintiff and the defendant reveals that there is no likelihood of confusion in \nthe market. Hence, I am of the prima facie view that the defendant is not \npassing off its goods as those of the plaintiff. \n22. \nCounsel for the plaintiff has vehemently argued that the products in \nquestion, pipes, are used by plumbers, who identify the product with the \nterm ‘CPVC PRO’ and not the house marks. I do not find merit in this \nsubmission of the plaintiff. I see no reason as to why persons in the trade, \nincluding plumbers, would not identify with a product through the house \nmark which finds mention on the product. Nor has the plaintiff filed any \nmaterial to substantiate such a claim. \n23. \nCounsel for the plaintiff has placed strong reliance on the recent \njudgment of the Division Bench in PEPS Industries Private Limited v. \nKurlon Limited, 2022 SCC OnLine  Del 3275 to contend that (i) when the \ndefendant has sought for registration of the same mark as that of the plaintiff \n(‘NO TURN’ in the said case), such a defendant is estopped from raising a \nquestion on the validity of the said mark on the ground of it being \ndescriptive in nature; and, (ii) registration granted in favour of the plaintiff is \nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified",
          "pdf_source": "19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf",
          "nodes": []
        },
        {
          "title": "Page 18",
          "node_id": "0021",
          "start_index": 18,
          "end_index": 18,
          "summary": "According to page 18 of the PDF \"19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf\", the court ruled that the plaintiff, Astral Ltd, failed to make a prima facie case for an interim injunction. The defendant, Ashirvad Pipes Pvt Ltd, had raised objections to the validity of the plaintiff's registrations. The court dismissed the plaintiff's application (I.A.7334/2022) under Order XXXIX Rules 1 and 2 of the CPC. The case is listed for consideration on April 24, 2023. The judgment was delivered by Amit Bansal, J. on February 23, 2023. The court noted that any observations made are only for the purposes of the present application and will not affect the final outcome of the suit. (Source: 2023/DHC/001281, CS(COMM) 309/2022)",
          "content": "2023/DHC/001281 \n \nCS(COMM) 309/2022                                                                                                 Page 18 of 18 \n \nprima facie evidence of its validity and cannot be ignored unless a question \non the validity of the registration is raised. \n24. \nIn the present case, the defendant has sought registration of the marks \nbearing the word ‘CPVC’ not on a stand-alone basis but along with its house \nmark ‘ASHIRVAD’. Therefore, it cannot be said that the defendant is \nestopped from raising the issue of non-distinctiveness of the term ‘CPVC \nPRO’ or its individual components.  Further, in the present case, the \ndefendant has raised objections with regard to validity of the registrations \ngranted in favour of the plaintiff.  Therefore, the judgment in PEPS \nIndustries (supra) is clearly distinguishable and would not advance the case \nof the plaintiff. \n25. \nIn light of the discussion above, I am of the view that the plaintiff has \nfailed to make out a prima facie case for grant of interim injunction. \n26. \nAccordingly, I.A.7334/2022 filed on behalf of the plaintiff under \nOrder XXXIX Rules 1 and 2 of the CPC is dismissed. \n27. \nNeedless to state, any observations made herein are only for the \npurposes of adjudication of the present application and would have no \nbearing on the final outcome of the suit. \nCS(COMM) 309/2022, I.A. 8856/2022(O-XI R-1(4) of CPC), I.A. \n9750/2022 (O-XI R-1(10) of CC Act), I.A. 12468/2022(u/s 124 of Trade \nMark Act) and I.A. 19036/2022(O-XI R-1(4) of CPC) \n \n28. \nList for consideration on 24th April, 2023. \n \nAMIT BANSAL, J. \nFEBURARY 23, 2023/dk \nDigitally Signed\nBy:AMIT BANSAL\nSignature Not Verified",
          "pdf_source": "19. ASTRAL LTD Vs. ASHIRVAD PIPES PVT LTD.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-15T18:40:07.147773",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}