{
  "doc_name": "2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI",
  "pdf_source": "2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf",
  "metadata": {
    "document_name": "2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI",
    "source_pdf": "2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf",
    "judges": [
      "AMIT BANSAL"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "813/2016",
      "813/2016",
      "813/2016",
      "813/2016",
      "813/2016",
      "813/2016",
      "813/2016",
      "813/2016",
      "813/2016",
      "813/2016",
      "813/2016",
      "813/2016",
      "16968/2022",
      "311/2017",
      "311/2017",
      "311/2017",
      "311/2017",
      "311/2017"
    ],
    "dhc_numbers": [
      "2022/DHC/005678",
      "2022/DHC/005678",
      "2022/DHC/005678",
      "2022/DHC/005678",
      "2022/DHC/005678",
      "2022/DHC/005678",
      "2022/DHC/005678",
      "2022/DHC/005678",
      "2022/DHC/005678",
      "2022/DHC/005678"
    ],
    "ia_numbers": [],
    "decision_date": "12 December, 2022",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      "SANA HERBALS PVT LTD"
    ],
    "defendants": [
      "MOHSIN DEHLVI"
    ],
    "appellants": [],
    "respondents": [],
    "plaintiff_advocates": [
      "Mr. M.K. Miglani"
    ],
    "defendant_advocates": [
      "Dr. Farrukh Khan",
      "Ms. Ridhima Goyal",
      "Ms. Ishita"
    ],
    "appellant_advocates": [],
    "respondent_advocates": [],
    "damages_claimed": null,
    "damages_awarded": null,
    "key_issues": [
      "Validity of trademark registrations with the name and style of \"Dehlvi\" is being questioned by the defendant as being based on false user and liable to be cancelled.",
      "The alleged Assignment Deed dated 19th September, 1999 is being challenged by the defendant as a void instrument.",
      "Infringement of trademarks, copyright, and passing off of the trademark/label \"DEHLVI\" is the main claim made by the plaintiff.",
      "The defendant is seeking to revoke or cancel the plaintiff's trademarks before the Intellectual Property Appellate Board (IPAB) through various rectification petitions.",
      "The court's observation on the framing of issues regarding the validity of the plaintiff's marks is crucial in determining the course of the case.",
      "The plaintiff's claim of being the proprietor of the mark \"DEHLVI\" is being contested by the defendant.",
      "The admissibility and relevance of the Assignment Deed dated 19th September, 1999, as evidence in the case is a point of contention.",
      "The court's decision on the stay of the present suit pending the outcome of the rectification petitions filed by the defendant is significant.",
      "The defendant's application under Section 124 of the Trade Marks Act, 1999, seeking permission to institute proceedings for revocation/cancellation of the plaintiff's trademarks, has been dismissed as not pressed."
    ],
    "decision_summary": "**Background:**\n\nThe case of Sana Herbals Pvt Ltd vs Mohsin Dehlvi (CS(COMM) 813/2016) is a trademark infringement, copyright, and passing off lawsuit filed in the High Court of Delhi. The plaintiff, Sana Herbals Pvt Ltd, claims to be the proprietor of the trademark \"DEHLVI\" and alleges that the defendant, Mohsin Dehlvi, has infringed upon this trademark. The defendant has filed a written statement opposing the reliefs sought in the plaint, claiming that the plaintiff's trademark registrations are invalid and liable to be cancelled.\n\n**Legal Issues:**\n\nThe main legal issues in this case are:\n\n1. The validity of the plaintiff's trademark registrations for \"DEHLVI\".\n2. The validity of the Assignment Deed dated 19th September 1999, which is alleged to be a void instrument.\n3. The defendant's claim that the plaintiff's trademark registrations are liable to be cancelled due to false user.\n\n**Arguments:**\n\nThe defendant has filed an application under Order XIV Rule 5 of the Code of Civil Procedure, 1908 (CPC) for framing additional issues, including:\n\n1. Whether the registration of trademarks with the name and style of \"DEHLVI\" in favor of the plaintiff is invalid and based on false user, and thus liable to be cancelled/removed.\n2. Whether the alleged Assignment Deed dated 19th September 1999 is a legally valid instrument.\n\nThe defendant's counsel argues that necessary averments have been made in the written statement regarding the invalidity of the plaintiff's trademark registrations and the invalidity of the Assignment Deed. Therefore, issues in this regard are required to be framed. The defendant's counsel also submits that the withdrawal of the application under Section 124 of the Trade Marks Act was due to the fact that the defendant did not want the present suit to be stayed.\n\n**Court Findings:**\n\nThe court has noted that issues were framed in the suit on 29th April 2019, but no issue was framed regarding the validity of the plaintiff's trademarks. The court has also noted that the defendant had filed an application under Section 124 of the Trade Marks Act, 1999, seeking permission to institute proceedings for revocation/cancellation of the plaintiff's trademarks before the Intellectual Property Appellate Board (IPAB) and for a stay of the present suit. However, the defendant did not press this application, and it was dismissed as not pressed.\n\n**Decision:**\n\nThe court's decision on the present application is not explicitly stated in the provided text. However, the court has reserved judgment on the application and has noted the arguments made by the defendant's counsel. It is likely that the court will frame additional issues as requested by the defendant, allowing the defendant to proceed with its claims regarding the invalidity of the plaintiff's trademark registrations and the Assignment Deed.\n\n**Recent Developments:**\n\nIn 2022, the defendant filed various rectification petitions, including C.O. (COMM.IPD-TM) 100/2022, seeking cancellation of the registrations granted in favor of the trademark \"DEHLVI\". One of these petitions was withdrawn by the defendant with liberty to file the petition afresh after taking appropriate steps in the present suit. The defendant has now filed the present application for framing additional issues, which will allow the court to consider the defendant's claims regarding the invalidity of the plaintiff's trademark registrations and the Assignment Deed.",
    "legal_precedents": [
      "Surjit Singh Sahni Brij Mohan Kaur",
      "Krishna Saini Chameli Devi",
      "(1975) 1 SCC 405",
      "(1997) \n65 DLT 670",
      "(2014) \n210 DLT 591",
      "Shiv Prasad Durga Prasad",
      "(2018) 2 SCC \n112"
    ],
    "full_text": "\n--- PAGE 1 ---\n2022/DHC/005678 \n \nCS(COMM) 813/2016 \n \n \n \n \n \n                       Page 1 of 10 \n \n * \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n \n% \n \n \nJudgment Reserved on   :  12th December, 2022  \nJudgment Delivered on :  20th December, 2022        \n \n+  \n \n \n \nCS(COMM) 813/2016   \n \n \nSANA HERBALS PVT LTD  \n \n..... Plaintiff \n \n \n \n \nThrough: \nMr. M.K. Miglani, Advocate \n \n \n \n \n \nversus \n \n \nMOHSIN DEHLVI \n \n \n \n \n..... Defendant \nThrough: \nDr. Farrukh Khan, Ms. Ridhima \nGoyal and Ms. Ishita, Advocates \n \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nJUDGMENT \n \nI.A. 16968/2022 (O-XIV R-5 of the CPC) \n1. \nThe present application has been filed on behalf of the defendant \nunder Order XIV Rule 5 of the Code of Civil Procedure, 1908 (CPC) for \nframing of the following additional issues: \n“(x) Whether the registration of the trademarks with the name and \nstyle of „Dehlvi‟, either independently or as supporting word, as \nmentioned in Para 12 of the plaint, in favour of the Plaintiff, are \ninvalid and based on false user and thus, liable to be cancelled / \nremoved? OPD \n(xi) Whether the alleged Assignment Deed dated 19.09.1999 is a \nlegally valid instrument? OPD” \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.12.2022 12:03:26\nSignature Not Verified\n\n--- PAGE 2 ---\n2022/DHC/005678 \n \nCS(COMM) 813/2016 \n \n \n \n \n \n                       Page 2 of 10 \n \n2. \nOn 29th November, 2022, the statement of counsel for the plaintiff \nwas recorded that he does not wish to file reply and the application may be \nheard on the basis of oral submissions.   \n3. \nThe brief facts relevant for deciding the present application are set out \nbelow: \n3.1 \nThe present suit has been filed alleging infringement of trade marks, \ncopyright and passing off of the trademark/label “DEHLVI”.   \n3.2 \nThe plaintiff claims to be the proprietor of the mark “DEHLVI”. \n3.3 \nThe defendant has filed written statement opposing the reliefs sought \nin the plaint, inter alia, pleading that the various registrations of the \nmark/label “DEHLVI” in favour of the plaintiff are invalid and liable \nto be cancelled. It has further been pleaded in the written statement \nthat the alleged Assignment Deed dated 19th September, 1999 is a \nvoid instrument. \n3.4 \nAn application under Section 124 of the Trade Marks Act, 1999, \nbeing I.A. 311/2017, was filed on behalf of the defendant, whereby \npermission was sought from the Court to institute appropriate \nproceedings for revocation/cancellation of the plaintiff’s trademarks \nbefore the Intellectual Property Appellate Board (IPAB) and for stay \nof the present suit. \n3.5 \nIssues were framed in the suit on 29th April, 2019 and an observation \nwas made by the Court that since no issue with regard to validity of \nthe marks of the plaintiff was framed, I.A. 311/2017 was liable to be \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.12.2022 12:03:26\nSignature Not Verified\n\n--- PAGE 3 ---\n2022/DHC/005678 \n \nCS(COMM) 813/2016 \n \n \n \n \n \n                       Page 3 of 10 \n \ndismissed. However, the matter was listed on 26th November, 2019 \nfor arguments on I.A. 311/2017. \n3.6 \nIn the order dated 26th November, 2019 passed by this Court, it was \nnoted that the defendant was not pressing I.A. 311/2017 and \nconsequently, the said application was dismissed as not pressed.  \n3.7 \nIn the year 2022, various rectification petitions, including C.O. \n(COMM.IPD-TM) 100/2022, were filed on behalf of the defendant \nseeking cancellation of the registrations granted in favour of the \ntrademark “DEHLVI”.  \n3.8 \nOn 19th September, 2022, another rectification petition filed by the \npetitioner in respect of the trademark “DEHLVI”, being C.O. \n(COMM.IPD-TM) \n100/2022, \nwas \nwithdrawn \nby \nthe \npetitioner/defendant with liberty to file the petition afresh, after taking \nappropriate steps in the present suit. \n3.9 \nAccordingly, the defendant has filed the present application on 8th \nOctober, 2022 for framing additional issues as aforesaid.   \n4. \nCounsel for the defendant has drawn attention of the Court to the \npleadings in the written statement to contend that necessary averments have \nbeen made with regard to the invalidity of registrations of the plaintiff’s \ntrademarks and invalidity of the Assignment Deed granted in favour of the \nplaintiff. Therefore, issues in this regard are required to be framed. He \nsubmits that the withdrawal of the application under Section 124 of Trade \nMarks Act was on account of the fact that the defendant did not want the \npresent suit to be stayed. He further submits that with the coming into effect \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.12.2022 12:03:26\nSignature Not Verified\n\n--- PAGE 4 ---\n2022/DHC/005678 \n \nCS(COMM) 813/2016 \n \n \n \n \n \n                       Page 4 of 10 \n \nof the Tribunals Reforms Act, 2021, the IPAB stands abolished and even the \nrectification applications have to be heard by this Court. Therefore, the \nrectification petitions filed by the defendant can be clubbed and tried along \nwith the present suit and no prejudice would be caused to the plaintiff. \n5. \nPer contra, counsel for the plaintiff submits that the defendant was \nconscious that permission was required from the Court before filing a \nrectification petition and accordingly filed I.A 311/2017 seeking permission \nof the Court. No issue with regard to the invalidity of the trademarks of the \nplaintiff was framed by this Court and I.A. 311/2017 was dismissed as not \npressed. Therefore, the defendant has consciously chosen not to press the \nissue regarding the invalidity of plaintiff’s trademarks and under the garb of \nthe present application, the defendant cannot raise the aforesaid issue again. \nReliance is placed on the judgments in Shiv Prasad v. Durga Prasad & \nAnr., (1975) 1 SCC 405; Anil Dinmani Shanker Joshi & Anr. v. Chief \nOfficer, (2003) SCC OnLine BOM 24; Jaswant Rai & Ors. v. Municipality, \nBadthinda, (2014) SCC OnLine P&H 25276; and, Krishna Saini v. \nChameli Devi &Ors., (2011) SCC OnLine Del 2258 (DB). \n6. \nI have heard the rival submissions and examined the record of the \ncase. \n7. \nIn Patel Field Marshal Agencies v. P.M. Diesels Ltd., (2018) 2 SCC \n112, the Supreme Court observed that where, during the pendency of a suit, \na rectification application is filed, the application can be pursued only upon \na finding by the Civil Court on the prima facie tenability of the plea of \ninvalidity. If the Civil Court does not find a triable issue on the plea of \ninvalidity, then the said application cannot be pursued. The Supreme Court \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.12.2022 12:03:26\nSignature Not Verified\n\n--- PAGE 5 ---\n2022/DHC/005678 \n \nCS(COMM) 813/2016 \n \n \n \n \n \n                       Page 5 of 10 \n \nnoted that this was necessary so as to avoid multiple proceedings on the \nsame issue and the possibility of conflicting decisions. However, there have \nbeen subsequent developments since the passing of judgment in Patel Field \nMarshal Agencies (supra). In terms of the Tribunals Reforms Act, 2021, the \nIPAB has been abolished and the jurisdiction to decide rectification petitions \nnow vests with the High Court under Section 21 of the Act. Therefore, now \nthe suit as well as the rectification applications have to be decided by one \nauthority alone i.e. the High Court and resultantly, there cannot be any \npossibility of conflicting decisions. Hence, the rectification petitions can be \nclubbed with the civil suits and there is no requirement of staying the civil \nsuit. \n8. \nIn Abbott Healthcare Pvt. Ltd. v. Raj Kumar Prasad & Anr., 2018 \nSCC OnLine Del 6657, a Co-ordinate Bench of this Court was seized of a \nsimilar application filed on behalf of the plaintiff seeking framing of an \nadditional issue with regard to validity of the registration of the defendant’s \ntrademark. In the said suit, issues were framed prior to the filing of the \nSection 124 application and no issue with regard to invalidity of the \ndefendant’s trademark had been urged or framed. Noting that no issue with \nregard to validity of the impugned trademark was framed in the suit, the \napplication filed on behalf of the plaintiff under Section 124 of the Trade \nMarks Act, 1999 was subsequently dismissed by the Court with the liberty \nto apply afresh in the event additional issues were framed in the suit. \nRelying on the dicta of S. Surjit Singh Sahni v. Brij Mohan Kaur, (1997) \n65 DLT 670, the Co-ordinate Bench of this Court observed that framing of \nissues is the duty of the Court and rejection of an earlier prayer does not \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.12.2022 12:03:26\nSignature Not Verified\n\n--- PAGE 6 ---\n2022/DHC/005678 \n \nCS(COMM) 813/2016 \n \n \n \n \n \n                       Page 6 of 10 \n \ndebar a fresh prayer for framing an issue if it arises from the pleadings and \nought to have been framed but has inadvertently not been framed. The \nrelevant observations of the Court in Abbott Healthcare Pvt. Ltd. (supra) are \nset out below: \n“12. The counsel for the plaintiff, in rejoinder, refers to S. \nSurjit Singh Sahni v. Brij Mohan Kaur 65 (1997) DLT 670 and \non order dated 30th April, 2013 in CS(OS) No. 1457/2009 titled \nRanbaxy Laboratories Ltd. v. Intas Pharmaceuticals Ltd. and \nagainst which no appeal is stated to have been preferred, holding \nthat framing of issues is the duty of the Court and rejection of an \nearlier prayer does not debar a fresh prayer for framing an issue \nif it arises from the pleadings and ought to have been framed \nand has mistakenly not been framed. It is argued that the Court, \nat the time of framing of issues on 21st March, 2016, has not \napplied its mind and not refused to frame the issue about \ninvalidity. It is thus contended that the plaintiff can apply for \nframing of additional issue. \n13. \nI tend to agree with the counsel for plaintiff. The Code of \nCivil Procedure, 1908 (CPC), vide Order XIV Rule 5 empowers \nthe Court to, at any time before passing a decree, amend the \nissues or frame additional issues and provides that all such \namendments or additional issues as may be necessary for \ndetermining the maters in controversy between the parties shall \nbe so made or framed. Thus, merely because at the time of \nframing of issues, an issue though arising from pleadings, has \nnot been pressed and/or framed would not stop a subsequent \napplication. The position may be different where an issue is \npressed and not framed by a speaking order. In such case, the \nbar of res judicata, also applicable at successive stages of same \nproceeding, may come in way of an application under Order XIV \nRule 5 CPC. However, in the present case, a perusal of order \ndated 21st March, 2016, when issues were framed, does not show \nany such thing.”  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.12.2022 12:03:26\nSignature Not Verified\n\n--- PAGE 7 ---\n2022/DHC/005678 \n \nCS(COMM) 813/2016 \n \n \n \n \n \n                       Page 7 of 10 \n \n9. \nThe facts in Abbott Healthcare (supra) are similar to that of the \npresent case. In the said case, the Court dismissed the Section 124 \napplication as no issue had been framed with regard to invalidity of the \ntrademark. In the present case also, no issue was framed by the Court with \nregard to invalidity of the registrations of the plaintiff’s marks and the \ndefendant withdrew the application filed under Section 124 of the Trade \nMarks Act, 1999. However, like in Abbott Healthcare (supra), as per the \norder dated 19th September, 2022 in C.O. (COMM.IPD-TM) 100/2022, \nliberty was given to the defendant herein to apply for framing of additional \nissues.  \n10. \nTherefore, what has to be examined is whether the defendant has \nmade the necessary averments in the written statement with regard to the \ninvalidity of the plaintiff’s trademarks so as to frame an issue in this regard. \n11. \nA perusal of the written statement filed on behalf of the defendant \nshows that defendant has pleaded that; (i) the plaintiff company came into \nexistence only on 21st October, 1997, whereas the defendant has been using \nthe trademark “DEHLVI” since 1995 (page 17 of the written statement); (ii) \nthe plaintiff claims rights in the trademark “DEHLVI” only on the basis of \nthe Assignment Deed dated 19th September, 1999, which is invalid and void \nab initio (pages 12 and 17 of the written statement); and, (iii) the registration \nobtained by the plaintiff is on the basis of false user and therefore, the \nregistered trademarks of the plaintiff are liable to be cancelled and pending \nregistration applications liable to be refused (paragraph 24, page 22 of the \nwritten statement). \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.12.2022 12:03:26\nSignature Not Verified\n\n--- PAGE 8 ---\n2022/DHC/005678 \n \nCS(COMM) 813/2016 \n \n \n \n \n \n                       Page 8 of 10 \n \n12. \nA holistic reading of the written statement leads me to conclude that \nthe defendant has made necessary pleadings with regard to (i) invalidity of \nthe Assignment Deed dated 19th September, 1999; and (ii) the invalidity of \nthe trademark registrations granted in favour of the plaintiff. These are \nmaterial propositions of fact in terms of Order XIV Rule 1 of the CPC and \ntherefore, an issue ought to have been framed with regard to the same. \n13. \nIt is the settled position of law that it is the obligation of the Court to \nframe issues. In this regard reference may be made to paragraph 7 of the S. \nSurjit Singh Sahni (supra): \n“7. \nA perusal of the several provisions contained in Order 14 \nof the CPC would be apposite. An issue arises when a material \nproposition of fact or law is affirmed by one party and denied by \nthe other. Every such proposition shall form the subject of a \ndistinct issue. Primarily it is the obligation of the Court to frame \nthe issues. Failure on the part of the Court may be remedied by \neither party inviting attention of the Court to the need of framing \nsuch an issue either by participating in the process of settlement \nof issues or by moving an application under Order 14 Rule 5 of \nthe CPC. It is obligatory on the part of the Court to frame an \nissue once it is satisfied that an issue which should have been \nframed was not framed. If the trial court fails in framing an \nissue or fails to remedy its earlier failure then even an appellate \ncourt is vested with power of framing an issue under Rule 25 of \nOrder 41 of the CPC.” \n[emphasis supplied] \n14. \nIn light of the dicta above, even if the counsel for the defendant did \nnot press for framing of the issues sought to be framed now, it would not \nmean that the Court cannot, at a subsequent stage, frame such issues if they \nemerge from the pleadings in the suit. The language of Order XIV Rule 5 of \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.12.2022 12:03:26\nSignature Not Verified\n\n--- PAGE 9 ---\n2022/DHC/005678 \n \nCS(COMM) 813/2016 \n \n \n \n \n \n                       Page 9 of 10 \n \nthe CPC is very wide and empowers the Court to amend the issues so \nframed or frame additional issues at any time before passing of the final \ndecree. \n15. \nIn any event, if the counsel for the defendant did not press for framing \nof additional issues that are subject matter of the present application and also \ndid not press the application under Section 124 of the Trade Marks Act, the \ndefendant cannot be made to suffer. It has been held in Teva \nPharmaceutical Industries Ltd. & Ors. v. Natco Pharma Limited, (2014) \n210 DLT 591 (DB), which has been followed in Abbott Healthcare (supra) \nthat a litigant ought not to suffer on account of acts of his advocate. \n16. \nThe judgments relied upon by counsel for the plaintiff was in an \nentirely different factual context and therefore, would not be applicable to \nthe facts and circumstances of the present case. \n17. \nThere is another aspect of the matter. In the earlier regime, upon an \nissue being framed with regard to invalidity of a trademark, proceedings in \nthe civil suit were stayed in order that for the statutory authority i.e. IPAB to \ndecide. With the coming into effect of the Tribunals Reforms Act, 2021, and \nthe consequent abolition of the IPAB, this situation does not exist anymore. \nTherefore, even if an issue with regard to invalidity of a trademark is framed \nby the civil court and rectification applications are filed by a litigant, the \ncivil suit is not liable to be stayed. The rectification petitions/applications \ncan be clubbed and tried along with the civil suit. Therefore, no prejudice \nwould be caused to the plaintiff if the additional issues, as sought to be \nframed by way of the present application, are framed. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.12.2022 12:03:26\nSignature Not Verified\n\n--- PAGE 10 ---\n2022/DHC/005678 \n \nCS(COMM) 813/2016 \n \n \n \n \n \n                       Page 10 of 10 \n \n18. \nAccordingly, the present application is allowed and the following \nadditional issues are framed: \nI. \nWhether the registration of the trademarks with the name and style of \n\"Dehlvi\", either independently or as supporting word, as mentioned in \nparagraph 12 of the plaint, in favour of the Plaintiff, are invalid and \nbased on false user and thus, liable to be cancelled / removed? OPD \nII. \nWhether the alleged Assignment Deed dated 19th September, 1999 is \na legally valid instrument? OPD \nCS(COMM) 813/2016 \n19. \nList before the Joint Registrar on 6th February, 2023. \n \n \n \n \n \n \n \n \n \nAMIT BANSAL, J. \nDECEMBER 20, 2022 \ndk/sr \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.12.2022 12:03:26\nSignature Not Verified\n"
  },
  "total_pages": 10,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "According to the PDF document \"2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf\", the case CS(COMM) 813/2016 is being heard in the High Court of Delhi at New Delhi. The plaintiff, Sana Herbals Pvt Ltd, is represented by Mr. M.K. Miglani, Advocate, while the defendant, Mohsin Dehlvi, is represented by Dr. Farrukh Khan, Ms. Ridhima Goyal, and Ms. Ishita, Advocates.\n\nThe judgment was reserved on December 12, 2022, and delivered on December 20, 2022. The defendant filed an application under Order XIV Rule 5 of the Code of Civil Procedure, 1908, for framing additional issues, including the validity of the plaintiff's trademarks and the legitimacy of an Assignment Deed dated September 19, 1999.\n\nThe suit was filed alleging infringement of trademarks, copyright, and passing off of the trademark/label \"DEHLVI\". The plaintiff claims to be the proprietor of the mark, while the defendant argues that the registrations are invalid and liable to be cancelled. The court had previously framed issues in the suit on April 29, 2019, and observed that no issue regarding the validity of the plaintiff's marks was framed.\n\nThe application was heard on the basis of oral submissions, as the plaintiff's counsel stated that they did not wish to file a reply. The court's decision on the application is not specified in the provided section of the PDF document. (Source: 2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf, 2022/DHC/005678)",
      "pdf_source": "2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "According to page 1 of the PDF \"2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf\", the case CS(COMM) 813/2016 is between Sana Herbals Pvt Ltd (Plaintiff) and Mohsin Dehlvi (Defendant) in the High Court of Delhi. The judgment was reserved on December 12, 2022, and delivered on December 20, 2022. The Defendant filed an application under Order XIV Rule 5 of the Code of Civil Procedure, 1908, to frame additional issues, including the validity of the Plaintiff's trademark registration and the legality of an Assignment Deed dated September 19, 1999. The application was heard by Hon'ble Mr. Justice Amit Bansal. The PDF source provides details of the court proceedings, including the names of the advocates representing the parties: Mr. M.K. Miglani for the Plaintiff and Dr. Farrukh Khan, Ms. Ridhima Goyal, and Ms. Ishita for the Defendant.",
          "content": "2022/DHC/005678 \n \nCS(COMM) 813/2016 \n \n \n \n \n \n                       Page 1 of 10 \n \n * \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n \n% \n \n \nJudgment Reserved on   :  12th December, 2022  \nJudgment Delivered on :  20th December, 2022        \n \n+  \n \n \n \nCS(COMM) 813/2016   \n \n \nSANA HERBALS PVT LTD  \n \n..... Plaintiff \n \n \n \n \nThrough: \nMr. M.K. Miglani, Advocate \n \n \n \n \n \nversus \n \n \nMOHSIN DEHLVI \n \n \n \n \n..... Defendant \nThrough: \nDr. Farrukh Khan, Ms. Ridhima \nGoyal and Ms. Ishita, Advocates \n \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nJUDGMENT \n \nI.A. 16968/2022 (O-XIV R-5 of the CPC) \n1. \nThe present application has been filed on behalf of the defendant \nunder Order XIV Rule 5 of the Code of Civil Procedure, 1908 (CPC) for \nframing of the following additional issues: \n“(x) Whether the registration of the trademarks with the name and \nstyle of „Dehlvi‟, either independently or as supporting word, as \nmentioned in Para 12 of the plaint, in favour of the Plaintiff, are \ninvalid and based on false user and thus, liable to be cancelled / \nremoved? OPD \n(xi) Whether the alleged Assignment Deed dated 19.09.1999 is a \nlegally valid instrument? OPD” \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.12.2022 12:03:26\nSignature Not Verified",
          "pdf_source": "2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "According to page 2 of the PDF \"SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf\", the case CS(COMM) 813/2016 involves a trademark infringement suit filed by Sana Herbals Pvt Ltd against Mohsin Dehlvi. The plaintiff claims to be the proprietor of the mark \"DEHLVI\". The defendant has opposed the reliefs sought, pleading that the plaintiff's trademark registrations are invalid and liable to be cancelled. An application under Section 124 of the Trade Marks Act, 1999, was filed by the defendant to institute proceedings for revocation/cancellation of the plaintiff's trademarks. The court framed issues in the suit on April 29, 2019, and observed that the defendant's application was liable to be dismissed since no issue regarding the validity of the plaintiff's marks was framed. The judgment was reserved on December 12, 2022, and delivered on December 20, 2022. (Source: SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf)",
          "content": "2022/DHC/005678 \n \nCS(COMM) 813/2016 \n \n \n \n \n \n                       Page 2 of 10 \n \n2. \nOn 29th November, 2022, the statement of counsel for the plaintiff \nwas recorded that he does not wish to file reply and the application may be \nheard on the basis of oral submissions.   \n3. \nThe brief facts relevant for deciding the present application are set out \nbelow: \n3.1 \nThe present suit has been filed alleging infringement of trade marks, \ncopyright and passing off of the trademark/label “DEHLVI”.   \n3.2 \nThe plaintiff claims to be the proprietor of the mark “DEHLVI”. \n3.3 \nThe defendant has filed written statement opposing the reliefs sought \nin the plaint, inter alia, pleading that the various registrations of the \nmark/label “DEHLVI” in favour of the plaintiff are invalid and liable \nto be cancelled. It has further been pleaded in the written statement \nthat the alleged Assignment Deed dated 19th September, 1999 is a \nvoid instrument. \n3.4 \nAn application under Section 124 of the Trade Marks Act, 1999, \nbeing I.A. 311/2017, was filed on behalf of the defendant, whereby \npermission was sought from the Court to institute appropriate \nproceedings for revocation/cancellation of the plaintiff’s trademarks \nbefore the Intellectual Property Appellate Board (IPAB) and for stay \nof the present suit. \n3.5 \nIssues were framed in the suit on 29th April, 2019 and an observation \nwas made by the Court that since no issue with regard to validity of \nthe marks of the plaintiff was framed, I.A. 311/2017 was liable to be \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.12.2022 12:03:26\nSignature Not Verified",
          "pdf_source": "2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0007",
      "start_index": 3,
      "end_index": 5,
      "summary": "According to the PDF document \"2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf\", a legal proceeding (CS(COMM) 813/2016) is ongoing in the High Court of Delhi. The plaintiff, Sana Herbals Pvt Ltd, is represented by Mr. M.K. Miglani, while the defendant, Mohsin Dehlvi, is represented by Dr. Farrukh Khan and others.\n\nThe court reserved judgment on December 12, 2022, and delivered it on December 20, 2022. The defendant had filed a rectification petition (C.O. (COMM.IPD-TM) 100/2022) seeking cancellation of the registrations granted in favor of the trademark \"DEHLVI\". However, this petition was withdrawn on September 19, 2022, with liberty to file it afresh.\n\nThe defendant has now filed an application for framing additional issues, which the plaintiff opposes. The defendant's counsel argues that the issues regarding the invalidity of the plaintiff's trademarks and the assignment deed should be framed, as the Intellectual Property Appellate Board (IPAB) has been abolished, and the rectification applications can be heard by the court. The plaintiff's counsel counters that the defendant had consciously chosen not to press the issue regarding the invalidity of the plaintiff's trademarks and cannot raise it again under the present application.\n\nThe court has heard the rival submissions and examined the record, considering judgments such as Patel Field Marshal Agencies v. P.M. Diesels Ltd. (2018) 2 SCC 112, which observed that a rectification application can only be pursued upon a finding by the Civil Court on the prima facie tenability of the plea of invalidity. (Source: 2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf, pages 1-5)",
      "pdf_source": "2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "According to page 3 of the PDF \"2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf\", the court proceedings involved a trademark dispute between Sana Herbals Pvt Ltd and Mohsin Dehlvi. On November 26, 2019, the defendant's application (I.A. 311/2017) was dismissed as not pressed. In 2022, the defendant filed rectification petitions, including C.O. (COMM.IPD-TM) 100/2022, to cancel registrations of the trademark \"DEHLVI\". On September 19, 2022, one such petition was withdrawn with liberty to file afresh. The defendant then filed an application on October 8, 2022, to frame additional issues. The defendant's counsel argued that necessary averments were made in the written statement regarding the invalidity of the plaintiff's trademarks and assignment deed, requiring issues to be framed. (Source: 2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf, 2022/DHC/005678, CS(COMM) 813/2016)",
          "content": "2022/DHC/005678 \n \nCS(COMM) 813/2016 \n \n \n \n \n \n                       Page 3 of 10 \n \ndismissed. However, the matter was listed on 26th November, 2019 \nfor arguments on I.A. 311/2017. \n3.6 \nIn the order dated 26th November, 2019 passed by this Court, it was \nnoted that the defendant was not pressing I.A. 311/2017 and \nconsequently, the said application was dismissed as not pressed.  \n3.7 \nIn the year 2022, various rectification petitions, including C.O. \n(COMM.IPD-TM) 100/2022, were filed on behalf of the defendant \nseeking cancellation of the registrations granted in favour of the \ntrademark “DEHLVI”.  \n3.8 \nOn 19th September, 2022, another rectification petition filed by the \npetitioner in respect of the trademark “DEHLVI”, being C.O. \n(COMM.IPD-TM) \n100/2022, \nwas \nwithdrawn \nby \nthe \npetitioner/defendant with liberty to file the petition afresh, after taking \nappropriate steps in the present suit. \n3.9 \nAccordingly, the defendant has filed the present application on 8th \nOctober, 2022 for framing additional issues as aforesaid.   \n4. \nCounsel for the defendant has drawn attention of the Court to the \npleadings in the written statement to contend that necessary averments have \nbeen made with regard to the invalidity of registrations of the plaintiff’s \ntrademarks and invalidity of the Assignment Deed granted in favour of the \nplaintiff. Therefore, issues in this regard are required to be framed. He \nsubmits that the withdrawal of the application under Section 124 of Trade \nMarks Act was on account of the fact that the defendant did not want the \npresent suit to be stayed. He further submits that with the coming into effect \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.12.2022 12:03:26\nSignature Not Verified",
          "pdf_source": "2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "According to page 4 of the PDF \"2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf\", the court discusses the abolition of the IPAB due to the Tribunals Reforms Act, 2021, and its impact on rectification applications. The defendant's counsel argues that the rectification petitions can be heard by the court along with the present suit. The plaintiff's counsel counters that the defendant had previously filed I.A 311/2017 seeking permission to file a rectification petition, which was dismissed. The plaintiff argues that the defendant cannot raise the issue of trademark invalidity again. The court references the case of Patel Field Marshal Agencies v. P.M. Diesels Ltd. (2018) 2 SCC 112, which states that a rectification application can only be pursued if the Civil Court finds a triable issue on the plea of invalidity. (Source: 2022/DHC/005678, CS(COMM) 813/2016)",
          "content": "2022/DHC/005678 \n \nCS(COMM) 813/2016 \n \n \n \n \n \n                       Page 4 of 10 \n \nof the Tribunals Reforms Act, 2021, the IPAB stands abolished and even the \nrectification applications have to be heard by this Court. Therefore, the \nrectification petitions filed by the defendant can be clubbed and tried along \nwith the present suit and no prejudice would be caused to the plaintiff. \n5. \nPer contra, counsel for the plaintiff submits that the defendant was \nconscious that permission was required from the Court before filing a \nrectification petition and accordingly filed I.A 311/2017 seeking permission \nof the Court. No issue with regard to the invalidity of the trademarks of the \nplaintiff was framed by this Court and I.A. 311/2017 was dismissed as not \npressed. Therefore, the defendant has consciously chosen not to press the \nissue regarding the invalidity of plaintiff’s trademarks and under the garb of \nthe present application, the defendant cannot raise the aforesaid issue again. \nReliance is placed on the judgments in Shiv Prasad v. Durga Prasad & \nAnr., (1975) 1 SCC 405; Anil Dinmani Shanker Joshi & Anr. v. Chief \nOfficer, (2003) SCC OnLine BOM 24; Jaswant Rai & Ors. v. Municipality, \nBadthinda, (2014) SCC OnLine P&H 25276; and, Krishna Saini v. \nChameli Devi &Ors., (2011) SCC OnLine Del 2258 (DB). \n6. \nI have heard the rival submissions and examined the record of the \ncase. \n7. \nIn Patel Field Marshal Agencies v. P.M. Diesels Ltd., (2018) 2 SCC \n112, the Supreme Court observed that where, during the pendency of a suit, \na rectification application is filed, the application can be pursued only upon \na finding by the Civil Court on the prima facie tenability of the plea of \ninvalidity. If the Civil Court does not find a triable issue on the plea of \ninvalidity, then the said application cannot be pursued. The Supreme Court \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.12.2022 12:03:26\nSignature Not Verified",
          "pdf_source": "2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf",
          "nodes": []
        },
        {
          "title": "Page 5",
          "node_id": "0006",
          "start_index": 5,
          "end_index": 5,
          "summary": "According to page 5 of the PDF \"2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf\", the court notes that the Intellectual Property Appellate Board (IPAB) has been abolished under the Tribunals Reforms Act, 2021, and the jurisdiction to decide rectification petitions now lies with the High Court. This development eliminates the possibility of conflicting decisions, allowing rectification petitions to be combined with civil suits. The court cites the case of Abbott Healthcare Pvt. Ltd. v. Raj Kumar Prasad & Anr. (2018 SCC OnLine Del 6657) as a reference. The case CS(COMM) 813/2016, SANA HERBALS PVT LTD vs. MOHSIN DEHLVI, had judgment reserved on December 12, 2022, and delivered on December 20, 2022. (Source: 2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf)",
          "content": "2022/DHC/005678 \n \nCS(COMM) 813/2016 \n \n \n \n \n \n                       Page 5 of 10 \n \nnoted that this was necessary so as to avoid multiple proceedings on the \nsame issue and the possibility of conflicting decisions. However, there have \nbeen subsequent developments since the passing of judgment in Patel Field \nMarshal Agencies (supra). In terms of the Tribunals Reforms Act, 2021, the \nIPAB has been abolished and the jurisdiction to decide rectification petitions \nnow vests with the High Court under Section 21 of the Act. Therefore, now \nthe suit as well as the rectification applications have to be decided by one \nauthority alone i.e. the High Court and resultantly, there cannot be any \npossibility of conflicting decisions. Hence, the rectification petitions can be \nclubbed with the civil suits and there is no requirement of staying the civil \nsuit. \n8. \nIn Abbott Healthcare Pvt. Ltd. v. Raj Kumar Prasad & Anr., 2018 \nSCC OnLine Del 6657, a Co-ordinate Bench of this Court was seized of a \nsimilar application filed on behalf of the plaintiff seeking framing of an \nadditional issue with regard to validity of the registration of the defendant’s \ntrademark. In the said suit, issues were framed prior to the filing of the \nSection 124 application and no issue with regard to invalidity of the \ndefendant’s trademark had been urged or framed. Noting that no issue with \nregard to validity of the impugned trademark was framed in the suit, the \napplication filed on behalf of the plaintiff under Section 124 of the Trade \nMarks Act, 1999 was subsequently dismissed by the Court with the liberty \nto apply afresh in the event additional issues were framed in the suit. \nRelying on the dicta of S. Surjit Singh Sahni v. Brij Mohan Kaur, (1997) \n65 DLT 670, the Co-ordinate Bench of this Court observed that framing of \nissues is the duty of the Court and rejection of an earlier prayer does not \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.12.2022 12:03:26\nSignature Not Verified",
          "pdf_source": "2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0011",
      "start_index": 6,
      "end_index": 8,
      "summary": "According to the PDF document \"SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf\" (2022/DHC/005678, CS(COMM) 813/2016), the High Court of Delhi at New Delhi heard the case between Sana Herbals Pvt Ltd (plaintiff) and Mohsin Dehlvi (defendant). The judgment was reserved on December 12, 2022, and delivered on December 20, 2022. \n\nThe defendant sought to frame additional issues, including the invalidity of the plaintiff's trademarks. The court referred to the case of Abbott Healthcare Pvt. Ltd., which held that the rejection of an earlier prayer does not debar a fresh prayer for framing an issue if it arises from the pleadings and ought to have been framed but has inadvertently not been framed.\n\nThe defendant's written statement pleaded that the plaintiff's trademarks were invalid, citing that the plaintiff company was established in 1997, while the defendant had been using the trademark \"DEHLVI\" since 1995. The defendant also claimed that the plaintiff's registration was based on false user and was liable to be cancelled.\n\nThe court considered the defendant's application to frame additional issues, including the invalidity of the plaintiff's trademarks. The court's decision was influenced by the fact that no issue had been framed with regard to the invalidity of the registrations of the plaintiff's marks, and the defendant had withdrawn the application filed under Section 124 of the Trade Marks Act, 1999. The court gave the defendant liberty to apply for framing of additional issues, as per the order dated September 19, 2022. (Source: PDF document)",
      "pdf_source": "2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf",
      "nodes": [
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "According to page 6 of the PDF: 2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf, the court discusses the possibility of framing additional issues in a case. The plaintiff's counsel refers to the case of S. Surjit Singh Sahni v. Brij Mohan Kaur and Ranbaxy Laboratories Ltd. v. Intas Pharmaceuticals Ltd., which held that the court can frame additional issues at any time before passing a decree. The court agrees with the counsel, citing Order XIV Rule 5 of the Code of Civil Procedure, 1908, which empowers the court to amend or frame additional issues. The court notes that the issue of invalidity was not pressed or framed earlier, but this does not bar a subsequent application. The judgment was reserved on December 12, 2022, and delivered on December 20, 2022, in the case CS(COMM) 813/2016, Sana Herbals Pvt Ltd vs. Mohsin Dehlvi.",
          "content": "2022/DHC/005678 \n \nCS(COMM) 813/2016 \n \n \n \n \n \n                       Page 6 of 10 \n \ndebar a fresh prayer for framing an issue if it arises from the pleadings and \nought to have been framed but has inadvertently not been framed. The \nrelevant observations of the Court in Abbott Healthcare Pvt. Ltd. (supra) are \nset out below: \n“12. The counsel for the plaintiff, in rejoinder, refers to S. \nSurjit Singh Sahni v. Brij Mohan Kaur 65 (1997) DLT 670 and \non order dated 30th April, 2013 in CS(OS) No. 1457/2009 titled \nRanbaxy Laboratories Ltd. v. Intas Pharmaceuticals Ltd. and \nagainst which no appeal is stated to have been preferred, holding \nthat framing of issues is the duty of the Court and rejection of an \nearlier prayer does not debar a fresh prayer for framing an issue \nif it arises from the pleadings and ought to have been framed \nand has mistakenly not been framed. It is argued that the Court, \nat the time of framing of issues on 21st March, 2016, has not \napplied its mind and not refused to frame the issue about \ninvalidity. It is thus contended that the plaintiff can apply for \nframing of additional issue. \n13. \nI tend to agree with the counsel for plaintiff. The Code of \nCivil Procedure, 1908 (CPC), vide Order XIV Rule 5 empowers \nthe Court to, at any time before passing a decree, amend the \nissues or frame additional issues and provides that all such \namendments or additional issues as may be necessary for \ndetermining the maters in controversy between the parties shall \nbe so made or framed. Thus, merely because at the time of \nframing of issues, an issue though arising from pleadings, has \nnot been pressed and/or framed would not stop a subsequent \napplication. The position may be different where an issue is \npressed and not framed by a speaking order. In such case, the \nbar of res judicata, also applicable at successive stages of same \nproceeding, may come in way of an application under Order XIV \nRule 5 CPC. However, in the present case, a perusal of order \ndated 21st March, 2016, when issues were framed, does not show \nany such thing.”  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.12.2022 12:03:26\nSignature Not Verified",
          "pdf_source": "2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf",
          "nodes": []
        },
        {
          "title": "Page 7",
          "node_id": "0009",
          "start_index": 7,
          "end_index": 7,
          "summary": "According to page 7 of the PDF \"2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf\", the court is examining whether the defendant has made necessary averments in the written statement to frame an issue regarding the invalidity of the plaintiff's trademarks. The defendant's written statement claims that the plaintiff company was established in 1997, while the defendant has been using the trademark \"DEHLVI\" since 1995. The defendant also challenges the validity of the Assignment Deed dated 19th September, 1999, and the registration of the plaintiff's trademarks, alleging false user. The court cites a similar case, Abbott Healthcare, where the Court dismissed a Section 124 application due to no issue being framed regarding trademark invalidity. The defendant was given liberty to apply for framing additional issues, as per the order dated 19th September, 2022. (Source: 2022/DHC/005678, CS(COMM) 813/2016)",
          "content": "2022/DHC/005678 \n \nCS(COMM) 813/2016 \n \n \n \n \n \n                       Page 7 of 10 \n \n9. \nThe facts in Abbott Healthcare (supra) are similar to that of the \npresent case. In the said case, the Court dismissed the Section 124 \napplication as no issue had been framed with regard to invalidity of the \ntrademark. In the present case also, no issue was framed by the Court with \nregard to invalidity of the registrations of the plaintiff’s marks and the \ndefendant withdrew the application filed under Section 124 of the Trade \nMarks Act, 1999. However, like in Abbott Healthcare (supra), as per the \norder dated 19th September, 2022 in C.O. (COMM.IPD-TM) 100/2022, \nliberty was given to the defendant herein to apply for framing of additional \nissues.  \n10. \nTherefore, what has to be examined is whether the defendant has \nmade the necessary averments in the written statement with regard to the \ninvalidity of the plaintiff’s trademarks so as to frame an issue in this regard. \n11. \nA perusal of the written statement filed on behalf of the defendant \nshows that defendant has pleaded that; (i) the plaintiff company came into \nexistence only on 21st October, 1997, whereas the defendant has been using \nthe trademark “DEHLVI” since 1995 (page 17 of the written statement); (ii) \nthe plaintiff claims rights in the trademark “DEHLVI” only on the basis of \nthe Assignment Deed dated 19th September, 1999, which is invalid and void \nab initio (pages 12 and 17 of the written statement); and, (iii) the registration \nobtained by the plaintiff is on the basis of false user and therefore, the \nregistered trademarks of the plaintiff are liable to be cancelled and pending \nregistration applications liable to be refused (paragraph 24, page 22 of the \nwritten statement). \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.12.2022 12:03:26\nSignature Not Verified",
          "pdf_source": "2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf",
          "nodes": []
        },
        {
          "title": "Page 8",
          "node_id": "0010",
          "start_index": 8,
          "end_index": 8,
          "summary": "According to page 8 of the PDF \"2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf\", the court concludes that the defendant has made necessary pleadings regarding the invalidity of the Assignment Deed and trademark registrations. The court states that it is their obligation to frame issues, as per Order XIV Rule 1 of the CPC. The court references the case of S. Surjit Singh Sahni, which emphasizes the importance of framing issues. The court notes that even if the defendant's counsel did not press for framing issues, the court can still frame them at a later stage if they emerge from the pleadings. The case details are CS(COMM) 813/2016, with judgment reserved on December 12, 2022, and delivered on December 20, 2022. The parties involved are Sana Herbals Pvt Ltd (plaintiff) and Mohsin Dehlvi (defendant).",
          "content": "2022/DHC/005678 \n \nCS(COMM) 813/2016 \n \n \n \n \n \n                       Page 8 of 10 \n \n12. \nA holistic reading of the written statement leads me to conclude that \nthe defendant has made necessary pleadings with regard to (i) invalidity of \nthe Assignment Deed dated 19th September, 1999; and (ii) the invalidity of \nthe trademark registrations granted in favour of the plaintiff. These are \nmaterial propositions of fact in terms of Order XIV Rule 1 of the CPC and \ntherefore, an issue ought to have been framed with regard to the same. \n13. \nIt is the settled position of law that it is the obligation of the Court to \nframe issues. In this regard reference may be made to paragraph 7 of the S. \nSurjit Singh Sahni (supra): \n“7. \nA perusal of the several provisions contained in Order 14 \nof the CPC would be apposite. An issue arises when a material \nproposition of fact or law is affirmed by one party and denied by \nthe other. Every such proposition shall form the subject of a \ndistinct issue. Primarily it is the obligation of the Court to frame \nthe issues. Failure on the part of the Court may be remedied by \neither party inviting attention of the Court to the need of framing \nsuch an issue either by participating in the process of settlement \nof issues or by moving an application under Order 14 Rule 5 of \nthe CPC. It is obligatory on the part of the Court to frame an \nissue once it is satisfied that an issue which should have been \nframed was not framed. If the trial court fails in framing an \nissue or fails to remedy its earlier failure then even an appellate \ncourt is vested with power of framing an issue under Rule 25 of \nOrder 41 of the CPC.” \n[emphasis supplied] \n14. \nIn light of the dicta above, even if the counsel for the defendant did \nnot press for framing of the issues sought to be framed now, it would not \nmean that the Court cannot, at a subsequent stage, frame such issues if they \nemerge from the pleadings in the suit. The language of Order XIV Rule 5 of \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.12.2022 12:03:26\nSignature Not Verified",
          "pdf_source": "2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0014",
      "start_index": 9,
      "end_index": 10,
      "summary": "According to the PDF document \"SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf\" (2022/DHC/005678, CS(COMM) 813/2016), the High Court of Delhi at New Delhi delivered a judgment on December 20, 2022. The court allowed the defendant's application to frame additional issues in the case. \n\nThe plaintiff, Sana Herbals Pvt Ltd, was represented by Mr. M.K. Miglani, Advocate, while the defendant, Mohsin Dehlvi, was represented by Dr. Farrukh Khan, Ms. Ridhima Goyal, and Ms. Ishita. The court ruled that the defendant cannot be made to suffer due to the acts of their advocate, citing the case of Teva Pharmaceutical Industries Ltd. & Ors. v. Natco Pharma Limited (2014) 210 DLT 591 (DB).\n\nThe court also noted that the judgments relied upon by the plaintiff's counsel were in a different factual context and not applicable to the present case. Additionally, the court mentioned that the abolition of the IPAB (Intellectual Property Appellate Board) due to the Tribunals Reforms Act, 2021, means that civil suits are not liable to be stayed even if an issue regarding trademark invalidity is framed.\n\nThe court framed two additional issues: (1) whether the registration of trademarks with the name \"Dehlvi\" in favor of the plaintiff is invalid and liable to be canceled, and (2) whether the alleged Assignment Deed dated September 19, 1999, is a legally valid instrument. The case was listed before the Joint Registrar on February 6, 2023. (Source: SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf)",
      "pdf_source": "2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf",
      "nodes": [
        {
          "title": "Page 9",
          "node_id": "0012",
          "start_index": 9,
          "end_index": 9,
          "summary": "According to page 9 of the PDF \"2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf\", the Court has the power to amend or frame additional issues at any time before passing the final decree under the CPC. The defendant cannot be penalized for their counsel's actions, as held in Teva Pharmaceutical Industries Ltd. & Ors. v. Natco Pharma Limited. The Court also notes that the abolition of IPAB due to the Tribunals Reforms Act, 2021, means that civil suits will not be stayed even if rectification applications are filed. The judgment was delivered on December 20, 2022, by Amit Bansal. The case is CS(COMM) 813/2016, Sana Herbals Pvt Ltd vs. Mohsin Dehlvi. The Court decides that framing additional issues will not cause prejudice to the plaintiff. (Source: 2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf)",
          "content": "2022/DHC/005678 \n \nCS(COMM) 813/2016 \n \n \n \n \n \n                       Page 9 of 10 \n \nthe CPC is very wide and empowers the Court to amend the issues so \nframed or frame additional issues at any time before passing of the final \ndecree. \n15. \nIn any event, if the counsel for the defendant did not press for framing \nof additional issues that are subject matter of the present application and also \ndid not press the application under Section 124 of the Trade Marks Act, the \ndefendant cannot be made to suffer. It has been held in Teva \nPharmaceutical Industries Ltd. & Ors. v. Natco Pharma Limited, (2014) \n210 DLT 591 (DB), which has been followed in Abbott Healthcare (supra) \nthat a litigant ought not to suffer on account of acts of his advocate. \n16. \nThe judgments relied upon by counsel for the plaintiff was in an \nentirely different factual context and therefore, would not be applicable to \nthe facts and circumstances of the present case. \n17. \nThere is another aspect of the matter. In the earlier regime, upon an \nissue being framed with regard to invalidity of a trademark, proceedings in \nthe civil suit were stayed in order that for the statutory authority i.e. IPAB to \ndecide. With the coming into effect of the Tribunals Reforms Act, 2021, and \nthe consequent abolition of the IPAB, this situation does not exist anymore. \nTherefore, even if an issue with regard to invalidity of a trademark is framed \nby the civil court and rectification applications are filed by a litigant, the \ncivil suit is not liable to be stayed. The rectification petitions/applications \ncan be clubbed and tried along with the civil suit. Therefore, no prejudice \nwould be caused to the plaintiff if the additional issues, as sought to be \nframed by way of the present application, are framed. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.12.2022 12:03:26\nSignature Not Verified",
          "pdf_source": "2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf",
          "nodes": []
        },
        {
          "title": "Page 10",
          "node_id": "0013",
          "start_index": 10,
          "end_index": 10,
          "summary": "According to page 10 of the PDF \"2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf\", the court has allowed the present application and framed additional issues. The issues include the validity of the Plaintiff's trademarks with the name \"Dehlvi\" and whether the alleged Assignment Deed dated 19th September, 1999 is legally valid. The case, CS(COMM) 813/2016, is listed before the Joint Registrar on 6th February, 2023. The judgment was delivered by Amit Bansal, J. on December 20, 2022. The parties involved are Sana Herbals Pvt Ltd (Plaintiff) and Mohsin Dehlvi (Defendant), represented by their respective advocates. (Source: 2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf, page 10)",
          "content": "2022/DHC/005678 \n \nCS(COMM) 813/2016 \n \n \n \n \n \n                       Page 10 of 10 \n \n18. \nAccordingly, the present application is allowed and the following \nadditional issues are framed: \nI. \nWhether the registration of the trademarks with the name and style of \n\"Dehlvi\", either independently or as supporting word, as mentioned in \nparagraph 12 of the plaint, in favour of the Plaintiff, are invalid and \nbased on false user and thus, liable to be cancelled / removed? OPD \nII. \nWhether the alleged Assignment Deed dated 19th September, 1999 is \na legally valid instrument? OPD \nCS(COMM) 813/2016 \n19. \nList before the Joint Registrar on 6th February, 2023. \n \n \n \n \n \n \n \n \n \nAMIT BANSAL, J. \nDECEMBER 20, 2022 \ndk/sr \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.12.2022 12:03:26\nSignature Not Verified",
          "pdf_source": "2. SANA HERBALS PVT LTD VS. MOHSIN DELHI VI.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-15T18:30:28.409443",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}