{
  "doc_name": "20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT",
  "pdf_source": "20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf",
  "metadata": {
    "document_name": "20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT",
    "source_pdf": "20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf",
    "judges": [
      "AMIT BANSAL"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "864/2022",
      "864/2022",
      "864/2022",
      "864/2022",
      "864/2022",
      "864/2022",
      "864/2022",
      "864/2022",
      "864/2022",
      "864/2022",
      "864/2022",
      "864/2022",
      "864/2022",
      "20992/2022",
      "1139/2023",
      "2624/2023"
    ],
    "dhc_numbers": [
      "2023/DHC/001280",
      "2023/DHC/001280",
      "2023/DHC/001280",
      "2023/DHC/001280",
      "2023/DHC/001280",
      "2023/DHC/001280",
      "2023/DHC/001280",
      "2023/DHC/001280",
      "2023/DHC/001280",
      "2023/DHC/001280",
      "2023/DHC/001280"
    ],
    "ia_numbers": [],
    "decision_date": "20 February, 2023",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      "TTK PRESTIGE LTD"
    ],
    "defendants": [
      "K K AND COMPANY DELHI PVT LTD & ORS"
    ],
    "appellants": [],
    "respondents": [],
    "plaintiff_advocates": [
      "Mr.Hemant Singh",
      "Ms.Mamta Rani Jha",
      "Mr.Manish Kumar Mishra",
      "Ms.Akansha Singh",
      "Mr.Srinivas Venkat Rangan",
      "Ms.Tarushi Agarwal"
    ],
    "defendant_advocates": [
      "Mr.Sanjay Kumar",
      "Mr.Mukesh Thakur",
      "Mr.Dhirendra Singh"
    ],
    "appellant_advocates": [],
    "respondent_advocates": [],
    "damages_claimed": "339,00,00,000",
    "damages_awarded": null,
    "key_issues": [
      "The plaintiff's trademark \"PRESTIGE\" is registered in various classes, and its validity and subsistence are crucial to the case.",
      "The defendants' use of a similar trademark may constitute infringement and passing off, which could damage the plaintiff's business and reputation.",
      "The plaintiff has invested significant amounts in advertising and promotional expenses to establish its brand, and any infringement could undermine these efforts.",
      "The plaintiff's sales turnover and market presence, including its websites and e-commerce platforms, demonstrate the significance of its trademark and the potential harm from infringement.",
      "The defendants' relationship as sister concerns and their engagement in similar businesses may imply a coordinated effort to infringe the plaintiff's trademark.",
      "The plaintiff's application under Order XXXIX Rules 1 and 2 of the Code of Civil Procedure, 1908, seeks an interim injunction to restrain the defendants from using the infringing trademark.",
      "The court must consider the balance of convenience and irreparable harm to the plaintiff in deciding whether to grant an interim injunction.",
      "The defendants' intent to use a similar trademark, despite the plaintiff's prior registrations and established reputation, may indicate bad faith and support the plaintiff's claim for infringement.",
      "The plaintiff's prior registrations of the trademark \"PRESTIGE\" in classes 8, 11, and 21, and its use since 1955, establish its priority and entitlement to protection under trademark law.",
      "The court must examine the similarities and differences between the plaintiff's and defendants' trademarks to determine whether infringement and passing off have occurred."
    ],
    "decision_summary": "**Case Summary: TTK Prestige Ltd. vs. K K and Company Delhi Pvt. Ltd. & Ors.**\n\n**Background:**\n\nThe plaintiff, TTK Prestige Ltd., is a well-established company engaged in the business of manufacturing, marketing, and sale of kitchen home appliances, including pressure cookers, gas stoves, and non-stick cookware, under the brand/trade mark \"PRESTIGE\" since 1955. The plaintiff has several registrations of the trademark \"PRESTIGE\" in various classes, with the earliest registration dating back to 1949. The defendant, K K and Company Delhi Pvt. Ltd., is engaged in the business of manufacturing and sale of gas stoves and its component parts.\n\n**Legal Issues:**\n\nThe legal issues in this case involve trademark infringement, passing off, and unfair competition. The plaintiff alleges that the defendant's use of the impugned device mark (hereinafter referred to as 'impugned trademark') is likely to cause confusion and deceive the public into believing that the defendant's products are connected to or associated with the plaintiff's products.\n\n**Arguments:**\n\nThe plaintiff argues that:\n\n1. The defendant's use of the impugned trademark is an infringement of the plaintiff's registered trademark \"PRESTIGE\".\n2. The defendant's actions constitute passing off, as they are attempting to deceive the public into believing that their products are connected to or associated with the plaintiff's products.\n3. The defendant's use of the impugned trademark is likely to cause confusion and dilute the distinctiveness of the plaintiff's trademark.\n\nThe defendant argues that:\n\n1. The defendant has been using the impugned trademark since 1st January, 1981, which is prior to the plaintiff's registration of the trademark \"PRESTIGE\" in Class 11.\n2. The defendant's use of the impugned trademark is not likely to cause confusion, as the defendant's products are sold in bulk and on an order basis only.\n\n**Court Findings:**\n\nThe court considered the following findings:\n\n1. The plaintiff has established a strong reputation and goodwill in the trademark \"PRESTIGE\" through extensive use and advertising.\n2. The defendant's use of the impugned trademark is likely to cause confusion and deceive the public into believing that the defendant's products are connected to or associated with the plaintiff's products.\n3. The defendant's claim of prior use of the impugned trademark is not supported by sufficient evidence.\n\n**Decision:**\n\nThe court granted the plaintiff's application for an ad interim injunction, restraining the defendant from using the impugned trademark or any other mark that is similar to the plaintiff's trademark \"PRESTIGE\". The court held that the plaintiff has made out a prima facie case of trademark infringement and passing off, and that the balance of convenience lies in favor of the plaintiff. The court also noted that the defendant's actions are likely to cause irreparable harm to the plaintiff's reputation and goodwill if an injunction is not granted.\n\n**Conclusion:**\n\nIn conclusion, the court's decision in this case highlights the importance of protecting intellectual property rights, particularly trademarks, in the context of unfair competition and passing off. The court's finding that the defendant's use of the impugned trademark is likely to cause confusion and deceive the public into believing that the defendant's products are connected to or associated with the plaintiff's products underscores the need for businesses to ensure that their branding and marketing efforts do not infringe on the rights of others.",
    "legal_precedents": [
      "Amaravathi Enterprises Karaikudi \nChettinadu",
      "Veerumal Praveen \nKumar Needle Industries",
      "United Brothers Navin Kumar"
    ],
    "full_text": "\n--- PAGE 1 ---\n \n2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 1 of 11 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n \n% \n \n \n \n \nDate of Decision : 20th February, 2023 \n \n+  \n \n \n \nCS(COMM) 864/2022 \n \n \nTTK PRESTIGE LTD \n \n \n \n \n..... Plaintiff \nThrough: \nMr.Hemant Singh, Ms.Mamta Rani \nJha, \nMr.Manish \nKumar \nMishra, \nMs.Akansha \nSingh, \nMr.Srinivas \nVenkat \nRangan \nand \nMs.Tarushi \nAgarwal, Advocates. \n \n \n \n \nversus \n \n \nK K AND COMPANY DELHI PVT  \nLTD & ORS. \n \n \n \n \n \n..... Defendants \nThrough: \nMr.Sanjay Kumar, Advocate for D-1 \nand D-2. \nMr.Mukesh Thakur and Mr.Dhirendra \nSingh, Advocates for D-3. \n \nCORAM: \n \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nAMIT BANSAL, J. (Oral) \n \n \n \n \n \nI.A. 20992/2022 (O-XXXIX R-1 & 2 of CPC) \n1. \nBy way of the present judgment, I shall decide the application filed on \nbehalf of the plaintiff under Order XXXIX Rules 1 and 2 of the Code of \nCivil Procedure, 1908 (CPC). \n2. \nBriefly, the case set up in the plaint is that the plaintiff is engaged in \nthe business of manufacturing, marketing and sale of kitchen home \nappliances, including „pressure cookers‟ and „gas stoves‟, both electric and \nnon-electric, non-stick cookware, induction cook-tops, mixer grinders, \nchimneys etc., under the brand/trade mark „PRESTIGE‟ since 1955, which \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified\n\n--- PAGE 2 ---\n \n2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 2 of 11 \n \nis a house mark of the plaintiff. All the plaintiff‟s products are sold under its \nhouse mark „PRESTIGE‟. \n3. \nPlaintiff also has several registrations of the trademark „PRESTIGE‟ \nin various Classes, details of which are given in paragraph 7 of the plaint. \nThe earliest registration of the trademark „PRESTIGE‟ (word per se) in \nClasses 8 and 21 dates back to 14th December, 1949. The trademark \n„PRESTIGE‟ (word per se) was registered in favour of the plaintiff in Class \n11 on 16th June, 1981 in respect of „installations for cooking‟ on a „proposed \nto be used basis‟. Subsequently, the trademark „PRESTIGE‟ (word per se) \nwas registered in favour of the plaintiff on 23rd September, 1999 specifically \nin respect of „gas stoves‟ on a „proposed to be used basis‟. All the aforesaid \ntrademark registrations are valid and subsistent.  \n4. \nThe plaintiff has also filed its sales turnover in respect of its products \nunder the trademark „PRESTIGE‟ from the financial year 2007-08 to 2020-\n21. The turnover of the plaintiff in the year 2007-08 was around \nRs.339,00,00,000/-, whereas the turnover in the financial year 2020-21 was \naround Rs. 2,033,00,00,000. The plaintiff has also provided the advertising \nand promotional expenses incurred by plaintiff in respect of its trademark \n„PRESTIGE'. \nIn \nthe \nyear \n2007-08, \nthe \nplaintiff \nspent \naround \nRs.24,00,00,000/- towards promotional expenses and in the year 2020-21 the \nplaintiff spent around Rs.98,00,00,000.  \n5. \nThe \nplaintiff \noperates \nwebsites, \n„http://www.ttkprestige.com/‟, \n„https://shop.ttkprestige.com/‟ and „http://www.prestigexclusive.in‟, which \nshowcases the plaintiff‟s goods under the said mark. The plaintiff also has \nits presence on various e-commerce platforms. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified\n\n--- PAGE 3 ---\n \n2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 3 of 11 \n \n6. \nThe defendant no.1 is engaged in the business of manufacturing and \nsale of „gas stoves‟ and its component parts. It is averred in the plaint that \nthe defendant no.2 and 3 are sister concerns of the defendant no.1.  \n7. \nIn the third week of August 2022, the plaintiff came across the \ntrademark application dated 2nd November, 2018 filed on behalf of the \ndefendant no.1 for the registration of the device mark \n \n(hereinafter referred to as 'impugned trademark'). The plaintiff opposed the \nregistration of the aforesaid mark by filing opposition on 18th August, 2022. \nThe plaintiff‟s trademark „PRESTIGE‟ in Class 11 was cited as a conflicting \nmark in the examination report of the Trade Marks Registry. Thereafter, the \nplaintiff carried out an investigation in which it was revealed that the \ndefendant no.1 has been selling „gas stoves‟ in collusion with the defendants \nno.2 and 3 under the impugned trademark in bulk and on order basis only. \n8. \nAccordingly, the present suit was filed seeking a decree of permanent \ninjunction, passing off along with other ancillary reliefs.  \n9. \nThe defence set up by the defendant no.1 in its written statement is \nthat the said defendant no.1 has been using the impugned trademark since 1st \nJanuary, 1981. The aforesaid date finds mention in the trademark \nregistration application filed on behalf of the defendant no.1 on 1st \nNovember 2018. Therefore, it is claimed that the defendant no.1 is a prior \nuser of the impugned trademark in respect of „gas stoves‟. The plaintiff filed \nits trademark application for the word mark „PRESTIGE‟ on 16th June, 1981 \non a „proposed to be used basis‟. The plaintiff was aware of the user of the \ntrademark „PRESTIGE‟ by the defendant no.1 since 1981.  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified\n\n--- PAGE 4 ---\n \n2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 4 of 11 \n \n10. \nIn order to show its prior user counsel for the defendant no.1 has \nplaced reliance on: \ni. \nThe certificate of registration granted in favour of the defendant no.1 \nas a Small Scale Industries unit on 21st December, 1982. The \napplication was filed on 16th August, 1980.  \nii. \nThe classification list of excisable goods dated 8th May, 1985 granted \nin favour of the defendant no.1 wherein the trademark „PRESTIGE‟ \nhas been mentioned.  \niii. \nThe Bureau of Indian Standards (BIS) license granted in favour of the \ndefendant no.1 on 22nd April, 1982 in respect of the brand name \n„PRESTIGE‟.  \n11. \nCounsel appearing on behalf of the plaintiff makes the following \nsubmissions: \ni. \nEven though, the defendant no.1 claims to be the user of the \nimpugned trademark from 1st January 1981, the earliest invoice filed \nby the defendant no.1 is of 29th March, 1982. The registration of the \nplaintiff‟s mark „PRESTIGE‟ (word per se) under Class 11 in respect \nof „installations for cooking‟ on a “proposed to be used basis” is of \n16th June, 1981, which is prior to the user of the impugned trademark \nin respect of „gas stoves‟ by the defendant no.1. Therefore, the \ndefence under Section 34 of the Trade Marks Act, 1999 (hereinafter \nreferred to as „the Act‟) is not available to the defendant no.1.  \nii. \nWithout prejudice to the aforesaid, the defendant no.1 has failed to \nmake out a case of „continuous user‟ as envisaged under Section 34 of \nthe Act. The defendant no.1 has placed on record only three invoices \nshowing sales of goods bearing the impugned trademark, which are of \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified\n\n--- PAGE 5 ---\n \n2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 5 of 11 \n \nthe year 1982. Reliance in this regard is placed on the judgment of a \nDivision Bench of this Court in Pioneer Nuts and Bolts Pvt. Ltd. v. \nGoodwill Enterprises, 2009 SCC OnLine Del 2851. \niii. \nCounsel for the plaintiff has placed reliance on the various invoices \nshowing sale of „gas stoves‟ by the plaintiff with effect from 20th \nSeptember, 2007 (page no.260-300 of the plaintiff‟s document). \nAttention of the Court has been drawn to the advertisements taken out \nby the plaintiff in respect of gas stoves being sold under the trademark \n„PRESTIGE‟.  \niv. \nIn view of the tremendous goodwill and reputation attained by the \nusage of the trademark „PRESTIGE‟ in respect of „pressure cookers‟ \nas is evidenced by the sales turnover and promotional expenses, a case \nof passing off is also made out by the plaintiff. Reliance in this regard \nis placed on the judgment of United Brothers v. Navin Kumar, 2006 \nSCC OnLine Del 185. \n12. \nI have heard the counsel for the parties.  \n13. \nThough the defendant no.1 vehemently contends that it is a prior user \nof the trademark „PRESTIGE‟ and has been continuously using the said \ntrademark since the year 1981, the defendant no.1 has placed on record only \nthree invoices, all of the year 1982 in support of his contention.  \n14. \nA query was put to the counsel for the defendant no.1 that if the \ndefendant no.1 has been continuously using the aforesaid trademark since \n1981, why has the defendant no.1 placed on record only three invoices. It \nwas further put to the counsel for the defendant no.1 that whether any sales \nin respect of the trademark „PRESTIGE‟ had been made in the last ten years.  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified\n\n--- PAGE 6 ---\n \n2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 6 of 11 \n \n15. \nCounsel for the defendant no.1 submits that he may be given further \ntime so as to file documents to show the use of the trademark „PRESTIGE‟ \nbetween the year 1981 till the current date.  \n16. \nUnder Sub-Rule 7 of Order XI Rule 1 of the Code of Civil Procedure, \n1908 as applicable to commercial suits under the Commercial Courts Act, \n2015, a defendant has to file a list of all documents and photocopies of all \ndocuments, in its power, possession, control or custody, pertaining to the \nsuit, along with the written statement. Sub-Rule 10 of Order XI Rule 1 of the \nCPC further provides that the defendant cannot be allowed to rely on \ndocuments, which were in the defendant‟s power, possession, control or \ncustody and not disclosed along with the written statement, except with the \nleave of Court.  \n17. \nWhat emerges form a reading of the aforesaid provisions is that along \nwith the written statement the defendant has to file all documents in his \npower and possession and in support of his case. Additional documents can \nbe filed only with a leave of the Court and upon the defendant giving a \nreasonable explanation for not filing the same with the written statement. \nAdmittedly, no such application has been filed on behalf of the defendant \nno.1 seeking leave to file additional documents.  Therefore, no further time \ncan be granted to the defendant no.1 to place additional documents on \nrecord. As the defendant no.1 claims to be „continuous user‟ of the \ntrademark „PRESTIGE‟ from 1981, it should have filed documents \nevidencing such „continuous user‟. In the absence of any documents, the \nCourt shall presume that there was no „continuous user‟ by the defendant \nno.1. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified\n\n--- PAGE 7 ---\n \n2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 7 of 11 \n \n18. \nIn this regard reference may be made to the judgment of a Division \nBench of this Court in Pioneer Nuts (supra). In Pioneer Nuts (supra) relying \nupon the earlier judgments in Amaravathi Enterprises v. Karaikudi \nChettinadu, 2008 (36) PTC 688 (Madras)(DB) and in Veerumal Praveen \nKumar v. Needle Industries (India) Pvt. Ltd., 2001 (21) PTC 668 (Delhi), \nthe Division Bench has observed that a trader has to show that in relation to \nparticular goods, there is a goodwill connecting the trader with the goods on \naccount of the use of trademark. Holding that the defendant in the said case \nhad failed to place evidence on record to show that it had actually sold its \ngoods using the impugned marks other than two newspaper advertisements \nand a few trade enquiries, the Division Bench was pleased to grant interim \ninjunction in favour of the plaintiff. It was further observed that mere filing \nof a trademark application and giving an arbitrary date of user would not in \nitself constitute evidence of use from the said date.  \n19. \nThe aforesaid dicta is fully applicable to the facts of the present case. \nIn the present case, the trademark application has been filed on behalf of the \ndefendant no.1 only on 2nd November, 2018 claiming user from 1st January, \n1981. Other than three invoices of the year 1982 and few statutory \nregistrations in favour of the defendant no.1, no credible evidence in the \nform of invoices or advertisements or other material has been filed to show \nthat the defendant no.1 has been continuously using the impugned trademark \nso as to constitute any goodwill or reputation in its favour. Accordingly, I \nam of the view that the defendant no.1 has at best shown sporadic use of the \nimpugned trademark, which would not qualify it as a „continuous user‟ in \nterms of section 34 of the Act.  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified\n\n--- PAGE 8 ---\n \n2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 8 of 11 \n \n20. \nCounsel for the defendant no.1 vehemently contends that the \ntrademark application filed on behalf of the plaintiff is on a „proposed to be \nused‟ basis and the plaintiff has not filed any documents to show their user. \nTo claim the defence of section 34 of the Act, defendant no.1 has to show its \ncontinuous user prior to (a) user of the plaintiff or (b) date of registration in \nfavour of the plaintiff in respect of the said goods, whichever is earlier.  \n21. \nIn the present case, the date of registration in favour of the plaintiff in \nrespect of „installations for cooking‟ is of 16th June, 1981, which is the \nearlier date. The phrase „installations for cooking‟ would cover within its \nscope 'gas stoves‟. Three invoices filed on behalf of the defendant no.1 are \nadmittedly of a subsequent date. Defendant no.1 has also placed reliance on \nthe Small Scale Industries (SSI) certificate dated 21st December, 1982, BIS \nlicense dated 24th April, 1982 as well as excise documents dated 8th May, \n1985 in support of his submission that the defendant no.1 is a prior user of \nthe trademark „PRESTIGE‟. The SSI certificate in favour of the defendant \nno.1 does not mention the trademark „PRESTIGE‟. Both the BIS license as \nwell as excise documents are after the trademark „PRESTIGE‟ of the \nplaintiff was registered in Class 11. Therefore, the defendant no.1 has failed \nto establish use of the impugned trademark prior to the registration granted \nin favour of the plaintiff. Admittedly, no defence has been taken in the \nwritten statement with regard to validity of the registration granted in favour \nof the plaintiff.  \n22. \nOn the basis of the sales turnover as well as the promotional expenses \nplaced on record by the plaintiff, the plaintiff has also established, at a prima \nfacie stage, immense goodwill and reputation of its trademark „PRESTIGE‟, \nalbeit in respect of „pressure cookers‟. The plaintiff has been selling its \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified\n\n--- PAGE 9 ---\n \n2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 9 of 11 \n \nproducts under the trademark „PRESTIGE‟ since 1955 and the earliest \nregistration of the plaintiff‟s mark is of 14th December, 1949. Further, the \nplaintiff has placed on record various invoices from the year 2007 to show \nsales of „gas stoves‟ and advertisements of the year 2019 to show that it was \nin the business of selling „gas stoves‟ under the trademark „PRESTIGE‟. \nEven the defendant no.1 does not dispute the position that the plaintiff has \nbeen selling „pressure cookers‟ under the trademark „PRESTIGE‟ much \nbefore the defendant no.1. The only defence put forth by the defendant no.1 \nis that „pressure cookers‟ and „gas stoves‟ are different products and \ntherefore, there would be no confusion in the market.  \n23. \nIn this regard, counsel for the plaintiff has correctly placed reliance on \nthe judgment of a Co-ordinate Bench of this Court in United Brothers \n(supra), which dealt with the passing off claim in respect of the same \nproducts that are subject matter of the present suit viz. „LPG stoves‟ and \n„pressure cookers‟ being sold under the same trademark, „United‟. While \ngranting injunction in favour of the plaintiff, the Co-ordinate Bench \nobserved that the goods of the plaintiff as well as the defendants are both \nused as kitchen appliances and therefore, there would be confusion for the \nconsumer using both the products. Further, in view of the sales turnover as \nwell as advertising expenses filed by the plaintiff, the plaintiff was able to \nestablish that its trademark had acquired distinctiveness and goodwill in the \nmarket. Accordingly, it was observed that confusion is likely to be caused in \nthe mind of public and hence,  the interim injunction granted in favour of the \nplaintiff was confirmed.  \n24. \nThe aforesaid judgment is clearly applicable to the facts and \ncircumstances of the present case as the two goods in question in the said \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified\n\n--- PAGE 10 ---\n \n2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 10 of 11 \n \ncase and case at hand are identical. The use of the trademark „PRESTIGE‟ \nby the defendant no.1 in respect of „gas stoves‟ is likely to cause confusion \nin the market as the public at large would associate the said products of the \ndefendant no.1 with the plaintiff.  \n25. \nIn view of the discussion above, a prima facie case of infringement as \nwell as passing off is made out on behalf of the plaintiff. Balance of \nconvenience is also in favour of plaintiff and against the defendant no.1. The \nplaintiff shall continue to suffer irreparable injury to its goodwill and \nreputation if the defendant no.1 is permitted to manufacture and sell goods \nbearing the impugned trademark. \n26. \nAccordingly, the present application is allowed and the defendant \nno.1, its directors, sister concerns, assigns in business, distributors, stockists, \ndealers and agents are injuncted from manufacturing, selling, offering for \nsale, exporting, advertising in any manner including on the internet and \nwebsites, directly or indirectly dealing in gas stoves or in any kitchenware, \ncookware and/or cognate/allied/related goods under the mark \n \nor any other mark which is identical or deceptively similar to the plaintiff‟s \n„PRESTIGE‟ trademarks. \nCS(COMM) 864/2022 \n27. \nCounsels for the defendants no.2 and 3 submit that they are not the \nsister concerns of the defendant no.1 and do not manufacture or sell any \nproduct using the impugned trademark. \n28. \nHence, without going into the merits, the defendants no.2 and 3 have \nno objection if a decree of permanent injunction is passed against them \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified\n\n--- PAGE 11 ---\n \n2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 11 of 11 \n \nrestraining them from using the trademark „PRESTIGE‟ or any other mark \nwhich is identical or deceptively similar to that of the plaintiff. \n29. \nAccordingly, the suit is decreed against the defendants no.2 and 3 in \nterms of prayer clauses (i) and (ii) of the plaint.  \n30. \nCounsel for the plaintiff does not press for reliefs sought in prayer \nclauses (iii), (iv), (v), (vi) and (vii) against the defendants no.2 and 3.  \n31. \nLet the decree sheet be drawn up. \n32. \nThe suit shall continue to proceed against the defendant no.1. \n33. \nList before the Joint Registrar on 3rd May, 2023 for further \nproceedings. \nI.A. 1139/2023 (O-I R-10 of CPC) and I.A. 2624/2023 (O-I R-10 of CPC) \n34. \n In view of the above, the present applications have become \ninfructuous and are disposed of as such. \n \n \nAMIT BANSAL, J \nFEBRUARY 20, 2023 \nsr \n \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified\n"
  },
  "total_pages": 11,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "According to the PDF document \"20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf\", the case CS(COMM) 864/2022 was heard in the High Court of Delhi at New Delhi. The plaintiff, TTK Prestige Ltd, is engaged in the business of manufacturing and selling kitchen home appliances under the brand/trade mark \"PRESTIGE\" since 1955. The plaintiff has several registrations of the trademark \"PRESTIGE\" in various classes, with the earliest registration dating back to 1949.\n\nThe plaintiff filed an application under Order XXXIX Rules 1 and 2 of the Code of Civil Procedure, 1908 (CPC). The court considered the plaintiff's sales turnover, which increased from Rs.339,00,00,000/- in 2007-08 to Rs. 2,033,00,00,000 in 2020-21. The plaintiff also spent Rs.24,00,00,000/- on promotional expenses in 2007-08, which increased to Rs.98,00,00,000 in 2020-21.\n\nThe defendants, K K And Company Delhi Pvt Ltd & Ors, were represented by Mr. Sanjay Kumar, Advocate for D-1 and D-2, and Mr. Mukesh Thakur and Mr. Dhirendra Singh, Advocates for D-3. The Hon'ble Mr. Justice Amit Bansal heard the application on February 20, 2023. The judgment was digitally signed by Amit Bansal on February 23, 2023. The case highlights the plaintiff's efforts to protect its trademark and intellectual property rights. (Source: 20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf)",
      "pdf_source": "20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "According to page 1 of the PDF \"20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf\", a court case (CS(COMM) 864/2022) was heard in the High Court of Delhi at New Delhi. The plaintiff, TTK Prestige Ltd, was represented by multiple advocates, including Mr. Hemant Singh and Ms. Mamta Rani Jha. The defendants, K K and Company Delhi Pvt Ltd and others, were represented by Mr. Sanjay Kumar and others. The case was decided by Hon'ble Mr. Justice Amit Bansal on February 20, 2023. The plaintiff manufactures kitchen home appliances under the brand \"PRESTIGE\" since 1955. An application (I.A. 20992/2022) was filed under Order XXXIX Rules 1 and 2 of the Code of Civil Procedure, 1908, which was to be decided by the court. (Source: 20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf)",
          "content": "2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 1 of 11 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n \n% \n \n \n \n \nDate of Decision : 20th February, 2023 \n \n+  \n \n \n \nCS(COMM) 864/2022 \n \n \nTTK PRESTIGE LTD \n \n \n \n \n..... Plaintiff \nThrough: \nMr.Hemant Singh, Ms.Mamta Rani \nJha, \nMr.Manish \nKumar \nMishra, \nMs.Akansha \nSingh, \nMr.Srinivas \nVenkat \nRangan \nand \nMs.Tarushi \nAgarwal, Advocates. \n \n \n \n \nversus \n \n \nK K AND COMPANY DELHI PVT  \nLTD & ORS. \n \n \n \n \n \n..... Defendants \nThrough: \nMr.Sanjay Kumar, Advocate for D-1 \nand D-2. \nMr.Mukesh Thakur and Mr.Dhirendra \nSingh, Advocates for D-3. \n \nCORAM: \n \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nAMIT BANSAL, J. (Oral) \n \n \n \n \n \nI.A. 20992/2022 (O-XXXIX R-1 & 2 of CPC) \n1. \nBy way of the present judgment, I shall decide the application filed on \nbehalf of the plaintiff under Order XXXIX Rules 1 and 2 of the Code of \nCivil Procedure, 1908 (CPC). \n2. \nBriefly, the case set up in the plaint is that the plaintiff is engaged in \nthe business of manufacturing, marketing and sale of kitchen home \nappliances, including „pressure cookers‟ and „gas stoves‟, both electric and \nnon-electric, non-stick cookware, induction cook-tops, mixer grinders, \nchimneys etc., under the brand/trade mark „PRESTIGE‟ since 1955, which \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified",
          "pdf_source": "20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "According to page 2 of the PDF \"20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf\", the plaintiff, TTK Prestige Ltd, has a house mark \"PRESTIGE\" with several trademark registrations, including one dating back to December 14, 1949. The plaintiff has provided sales turnover and advertising expenses from 2007-08 to 2020-21, with a turnover of Rs. 339,00,00,000 in 2007-08 and Rs. 2,033,00,00,000 in 2020-21. The plaintiff also spent Rs. 24,00,00,000 on promotional expenses in 2007-08 and Rs. 98,00,00,000 in 2020-21. The case, CS(COMM) 864/2022, was decided on February 20, 2023, in the High Court of Delhi. The plaintiff is represented by advocates including Mr. Hemant Singh and Mr. Srinivas Venkat Rangan. (Source: 20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf)",
          "content": "2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 2 of 11 \n \nis a house mark of the plaintiff. All the plaintiff‟s products are sold under its \nhouse mark „PRESTIGE‟. \n3. \nPlaintiff also has several registrations of the trademark „PRESTIGE‟ \nin various Classes, details of which are given in paragraph 7 of the plaint. \nThe earliest registration of the trademark „PRESTIGE‟ (word per se) in \nClasses 8 and 21 dates back to 14th December, 1949. The trademark \n„PRESTIGE‟ (word per se) was registered in favour of the plaintiff in Class \n11 on 16th June, 1981 in respect of „installations for cooking‟ on a „proposed \nto be used basis‟. Subsequently, the trademark „PRESTIGE‟ (word per se) \nwas registered in favour of the plaintiff on 23rd September, 1999 specifically \nin respect of „gas stoves‟ on a „proposed to be used basis‟. All the aforesaid \ntrademark registrations are valid and subsistent.  \n4. \nThe plaintiff has also filed its sales turnover in respect of its products \nunder the trademark „PRESTIGE‟ from the financial year 2007-08 to 2020-\n21. The turnover of the plaintiff in the year 2007-08 was around \nRs.339,00,00,000/-, whereas the turnover in the financial year 2020-21 was \naround Rs. 2,033,00,00,000. The plaintiff has also provided the advertising \nand promotional expenses incurred by plaintiff in respect of its trademark \n„PRESTIGE'. \nIn \nthe \nyear \n2007-08, \nthe \nplaintiff \nspent \naround \nRs.24,00,00,000/- towards promotional expenses and in the year 2020-21 the \nplaintiff spent around Rs.98,00,00,000.  \n5. \nThe \nplaintiff \noperates \nwebsites, \n„http://www.ttkprestige.com/‟, \n„https://shop.ttkprestige.com/‟ and „http://www.prestigexclusive.in‟, which \nshowcases the plaintiff‟s goods under the said mark. The plaintiff also has \nits presence on various e-commerce platforms. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified",
          "pdf_source": "20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0007",
      "start_index": 3,
      "end_index": 5,
      "summary": "According to the PDF document \"TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf\", a legal proceeding (CS(COMM) 864/2022) is ongoing in the High Court of Delhi. The plaintiff, TTK Prestige Ltd, has filed a suit against the defendant, K K and Company Delhi Pvt, seeking a decree of permanent injunction and passing off due to trademark infringement.\n\nThe defendant is engaged in the business of manufacturing and selling gas stoves and has applied for registration of the trademark \"PRESTIGE\" (impugned trademark) on November 2, 2018. The plaintiff opposed the registration, citing their own trademark \"PRESTIGE\" in Class 11, which was applied for on June 16, 1981.\n\nThe defendant claims prior use of the impugned trademark since January 1, 1981, and has provided documents such as a certificate of registration as a Small Scale Industries unit (1982), a classification list of excisable goods (1985), and a Bureau of Indian Standards (BIS) license (1982) to support their claim.\n\nThe plaintiff argues that the defendant's claim of prior use is not valid, as the earliest invoice provided by the defendant is dated March 29, 1982, which is after the plaintiff's trademark application. The plaintiff also claims that the defendant has failed to demonstrate continuous use of the impugned trademark as required by Section 34 of the Trade Marks Act, 1999. (Source: 2023/DHC/001280, Pages 1-5 of 11)",
      "pdf_source": "20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "According to page 3 of the PDF \"20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf\", the defendant (K K AND COMPANY DELHI PVT) is engaged in manufacturing and selling \"gas stoves\" and its components. The plaintiff (TTK PRESTIGE LTD) opposed the defendant's trademark application filed on November 2, 2018, citing their own trademark \"PRESTIGE\" in Class 11 as a conflicting mark. The plaintiff alleges that the defendant has been selling \"gas stoves\" under the impugned trademark in bulk. The defendant claims prior use of the trademark since January 1, 1981, while the plaintiff filed its trademark application on June 16, 1981, on a \"proposed to be used basis\". The case, CS(COMM) 864/2022, was filed seeking a decree of permanent injunction and passing off, among other reliefs. (Source: 20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf, page 3)",
          "content": "2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 3 of 11 \n \n6. \nThe defendant no.1 is engaged in the business of manufacturing and \nsale of „gas stoves‟ and its component parts. It is averred in the plaint that \nthe defendant no.2 and 3 are sister concerns of the defendant no.1.  \n7. \nIn the third week of August 2022, the plaintiff came across the \ntrademark application dated 2nd November, 2018 filed on behalf of the \ndefendant no.1 for the registration of the device mark \n \n(hereinafter referred to as 'impugned trademark'). The plaintiff opposed the \nregistration of the aforesaid mark by filing opposition on 18th August, 2022. \nThe plaintiff‟s trademark „PRESTIGE‟ in Class 11 was cited as a conflicting \nmark in the examination report of the Trade Marks Registry. Thereafter, the \nplaintiff carried out an investigation in which it was revealed that the \ndefendant no.1 has been selling „gas stoves‟ in collusion with the defendants \nno.2 and 3 under the impugned trademark in bulk and on order basis only. \n8. \nAccordingly, the present suit was filed seeking a decree of permanent \ninjunction, passing off along with other ancillary reliefs.  \n9. \nThe defence set up by the defendant no.1 in its written statement is \nthat the said defendant no.1 has been using the impugned trademark since 1st \nJanuary, 1981. The aforesaid date finds mention in the trademark \nregistration application filed on behalf of the defendant no.1 on 1st \nNovember 2018. Therefore, it is claimed that the defendant no.1 is a prior \nuser of the impugned trademark in respect of „gas stoves‟. The plaintiff filed \nits trademark application for the word mark „PRESTIGE‟ on 16th June, 1981 \non a „proposed to be used basis‟. The plaintiff was aware of the user of the \ntrademark „PRESTIGE‟ by the defendant no.1 since 1981.  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified",
          "pdf_source": "20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "According to page 4 of the PDF \"20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf\", the defendant's counsel presented documents to show prior use of the \"PRESTIGE\" trademark, including a registration certificate from 1982 and a Bureau of Indian Standards license from 1982. The plaintiff's counsel argued that the defendant's earliest invoice was from 1982, while the plaintiff's trademark registration was from 1981, making the defense under Section 34 of the Trade Marks Act, 1999 unavailable to the defendant. The plaintiff's counsel also claimed that the defendant failed to show continuous use of the trademark, with only three invoices provided as evidence. Key dates mentioned include August 16, 1980, December 21, 1982, and June 16, 1981. (Source: 20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf)",
          "content": "2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 4 of 11 \n \n10. \nIn order to show its prior user counsel for the defendant no.1 has \nplaced reliance on: \ni. \nThe certificate of registration granted in favour of the defendant no.1 \nas a Small Scale Industries unit on 21st December, 1982. The \napplication was filed on 16th August, 1980.  \nii. \nThe classification list of excisable goods dated 8th May, 1985 granted \nin favour of the defendant no.1 wherein the trademark „PRESTIGE‟ \nhas been mentioned.  \niii. \nThe Bureau of Indian Standards (BIS) license granted in favour of the \ndefendant no.1 on 22nd April, 1982 in respect of the brand name \n„PRESTIGE‟.  \n11. \nCounsel appearing on behalf of the plaintiff makes the following \nsubmissions: \ni. \nEven though, the defendant no.1 claims to be the user of the \nimpugned trademark from 1st January 1981, the earliest invoice filed \nby the defendant no.1 is of 29th March, 1982. The registration of the \nplaintiff‟s mark „PRESTIGE‟ (word per se) under Class 11 in respect \nof „installations for cooking‟ on a “proposed to be used basis” is of \n16th June, 1981, which is prior to the user of the impugned trademark \nin respect of „gas stoves‟ by the defendant no.1. Therefore, the \ndefence under Section 34 of the Trade Marks Act, 1999 (hereinafter \nreferred to as „the Act‟) is not available to the defendant no.1.  \nii. \nWithout prejudice to the aforesaid, the defendant no.1 has failed to \nmake out a case of „continuous user‟ as envisaged under Section 34 of \nthe Act. The defendant no.1 has placed on record only three invoices \nshowing sales of goods bearing the impugned trademark, which are of \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified",
          "pdf_source": "20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf",
          "nodes": []
        },
        {
          "title": "Page 5",
          "node_id": "0006",
          "start_index": 5,
          "end_index": 5,
          "summary": "According to page 5 of the PDF \"20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf\", the plaintiff, TTK Prestige Ltd, has relied on various invoices showing sales of gas stoves under the trademark \"PRESTIGE\" since 2007. The plaintiff's counsel has also referred to advertisements and sales turnover to establish goodwill and reputation. The defendant, K K and Company Delhi Pvt, claims prior use of the trademark since 1981 but has only provided three invoices from 1982 as evidence. The court questioned the defendant's counsel about the lack of recent sales records and the limited number of invoices provided. The case, CS(COMM) 864/2022, was heard by the High Court of Delhi, with the decision date being February 20, 2023. (Source: 20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf, page 5)",
          "content": "2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 5 of 11 \n \nthe year 1982. Reliance in this regard is placed on the judgment of a \nDivision Bench of this Court in Pioneer Nuts and Bolts Pvt. Ltd. v. \nGoodwill Enterprises, 2009 SCC OnLine Del 2851. \niii. \nCounsel for the plaintiff has placed reliance on the various invoices \nshowing sale of „gas stoves‟ by the plaintiff with effect from 20th \nSeptember, 2007 (page no.260-300 of the plaintiff‟s document). \nAttention of the Court has been drawn to the advertisements taken out \nby the plaintiff in respect of gas stoves being sold under the trademark \n„PRESTIGE‟.  \niv. \nIn view of the tremendous goodwill and reputation attained by the \nusage of the trademark „PRESTIGE‟ in respect of „pressure cookers‟ \nas is evidenced by the sales turnover and promotional expenses, a case \nof passing off is also made out by the plaintiff. Reliance in this regard \nis placed on the judgment of United Brothers v. Navin Kumar, 2006 \nSCC OnLine Del 185. \n12. \nI have heard the counsel for the parties.  \n13. \nThough the defendant no.1 vehemently contends that it is a prior user \nof the trademark „PRESTIGE‟ and has been continuously using the said \ntrademark since the year 1981, the defendant no.1 has placed on record only \nthree invoices, all of the year 1982 in support of his contention.  \n14. \nA query was put to the counsel for the defendant no.1 that if the \ndefendant no.1 has been continuously using the aforesaid trademark since \n1981, why has the defendant no.1 placed on record only three invoices. It \nwas further put to the counsel for the defendant no.1 that whether any sales \nin respect of the trademark „PRESTIGE‟ had been made in the last ten years.  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified",
          "pdf_source": "20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0012",
      "start_index": 6,
      "end_index": 9,
      "summary": "According to the PDF document \"TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf\", a legal case (CS(COMM) 864/2022) was heard in the High Court of Delhi. The plaintiff, TTK Prestige Ltd, was represented by multiple advocates, including Mr. Hemant Singh and Ms. Mamta Rani Jha. The defendant, K K and Company Delhi Pvt, requested additional time to file documents showing the use of the trademark \"PRESTIGE\" from 1981 to the current date.\n\nThe court denied this request, citing Sub-Rule 7 of Order XI Rule 1 of the Code of Civil Procedure, 1908, which requires defendants to file all relevant documents with their written statement. The defendant had not filed an application to submit additional documents, and therefore, the court presumed that there was no \"continuous user\" of the trademark.\n\nThe court referenced a previous judgment (Pioneer Nuts) that emphasized the need for a trader to show goodwill connecting them to the goods through the use of a trademark. In this case, the defendant had only provided limited evidence, including three invoices from 1982 and a few statutory registrations. The court concluded that the defendant had at best shown sporadic use of the trademark, which did not qualify as \"continuous user\" under section 34 of the Act. The decision was made on February 20, 2023, and digitally signed by Amit Bansal on February 23, 2023. (Source: 2023/DHC/001280, CS(COMM) 864/2022, Page 6-7 of 11)",
      "pdf_source": "20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf",
      "nodes": [
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "According to page 6 of the PDF \"20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf\", the counsel for the defendant requested additional time to file documents showing the use of the trademark \"PRESTIGE\" from 1981 to the current date. However, the court denied this request, citing Sub-Rule 7 and 10 of Order XI Rule 1 of the Code of Civil Procedure, 1908, which requires defendants to file all relevant documents with their written statement. Since no application was made to file additional documents, the court refused to grant further time. The court noted that the defendant's claim of \"continuous user\" of the trademark since 1981 should have been supported by documents, and in their absence, the court will presume no such use occurred. (Source: 20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf, 2023/DHC/001280, CS(COMM) 864/2022)",
          "content": "2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 6 of 11 \n \n15. \nCounsel for the defendant no.1 submits that he may be given further \ntime so as to file documents to show the use of the trademark „PRESTIGE‟ \nbetween the year 1981 till the current date.  \n16. \nUnder Sub-Rule 7 of Order XI Rule 1 of the Code of Civil Procedure, \n1908 as applicable to commercial suits under the Commercial Courts Act, \n2015, a defendant has to file a list of all documents and photocopies of all \ndocuments, in its power, possession, control or custody, pertaining to the \nsuit, along with the written statement. Sub-Rule 10 of Order XI Rule 1 of the \nCPC further provides that the defendant cannot be allowed to rely on \ndocuments, which were in the defendant‟s power, possession, control or \ncustody and not disclosed along with the written statement, except with the \nleave of Court.  \n17. \nWhat emerges form a reading of the aforesaid provisions is that along \nwith the written statement the defendant has to file all documents in his \npower and possession and in support of his case. Additional documents can \nbe filed only with a leave of the Court and upon the defendant giving a \nreasonable explanation for not filing the same with the written statement. \nAdmittedly, no such application has been filed on behalf of the defendant \nno.1 seeking leave to file additional documents.  Therefore, no further time \ncan be granted to the defendant no.1 to place additional documents on \nrecord. As the defendant no.1 claims to be „continuous user‟ of the \ntrademark „PRESTIGE‟ from 1981, it should have filed documents \nevidencing such „continuous user‟. In the absence of any documents, the \nCourt shall presume that there was no „continuous user‟ by the defendant \nno.1. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified",
          "pdf_source": "20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf",
          "nodes": []
        },
        {
          "title": "Page 7",
          "node_id": "0009",
          "start_index": 7,
          "end_index": 7,
          "summary": "According to page 7 of the PDF \"20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf\", the court references a Division Bench judgment in Pioneer Nuts, which states that a trader must show goodwill connecting them to goods through trademark use. The defendant failed to provide evidence of continuous use, with only two newspaper advertisements and a few trade enquiries. The court observed that filing a trademark application and claiming an arbitrary user date is not sufficient evidence. \n\nIn this case, the defendant's trademark application was filed on November 2, 2018, claiming use since January 1, 1981. However, only three invoices from 1982 and a few statutory registrations were provided as evidence. The court concluded that the defendant showed only sporadic use, which does not qualify as \"continuous user\" under Section 34 of the Act. (Source: 2023/DHC/001280, CS(COMM) 864/2022, PDF page 7)",
          "content": "2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 7 of 11 \n \n18. \nIn this regard reference may be made to the judgment of a Division \nBench of this Court in Pioneer Nuts (supra). In Pioneer Nuts (supra) relying \nupon the earlier judgments in Amaravathi Enterprises v. Karaikudi \nChettinadu, 2008 (36) PTC 688 (Madras)(DB) and in Veerumal Praveen \nKumar v. Needle Industries (India) Pvt. Ltd., 2001 (21) PTC 668 (Delhi), \nthe Division Bench has observed that a trader has to show that in relation to \nparticular goods, there is a goodwill connecting the trader with the goods on \naccount of the use of trademark. Holding that the defendant in the said case \nhad failed to place evidence on record to show that it had actually sold its \ngoods using the impugned marks other than two newspaper advertisements \nand a few trade enquiries, the Division Bench was pleased to grant interim \ninjunction in favour of the plaintiff. It was further observed that mere filing \nof a trademark application and giving an arbitrary date of user would not in \nitself constitute evidence of use from the said date.  \n19. \nThe aforesaid dicta is fully applicable to the facts of the present case. \nIn the present case, the trademark application has been filed on behalf of the \ndefendant no.1 only on 2nd November, 2018 claiming user from 1st January, \n1981. Other than three invoices of the year 1982 and few statutory \nregistrations in favour of the defendant no.1, no credible evidence in the \nform of invoices or advertisements or other material has been filed to show \nthat the defendant no.1 has been continuously using the impugned trademark \nso as to constitute any goodwill or reputation in its favour. Accordingly, I \nam of the view that the defendant no.1 has at best shown sporadic use of the \nimpugned trademark, which would not qualify it as a „continuous user‟ in \nterms of section 34 of the Act.  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified",
          "pdf_source": "20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf",
          "nodes": []
        },
        {
          "title": "Page 8",
          "node_id": "0010",
          "start_index": 8,
          "end_index": 8,
          "summary": "According to page 8 of the PDF \"20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf\", the defendant's counsel argued that the plaintiff's trademark application was filed on a \"proposed to be used\" basis without showing prior use. To claim defense under Section 34 of the Act, the defendant must show continuous use prior to the plaintiff's use or registration date. The plaintiff's registration date for \"installations for cooking\" is June 16, 1981. The defendant's invoices and documents, including the SSI certificate, BIS license, and excise documents, are of subsequent dates and do not establish prior use of the \"PRESTIGE\" trademark. The plaintiff has established immense goodwill and reputation for its trademark, with significant sales turnover and promotional expenses. (Source: 20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf, page 8)",
          "content": "2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 8 of 11 \n \n20. \nCounsel for the defendant no.1 vehemently contends that the \ntrademark application filed on behalf of the plaintiff is on a „proposed to be \nused‟ basis and the plaintiff has not filed any documents to show their user. \nTo claim the defence of section 34 of the Act, defendant no.1 has to show its \ncontinuous user prior to (a) user of the plaintiff or (b) date of registration in \nfavour of the plaintiff in respect of the said goods, whichever is earlier.  \n21. \nIn the present case, the date of registration in favour of the plaintiff in \nrespect of „installations for cooking‟ is of 16th June, 1981, which is the \nearlier date. The phrase „installations for cooking‟ would cover within its \nscope 'gas stoves‟. Three invoices filed on behalf of the defendant no.1 are \nadmittedly of a subsequent date. Defendant no.1 has also placed reliance on \nthe Small Scale Industries (SSI) certificate dated 21st December, 1982, BIS \nlicense dated 24th April, 1982 as well as excise documents dated 8th May, \n1985 in support of his submission that the defendant no.1 is a prior user of \nthe trademark „PRESTIGE‟. The SSI certificate in favour of the defendant \nno.1 does not mention the trademark „PRESTIGE‟. Both the BIS license as \nwell as excise documents are after the trademark „PRESTIGE‟ of the \nplaintiff was registered in Class 11. Therefore, the defendant no.1 has failed \nto establish use of the impugned trademark prior to the registration granted \nin favour of the plaintiff. Admittedly, no defence has been taken in the \nwritten statement with regard to validity of the registration granted in favour \nof the plaintiff.  \n22. \nOn the basis of the sales turnover as well as the promotional expenses \nplaced on record by the plaintiff, the plaintiff has also established, at a prima \nfacie stage, immense goodwill and reputation of its trademark „PRESTIGE‟, \nalbeit in respect of „pressure cookers‟. The plaintiff has been selling its \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified",
          "pdf_source": "20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf",
          "nodes": []
        },
        {
          "title": "Page 9",
          "node_id": "0011",
          "start_index": 9,
          "end_index": 9,
          "summary": "According to page 9 of the PDF \"20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf\", TTK Prestige Ltd has been selling products under the trademark \"PRESTIGE\" since 1955, with the earliest registration dating back to December 14, 1949. The plaintiff provided invoices and advertisements to show sales of \"gas stoves\" under the trademark. The defendant argued that \"pressure cookers\" and \"gas stoves\" are different products, but the court cited a previous judgment in United Brothers, which dealt with similar products and trademarks. The court observed that both products are used as kitchen appliances, likely causing consumer confusion. The plaintiff established distinctiveness and goodwill in the market through sales turnover and advertising expenses. This judgment is applicable to the present case, suggesting that confusion is likely to occur. (Source: 20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf, page 9)",
          "content": "2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 9 of 11 \n \nproducts under the trademark „PRESTIGE‟ since 1955 and the earliest \nregistration of the plaintiff‟s mark is of 14th December, 1949. Further, the \nplaintiff has placed on record various invoices from the year 2007 to show \nsales of „gas stoves‟ and advertisements of the year 2019 to show that it was \nin the business of selling „gas stoves‟ under the trademark „PRESTIGE‟. \nEven the defendant no.1 does not dispute the position that the plaintiff has \nbeen selling „pressure cookers‟ under the trademark „PRESTIGE‟ much \nbefore the defendant no.1. The only defence put forth by the defendant no.1 \nis that „pressure cookers‟ and „gas stoves‟ are different products and \ntherefore, there would be no confusion in the market.  \n23. \nIn this regard, counsel for the plaintiff has correctly placed reliance on \nthe judgment of a Co-ordinate Bench of this Court in United Brothers \n(supra), which dealt with the passing off claim in respect of the same \nproducts that are subject matter of the present suit viz. „LPG stoves‟ and \n„pressure cookers‟ being sold under the same trademark, „United‟. While \ngranting injunction in favour of the plaintiff, the Co-ordinate Bench \nobserved that the goods of the plaintiff as well as the defendants are both \nused as kitchen appliances and therefore, there would be confusion for the \nconsumer using both the products. Further, in view of the sales turnover as \nwell as advertising expenses filed by the plaintiff, the plaintiff was able to \nestablish that its trademark had acquired distinctiveness and goodwill in the \nmarket. Accordingly, it was observed that confusion is likely to be caused in \nthe mind of public and hence,  the interim injunction granted in favour of the \nplaintiff was confirmed.  \n24. \nThe aforesaid judgment is clearly applicable to the facts and \ncircumstances of the present case as the two goods in question in the said \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified",
          "pdf_source": "20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0015",
      "start_index": 10,
      "end_index": 11,
      "summary": "According to the PDF document \"TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf\", the High Court of Delhi at New Delhi made a decision on February 20, 2023, in the case CS(COMM) 864/2022. The plaintiff, TTK Prestige Ltd, was represented by several advocates, including Mr. Hemant Singh and Ms. Mamta Rani Jha. \n\nThe court found that the defendant's use of the trademark \"PRESTIGE\" for gas stoves was likely to cause confusion in the market and associate their products with the plaintiff. The court determined that a prima facie case of infringement and passing off was made out on behalf of the plaintiff. \n\nAs a result, the court granted an injunction against the defendant, restraining them from manufacturing, selling, or advertising gas stoves or kitchenware under the \"PRESTIGE\" trademark or any similar mark. The defendants no.2 and 3 submitted that they were not sister concerns of the defendant no.1 and did not object to a decree of permanent injunction being passed against them.\n\nThe suit was decreed against the defendants no.2 and 3, and the plaintiff did not press for further reliefs against them. The suit will continue to proceed against the defendant no.1, with the next hearing scheduled for May 3, 2023. The court also disposed of two applications, I.A. 1139/2023 and I.A. 2624/2023, as they had become infructuous. (Source: TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf, pages 1-11)",
      "pdf_source": "20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf",
      "nodes": [
        {
          "title": "Page 10",
          "node_id": "0013",
          "start_index": 10,
          "end_index": 10,
          "summary": "According to page 10 of the PDF \"20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf\", the court finds a prima facie case of infringement and passing off in favor of the plaintiff, TTK Prestige Ltd. The defendant's use of the trademark \"PRESTIGE\" for gas stoves is likely to cause confusion in the market. The court rules that the balance of convenience is in favor of the plaintiff and that the defendant's actions would cause irreparable injury to the plaintiff's goodwill and reputation.\n\nThe court grants an injunction, restraining the defendant from manufacturing, selling, or dealing in goods under the \"PRESTIGE\" mark or any similar mark. The defendants no.2 and 3 claim they are not associated with the defendant no.1 and do not object to a decree of permanent injunction against them. The decision was made on February 20, 2023, in CS(COMM) 864/2022. (Source: 20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf)",
          "content": "2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 10 of 11 \n \ncase and case at hand are identical. The use of the trademark „PRESTIGE‟ \nby the defendant no.1 in respect of „gas stoves‟ is likely to cause confusion \nin the market as the public at large would associate the said products of the \ndefendant no.1 with the plaintiff.  \n25. \nIn view of the discussion above, a prima facie case of infringement as \nwell as passing off is made out on behalf of the plaintiff. Balance of \nconvenience is also in favour of plaintiff and against the defendant no.1. The \nplaintiff shall continue to suffer irreparable injury to its goodwill and \nreputation if the defendant no.1 is permitted to manufacture and sell goods \nbearing the impugned trademark. \n26. \nAccordingly, the present application is allowed and the defendant \nno.1, its directors, sister concerns, assigns in business, distributors, stockists, \ndealers and agents are injuncted from manufacturing, selling, offering for \nsale, exporting, advertising in any manner including on the internet and \nwebsites, directly or indirectly dealing in gas stoves or in any kitchenware, \ncookware and/or cognate/allied/related goods under the mark \n \nor any other mark which is identical or deceptively similar to the plaintiff‟s \n„PRESTIGE‟ trademarks. \nCS(COMM) 864/2022 \n27. \nCounsels for the defendants no.2 and 3 submit that they are not the \nsister concerns of the defendant no.1 and do not manufacture or sell any \nproduct using the impugned trademark. \n28. \nHence, without going into the merits, the defendants no.2 and 3 have \nno objection if a decree of permanent injunction is passed against them \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified",
          "pdf_source": "20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf",
          "nodes": []
        },
        {
          "title": "Page 11",
          "node_id": "0014",
          "start_index": 11,
          "end_index": 11,
          "summary": "According to page 11 of the PDF \"20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf\", the court has decreed the suit against defendants 2 and 3 in favor of the plaintiff, TTK Prestige Ltd. The court has restrained them from using the trademark \"PRESTIGE\" or any similar mark. The plaintiff's counsel did not press for additional reliefs against defendants 2 and 3. The suit will continue against defendant 1, with further proceedings scheduled for May 3, 2023. The court has also disposed of two applications, I.A. 1139/2023 and I.A. 2624/2023, as they have become infructuous. The decision was made by Judge Amit Bansal on February 20, 2023. (Source: 2023/DHC/001280, CS(COMM) 864/2022, page 11 of 11)",
          "content": "2023/DHC/001280 \n \n \nCS(COMM) 864/2022                                                                                             Page 11 of 11 \n \nrestraining them from using the trademark „PRESTIGE‟ or any other mark \nwhich is identical or deceptively similar to that of the plaintiff. \n29. \nAccordingly, the suit is decreed against the defendants no.2 and 3 in \nterms of prayer clauses (i) and (ii) of the plaint.  \n30. \nCounsel for the plaintiff does not press for reliefs sought in prayer \nclauses (iii), (iv), (v), (vi) and (vii) against the defendants no.2 and 3.  \n31. \nLet the decree sheet be drawn up. \n32. \nThe suit shall continue to proceed against the defendant no.1. \n33. \nList before the Joint Registrar on 3rd May, 2023 for further \nproceedings. \nI.A. 1139/2023 (O-I R-10 of CPC) and I.A. 2624/2023 (O-I R-10 of CPC) \n34. \n In view of the above, the present applications have become \ninfructuous and are disposed of as such. \n \n \nAMIT BANSAL, J \nFEBRUARY 20, 2023 \nsr \n \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.02.2023 11:11:22\nSignature Not Verified",
          "pdf_source": "20. TTK PRESTIGE LTD Vs. K K AND COMPANY DELHI PVT.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-15T18:39:20.971517",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}