{
  "doc_name": "21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors",
  "pdf_source": "21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf",
  "metadata": {
    "document_name": "21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors",
    "source_pdf": "21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf",
    "judges": [
      "AMIT BANSAL"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "176/2022",
      "176/2022",
      "176/2022",
      "176/2022",
      "176/2022",
      "176/2022",
      "176/2022",
      "176/2022",
      "176/2022",
      "176/2022",
      "176/2022",
      "176/2022",
      "176/2022",
      "4439/2022",
      "18256/2022"
    ],
    "dhc_numbers": [
      "2023/DHC/001117",
      "2023/DHC/001117",
      "2023/DHC/001117",
      "2023/DHC/001117",
      "2023/DHC/001117",
      "2023/DHC/001117",
      "2023/DHC/001117",
      "2023/DHC/001117",
      "2023/DHC/001117",
      "2023/DHC/001117",
      "2023/DHC/001117"
    ],
    "ia_numbers": [],
    "decision_date": "14 February, 2023",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      "WINZO GAMES PRIVATE LIMITED"
    ],
    "defendants": [
      "GOOGLE LLC & ORS"
    ],
    "appellants": [],
    "respondents": [],
    "plaintiff_advocates": [
      "Mr. Abhishek Malhotra",
      "Ms. Atmja Tripathy"
    ],
    "defendant_advocates": [
      "Mr. Arun Kathpalia",
      "Ms. Mamta Rani Jha",
      "Mr. Rohan Ahuja",
      "Ms. Shrutima Ehersa",
      "Mr. Vatsalya Vishal",
      "Ms. Amishi Sodani"
    ],
    "appellant_advocates": [],
    "respondent_advocates": [],
    "damages_claimed": null,
    "damages_awarded": null,
    "key_issues": [
      "Infringement of trademarks by displaying a warning against the use of the gaming platform 'WinZO Games' on the Android Operating System",
      "Display of warning by Google LLC goes beyond the mandate of the Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021",
      "Tarnishment of the plaintiff's trademarks 'WinZO' and 'WinZO Games' by displaying a warning that may harm the device",
      "Disparagement of the plaintiff's digital gaming services under the 'WinZO' and 'WinZO Games' marks by displaying a warning",
      "Inducement of breach of contract between the plaintiff and its users by displaying the warning",
      "Legality of displaying a warning without any legal justification or evidence of harm caused by the plaintiff's application",
      "Balance between the right to freedom of speech and the right to protection of trademarks and reputation",
      "Jurisdiction of the High Court of Delhi to grant an injunction against a global company like Google LLC",
      "Application of the Code of Civil Procedure, 1908, specifically Order XXXIX Rules 1 and 2, to the present case",
      "Interplay between intellectual property rights, contract law, and information technology laws in the context of online gaming platforms"
    ],
    "decision_summary": "**Case Summary: WinZO Games Private Limited vs. Google LLC & Ors.**\n\n**Background:**\nThe plaintiff, WinZO Games Private Limited, is a digital gaming and technology company that operates an online gaming platform/application under the marks \"WinZO\" and \"WinZO Games\". The defendants, Google LLC and others, are the operators of the Google Play Store and the Android Operating System. The plaintiff's application was initially available on the Google Play Store but was later removed after it was converted to a paid gaming platform. The plaintiff now operates its gaming platform through its website, which can be accessed by searching for the keywords \"WinZO Games\" on any search engine.\n\n**Legal Issues:**\nThe plaintiff filed a suit against the defendants seeking a decree of permanent injunction and other ancillary reliefs, alleging that the defendants were displaying a warning against the use of the plaintiff's gaming platform on the Android Operating System. The warning stated, \"This type of file may harm your device. Do you want to keep WinZO.apk anyway?\" The plaintiff claimed that this warning was devoid of any legal justification, went beyond the mandate of the Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021, and amounted to infringement/tarnishment of the plaintiff's trademarks.\n\n**Arguments:**\nThe plaintiff's counsel argued that:\n\n* The warning was unjustified and had no legal basis.\n* The warning went beyond the mandate of the IT Rules 2021.\n* The warning infringed/tarnished the plaintiff's trademarks.\n* The warning disparaged the plaintiff's digital gaming services.\n* The defendants were inducing breach of contract between the plaintiff and its users by displaying the warning.\n\nThe defendants' counsel argued that:\n\n* The warning was used on a non-discriminatory basis for all third-party APK format files/applications.\n* The warning was an industry practice, as several other browsers displayed similar warnings.\n* The warning was a security feature to protect consumers from malware.\n* The defendants were not using the plaintiff's trademarks \"in the course of trade\", which is a necessary condition for trademark infringement/tarnishment.\n* There was no disparagement, as there was no comparison between the plaintiff's application and any of the defendants' products or services.\n\n**Court Findings and Decision:**\nThe court, presided over by Hon'ble Mr. Justice Amit Bansal, heard the arguments and considered the submissions of both parties. However, the judgment does not provide the court's findings and decision, as the pages provided only contain the background, legal issues, and arguments. To determine the outcome of the case, it is necessary to review the complete judgment, which is not available in the provided text.\n\n**Conclusion:**\nIn conclusion, the case of WinZO Games Private Limited vs. Google LLC & Ors. involves a dispute over a warning displayed by the defendants against the use of the plaintiff's gaming platform on the Android Operating System. The plaintiff alleges that the warning is unjustified, infringes its trademarks, and disparages its digital gaming services. The defendants argue that the warning is a security feature, an industry practice, and does not constitute trademark infringement or disparagement. The court's decision, which is not available in the provided text, will determine the outcome of this case and provide guidance on the issues raised by the parties.",
    "legal_precedents": [],
    "full_text": "\n--- PAGE 1 ---\n2023/DHC/001117\nCS(COMM) 176/2022\nPage 1 of 11\n*\nIN THE HIGH COURT OF DELHI AT NEW DELHI\nDate of decision: 14th February, 2023.\n+\nCS(COMM) 176/2022\nWINZO GAMES PRIVATE LIMITED\n..... Plaintiff\nThrough:\nMr.Abhishek Malhotra and Ms.Atmja\nTripathy, Advocates.\nversus\nGOOGLE LLC & ORS.\n..... Defendants\nThrough:\nMr.Arun Kathpalia, Sr.Advocate with\nMs.\nMamta\nRani\nJha,\nMr.Rohan\nAhuja,\nMs.Shrutima\nEhersa,\nMr.Vatsalya Vishal and Ms.Amishi\nSodani, Advocates.\nCORAM:\nHON'BLE MR. JUSTICE AMIT BANSAL\nJUDGMENT\nAMIT BANSAL, J. (Oral)\nI.A. 4439/2022 (O-XXXIX R-1 & 2 of the CPC)\n1.\nThe present application has been filed on behalf of the plaintiff under\nOrder XXXIX Rules 1 and 2 of the Code of Civil Procedure, 1908 (CPC)\nseeking to restrain the defendants from displaying any warning against the\nuse of the gaming platform/application ‘WinZO Games’ of the plaintiff on\nthe Android Operating System/s.\n2.\nNotice was issued in the application on 22nd March, 2022 and reply\nthereto has subsequently been filed on behalf of the defendant no.1. Plaintiff\nhas also filed a rejoinder to the reply filed by the defendant no.1.\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified\n\n--- PAGE 2 ---\n2023/DHC/001117\nCS(COMM) 176/2022\nPage 2 of 11\n3.\nArguments in the application were heard on 8th February, 2022 and\nboth sides have filed a brief note of their submissions.\nFACTUAL MATRIX\n4.\nThe case set up by the plaintiff is as under:\n4.1\nThe plaintiff is a digital gaming and technology company that\noperates an online digital gaming platform/application under the marks\n‘WinZO’/ ‘WinZO Games’.\n4.2\nThe plaintiff has registrations/has applied for registrations in respect\nof the marks WinZO’ and ‘WinZO Games’ in Classes 38, 41 and 42, details\nof which are given in paragraph 5 of the plaint.\n4.3\nThe plaintiff enjoys considerable goodwill and reputation associated\nwith its trademarks ‘WinZO’/ ‘WinZO Games’.\n4.4\nThe aforesaid application under the marks ‘WinZO’/ ‘WinZO Games’\nof the plaintiff was introduced in February, 2017 and offers over seventy\ngames in five formats to its users, in over twelve regional languages.\n4.5\nThe application of the plaintiff was available on the Google Playstore\nuntil it was converted by the plaintiff to a paid gaming platform. Thereafter,\nthe plaintiff had to remove its application from the Google Playstore.\n4.6\nThe plaintiff owns and operates the website ‘www.winzogames.com/’\nthrough which consumers can download the gaming application of the\nplaintiff. The said website can be accessed by searching for the keywords\n‘WinZO Games’ on any search engine.\n4.7\nIn November, 2021, the plaintiff was informed of the defendants\ndisplaying a disclaimer/warning to users upon an attempted download of the\nplaintiff’s application. The text of the warning is as under:\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified\n\n--- PAGE 3 ---\n2023/DHC/001117\nCS(COMM) 176/2022\nPage 3 of 11\n“This type of file may harm your device. Do you want to keep\nWinZO.apk anyway?”\n5.\nAccordingly, the present suit was filed seeking a decree of permanent\ninjunction along with other ancillary reliefs.\nSUBMISSIONS ON BEHALF OF THE COUNSELS\n6.\nCounsel appearing on behalf of the plaintiff makes the following\nsubmissions:\ni.\nThe warning placed by the defendants in relation to the plaintiff’s\nservices under the ‘WinZO’/ ‘WinZO Games’ marks is devoid of any\nlegal justification.\nii.\nThe aforesaid warning goes beyond the mandate of the Information\nTechnology (Intermediary Guidelines and Digital Media Ethics Code)\nRules, 2021 (IT Rules 2021).\niii.\nThe\nwarning\nplaced\nby\nthe\ndefendants\namounts\nto\ninfringement/tarnishment of the plaintiff’s trademarks.\niv.\nThe warning of the defendants disparages the plaintiff’s digital\ngaming services under the ‘WinZO’/ ‘WinZO Games’ marks\nv.\nThe defendants are inducing breach of contract between the plaintiff\nand its users by displaying the aforesaid warning.\n7.\nSenior counsel appearing on behalf of the defendants makes the\nfollowing submissions:\ni.\nThe warning is being used on a non-discriminatory basis in respect of\nall\nthird-party\nAPK\nformat\nfiles/applications,\nwhich\ncan\nbe\ndownloaded from the internet.\nii.\nSeveral other browsers also display such warning while downloading\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified\n\n--- PAGE 4 ---\n2023/DHC/001117\nCS(COMM) 176/2022\nPage 4 of 11\nother third-party APK format files/applications and therefore, the\nsame constitutes an industry practice.\niii.\nThe warning is a security feature so as to protect consumers from any\npossible malware.\niv.\nThe defendants are not using the plaintiff’s trademarks ‘in the course\nof\ntrade’,\nwhich\nis\na\nsine\nqua\nnon\nfor\ntrademark\ninfringement/tarnishment action.\nv.\nThere is no disparagement as there is no comparison of the plaintiff’s\napplication with any of the defendants’ products or services.\nvi.\nThere cannot be any tort of inducement of breach of contract as there\nis no contract in place between the plaintiff and its users till the time\nthe application of the plaintiff is installed by a potential user.\n8.\nI have heard the rival submissions.\nANALYSIS AND FINDINGS\n9.\nThe submission of the defendants that the defendant no.1, Google\nLLC uses the aforesaid warnings in respect of all third-party applications\nthat are downloaded from the internet has not disputed by the plaintiff.\nTherefore, the admitted position is that the said warning is in respect of all\nsuch file/application downloads\nand not confined to the plaintiff’s\napplication, and is not discriminatory.\n10.\nThe warning given by the defendants is in the nature of a disclaimer\nand does not prohibit or block the download. The users can continue to\ndownload and install the APK files by clicking on the option of ‘Download\nanyway’. It may be noted that APK files/applications like that of the plaintiff\nare not part of the ‘Google Play’ ecosystem and therefore, the same do not\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified\n\n--- PAGE 5 ---\n2023/DHC/001117\nCS(COMM) 176/2022\nPage 5 of 11\nundergo the various security checks and measures. Therefore, the defendants\nare only cautioning the user before the user proceeds to download the\napplication.\n11.\nThe defendants have also provided details that such warnings are not\nunique to the Google Chrome browser of the defendant no.1. Several other\nbrowsers also display such warning when viewers/potential users download\nthird-party APK files/applications from their websites. On a prima facie\nview, this appears to be the industry practice.\n12.\nIn terms of the prevailing legal regime, the defendants are required to\nput in place such warnings so as to guard the user against potential threats.\nIn this regard, reference may be made to Rules 3(1)(i) and 3(1)(k) of the\nInformation Technology (Intermediary Guidelines and Digital Media Ethics\nCode) Rules, 2021 [hereinafter ‘2021 IT Rules’] as well as Rule 8 of The\nInformation Technology (Reasonable Security Practices And Procedures\nAnd Sensitive Personal Data or Information) Rules, 2011 [hereinafter ‘2011\nSecurity Rules’].\n13.\nRules 3(1)(i) and 3(1)(k) of the 2021 IT Rules are as under:\n“3.\n(1) Due diligence by an intermediary: An intermediary,\nincluding social media intermediary and significant social\nmedia intermediary, shall observe the following due diligence\nwhile discharging its duties, namely:—\n(i) the intermediary shall take all reasonable measures to\nsecure its computer resource and information contained\ntherein following the reasonable security practices and\nprocedures as prescribed in the Information Technology\n(Reasonable Security Practices and Procedures and Sensitive\nPersonal Information) Rules, 2011;\nxxx\nxxx\nxxx\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified\n\n--- PAGE 6 ---\n2023/DHC/001117\nCS(COMM) 176/2022\nPage 6 of 11\n(k) the intermediary shall not knowingly deploy or install or\nmodify technical configuration of computer resource or\nbecome party to any act that may change or has the potential\nto change the normal course of operation of the computer\nresource than what it is supposed to perform thereby\ncircumventing any law for the time being in force:”\n14.\nRule 8 of the 2011 Security Rules is set out below:\n“8.\nReasonable Security Practices and Procedures.— (1) A\nbody corporate or a person on its behalf shall be considered to\nhave\ncomplied\nwith\nreasonable\nsecurity\npractices\nand\nprocedures, if they have implemented such security practices\nand\nstandards\nand\nhave\na\ncomprehensive\ndocumented\ninformation security programme and information security\npolicies that contain managerial, technical, operational and\nphysical security control measures that are commensurate\nwith the information assets being protected with the nature of\nbusiness. In the event of an information security breach, the\nbody corporate or a person on its behalf shall be required to\ndemonstrate, as and when called upon to do so by the agency\nmandated under the law, that they have implemented security\ncontrol measures as per their documented information security\nprogramme and information security policies.\n(2)\nThe\ninternational\nStandard\nIS/ISO/IEC\n27001\non\n“Information Technology - Security Techniques - Information\nSecurity Management System – Requirements” is one such\nstandard referred to in sub-rule (1).\n(3) Any industry association or an entity formed by such an\nassociation, whose members are self-regulating by following\nother than IS/ISO/IEC codes of best practices for data\nprotection as per sub-rule(1), shall get its codes of best\npractices\nduly\napproved\nand\nnotified\nby\nthe\nCentral\nGovernment for effective implementation.\n(4) The body corporate or a person on its behalf who have\nimplemented either IS/ISO/IEC 27001 standard or the codes\nof best practices for data protection as approved and notified\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified\n\n--- PAGE 7 ---\n2023/DHC/001117\nCS(COMM) 176/2022\nPage 7 of 11\nunder sub-rule (3) shall be deemed to have complied with\nreasonable security practices and procedures provided that\nsuch standard or the codes of best practices have been\ncertified or audited on a regular basis by entities through\nindependent\nauditor,\nduly\napproved\nby\nthe\nCentral\nGovernment. The audit of reasonable security practices and\nprocedures shall be carried cut by an auditor at least once a\nyear or as and when the body corporate or a person on its\nbehalf undertake significant upgradation of its process and\ncomputer resource.”\n15.\nThe counsel for the plaintiff has vehemently contended that the\ntrademark of the plaintiff is infringed/tarnished by the defendants when\nnaming the APK file/application ‘WinZO’ in the warning displayed for its\nusers. At this stage, reference may be made to the relevant provisions of\nSection 29, which are set out below:\n“29. Infringement\nof\nregistered\ntrade\nmarks.—(1)\nA\nregistered trade mark is infringed by a person who, not being a\nregistered proprietor or a person using by way of permitted\nuse, uses in the course of trade, a mark which is identical with,\nor deceptively similar to, the trade mark in relation to goods or\nservices in respect of which the trade mark is registered and in\nsuch manner as to render the use of the mark likely to be\ntaken as being used as a trade mark.\n…\n(4) A registered trade mark is infringed by a person who, not\nbeing a registered proprietor or a person using by way of\npermitted use, uses in the course of trade, a mark which—\n(a) is identical with or similar to the registered trade mark;\nand\n(b) is used in relation to goods or services which are not\nsimilar to those for which the trade mark is registered; and\n(c) the registered trade mark has a reputation in India and\nthe use of the mark without due cause takes unfair\nadvantage of or is detrimental to, the distinctive character\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified\n\n--- PAGE 8 ---\n2023/DHC/001117\nCS(COMM) 176/2022\nPage 8 of 11\nor repute of the registered trade mark.\n…\n(6) For the purposes of this section, a person uses a registered\nmark, if, in particular, he—\n(a)affixes it to goods or the packaging thereof;\n(b)offers or exposes goods for sale, puts them on the\nmarket, or stocks them for those purposes under the\nregistered trade mark, or offers or supplies services under\nthe registered trade mark;\n(c) imports or exports goods under the mark; or\n(d) uses the registered trade mark on business papers or in\nadvertising.\n…\n(8) A registered trade mark is infringed by any advertising of\nthat trade mark if such advertising—\n(a) takes unfair advantage of and is contrary to honest\npractices in industrial or commercial matters; or\n(b) is detrimental to its distinctive character; or\n(c) is against the reputation of the trade mark.”\n16.\nThere is merit in the submission of the defendants that the use of the\nplaintiff’s trademark in the aforesaid warning shall not constitute as a ‘mark\nlikely to be taken as being used as a trade mark’ in terms of Section 29(1) of\nthe Trade Marks Act, 1999. Further, a perusal of Section 29(6) of the Trade\nMarks Act, 1999 would show that the use of the impugned marks by the\ndefendants in their warning is not covered in any of the sub-clauses (a), (b),\n(c) or (d) of Section 29(6). A perusal of the warning would show that the\nreference to the name of the APK file/application ‘WinZO’ is only for\nidentifying the file being downloaded for the purpose of the warning.\n17.\nIt is a settled position of law that to make out a case for infringement\nunder Section 29(4) of the Trade Marks Act, 1999, all three conditions under\nthe said provision have to be met. Since the defendant no.1, Google LLC is\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified\n\n--- PAGE 9 ---\n2023/DHC/001117\nCS(COMM) 176/2022\nPage 9 of 11\nnot providing any goods or services using the impugned trademarks, the\ncondition in sub-clause (b) of Section 29(4) is not satisfied. Hence, it does\nnot constitute ‘use of the trademark in the course of trade’ within the\nmeaning of Section 29(4). Further, since the defendant no.1 is not\nadvertising goods/services by using the plaintiff’s marks in any manner,\nthere is no case made out for infringement under Section 29(8) of the Trade\nMarks Act, 1999.\n18.\nTherefore, in my prima facie view, the reliance placed by the plaintiff\non Section 29 of the Trade Marks Act, 1999 to make out a case for\ninfringement/tarnishment of its ‘WinZO’/ ‘WinZO Games’ marks, is\nmisplaced.\n19.\nAs regards the ground of disparagement, indisputably, there is no\ncomparison between the products/services of the defendants with that of the\ngoods/services of the plaintiff. Nor is there any advertising for any goods or\nservices. Therefore, there is no competing interest of the products/services\nof the defendants involved and in my prima facie view, no case of\ndisparagement is made out.\n20.\nInsofar as the ground of inducement of breach of contract between a\nuser and the plaintiff is concerned, the act of a user opting to download an\napplication from the website of the plaintiff would not result in a contract.\nAt best, a contract can come into place once the application is installed.\nSince there is no contract in place at the time the warning is displayed, there\ncannot be any question of inducement to breach the same. In fact, in\nparagraph 21 of the plaint, the plaintiff has admitted that when a user clicks\non the download link on the plaintiff’s website, the user is only ‘willing to\nexecute’ a contract with the plaintiff. It is further stated that the warning\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified\n\n--- PAGE 10 ---\n2023/DHC/001117\nCS(COMM) 176/2022\nPage 10 of 11\ndeters ‘willing’ users from entering into a contract with the plaintiff.\nTherefore, there is no contract at the stage when the warning appears.\nParagraph 21 of the plaint is set out below:\n“21. It is further pertinent to note that when an internet user\nsearches ‘WinZO Games’ on any search engine or clicks on\nany paid/promoted links on any other social media platform or\nother internet-based platform and accesses the Plaintiff’s\nWebsite to download the Application, and ultimately clicks on\nthe download link on the Website, the said user is willing to\nexecute a contract with the Plaintiff by demonstrating a\nwillingness to download the Application. However, the Warning\ndisplayed on Defendants’ owned AOS device/platform deters\nsuch willing users from executing the contract with the Plaintiff.\nThe Plaintiff, therefore, states that the Defendants’ unwarranted\nand baseless Warning amounts to tort of inducement for breach\nof contract.”\n21.\nThe submission that the warning of the defendants has resulted in\ndecline of downloads from the plaintiff’s website is also speculative. At this\nstage, the plaintiff is yet to establish a case on the aforesaid ground. This\naspect can only be established in the trial.\n22.\nAccordingly, I do not find any merit in the application and the same is\ndismissed.\n23.\nNeedless to state, any observations made herein are only for the\npurposes of adjudication of the present application and would have no\nbearing on the final outcome of the suit.\nI.A. 18256/2022 (for condonation of delay of 93 days in filing\nreplication)\n24.\nCounsel for the plaintiff fairly admits that the replication has been\nfiled beyond maximum permissible period of 45 days as mandated in Rules\n5 and 7 of Chapter VII of the Delhi High Court (Original Side) Rules, 2018.\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified\n\n--- PAGE 11 ---\n2023/DHC/001117\nCS(COMM) 176/2022\nPage 11 of 11\nTherefore, in view of the judgment dated 19th October, 2020 of the Division\nBench in FAO(OS) 47/2020 titled Ram Sarup Lugani & Anr. v. Nirmal\nLugani & Ors., if the replication is filed beyond 45 days, the delay cannot\nbe condoned.\n25.\nIn view thereof, the present application is dismissed and the\nreplication filed on behalf of the plaintiff is directed to be taken off the\nrecord.\nCS(COMM) 176/2022\n26.\nList before the Joint Registrar for marking of exhibits on 22nd March,\n2023.\nAMIT BANSAL, J\nFEBRUARY 14, 2023\nsr\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified\n"
  },
  "total_pages": 11,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "According to the PDF document \"WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf\", a legal case was heard in the High Court of Delhi at New Delhi. The plaintiff, WinZO Games Private Limited, filed a case against Google LLC and others, seeking to restrain the defendants from displaying a warning against the use of the gaming platform 'WinZO Games' on the Android Operating System.\n\nThe case, CS(COMM) 176/2022, was decided on February 14, 2023, by Hon'ble Mr. Justice Amit Bansal. The plaintiff argued that they enjoy considerable goodwill and reputation associated with their trademarks 'WinZO' and 'WinZO Games', and that the warning displayed by the defendants was harming their business.\n\nThe facts of the case, as presented by the plaintiff, include that their gaming application was available on the Google Playstore until it was converted to a paid platform, after which it was removed. The plaintiff then made their application available on their website, which can be accessed by searching for 'WinZO Games' on any search engine.\n\nThe defendants displayed a warning to users attempting to download the plaintiff's application in November 2021. The plaintiff sought an injunction to restrain the defendants from displaying this warning. The court heard arguments from both sides on February 8, 2022, and a decision was made on February 14, 2023. The details of the decision are not provided in the given section of the PDF document. (Source: WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf)",
      "pdf_source": "21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "According to page 1 of the PDF \"21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf\", a court case (CS(COMM) 176/2022) was heard in the High Court of Delhi at New Delhi. The plaintiff, Winzo Games Private Limited, filed an application under Order XXXIX Rules 1 and 2 of the Code of Civil Procedure, 1908, to restrain the defendants, including Google LLC, from displaying warnings against the use of the 'WinZO Games' platform on Android. The application (I.A. 4439/2022) was filed with the court, and notice was issued on March 22, 2022. The defendant replied, and the plaintiff filed a rejoinder. The case was decided on February 14, 2023, by Hon'ble Mr. Justice Amit Bansal. (Source: 21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf, page 1)",
          "content": "2023/DHC/001117\nCS(COMM) 176/2022\nPage 1 of 11\n*\nIN THE HIGH COURT OF DELHI AT NEW DELHI\nDate of decision: 14th February, 2023.\n+\nCS(COMM) 176/2022\nWINZO GAMES PRIVATE LIMITED\n..... Plaintiff\nThrough:\nMr.Abhishek Malhotra and Ms.Atmja\nTripathy, Advocates.\nversus\nGOOGLE LLC & ORS.\n..... Defendants\nThrough:\nMr.Arun Kathpalia, Sr.Advocate with\nMs.\nMamta\nRani\nJha,\nMr.Rohan\nAhuja,\nMs.Shrutima\nEhersa,\nMr.Vatsalya Vishal and Ms.Amishi\nSodani, Advocates.\nCORAM:\nHON'BLE MR. JUSTICE AMIT BANSAL\nJUDGMENT\nAMIT BANSAL, J. (Oral)\nI.A. 4439/2022 (O-XXXIX R-1 & 2 of the CPC)\n1.\nThe present application has been filed on behalf of the plaintiff under\nOrder XXXIX Rules 1 and 2 of the Code of Civil Procedure, 1908 (CPC)\nseeking to restrain the defendants from displaying any warning against the\nuse of the gaming platform/application ‘WinZO Games’ of the plaintiff on\nthe Android Operating System/s.\n2.\nNotice was issued in the application on 22nd March, 2022 and reply\nthereto has subsequently been filed on behalf of the defendant no.1. Plaintiff\nhas also filed a rejoinder to the reply filed by the defendant no.1.\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified",
          "pdf_source": "21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "According to page 2 of the PDF \"21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf\", the case CS(COMM) 176/2022 was heard on February 8, 2022. The plaintiff, WinZO Games Private Limited, is a digital gaming company with registrations for the marks 'WinZO' and 'WinZO Games' in Classes 38, 41, and 42. The company enjoys considerable goodwill and reputation associated with its trademarks. The application was available on the Google Playstore until it was converted to a paid gaming platform and removed. The plaintiff owns the website 'www.winzogames.com/' where consumers can download the gaming application. In November 2021, the plaintiff was informed of a disclaimer/warning displayed by the defendants upon attempted download of the plaintiff's application. The case was decided on February 14, 2023, by Hon'ble Mr. Justice Amit Bansal. (Source: 21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf, page 2)",
          "content": "2023/DHC/001117\nCS(COMM) 176/2022\nPage 2 of 11\n3.\nArguments in the application were heard on 8th February, 2022 and\nboth sides have filed a brief note of their submissions.\nFACTUAL MATRIX\n4.\nThe case set up by the plaintiff is as under:\n4.1\nThe plaintiff is a digital gaming and technology company that\noperates an online digital gaming platform/application under the marks\n‘WinZO’/ ‘WinZO Games’.\n4.2\nThe plaintiff has registrations/has applied for registrations in respect\nof the marks WinZO’ and ‘WinZO Games’ in Classes 38, 41 and 42, details\nof which are given in paragraph 5 of the plaint.\n4.3\nThe plaintiff enjoys considerable goodwill and reputation associated\nwith its trademarks ‘WinZO’/ ‘WinZO Games’.\n4.4\nThe aforesaid application under the marks ‘WinZO’/ ‘WinZO Games’\nof the plaintiff was introduced in February, 2017 and offers over seventy\ngames in five formats to its users, in over twelve regional languages.\n4.5\nThe application of the plaintiff was available on the Google Playstore\nuntil it was converted by the plaintiff to a paid gaming platform. Thereafter,\nthe plaintiff had to remove its application from the Google Playstore.\n4.6\nThe plaintiff owns and operates the website ‘www.winzogames.com/’\nthrough which consumers can download the gaming application of the\nplaintiff. The said website can be accessed by searching for the keywords\n‘WinZO Games’ on any search engine.\n4.7\nIn November, 2021, the plaintiff was informed of the defendants\ndisplaying a disclaimer/warning to users upon an attempted download of the\nplaintiff’s application. The text of the warning is as under:\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified",
          "pdf_source": "21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0007",
      "start_index": 3,
      "end_index": 5,
      "summary": "According to the PDF document \"WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf\", a lawsuit was filed by WinZO Games Private Limited against Google LLC and others in the High Court of Delhi (CS(COMM) 176/2022). The case, decided on February 14, 2023, revolves around a warning displayed by Google when users attempt to download the WinZO app, stating \"This type of file may harm your device. Do you want to keep WinZO.apk anyway?\"\n\nThe plaintiff argued that this warning is unjustified, infringes on their trademarks, and disparages their digital gaming services. The defendants, on the other hand, claimed that the warning is a security feature, used non-discriminately for all third-party APK files, and is an industry practice.\n\nThe court heard the arguments and found that the warning is not discriminatory, as it applies to all third-party applications downloaded from the internet. The warning is also not prohibitive, as users can still download the app by clicking \"Download anyway\". The court noted that the warning is a disclaimer, cautioning users about potential security threats, as required by the Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021.\n\nThe case highlights the legal proceedings, arguments, and decisions made by the High Court of Delhi, as detailed in the PDF document. The parties involved, dates, and relevant laws were also considered in the court's decision. (Source: WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf)",
      "pdf_source": "21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "According to page 3 of the PDF \"21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf\", the plaintiff, WinZO Games Private Limited, has filed a suit seeking a decree of permanent injunction against the defendants, Google LLC & Ors. The plaintiff's counsel argues that the warning displayed by the defendants when downloading the WinZO.apk file is unjustified, goes beyond the mandate of the IT Rules 2021, and infringes on the plaintiff's trademarks. The defendants' counsel counters that the warning is used on a non-discriminatory basis for all third-party APK files and is similar to warnings displayed by other browsers. The case, CS(COMM) 176/2022, was heard by Hon'ble Mr. Justice Amit Bansal on February 14, 2023. (Source: 21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf)",
          "content": "2023/DHC/001117\nCS(COMM) 176/2022\nPage 3 of 11\n“This type of file may harm your device. Do you want to keep\nWinZO.apk anyway?”\n5.\nAccordingly, the present suit was filed seeking a decree of permanent\ninjunction along with other ancillary reliefs.\nSUBMISSIONS ON BEHALF OF THE COUNSELS\n6.\nCounsel appearing on behalf of the plaintiff makes the following\nsubmissions:\ni.\nThe warning placed by the defendants in relation to the plaintiff’s\nservices under the ‘WinZO’/ ‘WinZO Games’ marks is devoid of any\nlegal justification.\nii.\nThe aforesaid warning goes beyond the mandate of the Information\nTechnology (Intermediary Guidelines and Digital Media Ethics Code)\nRules, 2021 (IT Rules 2021).\niii.\nThe\nwarning\nplaced\nby\nthe\ndefendants\namounts\nto\ninfringement/tarnishment of the plaintiff’s trademarks.\niv.\nThe warning of the defendants disparages the plaintiff’s digital\ngaming services under the ‘WinZO’/ ‘WinZO Games’ marks\nv.\nThe defendants are inducing breach of contract between the plaintiff\nand its users by displaying the aforesaid warning.\n7.\nSenior counsel appearing on behalf of the defendants makes the\nfollowing submissions:\ni.\nThe warning is being used on a non-discriminatory basis in respect of\nall\nthird-party\nAPK\nformat\nfiles/applications,\nwhich\ncan\nbe\ndownloaded from the internet.\nii.\nSeveral other browsers also display such warning while downloading\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified",
          "pdf_source": "21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "According to page 4 of the PDF \"21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf\", the defendants argue that the warning given to users is a security feature to protect consumers from malware and is an industry practice. They also claim that they are not using the plaintiff's trademarks in the course of trade and that there is no disparagement or tort of inducement of breach of contract. The court notes that the warning is not discriminatory and is given for all third-party applications downloaded from the internet, not just the plaintiff's application. The warning is a disclaimer and does not block the download, allowing users to continue with the installation by clicking 'Download anyway'. (Source: 21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf, 2023/DHC/001117, CS(COMM) 176/2022)",
          "content": "2023/DHC/001117\nCS(COMM) 176/2022\nPage 4 of 11\nother third-party APK format files/applications and therefore, the\nsame constitutes an industry practice.\niii.\nThe warning is a security feature so as to protect consumers from any\npossible malware.\niv.\nThe defendants are not using the plaintiff’s trademarks ‘in the course\nof\ntrade’,\nwhich\nis\na\nsine\nqua\nnon\nfor\ntrademark\ninfringement/tarnishment action.\nv.\nThere is no disparagement as there is no comparison of the plaintiff’s\napplication with any of the defendants’ products or services.\nvi.\nThere cannot be any tort of inducement of breach of contract as there\nis no contract in place between the plaintiff and its users till the time\nthe application of the plaintiff is installed by a potential user.\n8.\nI have heard the rival submissions.\nANALYSIS AND FINDINGS\n9.\nThe submission of the defendants that the defendant no.1, Google\nLLC uses the aforesaid warnings in respect of all third-party applications\nthat are downloaded from the internet has not disputed by the plaintiff.\nTherefore, the admitted position is that the said warning is in respect of all\nsuch file/application downloads\nand not confined to the plaintiff’s\napplication, and is not discriminatory.\n10.\nThe warning given by the defendants is in the nature of a disclaimer\nand does not prohibit or block the download. The users can continue to\ndownload and install the APK files by clicking on the option of ‘Download\nanyway’. It may be noted that APK files/applications like that of the plaintiff\nare not part of the ‘Google Play’ ecosystem and therefore, the same do not\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified",
          "pdf_source": "21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf",
          "nodes": []
        },
        {
          "title": "Page 5",
          "node_id": "0006",
          "start_index": 5,
          "end_index": 5,
          "summary": "According to page 5 of the PDF \"21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf\", the defendants (Google LLC & Ors.) have provided warnings to users before downloading third-party APK files/applications, which is an industry practice. The court references the Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021, and the Information Technology (Reasonable Security Practices And Procedures And Sensitive Personal Data or Information) Rules, 2011. Specifically, Rules 3(1)(i) and 3(1)(k) of the 2021 IT Rules require intermediaries to take reasonable measures to secure their computer resources and information. The case, CS(COMM) 176/2022, was decided on February 14, 2023, by Hon'ble Mr. Justice Amit Bansal. The defendants are represented by Mr. Arun Kathpalia, Sr. Advocate, among others. (Source: 21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf, page 5)",
          "content": "2023/DHC/001117\nCS(COMM) 176/2022\nPage 5 of 11\nundergo the various security checks and measures. Therefore, the defendants\nare only cautioning the user before the user proceeds to download the\napplication.\n11.\nThe defendants have also provided details that such warnings are not\nunique to the Google Chrome browser of the defendant no.1. Several other\nbrowsers also display such warning when viewers/potential users download\nthird-party APK files/applications from their websites. On a prima facie\nview, this appears to be the industry practice.\n12.\nIn terms of the prevailing legal regime, the defendants are required to\nput in place such warnings so as to guard the user against potential threats.\nIn this regard, reference may be made to Rules 3(1)(i) and 3(1)(k) of the\nInformation Technology (Intermediary Guidelines and Digital Media Ethics\nCode) Rules, 2021 [hereinafter ‘2021 IT Rules’] as well as Rule 8 of The\nInformation Technology (Reasonable Security Practices And Procedures\nAnd Sensitive Personal Data or Information) Rules, 2011 [hereinafter ‘2011\nSecurity Rules’].\n13.\nRules 3(1)(i) and 3(1)(k) of the 2021 IT Rules are as under:\n“3.\n(1) Due diligence by an intermediary: An intermediary,\nincluding social media intermediary and significant social\nmedia intermediary, shall observe the following due diligence\nwhile discharging its duties, namely:—\n(i) the intermediary shall take all reasonable measures to\nsecure its computer resource and information contained\ntherein following the reasonable security practices and\nprocedures as prescribed in the Information Technology\n(Reasonable Security Practices and Procedures and Sensitive\nPersonal Information) Rules, 2011;\nxxx\nxxx\nxxx\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified",
          "pdf_source": "21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0012",
      "start_index": 6,
      "end_index": 9,
      "summary": "According to the PDF document \"WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf\", a legal proceeding was held in the High Court of Delhi at New Delhi, with the case number CS(COMM) 176/2022. The plaintiff, Winzo Games Private Limited, was represented by Mr. Abhishek Malhotra and Ms. Atmja Tripathy, while the defendants, Google LLC & Ors, were represented by Mr. Arun Kathpalia and other advocates.\n\nThe court considered the legal arguments presented by both parties, focusing on the infringement of the plaintiff's trademark by the defendants. The plaintiff contended that the defendants' use of the name \"WinZO\" in a warning displayed to users infringed upon their registered trademark. The court referred to Section 29 of the relevant act, which deals with the infringement of registered trademarks.\n\nThe court also examined the provisions of the 2011 Security Rules, specifically Rule 8, which outlines reasonable security practices and procedures for body corporates and persons. The rule requires the implementation of security control measures, such as the international standard IS/ISO/IEC 27001, to protect information assets.\n\nThe case was decided on February 14, 2023, by Hon'ble Mr. Justice Amit Bansal. The judgment is digitally signed and available in the PDF document. The details of the decision and any subsequent actions are not provided in the given section. (Source: WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf, Pages 1-11)",
      "pdf_source": "21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf",
      "nodes": [
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "According to page 6 of the PDF \"21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf\", the court references Rule 8 of the 2011 Security Rules, which outlines reasonable security practices and procedures for body corporates or persons. The rule requires implementation of security control measures, including managerial, technical, operational, and physical security control measures. The international standard IS/ISO/IEC 27001 is mentioned as a reference point. The document is related to a court case (CS(COMM) 176/2022) in the High Court of Delhi, with the judgment given on February 14, 2023, by Hon'ble Mr. Justice Amit Bansal. The case involves Winzo Games Private Limited as the plaintiff and Google LLC & Ors. as the defendants. (Source: 2023/DHC/001117)",
          "content": "2023/DHC/001117\nCS(COMM) 176/2022\nPage 6 of 11\n(k) the intermediary shall not knowingly deploy or install or\nmodify technical configuration of computer resource or\nbecome party to any act that may change or has the potential\nto change the normal course of operation of the computer\nresource than what it is supposed to perform thereby\ncircumventing any law for the time being in force:”\n14.\nRule 8 of the 2011 Security Rules is set out below:\n“8.\nReasonable Security Practices and Procedures.— (1) A\nbody corporate or a person on its behalf shall be considered to\nhave\ncomplied\nwith\nreasonable\nsecurity\npractices\nand\nprocedures, if they have implemented such security practices\nand\nstandards\nand\nhave\na\ncomprehensive\ndocumented\ninformation security programme and information security\npolicies that contain managerial, technical, operational and\nphysical security control measures that are commensurate\nwith the information assets being protected with the nature of\nbusiness. In the event of an information security breach, the\nbody corporate or a person on its behalf shall be required to\ndemonstrate, as and when called upon to do so by the agency\nmandated under the law, that they have implemented security\ncontrol measures as per their documented information security\nprogramme and information security policies.\n(2)\nThe\ninternational\nStandard\nIS/ISO/IEC\n27001\non\n“Information Technology - Security Techniques - Information\nSecurity Management System – Requirements” is one such\nstandard referred to in sub-rule (1).\n(3) Any industry association or an entity formed by such an\nassociation, whose members are self-regulating by following\nother than IS/ISO/IEC codes of best practices for data\nprotection as per sub-rule(1), shall get its codes of best\npractices\nduly\napproved\nand\nnotified\nby\nthe\nCentral\nGovernment for effective implementation.\n(4) The body corporate or a person on its behalf who have\nimplemented either IS/ISO/IEC 27001 standard or the codes\nof best practices for data protection as approved and notified\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified",
          "pdf_source": "21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf",
          "nodes": []
        },
        {
          "title": "Page 7",
          "node_id": "0009",
          "start_index": 7,
          "end_index": 7,
          "summary": "According to page 7 of the PDF \"21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf\", the counsel for the plaintiff, WinZO Games Private Limited, argues that the defendants have infringed/tarnished their trademark by naming the APK file/application 'WinZO' in a warning displayed to users. The plaintiff references Section 29 of the trademark law, which states that a registered trademark is infringed if a person uses a mark identical or deceptively similar to the trademark in the course of trade. The case, CS(COMM) 176/2022, was heard by Hon'ble Mr. Justice Amit Bansal on February 14, 2023. The plaintiff's advocates, Mr. Abhishek Malhotra and Ms. Atmja Tripathy, contend that the defendants' actions are likely to take unfair advantage of or be detrimental to the distinctive character of the plaintiff's trademark. (Source: 21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf, page 7)",
          "content": "2023/DHC/001117\nCS(COMM) 176/2022\nPage 7 of 11\nunder sub-rule (3) shall be deemed to have complied with\nreasonable security practices and procedures provided that\nsuch standard or the codes of best practices have been\ncertified or audited on a regular basis by entities through\nindependent\nauditor,\nduly\napproved\nby\nthe\nCentral\nGovernment. The audit of reasonable security practices and\nprocedures shall be carried cut by an auditor at least once a\nyear or as and when the body corporate or a person on its\nbehalf undertake significant upgradation of its process and\ncomputer resource.”\n15.\nThe counsel for the plaintiff has vehemently contended that the\ntrademark of the plaintiff is infringed/tarnished by the defendants when\nnaming the APK file/application ‘WinZO’ in the warning displayed for its\nusers. At this stage, reference may be made to the relevant provisions of\nSection 29, which are set out below:\n“29. Infringement\nof\nregistered\ntrade\nmarks.—(1)\nA\nregistered trade mark is infringed by a person who, not being a\nregistered proprietor or a person using by way of permitted\nuse, uses in the course of trade, a mark which is identical with,\nor deceptively similar to, the trade mark in relation to goods or\nservices in respect of which the trade mark is registered and in\nsuch manner as to render the use of the mark likely to be\ntaken as being used as a trade mark.\n…\n(4) A registered trade mark is infringed by a person who, not\nbeing a registered proprietor or a person using by way of\npermitted use, uses in the course of trade, a mark which—\n(a) is identical with or similar to the registered trade mark;\nand\n(b) is used in relation to goods or services which are not\nsimilar to those for which the trade mark is registered; and\n(c) the registered trade mark has a reputation in India and\nthe use of the mark without due cause takes unfair\nadvantage of or is detrimental to, the distinctive character\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified",
          "pdf_source": "21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf",
          "nodes": []
        },
        {
          "title": "Page 8",
          "node_id": "0010",
          "start_index": 8,
          "end_index": 8,
          "summary": "According to page 8 of the PDF \"21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf\", the High Court of Delhi discusses trademark infringement under Section 29 of the Trade Marks Act, 1999. The defendants argue that using the plaintiff's trademark in a warning does not constitute as a 'mark likely to be taken as being used as a trade mark'. The court agrees, stating that the use of the impugned marks by the defendants is not covered under Section 29(6) and is only used to identify the file being downloaded for the purpose of the warning. The case, CS(COMM) 176/2022, was decided on February 14, 2023, by Hon'ble Mr. Justice Amit Bansal. The court found that the defendant, Google LLC, did not meet the conditions for infringement under Section 29(4) of the Trade Marks Act, 1999. (Source: 21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf)",
          "content": "2023/DHC/001117\nCS(COMM) 176/2022\nPage 8 of 11\nor repute of the registered trade mark.\n…\n(6) For the purposes of this section, a person uses a registered\nmark, if, in particular, he—\n(a)affixes it to goods or the packaging thereof;\n(b)offers or exposes goods for sale, puts them on the\nmarket, or stocks them for those purposes under the\nregistered trade mark, or offers or supplies services under\nthe registered trade mark;\n(c) imports or exports goods under the mark; or\n(d) uses the registered trade mark on business papers or in\nadvertising.\n…\n(8) A registered trade mark is infringed by any advertising of\nthat trade mark if such advertising—\n(a) takes unfair advantage of and is contrary to honest\npractices in industrial or commercial matters; or\n(b) is detrimental to its distinctive character; or\n(c) is against the reputation of the trade mark.”\n16.\nThere is merit in the submission of the defendants that the use of the\nplaintiff’s trademark in the aforesaid warning shall not constitute as a ‘mark\nlikely to be taken as being used as a trade mark’ in terms of Section 29(1) of\nthe Trade Marks Act, 1999. Further, a perusal of Section 29(6) of the Trade\nMarks Act, 1999 would show that the use of the impugned marks by the\ndefendants in their warning is not covered in any of the sub-clauses (a), (b),\n(c) or (d) of Section 29(6). A perusal of the warning would show that the\nreference to the name of the APK file/application ‘WinZO’ is only for\nidentifying the file being downloaded for the purpose of the warning.\n17.\nIt is a settled position of law that to make out a case for infringement\nunder Section 29(4) of the Trade Marks Act, 1999, all three conditions under\nthe said provision have to be met. Since the defendant no.1, Google LLC is\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified",
          "pdf_source": "21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf",
          "nodes": []
        },
        {
          "title": "Page 9",
          "node_id": "0011",
          "start_index": 9,
          "end_index": 9,
          "summary": "According to page 9 of the PDF \"21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf\", the court rules that the defendant's use of the trademark does not constitute 'use of the trademark in the course of trade' under Section 29(4) of the Trade Marks Act, 1999, as they are not providing any goods or services. The court also states that there is no case of infringement under Section 29(8) or disparagement, as there is no comparison between the products/services of the defendants and the plaintiff. Additionally, the court rules that there is no inducement of breach of contract, as no contract is in place when the warning is displayed. The judgment was made by Hon'ble Mr. Justice Amit Bansal on February 14, 2023, in the case CS(COMM) 176/2022. (Source: 2023/DHC/001117, PDF page 9)",
          "content": "2023/DHC/001117\nCS(COMM) 176/2022\nPage 9 of 11\nnot providing any goods or services using the impugned trademarks, the\ncondition in sub-clause (b) of Section 29(4) is not satisfied. Hence, it does\nnot constitute ‘use of the trademark in the course of trade’ within the\nmeaning of Section 29(4). Further, since the defendant no.1 is not\nadvertising goods/services by using the plaintiff’s marks in any manner,\nthere is no case made out for infringement under Section 29(8) of the Trade\nMarks Act, 1999.\n18.\nTherefore, in my prima facie view, the reliance placed by the plaintiff\non Section 29 of the Trade Marks Act, 1999 to make out a case for\ninfringement/tarnishment of its ‘WinZO’/ ‘WinZO Games’ marks, is\nmisplaced.\n19.\nAs regards the ground of disparagement, indisputably, there is no\ncomparison between the products/services of the defendants with that of the\ngoods/services of the plaintiff. Nor is there any advertising for any goods or\nservices. Therefore, there is no competing interest of the products/services\nof the defendants involved and in my prima facie view, no case of\ndisparagement is made out.\n20.\nInsofar as the ground of inducement of breach of contract between a\nuser and the plaintiff is concerned, the act of a user opting to download an\napplication from the website of the plaintiff would not result in a contract.\nAt best, a contract can come into place once the application is installed.\nSince there is no contract in place at the time the warning is displayed, there\ncannot be any question of inducement to breach the same. In fact, in\nparagraph 21 of the plaint, the plaintiff has admitted that when a user clicks\non the download link on the plaintiff’s website, the user is only ‘willing to\nexecute’ a contract with the plaintiff. It is further stated that the warning\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified",
          "pdf_source": "21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0015",
      "start_index": 10,
      "end_index": 11,
      "summary": "According to the PDF document \"WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf\", a court decision was made on February 14, 2023, in the High Court of Delhi at New Delhi (CS(COMM) 176/2022). The plaintiff, WinZO Games Private Limited, alleged that the defendants, Google LLC and others, displayed a warning on their Android Operating System (AOS) device/platform that deterred willing users from downloading the plaintiff's application, thereby inducing a breach of contract.\n\nThe court, presided over by Hon'ble Mr. Justice Amit Bansal, dismissed the plaintiff's application, stating that the submission regarding the decline of downloads due to the warning was speculative and had not been established. The court also noted that the plaintiff had failed to establish a case on this ground, which could only be determined during the trial.\n\nAdditionally, the court dismissed the plaintiff's application for condonation of delay in filing a replication (I.A. 18256/2022), as it was filed beyond the maximum permissible period of 45 days. The replication was directed to be taken off the record.\n\nThe court listed the matter for marking of exhibits on March 22, 2023, before the Joint Registrar. The decision was digitally signed by Justice Amit Bansal on February 16, 2023. The PDF document (2023/DHC/001117) provides the details of the court proceedings, arguments, and decisions made in this case.",
      "pdf_source": "21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf",
      "nodes": [
        {
          "title": "Page 10",
          "node_id": "0013",
          "start_index": 10,
          "end_index": 10,
          "summary": "According to page 10 of the PDF \"21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf\", the court rejects the plaintiff's argument that the defendant's warning deters users from downloading the plaintiff's application, thereby breaching a contract. The court states that there is no contract at the stage when the warning appears and the plaintiff's submission is speculative. The application is dismissed, and the court notes that its observations will not affect the final outcome of the suit. The plaintiff's counsel also admits to filing a replication 93 days late, exceeding the 45-day limit. Key figures mentioned include Hon'ble Mr. Justice Amit Bansal, and advocates Mr. Abhishek Malhotra, Mr. Arun Kathpalia, and Ms. Mamta Rani Jha. The decision was made on February 14, 2023. (Source: 2023/DHC/001117, CS(COMM) 176/2022)",
          "content": "2023/DHC/001117\nCS(COMM) 176/2022\nPage 10 of 11\ndeters ‘willing’ users from entering into a contract with the plaintiff.\nTherefore, there is no contract at the stage when the warning appears.\nParagraph 21 of the plaint is set out below:\n“21. It is further pertinent to note that when an internet user\nsearches ‘WinZO Games’ on any search engine or clicks on\nany paid/promoted links on any other social media platform or\nother internet-based platform and accesses the Plaintiff’s\nWebsite to download the Application, and ultimately clicks on\nthe download link on the Website, the said user is willing to\nexecute a contract with the Plaintiff by demonstrating a\nwillingness to download the Application. However, the Warning\ndisplayed on Defendants’ owned AOS device/platform deters\nsuch willing users from executing the contract with the Plaintiff.\nThe Plaintiff, therefore, states that the Defendants’ unwarranted\nand baseless Warning amounts to tort of inducement for breach\nof contract.”\n21.\nThe submission that the warning of the defendants has resulted in\ndecline of downloads from the plaintiff’s website is also speculative. At this\nstage, the plaintiff is yet to establish a case on the aforesaid ground. This\naspect can only be established in the trial.\n22.\nAccordingly, I do not find any merit in the application and the same is\ndismissed.\n23.\nNeedless to state, any observations made herein are only for the\npurposes of adjudication of the present application and would have no\nbearing on the final outcome of the suit.\nI.A. 18256/2022 (for condonation of delay of 93 days in filing\nreplication)\n24.\nCounsel for the plaintiff fairly admits that the replication has been\nfiled beyond maximum permissible period of 45 days as mandated in Rules\n5 and 7 of Chapter VII of the Delhi High Court (Original Side) Rules, 2018.\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified",
          "pdf_source": "21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf",
          "nodes": []
        },
        {
          "title": "Page 11",
          "node_id": "0014",
          "start_index": 11,
          "end_index": 11,
          "summary": "According to page 11 of the PDF \"21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf\", the High Court of Delhi at New Delhi made a decision on February 14, 2023, in the case CS(COMM) 176/2022. The court, presided over by Hon'ble Mr. Justice Amit Bansal, dismissed the present application and directed the replication filed on behalf of the plaintiff, Winzo Games Private Limited, to be taken off the record. This decision was based on a previous judgment dated October 19, 2020, which stated that delay in filing a replication beyond 45 days cannot be condoned. The case is now listed before the Joint Registrar for marking of exhibits on March 22, 2023. (Source: 21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf, page 11)",
          "content": "2023/DHC/001117\nCS(COMM) 176/2022\nPage 11 of 11\nTherefore, in view of the judgment dated 19th October, 2020 of the Division\nBench in FAO(OS) 47/2020 titled Ram Sarup Lugani & Anr. v. Nirmal\nLugani & Ors., if the replication is filed beyond 45 days, the delay cannot\nbe condoned.\n25.\nIn view thereof, the present application is dismissed and the\nreplication filed on behalf of the plaintiff is directed to be taken off the\nrecord.\nCS(COMM) 176/2022\n26.\nList before the Joint Registrar for marking of exhibits on 22nd March,\n2023.\nAMIT BANSAL, J\nFEBRUARY 14, 2023\nsr\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:16.02.2023 16:57:47\nSignature Not Verified",
          "pdf_source": "21. WINZO GAMES PRIVATE LIMITED vs. Google LLC & Ors.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-15T18:32:43.690524",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}