{
  "doc_name": "22. Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD",
  "pdf_source": "22. Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD.pdf",
  "metadata": {
    "document_name": "22. Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD",
    "source_pdf": "22. Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD.pdf",
    "judges": [
      "AMIT BANSAL"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "1120/2016",
      "1120/2016",
      "1120/2016",
      "1120/2016",
      "1120/2016",
      "1120/2016",
      "1120/2016",
      "1120/2016",
      "1120/2016",
      "1120/2016",
      "1120/2016",
      "1120/2016",
      "1120/2016",
      "1120/2016",
      "1120/2016",
      "1120/2016",
      "3153/2018",
      "2479/2020",
      "2480/2020",
      "2479/2020",
      "2480/2020",
      "2480/2020",
      "2480/2020",
      "2479/2020",
      "2479/2020",
      "2480/2020"
    ],
    "dhc_numbers": [
      "2023/DHC/000965",
      "2023/DHC/000965",
      "2023/DHC/000965",
      "2023/DHC/000965",
      "2023/DHC/000965",
      "2023/DHC/000965",
      "2023/DHC/000965",
      "2023/DHC/000965",
      "2023/DHC/000965",
      "2023/DHC/000965",
      "2023/DHC/000965",
      "2023/DHC/000965",
      "2023/DHC/000965",
      "2023/DHC/000965"
    ],
    "ia_numbers": [],
    "decision_date": "02 February, 2023",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      "LUXEMBOURG BRANDS S.A R.L & ANR"
    ],
    "defendants": [
      "G.M PENS INTERNATIONAL PVT LTD"
    ],
    "appellants": [],
    "respondents": [],
    "plaintiff_advocates": [
      "Mr.Sanjeev Sindhwani, Sr.Advocate",
      "Mr.Prashant Gupta, Advocate"
    ],
    "defendant_advocates": [
      "Mr.Sandeep Sethi, Sr.Advocate",
      "Mr.Arun",
      "Mr.Tahir AJ",
      "Ms.Shreya Sethi",
      "Mr.Vikram Singh Dalal",
      "Ms.Tanvi Tewari"
    ],
    "appellant_advocates": [],
    "respondent_advocates": [],
    "damages_claimed": "7",
    "damages_awarded": null,
    "key_issues": [
      "Termination of a license agreement and its implications on the use of trademarks",
      "Use of deceptively similar trademarks and potential infringement",
      "Entitlement to a decree of rendition of accounts against the defendant",
      "Appointment of an independent auditor to audit the defendant's accounts",
      "Compliance with court orders and consequences of disobedience",
      "Registration of similar trademarks and potential impact on existing trademark rights",
      "Phonetic similarity between trademarks and its relevance in trademark infringement cases",
      "Adoption of a trademark after termination of a license agreement and potential liability",
      "Submission of an unconditional apology for trademark infringement and its effect on the case",
      "Potential consequences for a defendant who continues to use a trademark after termination of a license agreement"
    ],
    "decision_summary": "**Case Summary: Luxembourg Brands S.A R.L & Anr. vs. G.M Pens International Pvt Ltd.**\n\n**Background:**\n\nThe plaintiffs, Luxembourg Brands S.A R.L & Anr., are the owners of various registered trademarks, including \"TRIMAX,\" used for stationery products such as writing instruments, correction pens, and glue sticks. The defendant, G.M Pens International Pvt Ltd., was a licensee of the plaintiff companies since 1986, manufacturing pens and other stationery instruments using the plaintiffs' trademarks. The license agreement was terminated by the plaintiffs on September 1, 2015, effective March 1, 2016. Despite this, the defendant continued to use some of the plaintiffs' trademarks, leading to the filing of the present suit on August 17, 2016.\n\n**Legal Issues:**\n\nThe suit raised several issues, including:\n\n1. Whether the plaintiffs are entitled to a decree of rendition of accounts against the defendants.\n2. Whether an independent auditor is required to be appointed to audit the defendant's accounts.\n3. Whether the defendant has disobeyed any orders passed by the court.\n\n**Arguments:**\n\nThe plaintiffs argued that the defendant continued to use their trademarks, including \"TERAMAX,\" which is deceptively similar to \"TRIMAX,\" despite the termination of the license agreement. The defendant initially tendered an unconditional apology for using the \"TERAMAX\" trademark but later contested the application filed by the plaintiffs, claiming that \"TERAMAX\" was not similar to \"TRIMAX.\"\n\n**Court Findings:**\n\nThe court found that:\n\n1. The trademarks \"T-MAX\" and \"TERAMAX\" are phonetically similar to \"TRIMAX\" and therefore deceptively similar.\n2. The defendant's application for registration of the \"TERAMAX\" trademark in October 2016 did not establish a bona fide adoption of the trademark.\n3. The defendant's continued use of the \"TERAMAX\" trademark after tendering an unconditional apology was a violation of the court's orders.\n\n**Decision:**\n\nThe court decided the issue in favor of the plaintiffs, holding that the defendant had violated the court's orders by selling writing instruments under the \"TERAMAX\" trademark. The court also noted that the defendant's actions were in breach of the license agreement and the court's previous orders, and that the defendant had failed to provide a satisfactory explanation for its continued use of the \"TERAMAX\" trademark.\n\n**Orders:**\n\nThe court disposed of two applications filed by the plaintiffs: I.A. No. 2479/2020 filed under Section 151 of the Civil Procedure Code (CPC) for summoning of records, and I.A. No. 2480/2020 filed under Order XI Rule 5 of the CPC for production of documents. The court's decision on these applications is not explicitly stated in the provided text, but it is likely that the court granted the plaintiffs' requests in light of its findings on the defendant's breach of the license agreement and court orders.\n\n**Conclusion:**\n\nThe court's decision in this case emphasizes the importance of respecting trademark rights and complying with court orders. The defendant's continued use of the \"TERAMAX\" trademark despite the termination of the license agreement and the court's orders was deemed a breach of the agreement and the court's orders, resulting in a decision in favor of the plaintiffs.",
    "legal_precedents": [
      "Narpat Singh Rajasthan Financial Corporation",
      "In Ellora Industries Banarsi Das Goela",
      "Akhileshwar Prasad Narayan Singh Shashi Shekhareshwar \nPrasad Narayan Singh",
      "(1987) \n2 SCC 179",
      "Uttar Pradesh Brahm Datt Sharma"
    ],
    "full_text": "\n--- PAGE 1 ---\n2023/DHC/000965 \n \nCS(COMM) 1120/2016                                                                                                 Page 1 of 14 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n% \n \n \n Judgment Reserved on :  02nd February, 2023 \nJudgment Delivered on : 10th February, 2023 \n  \n+  \nCS(COMM) 1120/2016 & CRL.M.A. 10583/2017 (u/s 340 CrPC), \nI.A. 3153/2018 (O-XXXIX R-2A of CPC) \n \n \nLUXEMBOURG BRANDS S.A R.L & ANR \n..... Plaintiffs \nThrough: \nMr.Sanjeev Sindhwani, Sr.Advocate \nwith Mr.Prashant Gupta, Advocate. \n \n \n \n \nversus \n \n \nG.M PENS INTERNATIONAL PVT LTD  \n..... Defendant \nThrough: \nMr.Sandeep Sethi, Sr.Advocate with \nMr.Arun, Mr.Tahir AJ, Ms.Shreya \nSethi, Mr.Vikram Singh Dalal and \nMs.Tanvi Tewari, Advocates. \n \n \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nJUDGMENT \nAMIT BANSAL, J. \n \nI.A. 2479/2020 (u/s 151 CPC for summoning of the records) and I.A. \n2480/2020 (O-XI R-5 of CPC) \n1. \nBy way of the present judgment, I shall dispose of I.A. No.2479/2020 \nfiled under Section 151 of the Civil Procedure Code, 1908 (CPC) and I.A. \nNo.2480/2020 filed under Order XI Rule 5 of the CPC for production of \ndocuments. \nBRIEF FACTS \n2. \nThe brief facts insofar as are relevant for deciding the present \napplications are set out below. \n3. \nThe plaintiffs are the owners of various registered marks including \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 14:36:32\nSignature Not Verified\n\n--- PAGE 2 ---\n2023/DHC/000965 \n \nCS(COMM) 1120/2016                                                                                                 Page 2 of 14 \n \n„TRIMAX‟ in relation to stationery products such as writing instruments, \ncorrection pens, glue sticks, etc. \n4. \nSince the year 1986, the defendant was a licensee of the plaintiff \ncompanies and was manufacturing pens and other stationery instruments \nusing the trademarks of the plaintiffs, pursuant to a license agreement.  Last \nsuch license was granted to the defendant vide license agreement dated 9th \nApril, 2010. \n5. \nThe aforesaid license was terminated by the plaintiffs vide letter dated \n1st September, 2015 w.e.f. 1st March, 2016. \n6. \nIt was the case of the plaintiffs that the defendant continued to use \nsome of the trademarks of the plaintiffs even after termination of the license \nagreement and therefore, the present suit was filed on 17th August, 2016. \n7. \nIt was noted in the order dated 17th November, 2016 passed in the \npresent suit that the defendant shall not use the trade mark „T-MAX‟. \n8. \nOn 3rd May, 2017, issues in the suit were framed. The issues relevant \nfor the purposes of the present applications are set out below: \n“6. \nWhether the plaintiffs are entitled to a decree of rendition of \naccounts against the defendants, as prayed for? OPP \n7. \nWhether an independent auditor is required to be appointed to \naudit the accounts the defendant? OPP \n8.  \nWhether the defendant has disobeyed any of the orders passed \nby this court? OPP” \n \n9. \nAn affidavit of unconditional apology dated 19th September, 2017 was \ntendered on behalf of the defendant for having used the trade mark \n„TERAMAX‟. \n10. \nA judgment dated 26th November, 2018 was passed in the present suit.  \nThe relevant portion of the said judgment in relation to issue no.8 above is \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 14:36:32\nSignature Not Verified\n\n--- PAGE 3 ---\n2023/DHC/000965 \n \nCS(COMM) 1120/2016                                                                                                 Page 3 of 14 \n \nset out below: \n“122. It is indisputable that the trademarks T-MAX and TERAMAX \nare phonetically similar to the trademark TRIMAX and, thus, both \nthe trademarks are deceptively similar. The fact that the defendant \nhad applied for registration of the brand TERAMAX in October, 2016 \n(which is prior to the order dated 17.11.2016) is of little relevance \nand does not, in any manner, establish that the adoption of the said \ntrademark by the defendant is bonafide. Mr Sethi, learned senior \ncounsel who was appearing for the defendant at the material time had \nthus, rightly not disputed that the trademark TERAMAX was \ndeceptively similar to the trademark TRIMAX, and had tendered the \naffidavit of the Managing Director of the defendant expressing his \nunconditional apology. However, Mr Arun C. Mohan, the learned \ncounsel who appeared for the defendant at the end of the final \narguments, sought to contest the application filed on behalf of the \nplaintiffs; he contended that the trademark TERAMAX was not \nsimilar to TRIMAX. This is plainly unsustainable. It is also clear \nthat even after tendering an unconditional apology, the defendant \nhas continued to sell its product under the trademark TERAMAX. \n \nxxx \n \n \nxxx \n \n \nxxx \n \n125. In view of the above, the issue is decided in favour of the \nplaintiffs to the extent that the defendant has violated the orders \npassed by this court by selling writing instruments under the \ntrademark „Teramax‟.” \n \n11. \nIn respect of issue no.6 relating to rendition of accounts, the relevant \nobservations made in the judgment are set out below:  \n“Re: Issue no.6  \n \nWhether the plaintiffs are entitled to a decree of rendition of accounts \nagainst the defendants, as prayed for? \n \n126. In view of the above, the plaintiffs are not entitled to profits \nmade by the defendant in respect of products sold under the trade \nmark RORITO or that may offend the injunction as sought for. The \ndefendant had voluntarily agreed to transfer various sub-trademarks \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 14:36:32\nSignature Not Verified\n\n--- PAGE 4 ---\n2023/DHC/000965 \n \nCS(COMM) 1120/2016                                                                                                 Page 4 of 14 \n \nused in conjunction with Reynolds as recorded in the order dated \n17.11.2016, and the disputes to that extent were resolved. However, \nin view of the above conclusion that the defendant is passed of its \ngoods under the brand name TERAMAX, the defendant must \naccount for the profits made in respect of the said writing \ninstrument sold under the trademarks TERAMAX to the plaintiffs \nand to this extent, the issue is decided in favour of the plaintiffs and \nagainst the defendant. The plaintiffs would also be entitled for \nverification of the accounts so rendered by independent auditors.” \n \n12. \nIn respect of issue no.7 relating to appointment of independent \nauditor, the relevant observations made in the judgment are set out below:  \n“Re: Issue No.7 \n \nWhether an independent auditor is required to be appointed to audit \nthe accounts of the defendant? \n127. This issue is also decided in favour of the plaintiffs and they are \nentitled to ensure that the accounts are rendered in respect of the net \nrevenue from the manufacture and sale of the products sold under the \ntrademark TERAMAX. \n \nxxx \n \n \nxxx \n \n \nxxx \n \n131. As held above, the defendant and its Executive Directors, \nnamely, Mohmad Meeran Katch and Indra Kumar Mahendran, \narrayed as respondents in IA No. 3153/2008, are plainly guilty of \nviolating the orders passed by this Court inasmuch as the defendant \nhas continued to manufacture and sell the writing instruments \nunder the trademark TERAMAX. The defendant and respondent no.2 \nand 3 (Mohmad Meeran Katch and Indra Kumar Mahendran) are \nimposed with a penalty of ₹5,00,000/- which shall be paid to the \nplaintiffs within a period of one month from today, failing which \nrespondent nos. 2 and 3 (Mohmad Meeran Katch and Indra Kumar \nMahendran) shall undergo imprisonment for a period of one month. \n  \n132. In addition, the defendant is liable to account for the net \nrevenue earned by the sale of the writing instruments under the \ntrademark TERAMAX. The defendant shall render a statement of \naccount of the net revenue (profit) earned from the sale of writing \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 14:36:32\nSignature Not Verified\n\n--- PAGE 5 ---\n2023/DHC/000965 \n \nCS(COMM) 1120/2016                                                                                                 Page 5 of 14 \n \ninstruments under the trademark TERAMAX, within a period of two \nweeks.  \n \n133. M/s Vaibhav Gupta, VGG & Co. Chartered Accountants (Mobile \nNo. 9811045762) is appointed as the Local Commissioner to \nindependently verify the accounts so rendered by the defendant \nrelating to the profits earned by the sale of the writing instruments \nunder the trademark TERAMAX. The defendant shall produce all \nbooks and accounts and furnish all information as required by the \nLocal Commissioner. The fee of the Local Commissioner shall be \ncommensurate with the quantum of work and is tentatively fixed at ₹3 \nlacs plus expenses. The aforesaid sum shall be paid by the defendant \nin advance. \n \n134. The Local Commissioner shall submit a report within a period \nof six weeks, after the defendant has furnished the statement of \naccount as directed above. \n \n135. Objections to the report, if any, be filed within a period of two \nweeks, thereafter. \n \n136. The decree for the amount so determined shall follow after \nconsidering the report of the Local Commissioner. \n \n137. The suit is partially decreed to the extent as indicated above. \n \n138. List on 26.02.2019 for consideration of the report of Local \nCommissioner.” \n \n13. \nOn 6th July, 2019, the independent auditor appointed by this Court \nsubmitted a report before this Court. At page no.7 of the aforesaid report, the \nauditor has noted that the defendant had allocated the legal expenses to the \n„TERAMAX‟ brand in excess and therefore, the auditor has made \nadjustment for the same to determine the profitability. At page no.14 – 15 of \nthe report, the auditor has made remarks with regard to expenses which are \nnot to be allowed and adjustments to be made so as to arrive at the correct \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 14:36:32\nSignature Not Verified\n\n--- PAGE 6 ---\n2023/DHC/000965 \n \nCS(COMM) 1120/2016                                                                                                 Page 6 of 14 \n \nprofits in respect of the brand „TERAMAX‟. A total adjustment of about \nRs.7 crores has been made by the independent auditor and in view of the \nabove, the loss claimed by the defendant of about Rs.1.81 crores would in \nfact translate into profits of Rs.5 crores in respect of sale of „TERAMAX‟ \nproducts. Both the plaintiffs and defendant wanted to file objections to the \nsaid report. \n14. \nSubsequently, in the order dated 18th July, 2019 passed by this Court, \nthe following observations were made: \n“6. \nHowever in my opinion no purpose will be served in wasting \ntime on permitting objections to be filed and allowing the pleadings to \nbe completed thereon. The procedure prescribed by Code of Civil \nProcedure, 1908 (CPC), of after passing of decree for accounts, is to \nrelegate the parties to evidence on the accounts.  \n \n7. \nA perusal of the order dated 3rd May, 2017 shows that the \naccounts were not to be gone into during trial and only the question \nof entitlement of the plaintiffs to a decree for rendition of accounts \nwas framed.  \n \n8.  \nThe senior counsel for the plaintiffs and the counsel for the \ndefendant agree that commission be issued to record evidence on the \naccounts.” \n \n15. \nIn the subsequent order dated 5th August, 2019, a Local Commissioner \nwas appointed to go into to the accounts pursuant to the decree passed by \nthis Court on 26th November, 2018 and the defendant was directed to file its \naffidavit by way of examination in chief with an advance copy to the \ncounsel for the plaintiffs. \n16. \nAn affidavit of evidence was filed on behalf of the defendant on 24th \nSeptember, 2019.  Along with the aforesaid affidavit, the defendant filed the \nstatement of profitability in respect of „TERAMAX‟ for the period 1st \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 14:36:32\nSignature Not Verified\n\n--- PAGE 7 ---\n2023/DHC/000965 \n \nCS(COMM) 1120/2016                                                                                                 Page 7 of 14 \n \nJanuary, 2017 to 31st August, 2018 and the audited financial results for the \nFinancial Years 2016-17, 2017-18 and 2018-19 showing losses in respect of \nthe aforesaid three Financial Years.  \n17. \nCounsel for the plaintiffs sent a notice to produce documents to the \ndefendant‟s counsel on 28th November, 2019 calling upon the defendant to \nproduce documents, including the documents that were submitted to the \nindependent auditor. The defendant, vide its response dated 7th January, \n2020 declined to produce the documents. In these circumstances, \nI.A.2479/2020 was filed on behalf of the plaintiffs seeking direction that the \ndocuments in custody of independent auditor be summoned and copies \nthereof be supplied to the parties as the same would be relevant for the \npurposes of cross-examination of the defendant‟s witness. \n18. \n I.A.2480/2020 was filed on behalf of the plaintiffs to produce various \ndocuments as detailed in paragraph 19(a) of the said application. \n19. \nBoth the aforesaid applications were opposed by the defendant on the \nfollowing grounds: \n(i) \nThe documents for which discovery is sought is not material for the \nadjudication of the present suit and amounts to roving and fishing \nenquiry.   \n(ii) \nThe documents sought by the plaintiffs are confidential in nature and \nin view of the fact that the plaintiffs are competitors of the defendant, \nthe documents cannot be supplied to the plaintiffs. \nSUBMISSIONS OF THE PLAINTIFFS \n20. \nSenior counsel appearing on behalf of the plaintiffs has made the \nfollowing submissions: \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 14:36:32\nSignature Not Verified\n\n--- PAGE 8 ---\n2023/DHC/000965 \n \nCS(COMM) 1120/2016                                                                                                 Page 8 of 14 \n \n(i) \nNo secrecy was claimed by the defendant while providing the \naforesaid documents to the independent auditor appointed by this \nCourt, and therefore no confidentiality can be claimed at this stage. \n(ii) \nIn terms of the license agreement dated 9th April, 2010 entered into \nbetween the plaintiffs and the defendant, the plaintiffs had full access \nto financial information and other records of the defendant company \nfor a period of three years after the expiry of the agreement.  \n(iii) In terms of the judgment dated 26th November, 2018, the plaintiffs \nhad the right to verify the aforesaid documents. A perusal of the report \nfiled by the independent auditor reveals that the defendant has \ndoctored its accounts so as to show losses despite having a turnover of \nRs.69 crores in respect of pens sold under the trade mark \n„TERAMAX‟. \n(iv) \nIn I.A.2480/2020, additional documents have been sought for the \ncheck period, being the period before and after the period in question \nfor which the accounts were to be rendered. \nSUBMISSIONS OF THE DEFENDANT \n21. \nSenior counsel appearing on behalf of the defendant has made the \nfollowing submissions: \n(i) \nThe proceedings in the present suit came to an end after the judgment \ndated 26th November, 2018 was delivered by this Court.  Therefore, \nthe present applications cannot be filed in a disposed of suit. \n(ii) \nBoth the parties have filed appeals against the aforesaid judgment \nwhich are pending before the Division Bench.   \n(iii) There has been no order passed by this Court for the defendant to \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 14:36:32\nSignature Not Verified\n\n--- PAGE 9 ---\n2023/DHC/000965 \n \nCS(COMM) 1120/2016                                                                                                 Page 9 of 14 \n \nshare its accounts and financial information with the plaintiffs.   \n(iv) \nDocuments sought in I.A.2480/2020 are beyond the scope of the suit \nas the documents sought therein are for the years 2013 to 2019.   \n(v) \nOnce a report has been filed on behalf of the Local Commissioner \nappointed by this Court, the issue of rendition of accounts cannot be \ngone into again by the Court as the same would amount to a second \ntrial.  Reliance is placed on the following judgments: \n(i) \nState of Uttar Pradesh v. Brahm Datt Sharma and Anr. (1987) \n2 SCC 179 \n(ii) \nNarpat Singh v. Rajasthan Financial Corporation, 2007 SCC \nOnLine SC 1580 \n(iii) Akhileshwar Prasad Narayan Singh v. Shashi Shekhareshwar \nPrasad Narayan Singh, MANU/DE/3416/2014 \nANALYSIS AND FINDINGS \n22. \nI have heard the counsel for the parties and perused the record. \n23. \nAt the outset, I do not find any merit in the submission of the \ndefendant that the present applications are not maintainable since the suit \nhas been finally disposed of. A bare perusal of paragraphs no.136 and 137 of \nthe judgment passed by this Court on 26th November, 2018 would show that \nthe suit was only partially decreed. The suit was kept pending for the \npurpose of determination of the amounts payable by the defendant to the \nplaintiffs. A perusal of the subsequent orders passed by this Court on 18th \nJuly, 2019 and 5th August, 2019 also make it abundantly clear that the \npresent suit insofar as the determination of the amounts payable to the \nplaintiffs still survived and a Local Commissioner was appointed by the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 14:36:32\nSignature Not Verified\n\n--- PAGE 10 ---\n2023/DHC/000965 \n \nCS(COMM) 1120/2016                                                                                                 Page 10 of 14 \n \nCourt for recording of evidence. Further, evidence by way of affidavit has \nalso been filed by the defendant in this regard. Therefore, there is no basis to \ncontend that the present suit was finally over and that the present \napplications are not maintainable. The judgments relied upon by the \ndefendant in this regard are therefore, not applicable. \n24. \nAccordingly, I proceed to consider the aforesaid applications on \nmerits.  \n25. \nSenior counsel on behalf of the defendant contends that the \ndocuments sought by the plaintiffs by virtue of these applications have no \nrelevance and the plaintiffs are seeking to conduct a fresh trial in the suit \nwhich stood completed with the report of the Local Commissioner being \nfiled.  However, the aforesaid submission overlooks the fact that in terms of \nparagraph 126 of the judgment dated 26th November, 2018, this Court had \nheld that the plaintiffs are entitled to verification of the accounts so rendered \nby the independent auditor in respect of the net revenue earned from the \nmanufacture and sale of the products sold under the trademark \n„TERAMAX‟ by the defendant. Further, the plaintiffs were also entitled to \nfile objections to the report of the independent auditor appointed by the \nCourt. The aforesaid verification could only be done by the plaintiffs and/or \nthe objections could only be filed by the plaintiffs, on the basis of the \ndocuments furnished by the defendant to the independent auditor. Therefore, \nthe intent of the Court in the judgment dated 26th November, 2018 was clear \nthat the plaintiffs be provided the complete accounts of the defendant so that \nthe plaintiffs could verify the net revenue earned on account of sale of \nwriting instruments under the mark „TERAMAX‟  \n26. \n In the order dated 18th July, 2019 passed in the present suit, it was \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 14:36:32\nSignature Not Verified\n\n--- PAGE 11 ---\n2023/DHC/000965 \n \nCS(COMM) 1120/2016                                                                                                 Page 11 of 14 \n \nspecifically noted that no purpose would be served by permitting parties to \nfile objections to the Local Commissioner‟s report and therefore, parties \nwere directed to lead evidence on the accounts of the defendant  \n27. \nIn the affidavit of evidence filed on behalf of the defendant, the \ndefendant has claimed a total turnover of Rs.69,08,80,592/- for the period of \nJanuary, 2017 to August, 2018, yet a loss of Rs.1,81,40,552/- has been \nclaimed for the aforesaid period in respect of sale of „TERAMAX‟ products. \nAlong with the said affidavit, the defendant has also filed statements of \nprofitability so as to justify the aforesaid loss. However, the defendant has \nfailed to provide any explanation in the affidavit as to how a loss of Rs.1.81 \ncrore was incurred by the defendant despite having a turnover of Rs.69 \ncrores in respect of „TERAMAX‟ pens. It has been observed in the report of \nthe independent auditor, the defendant has loaded various expenses so as to \nshow a loss of about Rs.1.81 crore in respect of „TERAMAX‟ pens.  A \nwhole lot of these expenses have been disallowed by the independent \nauditor.   \n28. \nAs noted in the order dated 18th July, 2019 passed by this Court, the \nparties were to proceed for trial on the issue of the accounts of the \ndefendant. Indisputably, once the parties are going for trial on the issue of \naccounts of the defendant, the plaintiffs would have the right to cross-\nexamine the witness of the defendant on its accounts.   \n29. \nIn view of the fact that the defendant has supplied the said documents \nto the independent auditor and on the basis of those documents the auditor \nhas prepared his report means that the said documents are material and \nrelevant for the purposes of determining the amounts payable by the \ndefendant to the plaintiffs in terms of the judgment passed by this Court on \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 14:36:32\nSignature Not Verified\n\n--- PAGE 12 ---\n2023/DHC/000965 \n \nCS(COMM) 1120/2016                                                                                                 Page 12 of 14 \n \n26th November, 2018. Therefore, the plaintiffs are justified in seeking access \nto the documents that were submitted by the defendant before the \nindependent auditor appointed by the Court. \n30. \nIn Ellora Industries v. Banarsi Das Goela, 1979 SCC OnLine Del \n198, a Co-ordinate Bench of this Court has elucidated one of the principles \nfor grant of account of profits, which is set out below: \n“50. Thirdly, the courts order an account of profits on the theory that \nthe defendant was constructively an agent of the plaintiff in \ndisposing of goods in a manner infringing the plaintiff's rights \n[Snell—Principles of Equity (24th ed. 1954) p. 574]. The principle \nupon which the court grants an account of profits is that where \none party owes a duty to another, the person to whom the duty is \nowed is entitled to recover from the other party every benefit which \nthat other party has received by virtue of his fiduciary position if in \nfact he has obtained it without the knowledge or consent of the \nparty to whom he owed the duty (Kerly—Law of Trade Marks 10th \ned. p. 344)....” \n \n31. \nIn the present case, a decree for rendition of accounts has already \nbeen passed in favour of the plaintiffs and against the defendant. Therefore, \nthe defendant is duty bound to offer true and fair rendition of accounts \npertaining to the net revenue earned on account of sale of pens under the \nmark „TERAMAX‟ for the period 1st January, 2017 to 31st August, 2018 \nplaced before the auditor.   \n32. \nAs regards the plea of confidentiality taken by the defendant, in a suit \nfor rendition of accounts where accounts have to be rendered by a defendant, \nthe defendant cannot claim confidentiality in respect of its books of \naccounts. If such a plea is allowed it would frustrate the whole purpose of \nthe trial. No such plea was taken by the defendant at the time of supplying \nthe aforesaid documents to the independent auditor. Therefore, the defendant \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 14:36:32\nSignature Not Verified\n\n--- PAGE 13 ---\n2023/DHC/000965 \n \nCS(COMM) 1120/2016                                                                                                 Page 13 of 14 \n \nat this stage cannot claim any confidentiality in providing the aforesaid \ndocuments to the plaintiffs. Clearly, the intention of the defendant is to \nconceal relevant information from the Court. The conduct of the defendant \nhas been noted and deprecated in the judgment dated 26th November, 2018 \npassed by this Court. In fact, costs of Rs,5,00,000/- were imposed on the \ndefendant and two other respondents for violating the order passed by this \nCourt, by continuing to manufacture and sell the writing instruments under \nthe trademark „TERAMAX‟ despite giving an undertaking.  \n33. \nIt may also be pertinent to note here that till 1st March, 2016, the \ndefendant was a licensee of the plaintiffs and in terms of the license \nagreement dated 9th April, 2010, the defendant was obliged to maintain \nrecords in respect of invoices, financial information, inventory etc., and \ndisclose the same to the plaintiffs. The said records were to be maintained \ntill a period of three years after the termination of the license agreement.  \nThe relevant clause 6.1 of the license agreement dated 9th April, 2010 is set \nout below: \n “6.1 Records. Licensee shall keep full and accurate books and \naccounts of all transactions relating to this Agreement and the \nmanufacture and sale of Licensed Products in sufficient detail to \nenable Paper Mate Licensor to determine and verify Licensee’s \ncompliance with its obligations hereunder, including without \nlimiting the generality of the foregoing Licensee’s payment \nobligations to Paper Mate Licensor. Such records shall include \nwithout limitation documentation to support the information \nprovided in the royalty reports required under Section 5.3, invoices, \nfinancial information, inventory, manufacturing, quality control, \nand approval records. Licensee shall maintain all such records \nduring the Term of this Agreement and for a period of three (3) \nyears thereafter.” \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 14:36:32\nSignature Not Verified\n\n--- PAGE 14 ---\n2023/DHC/000965 \n \nCS(COMM) 1120/2016                                                                                                 Page 14 of 14 \n \n34. \nIn terms of the Clause 29 of the aforesaid agreement, the aforesaid \nclause and the obligations therein were to survive even after the termination \nof the agreement. Admittedly, in the present case the license agreement was \nterminated with effect from 1st March, 2016. The records sought by the \nplaintiffs in I.A.2479/2020 are within 3 years from the date of termination of \nthe license agreement and therefore, fall within the ambit of the aforesaid \nclause and the defendant cannot claim any confidentiality in respect of the \nsame. \n35. \nIn view of the discussion above, I.A.2479/2020 is allowed and the \nRegistry is directed to supply to the plaintiffs the entire set of documents \nthat are a part of the report of the independent auditor submitted to this \nCourt. \n36. \nNo justification has been provided by the plaintiffs for supply of \ndocuments/information as detailed in I.A.2480/2020.  As per the judgment \ndated 26th November, 2018, the relevant period for which the accounts were \nto be rendered by the defendant is from 1st January, 2017 to 31st August, \n2018.  Therefore, there is no justification for the plaintiffs to demand \ninformation pertaining to the years 2013-14 to 2015-16 from the defendant. \n37. \nTherefore, I do not find any merit in the same and the same is \ndismissed. \nCS(COMM) 1120/2016 \n38. \nList before the Joint Registrar for further proceedings on 2nd March, \n2023. \n \nAMIT BANSAL, J. \nFEBURARY 10, 2023/dk \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 14:36:32\nSignature Not Verified\n"
  },
  "total_pages": 14,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "According to the PDF document \"Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD.pdf\", the case header and parties are as follows: \n\nThe High Court of Delhi at New Delhi heard the case CS(COMM) 1120/2016, with judgment reserved on February 2, 2023, and delivered on February 10, 2023. The plaintiffs, Luxembourg Brands S.A R.L & ANR, were represented by Mr. Sanjeev Sindhwani, Sr. Advocate, and Mr. Prashant Gupta, Advocate. The defendant, G.M Pens International Pvt Ltd, was represented by Mr. Sandeep Sethi, Sr. Advocate, and other advocates.\n\nThe brief facts of the case are that the plaintiffs own various registered marks, including \"TRIMAX\", for stationery products. The defendant was a licensee of the plaintiff companies since 1986 and manufactured pens and other stationery instruments using the plaintiffs' trademarks. The license was terminated on September 1, 2015, but the defendant continued to use some of the plaintiffs' trademarks, leading to the filing of the present suit on August 17, 2016.\n\nThe court framed issues on May 3, 2017, including whether the plaintiffs are entitled to a decree of rendition of accounts against the defendants and whether an independent auditor is required to audit the defendant's accounts. The defendant tendered an affidavit of unconditional apology on September 19, 2017, for using the trademark \"TERAMAX\". A judgment was passed on November 26, 2018, regarding the defendant's disobedience of court orders. (Source: 2023/DHC/000965, pdf page 1-2)",
      "pdf_source": "22. Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "According to page 1 of the PDF \"22. Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD.pdf\", a court case (CS(COMM) 1120/2016) was heard in the High Court of Delhi at New Delhi. The plaintiffs, Luxembourg Brands S.A R.L & Anr, were represented by Mr. Sanjeev Sindhwani, Sr. Advocate, while the defendant, G.M Pens International Pvt Ltd, was represented by Mr. Sandeep Sethi, Sr. Advocate. The judgment was reserved on February 2, 2023, and delivered on February 10, 2023, by Hon'ble Mr. Justice Amit Bansal. The case involves applications under Section 151 of the Civil Procedure Code and Order XI Rule 5 of the CPC for production of documents. The plaintiffs own various registered marks, but further details are not provided on this page. (Source: 2023/DHC/000965)",
          "content": "2023/DHC/000965 \n \nCS(COMM) 1120/2016                                                                                                 Page 1 of 14 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n% \n \n \n Judgment Reserved on :  02nd February, 2023 \nJudgment Delivered on : 10th February, 2023 \n  \n+  \nCS(COMM) 1120/2016 & CRL.M.A. 10583/2017 (u/s 340 CrPC), \nI.A. 3153/2018 (O-XXXIX R-2A of CPC) \n \n \nLUXEMBOURG BRANDS S.A R.L & ANR \n..... Plaintiffs \nThrough: \nMr.Sanjeev Sindhwani, Sr.Advocate \nwith Mr.Prashant Gupta, Advocate. \n \n \n \n \nversus \n \n \nG.M PENS INTERNATIONAL PVT LTD  \n..... Defendant \nThrough: \nMr.Sandeep Sethi, Sr.Advocate with \nMr.Arun, Mr.Tahir AJ, Ms.Shreya \nSethi, Mr.Vikram Singh Dalal and \nMs.Tanvi Tewari, Advocates. \n \n \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nJUDGMENT \nAMIT BANSAL, J. \n \nI.A. 2479/2020 (u/s 151 CPC for summoning of the records) and I.A. \n2480/2020 (O-XI R-5 of CPC) \n1. \nBy way of the present judgment, I shall dispose of I.A. No.2479/2020 \nfiled under Section 151 of the Civil Procedure Code, 1908 (CPC) and I.A. \nNo.2480/2020 filed under Order XI Rule 5 of the CPC for production of \ndocuments. \nBRIEF FACTS \n2. \nThe brief facts insofar as are relevant for deciding the present \napplications are set out below. \n3. \nThe plaintiffs are the owners of various registered marks including \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 14:36:32\nSignature Not Verified",
          "pdf_source": "22. Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "According to page 2 of the PDF \"22. Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD.pdf\", the defendant was a licensee of the plaintiff companies since 1986, using trademarks such as \"TRIMAX\" for stationery products. The license was terminated on September 1, 2015, and the plaintiffs filed a suit on August 17, 2016, alleging the defendant continued to use their trademarks. The court ordered the defendant not to use the \"T-MAX\" trademark on November 17, 2016. Issues were framed on May 3, 2017, including the plaintiffs' entitlement to a decree of rendition of accounts and the appointment of an independent auditor. The defendant tendered an unconditional apology on September 19, 2017, for using the \"TERAMAX\" trademark. A judgment was passed on November 26, 2018, related to the defendant's disobedience of court orders. (Source: 2023/DHC/000965, CS(COMM) 1120/2016)",
          "content": "2023/DHC/000965 \n \nCS(COMM) 1120/2016                                                                                                 Page 2 of 14 \n \n„TRIMAX‟ in relation to stationery products such as writing instruments, \ncorrection pens, glue sticks, etc. \n4. \nSince the year 1986, the defendant was a licensee of the plaintiff \ncompanies and was manufacturing pens and other stationery instruments \nusing the trademarks of the plaintiffs, pursuant to a license agreement.  Last \nsuch license was granted to the defendant vide license agreement dated 9th \nApril, 2010. \n5. \nThe aforesaid license was terminated by the plaintiffs vide letter dated \n1st September, 2015 w.e.f. 1st March, 2016. \n6. \nIt was the case of the plaintiffs that the defendant continued to use \nsome of the trademarks of the plaintiffs even after termination of the license \nagreement and therefore, the present suit was filed on 17th August, 2016. \n7. \nIt was noted in the order dated 17th November, 2016 passed in the \npresent suit that the defendant shall not use the trade mark „T-MAX‟. \n8. \nOn 3rd May, 2017, issues in the suit were framed. The issues relevant \nfor the purposes of the present applications are set out below: \n“6. \nWhether the plaintiffs are entitled to a decree of rendition of \naccounts against the defendants, as prayed for? OPP \n7. \nWhether an independent auditor is required to be appointed to \naudit the accounts the defendant? OPP \n8.  \nWhether the defendant has disobeyed any of the orders passed \nby this court? OPP” \n \n9. \nAn affidavit of unconditional apology dated 19th September, 2017 was \ntendered on behalf of the defendant for having used the trade mark \n„TERAMAX‟. \n10. \nA judgment dated 26th November, 2018 was passed in the present suit.  \nThe relevant portion of the said judgment in relation to issue no.8 above is \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 14:36:32\nSignature Not Verified",
          "pdf_source": "22. Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0007",
      "start_index": 3,
      "end_index": 5,
      "summary": "According to the PDF document \"Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD.pdf\", the High Court of Delhi at New Delhi heard the case CS(COMM) 1120/2016. The judgment was reserved on February 2, 2023, and delivered on February 10, 2023. The plaintiffs, Luxembourg Brands S.A R.L, alleged that the defendants, G.M. Pens International Pvt Ltd, had violated their trademark rights by using the trademark \"TERAMAX\", which is phonetically similar to the plaintiff's trademark \"TRIMAX\".\n\nThe court found that the defendant had indeed violated the plaintiff's trademark rights and had continued to sell products under the \"TERAMAX\" trademark despite an earlier apology and agreement to stop. The court ruled in favor of the plaintiffs, deciding that the defendant must account for the profits made from selling products under the \"TERAMAX\" trademark. The plaintiffs are also entitled to verification of the accounts by independent auditors.\n\nThe court imposed a penalty of ₹5,00,000 on the defendant and its executive directors for violating the court's orders. The court's decision is based on the fact that the defendant's trademark \"TERAMAX\" is deceptively similar to the plaintiff's trademark \"TRIMAX\", and the defendant's actions were not bonafide. The case highlights the importance of protecting trademark rights and the consequences of violating court orders. (Source: 2023/DHC/000965, Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD.pdf)",
      "pdf_source": "22. Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "According to page 3 of the PDF \"22. Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD.pdf\", the court ruled that the trademark \"TERAMAX\" is deceptively similar to \"TRIMAX\". The defendant had applied for registration of \"TERAMAX\" in October 2016 and continued to sell products under this trademark despite tendering an unconditional apology. The court decided in favor of the plaintiffs, stating that the defendant violated court orders by selling writing instruments under \"Teramax\". \n\nRegarding issue no.6, the plaintiffs are not entitled to a decree of rendition of accounts against the defendants. The defendant had voluntarily agreed to transfer sub-trademarks. The judgment was reserved on February 2, 2023, and delivered on February 10, 2023. The case is CS(COMM) 1120/2016, and the plaintiffs are represented by Mr. Sanjeev Sindhwani, Sr. Advocate. (Source: PDF \"22. Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD.pdf\", 2023/DHC/000965)",
          "content": "2023/DHC/000965 \n \nCS(COMM) 1120/2016                                                                                                 Page 3 of 14 \n \nset out below: \n“122. It is indisputable that the trademarks T-MAX and TERAMAX \nare phonetically similar to the trademark TRIMAX and, thus, both \nthe trademarks are deceptively similar. The fact that the defendant \nhad applied for registration of the brand TERAMAX in October, 2016 \n(which is prior to the order dated 17.11.2016) is of little relevance \nand does not, in any manner, establish that the adoption of the said \ntrademark by the defendant is bonafide. Mr Sethi, learned senior \ncounsel who was appearing for the defendant at the material time had \nthus, rightly not disputed that the trademark TERAMAX was \ndeceptively similar to the trademark TRIMAX, and had tendered the \naffidavit of the Managing Director of the defendant expressing his \nunconditional apology. However, Mr Arun C. Mohan, the learned \ncounsel who appeared for the defendant at the end of the final \narguments, sought to contest the application filed on behalf of the \nplaintiffs; he contended that the trademark TERAMAX was not \nsimilar to TRIMAX. This is plainly unsustainable. It is also clear \nthat even after tendering an unconditional apology, the defendant \nhas continued to sell its product under the trademark TERAMAX. \n \nxxx \n \n \nxxx \n \n \nxxx \n \n125. In view of the above, the issue is decided in favour of the \nplaintiffs to the extent that the defendant has violated the orders \npassed by this court by selling writing instruments under the \ntrademark „Teramax‟.” \n \n11. \nIn respect of issue no.6 relating to rendition of accounts, the relevant \nobservations made in the judgment are set out below:  \n“Re: Issue no.6  \n \nWhether the plaintiffs are entitled to a decree of rendition of accounts \nagainst the defendants, as prayed for? \n \n126. In view of the above, the plaintiffs are not entitled to profits \nmade by the defendant in respect of products sold under the trade \nmark RORITO or that may offend the injunction as sought for. The \ndefendant had voluntarily agreed to transfer various sub-trademarks \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 14:36:32\nSignature Not Verified",
          "pdf_source": "22. Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "According to page 4 of the PDF \"22. Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD.pdf\", the court ruled in favor of the plaintiffs, Luxembourg Brands S.A R.L & ANR, in a trademark dispute against G.M. Pens International Pvt Ltd. The defendant was found to have violated court orders by continuing to manufacture and sell writing instruments under the trademark TERAMAX. As a result, the defendant was ordered to account for profits made from the sale of these instruments and to pay a penalty of ₹5,00,000/- to the plaintiffs within a month. The court also decided that an independent auditor should be appointed to audit the defendant's accounts. The judgment was delivered on February 10, 2023, by the High Court of Delhi. (Source: 2023/DHC/000965, CS(COMM) 1120/2016)",
          "content": "2023/DHC/000965 \n \nCS(COMM) 1120/2016                                                                                                 Page 4 of 14 \n \nused in conjunction with Reynolds as recorded in the order dated \n17.11.2016, and the disputes to that extent were resolved. However, \nin view of the above conclusion that the defendant is passed of its \ngoods under the brand name TERAMAX, the defendant must \naccount for the profits made in respect of the said writing \ninstrument sold under the trademarks TERAMAX to the plaintiffs \nand to this extent, the issue is decided in favour of the plaintiffs and \nagainst the defendant. The plaintiffs would also be entitled for \nverification of the accounts so rendered by independent auditors.” \n \n12. \nIn respect of issue no.7 relating to appointment of independent \nauditor, the relevant observations made in the judgment are set out below:  \n“Re: Issue No.7 \n \nWhether an independent auditor is required to be appointed to audit \nthe accounts of the defendant? \n127. This issue is also decided in favour of the plaintiffs and they are \nentitled to ensure that the accounts are rendered in respect of the net \nrevenue from the manufacture and sale of the products sold under the \ntrademark TERAMAX. \n \nxxx \n \n \nxxx \n \n \nxxx \n \n131. As held above, the defendant and its Executive Directors, \nnamely, Mohmad Meeran Katch and Indra Kumar Mahendran, \narrayed as respondents in IA No. 3153/2008, are plainly guilty of \nviolating the orders passed by this Court inasmuch as the defendant \nhas continued to manufacture and sell the writing instruments \nunder the trademark TERAMAX. The defendant and respondent no.2 \nand 3 (Mohmad Meeran Katch and Indra Kumar Mahendran) are \nimposed with a penalty of ₹5,00,000/- which shall be paid to the \nplaintiffs within a period of one month from today, failing which \nrespondent nos. 2 and 3 (Mohmad Meeran Katch and Indra Kumar \nMahendran) shall undergo imprisonment for a period of one month. \n  \n132. In addition, the defendant is liable to account for the net \nrevenue earned by the sale of the writing instruments under the \ntrademark TERAMAX. The defendant shall render a statement of \naccount of the net revenue (profit) earned from the sale of writing \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 14:36:32\nSignature Not Verified",
          "pdf_source": "22. Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD.pdf",
          "nodes": []
        },
        {
          "title": "Page 5",
          "node_id": "0006",
          "start_index": 5,
          "end_index": 5,
          "summary": "According to page 5 of the PDF \"22. Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD.pdf\", the court appointed M/s Vaibhav Gupta as the Local Commissioner to verify the defendant's accounts related to the trademark TERAMAX. The defendant was required to produce all books and accounts, and the Local Commissioner's fee was fixed at ₹3 lacs plus expenses. The report was to be submitted within six weeks, and objections could be filed within two weeks thereafter. The court partially decreed the suit, listing it for consideration of the report on 26.02.2019. An independent auditor's report was later submitted on 6th July, 2019, making adjustments for excessive legal expenses allocated to the TERAMAX brand. (Source: 2023/DHC/000965, CS(COMM) 1120/2016)",
          "content": "2023/DHC/000965 \n \nCS(COMM) 1120/2016                                                                                                 Page 5 of 14 \n \ninstruments under the trademark TERAMAX, within a period of two \nweeks.  \n \n133. M/s Vaibhav Gupta, VGG & Co. Chartered Accountants (Mobile \nNo. 9811045762) is appointed as the Local Commissioner to \nindependently verify the accounts so rendered by the defendant \nrelating to the profits earned by the sale of the writing instruments \nunder the trademark TERAMAX. The defendant shall produce all \nbooks and accounts and furnish all information as required by the \nLocal Commissioner. The fee of the Local Commissioner shall be \ncommensurate with the quantum of work and is tentatively fixed at ₹3 \nlacs plus expenses. The aforesaid sum shall be paid by the defendant \nin advance. \n \n134. The Local Commissioner shall submit a report within a period \nof six weeks, after the defendant has furnished the statement of \naccount as directed above. \n \n135. Objections to the report, if any, be filed within a period of two \nweeks, thereafter. \n \n136. The decree for the amount so determined shall follow after \nconsidering the report of the Local Commissioner. \n \n137. The suit is partially decreed to the extent as indicated above. \n \n138. List on 26.02.2019 for consideration of the report of Local \nCommissioner.” \n \n13. \nOn 6th July, 2019, the independent auditor appointed by this Court \nsubmitted a report before this Court. At page no.7 of the aforesaid report, the \nauditor has noted that the defendant had allocated the legal expenses to the \n„TERAMAX‟ brand in excess and therefore, the auditor has made \nadjustment for the same to determine the profitability. At page no.14 – 15 of \nthe report, the auditor has made remarks with regard to expenses which are \nnot to be allowed and adjustments to be made so as to arrive at the correct \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 14:36:32\nSignature Not Verified",
          "pdf_source": "22. Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0015",
      "start_index": 6,
      "end_index": 12,
      "summary": "According to the PDF document \"Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD.pdf\", the legal proceedings involve a commercial dispute between Luxembourg Brands S.A.R.L and G.M. Pens International Pvt Ltd. The case, CS(COMM) 1120/2016, was heard in the High Court of Delhi at New Delhi. \n\nThe court reserved judgment on February 2, 2023, and delivered it on February 10, 2023. The plaintiffs, Luxembourg Brands S.A.R.L, claimed that the defendant had made a loss of approximately Rs. 1.81 crores in respect of the brand \"TERAMAX\". However, an independent auditor's report revealed that the defendant had actually made a profit of around Rs. 5 crores.\n\nThe defendant filed an affidavit of evidence on September 24, 2019, along with a statement of profitability and audited financial results showing losses for the financial years 2016-17, 2017-18, and 2018-19. The plaintiffs sought to produce documents, including those submitted to the independent auditor, but the defendant declined, citing confidentiality and competitive concerns.\n\nThe plaintiffs filed two applications, I.A.2479/2020 and I.A.2480/2020, seeking direction to summon documents and produce various documents. The defendant opposed these applications, arguing that the documents were not material and were confidential. The submissions of the plaintiffs and the defendant's opposition are detailed in the document, which is available in the PDF file \"2023/DHC/000965\" (Source: PDF document).",
      "pdf_source": "22. Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD.pdf",
      "nodes": [
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "According to page 6 of the PDF \"22. Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD.pdf\", an independent auditor found that the defendant's claimed loss of Rs.1.81 crores would actually translate into profits of Rs.5 crores in respect of the \"TERAMAX\" brand. The auditor made a total adjustment of about Rs.7 crores. The court decided to relegate the parties to evidence on the accounts, rather than allowing objections to the report. A Local Commissioner was appointed to examine the accounts, and the defendant was directed to file an affidavit by way of examination in chief. The defendant filed an affidavit of evidence on September 24, 2019, along with a statement of profitability for \"TERAMAX\" (Source: 2023/DHC/000965, CS(COMM) 1120/2016).",
          "content": "2023/DHC/000965 \n \nCS(COMM) 1120/2016                                                                                                 Page 6 of 14 \n \nprofits in respect of the brand „TERAMAX‟. A total adjustment of about \nRs.7 crores has been made by the independent auditor and in view of the \nabove, the loss claimed by the defendant of about Rs.1.81 crores would in \nfact translate into profits of Rs.5 crores in respect of sale of „TERAMAX‟ \nproducts. Both the plaintiffs and defendant wanted to file objections to the \nsaid report. \n14. \nSubsequently, in the order dated 18th July, 2019 passed by this Court, \nthe following observations were made: \n“6. \nHowever in my opinion no purpose will be served in wasting \ntime on permitting objections to be filed and allowing the pleadings to \nbe completed thereon. The procedure prescribed by Code of Civil \nProcedure, 1908 (CPC), of after passing of decree for accounts, is to \nrelegate the parties to evidence on the accounts.  \n \n7. \nA perusal of the order dated 3rd May, 2017 shows that the \naccounts were not to be gone into during trial and only the question \nof entitlement of the plaintiffs to a decree for rendition of accounts \nwas framed.  \n \n8.  \nThe senior counsel for the plaintiffs and the counsel for the \ndefendant agree that commission be issued to record evidence on the \naccounts.” \n \n15. \nIn the subsequent order dated 5th August, 2019, a Local Commissioner \nwas appointed to go into to the accounts pursuant to the decree passed by \nthis Court on 26th November, 2018 and the defendant was directed to file its \naffidavit by way of examination in chief with an advance copy to the \ncounsel for the plaintiffs. \n16. \nAn affidavit of evidence was filed on behalf of the defendant on 24th \nSeptember, 2019.  Along with the aforesaid affidavit, the defendant filed the \nstatement of profitability in respect of „TERAMAX‟ for the period 1st \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 14:36:32\nSignature Not Verified",
          "pdf_source": "22. Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD.pdf",
          "nodes": []
        },
        {
          "title": "Page 7",
          "node_id": "0009",
          "start_index": 7,
          "end_index": 7,
          "summary": "According to page 7 of the PDF \"22. Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD.pdf\", the plaintiffs sought to produce documents, including audited financial results for 2016-17, 2017-18, and 2018-19, which showed losses. The defendant declined to produce these documents. The plaintiffs then filed I.A.2479/2020 and I.A.2480/2020 to summon these documents, which the defendant opposed, citing that they were not material for the suit and were confidential. The plaintiffs' senior counsel, Mr. Sanjeev Sindhwani, made submissions in support of their application. The High Court of Delhi reserved judgment on February 2, 2023, and delivered it on February 10, 2023. (Source: 2023/DHC/000965, CS(COMM) 1120/2016)",
          "content": "2023/DHC/000965 \n \nCS(COMM) 1120/2016                                                                                                 Page 7 of 14 \n \nJanuary, 2017 to 31st August, 2018 and the audited financial results for the \nFinancial Years 2016-17, 2017-18 and 2018-19 showing losses in respect of \nthe aforesaid three Financial Years.  \n17. \nCounsel for the plaintiffs sent a notice to produce documents to the \ndefendant‟s counsel on 28th November, 2019 calling upon the defendant to \nproduce documents, including the documents that were submitted to the \nindependent auditor. The defendant, vide its response dated 7th January, \n2020 declined to produce the documents. In these circumstances, \nI.A.2479/2020 was filed on behalf of the plaintiffs seeking direction that the \ndocuments in custody of independent auditor be summoned and copies \nthereof be supplied to the parties as the same would be relevant for the \npurposes of cross-examination of the defendant‟s witness. \n18. \n I.A.2480/2020 was filed on behalf of the plaintiffs to produce various \ndocuments as detailed in paragraph 19(a) of the said application. \n19. \nBoth the aforesaid applications were opposed by the defendant on the \nfollowing grounds: \n(i) \nThe documents for which discovery is sought is not material for the \nadjudication of the present suit and amounts to roving and fishing \nenquiry.   \n(ii) \nThe documents sought by the plaintiffs are confidential in nature and \nin view of the fact that the plaintiffs are competitors of the defendant, \nthe documents cannot be supplied to the plaintiffs. \nSUBMISSIONS OF THE PLAINTIFFS \n20. \nSenior counsel appearing on behalf of the plaintiffs has made the \nfollowing submissions: \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 14:36:32\nSignature Not Verified",
          "pdf_source": "22. Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD.pdf",
          "nodes": []
        },
        {
          "title": "Page 8",
          "node_id": "0010",
          "start_index": 8,
          "end_index": 8,
          "summary": "According to page 8 of the PDF \"22. Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD.pdf\", the court proceedings are as follows: \n\n* The defendant provided documents to an independent auditor without claiming secrecy.\n* A license agreement dated April 9, 2010, allowed the plaintiffs to access the defendant's financial information for three years after the agreement expired.\n* The auditor's report revealed the defendant doctored accounts to show losses despite a Rs. 69 crores turnover.\n* The defendant's senior counsel argued that the proceedings ended after the November 26, 2018, judgment and that appeals are pending before the Division Bench.\n\nSource: \"22. Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD.pdf\" (2023/DHC/000965, CS(COMM) 1120/2016)",
          "content": "2023/DHC/000965 \n \nCS(COMM) 1120/2016                                                                                                 Page 8 of 14 \n \n(i) \nNo secrecy was claimed by the defendant while providing the \naforesaid documents to the independent auditor appointed by this \nCourt, and therefore no confidentiality can be claimed at this stage. \n(ii) \nIn terms of the license agreement dated 9th April, 2010 entered into \nbetween the plaintiffs and the defendant, the plaintiffs had full access \nto financial information and other records of the defendant company \nfor a period of three years after the expiry of the agreement.  \n(iii) In terms of the judgment dated 26th November, 2018, the plaintiffs \nhad the right to verify the aforesaid documents. A perusal of the report \nfiled by the independent auditor reveals that the defendant has \ndoctored its accounts so as to show losses despite having a turnover of \nRs.69 crores in respect of pens sold under the trade mark \n„TERAMAX‟. \n(iv) \nIn I.A.2480/2020, additional documents have been sought for the \ncheck period, being the period before and after the period in question \nfor which the accounts were to be rendered. \nSUBMISSIONS OF THE DEFENDANT \n21. \nSenior counsel appearing on behalf of the defendant has made the \nfollowing submissions: \n(i) \nThe proceedings in the present suit came to an end after the judgment \ndated 26th November, 2018 was delivered by this Court.  Therefore, \nthe present applications cannot be filed in a disposed of suit. \n(ii) \nBoth the parties have filed appeals against the aforesaid judgment \nwhich are pending before the Division Bench.   \n(iii) There has been no order passed by this Court for the defendant to \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 14:36:32\nSignature Not Verified",
          "pdf_source": "22. Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD.pdf",
          "nodes": []
        },
        {
          "title": "Page 9",
          "node_id": "0011",
          "start_index": 9,
          "end_index": 9,
          "summary": "According to page 9 of the PDF \"22. Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD.pdf\", the defendant argued that the applications are not maintainable since the suit has been finally disposed of. However, the court found that the suit was only partially decreed on November 26, 2018, and was kept pending to determine the amounts payable by the defendant to the plaintiffs. The court also referred to subsequent orders passed on July 18, 2019, and August 5, 2019, which confirmed that the suit was still ongoing for the determination of payable amounts. The defendant cited judgments, including State of Uttar Pradesh v. Brahm Datt Sharma and Anr. (1987) and Narpat Singh v. Rajasthan Financial Corporation, 2007, to support their arguments. (Source: 2023/DHC/000965, CS(COMM) 1120/2016)",
          "content": "2023/DHC/000965 \n \nCS(COMM) 1120/2016                                                                                                 Page 9 of 14 \n \nshare its accounts and financial information with the plaintiffs.   \n(iv) \nDocuments sought in I.A.2480/2020 are beyond the scope of the suit \nas the documents sought therein are for the years 2013 to 2019.   \n(v) \nOnce a report has been filed on behalf of the Local Commissioner \nappointed by this Court, the issue of rendition of accounts cannot be \ngone into again by the Court as the same would amount to a second \ntrial.  Reliance is placed on the following judgments: \n(i) \nState of Uttar Pradesh v. Brahm Datt Sharma and Anr. (1987) \n2 SCC 179 \n(ii) \nNarpat Singh v. Rajasthan Financial Corporation, 2007 SCC \nOnLine SC 1580 \n(iii) Akhileshwar Prasad Narayan Singh v. Shashi Shekhareshwar \nPrasad Narayan Singh, MANU/DE/3416/2014 \nANALYSIS AND FINDINGS \n22. \nI have heard the counsel for the parties and perused the record. \n23. \nAt the outset, I do not find any merit in the submission of the \ndefendant that the present applications are not maintainable since the suit \nhas been finally disposed of. A bare perusal of paragraphs no.136 and 137 of \nthe judgment passed by this Court on 26th November, 2018 would show that \nthe suit was only partially decreed. The suit was kept pending for the \npurpose of determination of the amounts payable by the defendant to the \nplaintiffs. A perusal of the subsequent orders passed by this Court on 18th \nJuly, 2019 and 5th August, 2019 also make it abundantly clear that the \npresent suit insofar as the determination of the amounts payable to the \nplaintiffs still survived and a Local Commissioner was appointed by the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 14:36:32\nSignature Not Verified",
          "pdf_source": "22. Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD.pdf",
          "nodes": []
        },
        {
          "title": "Page 10",
          "node_id": "0012",
          "start_index": 10,
          "end_index": 10,
          "summary": "According to page 10 of the PDF \"22. Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD.pdf\", the court considered the maintainability of the applications. The defendant argued that the suit was finally over, but the court disagreed, citing that evidence was still being recorded and affidavits were filed. The court then proceeded to consider the applications on merit. The defendant's senior counsel argued that the documents sought by the plaintiffs were irrelevant and that they were attempting to conduct a fresh trial. However, the court noted that its previous judgment on November 26, 2018, entitled the plaintiffs to verify the accounts and file objections to the report of the independent auditor. The court intended for the plaintiffs to receive complete accounts from the defendant to verify the net revenue earned from the sale of \"TERAMAX\" products. (Source: 2023/DHC/000965, CS(COMM) 1120/2016)",
          "content": "2023/DHC/000965 \n \nCS(COMM) 1120/2016                                                                                                 Page 10 of 14 \n \nCourt for recording of evidence. Further, evidence by way of affidavit has \nalso been filed by the defendant in this regard. Therefore, there is no basis to \ncontend that the present suit was finally over and that the present \napplications are not maintainable. The judgments relied upon by the \ndefendant in this regard are therefore, not applicable. \n24. \nAccordingly, I proceed to consider the aforesaid applications on \nmerits.  \n25. \nSenior counsel on behalf of the defendant contends that the \ndocuments sought by the plaintiffs by virtue of these applications have no \nrelevance and the plaintiffs are seeking to conduct a fresh trial in the suit \nwhich stood completed with the report of the Local Commissioner being \nfiled.  However, the aforesaid submission overlooks the fact that in terms of \nparagraph 126 of the judgment dated 26th November, 2018, this Court had \nheld that the plaintiffs are entitled to verification of the accounts so rendered \nby the independent auditor in respect of the net revenue earned from the \nmanufacture and sale of the products sold under the trademark \n„TERAMAX‟ by the defendant. Further, the plaintiffs were also entitled to \nfile objections to the report of the independent auditor appointed by the \nCourt. The aforesaid verification could only be done by the plaintiffs and/or \nthe objections could only be filed by the plaintiffs, on the basis of the \ndocuments furnished by the defendant to the independent auditor. Therefore, \nthe intent of the Court in the judgment dated 26th November, 2018 was clear \nthat the plaintiffs be provided the complete accounts of the defendant so that \nthe plaintiffs could verify the net revenue earned on account of sale of \nwriting instruments under the mark „TERAMAX‟  \n26. \n In the order dated 18th July, 2019 passed in the present suit, it was \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 14:36:32\nSignature Not Verified",
          "pdf_source": "22. Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD.pdf",
          "nodes": []
        },
        {
          "title": "Page 11",
          "node_id": "0013",
          "start_index": 11,
          "end_index": 11,
          "summary": "According to page 11 of the PDF \"22. Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD.pdf\", the defendant claimed a total turnover of Rs.69,08,80,592/- for the period of January, 2017 to August, 2018, but incurred a loss of Rs.1,81,40,552/- in respect of \"TERAMAX\" products. The independent auditor's report disallowed several expenses loaded by the defendant to show a loss. The Court directed the parties to proceed with the trial on the issue of the defendant's accounts, allowing the plaintiffs to cross-examine the defendant's witness. The defendant supplied documents to the independent auditor, which were deemed material and relevant for determining the amounts payable to the plaintiffs. The case, CS(COMM) 1120/2016, had judgment reserved on February 2, 2023, and delivered on February 10, 2023. (Source: 2023/DHC/000965)",
          "content": "2023/DHC/000965 \n \nCS(COMM) 1120/2016                                                                                                 Page 11 of 14 \n \nspecifically noted that no purpose would be served by permitting parties to \nfile objections to the Local Commissioner‟s report and therefore, parties \nwere directed to lead evidence on the accounts of the defendant  \n27. \nIn the affidavit of evidence filed on behalf of the defendant, the \ndefendant has claimed a total turnover of Rs.69,08,80,592/- for the period of \nJanuary, 2017 to August, 2018, yet a loss of Rs.1,81,40,552/- has been \nclaimed for the aforesaid period in respect of sale of „TERAMAX‟ products. \nAlong with the said affidavit, the defendant has also filed statements of \nprofitability so as to justify the aforesaid loss. However, the defendant has \nfailed to provide any explanation in the affidavit as to how a loss of Rs.1.81 \ncrore was incurred by the defendant despite having a turnover of Rs.69 \ncrores in respect of „TERAMAX‟ pens. It has been observed in the report of \nthe independent auditor, the defendant has loaded various expenses so as to \nshow a loss of about Rs.1.81 crore in respect of „TERAMAX‟ pens.  A \nwhole lot of these expenses have been disallowed by the independent \nauditor.   \n28. \nAs noted in the order dated 18th July, 2019 passed by this Court, the \nparties were to proceed for trial on the issue of the accounts of the \ndefendant. Indisputably, once the parties are going for trial on the issue of \naccounts of the defendant, the plaintiffs would have the right to cross-\nexamine the witness of the defendant on its accounts.   \n29. \nIn view of the fact that the defendant has supplied the said documents \nto the independent auditor and on the basis of those documents the auditor \nhas prepared his report means that the said documents are material and \nrelevant for the purposes of determining the amounts payable by the \ndefendant to the plaintiffs in terms of the judgment passed by this Court on \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 14:36:32\nSignature Not Verified",
          "pdf_source": "22. Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD.pdf",
          "nodes": []
        },
        {
          "title": "Page 12",
          "node_id": "0014",
          "start_index": 12,
          "end_index": 12,
          "summary": "According to page 12 of the PDF \"22. Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD.pdf\" (2023/DHC/000965), the plaintiffs are justified in seeking access to documents submitted by the defendant to the independent auditor. The court refers to the case of Ellora Industries v. Banarsi Das Goela (1979) to elucidate the principle of granting an account of profits. A decree for rendition of accounts has been passed in favor of the plaintiffs, and the defendant is duty-bound to provide true and fair accounts for the period January 1, 2017, to August 31, 2018. The defendant's plea of confidentiality is rejected, as it would frustrate the purpose of the trial. The judgment was reserved on February 2, 2023, and delivered on February 10, 2023. (Source: 2023/DHC/000965, page 12)",
          "content": "2023/DHC/000965 \n \nCS(COMM) 1120/2016                                                                                                 Page 12 of 14 \n \n26th November, 2018. Therefore, the plaintiffs are justified in seeking access \nto the documents that were submitted by the defendant before the \nindependent auditor appointed by the Court. \n30. \nIn Ellora Industries v. Banarsi Das Goela, 1979 SCC OnLine Del \n198, a Co-ordinate Bench of this Court has elucidated one of the principles \nfor grant of account of profits, which is set out below: \n“50. Thirdly, the courts order an account of profits on the theory that \nthe defendant was constructively an agent of the plaintiff in \ndisposing of goods in a manner infringing the plaintiff's rights \n[Snell—Principles of Equity (24th ed. 1954) p. 574]. The principle \nupon which the court grants an account of profits is that where \none party owes a duty to another, the person to whom the duty is \nowed is entitled to recover from the other party every benefit which \nthat other party has received by virtue of his fiduciary position if in \nfact he has obtained it without the knowledge or consent of the \nparty to whom he owed the duty (Kerly—Law of Trade Marks 10th \ned. p. 344)....” \n \n31. \nIn the present case, a decree for rendition of accounts has already \nbeen passed in favour of the plaintiffs and against the defendant. Therefore, \nthe defendant is duty bound to offer true and fair rendition of accounts \npertaining to the net revenue earned on account of sale of pens under the \nmark „TERAMAX‟ for the period 1st January, 2017 to 31st August, 2018 \nplaced before the auditor.   \n32. \nAs regards the plea of confidentiality taken by the defendant, in a suit \nfor rendition of accounts where accounts have to be rendered by a defendant, \nthe defendant cannot claim confidentiality in respect of its books of \naccounts. If such a plea is allowed it would frustrate the whole purpose of \nthe trial. No such plea was taken by the defendant at the time of supplying \nthe aforesaid documents to the independent auditor. Therefore, the defendant \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 14:36:32\nSignature Not Verified",
          "pdf_source": "22. Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0018",
      "start_index": 13,
      "end_index": 14,
      "summary": "According to the court document section from the PDF \"Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD.pdf\", the High Court of Delhi at New Delhi delivered a judgment on February 10, 2023, in the case CS(COMM) 1120/2016. The plaintiffs, Luxembourg Brands S.A R.L & ANR, were represented by Mr. Sanjeev Sindhwani, Sr. Advocate. The court allowed I.A.2479/2020, directing the Registry to supply the plaintiffs with documents from the independent auditor's report, as the defendant, G.M. Pens International Pvt Ltd, could not claim confidentiality for the documents.\n\nThe court noted that the defendant had previously violated a court order by continuing to manufacture and sell writing instruments under the trademark \"TERAMAX\" despite giving an undertaking, and costs of Rs. 5,00,000 were imposed on the defendant. The court also referred to a license agreement dated April 9, 2010, between the plaintiffs and the defendant, which obligated the defendant to maintain records and disclose them to the plaintiffs.\n\nThe court dismissed I.A.2480/2020, as the plaintiffs had not provided justification for demanding information from the defendant for the years 2013-14 to 2015-16. The case was listed for further proceedings on March 2, 2023, before the Joint Registrar. The judgment was delivered by Amit Bansal, J., and digitally signed on February 10, 2023. (Source: 2023/DHC/000965, PDF)",
      "pdf_source": "22. Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD.pdf",
      "nodes": [
        {
          "title": "Page 13",
          "node_id": "0016",
          "start_index": 13,
          "end_index": 13,
          "summary": "According to page 13 of the PDF \"22. Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD.pdf\", the defendant's intention is to conceal relevant information from the Court. The Court had previously imposed costs of Rs. 5,00,000 on the defendant for violating an order. The defendant was a licensee of the plaintiffs until March 1, 2016, and was obliged to maintain records under the license agreement dated April 9, 2010. Clause 6.1 of the agreement required the defendant to keep accurate books and accounts, including invoices, financial information, and inventory. The Court noted that the defendant cannot claim confidentiality in providing these documents to the plaintiffs. The judgment was delivered on February 10, 2023, by the High Court of Delhi. (Source: 2023/DHC/000965, CS(COMM) 1120/2016)",
          "content": "2023/DHC/000965 \n \nCS(COMM) 1120/2016                                                                                                 Page 13 of 14 \n \nat this stage cannot claim any confidentiality in providing the aforesaid \ndocuments to the plaintiffs. Clearly, the intention of the defendant is to \nconceal relevant information from the Court. The conduct of the defendant \nhas been noted and deprecated in the judgment dated 26th November, 2018 \npassed by this Court. In fact, costs of Rs,5,00,000/- were imposed on the \ndefendant and two other respondents for violating the order passed by this \nCourt, by continuing to manufacture and sell the writing instruments under \nthe trademark „TERAMAX‟ despite giving an undertaking.  \n33. \nIt may also be pertinent to note here that till 1st March, 2016, the \ndefendant was a licensee of the plaintiffs and in terms of the license \nagreement dated 9th April, 2010, the defendant was obliged to maintain \nrecords in respect of invoices, financial information, inventory etc., and \ndisclose the same to the plaintiffs. The said records were to be maintained \ntill a period of three years after the termination of the license agreement.  \nThe relevant clause 6.1 of the license agreement dated 9th April, 2010 is set \nout below: \n “6.1 Records. Licensee shall keep full and accurate books and \naccounts of all transactions relating to this Agreement and the \nmanufacture and sale of Licensed Products in sufficient detail to \nenable Paper Mate Licensor to determine and verify Licensee’s \ncompliance with its obligations hereunder, including without \nlimiting the generality of the foregoing Licensee’s payment \nobligations to Paper Mate Licensor. Such records shall include \nwithout limitation documentation to support the information \nprovided in the royalty reports required under Section 5.3, invoices, \nfinancial information, inventory, manufacturing, quality control, \nand approval records. Licensee shall maintain all such records \nduring the Term of this Agreement and for a period of three (3) \nyears thereafter.” \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 14:36:32\nSignature Not Verified",
          "pdf_source": "22. Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD.pdf",
          "nodes": []
        },
        {
          "title": "Page 14",
          "node_id": "0017",
          "start_index": 14,
          "end_index": 14,
          "summary": "According to page 14 of the PDF \"22. Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD.pdf\", the court allowed I.A.2479/2020, directing the Registry to supply documents to the plaintiffs. The license agreement was terminated on March 1, 2016, and the records sought were within 3 years of termination, making them non-confidential. \n\nI.A.2480/2020 was dismissed as the plaintiffs had no justification for demanding information from 2013-14 to 2015-16. The relevant period for accounts was from January 1, 2017, to August 31, 2018, as per the November 26, 2018, judgment. The case was listed for further proceedings on March 2, 2023, before the Joint Registrar. Judge Amit Bansal delivered the judgment on February 10, 2023. (Source: 2023/DHC/000965, CS(COMM) 1120/2016)",
          "content": "2023/DHC/000965 \n \nCS(COMM) 1120/2016                                                                                                 Page 14 of 14 \n \n34. \nIn terms of the Clause 29 of the aforesaid agreement, the aforesaid \nclause and the obligations therein were to survive even after the termination \nof the agreement. Admittedly, in the present case the license agreement was \nterminated with effect from 1st March, 2016. The records sought by the \nplaintiffs in I.A.2479/2020 are within 3 years from the date of termination of \nthe license agreement and therefore, fall within the ambit of the aforesaid \nclause and the defendant cannot claim any confidentiality in respect of the \nsame. \n35. \nIn view of the discussion above, I.A.2479/2020 is allowed and the \nRegistry is directed to supply to the plaintiffs the entire set of documents \nthat are a part of the report of the independent auditor submitted to this \nCourt. \n36. \nNo justification has been provided by the plaintiffs for supply of \ndocuments/information as detailed in I.A.2480/2020.  As per the judgment \ndated 26th November, 2018, the relevant period for which the accounts were \nto be rendered by the defendant is from 1st January, 2017 to 31st August, \n2018.  Therefore, there is no justification for the plaintiffs to demand \ninformation pertaining to the years 2013-14 to 2015-16 from the defendant. \n37. \nTherefore, I do not find any merit in the same and the same is \ndismissed. \nCS(COMM) 1120/2016 \n38. \nList before the Joint Registrar for further proceedings on 2nd March, \n2023. \n \nAMIT BANSAL, J. \nFEBURARY 10, 2023/dk \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:10.02.2023 14:36:32\nSignature Not Verified",
          "pdf_source": "22. Luxembourg brands S.A.R.L. & ANR VS. G.M. PENS INTERNATIONAL PVT LTD.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-15T18:29:39.257148",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}