{
  "doc_name": "23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS",
  "pdf_source": "23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf",
  "metadata": {
    "document_name": "23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS",
    "source_pdf": "23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf",
    "judges": [
      "AMIT BANSAL"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "198/2022",
      "198/2022",
      "198/2022",
      "198/2022",
      "198/2022",
      "198/2022",
      "198/2022",
      "198/2022",
      "198/2022",
      "198/2022",
      "198/2022",
      "198/2022",
      "198/2022",
      "4963/2022",
      "1921/2023",
      "4963/2022"
    ],
    "dhc_numbers": [
      "2023/DHC/000868",
      "2023/DHC/000868",
      "2023/DHC/000868",
      "2023/DHC/000868",
      "2023/DHC/000868",
      "2023/DHC/000868",
      "2023/DHC/000868",
      "2023/DHC/000868",
      "2023/DHC/000868",
      "2023/DHC/000868",
      "2023/DHC/000868"
    ],
    "ia_numbers": [],
    "decision_date": "1 February, 2023",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      "Aktiebolaget Volvo (AB Volvo)",
      "Volvo Trademark Holding AB",
      "Volvo Car Corporation"
    ],
    "defendants": [
      "Volvo White Paints Industries"
    ],
    "appellants": [],
    "respondents": [],
    "plaintiff_advocates": [
      "Mr. Pravin Anand",
      "Ms. Vaishali Mittal",
      "Mr. Karan Kamra"
    ],
    "defendant_advocates": [],
    "appellant_advocates": [],
    "respondent_advocates": [],
    "damages_claimed": "5,00,000",
    "damages_awarded": null,
    "key_issues": [
      "Infringement of trademarks by the defendants, specifically the use of the \"VOLVO\" mark, is a key legal issue in this case.",
      "The plaintiffs' claim of passing off their goods as that of the defendants is another major legal issue.",
      "The validity and enforceability of the global deed of assignment executed by plaintiff no.1 in favor of plaintiff no.2 are also at question.",
      "The licensing agreement between the plaintiffs for the use of the \"VOLVO\" trademark is a relevant legal issue.",
      "The plaintiffs' status as the registered proprietor of the \"VOLVO\" trademark and various \"VOLVO\" formative marks in different classes is a crucial aspect of the case.",
      "The plaintiffs' claim that their \"VOLVO\" marks have acquired the status of \"well-known trademarks\" under the Trade Marks Act, 1999, is a significant legal issue.",
      "The defendants' alleged unauthorized use of the \"VOLVO\" trademark, including the use of similar domain names, is another key legal issue.",
      "The plaintiffs' entitlement to relief, including permanent injunction and other ancillary reliefs, is a major legal issue in this case.",
      "The applicability of Section 2(1)(zg) of the Trade Marks Act, 1999, which defines \"well-known trademarks\", is also a relevant legal issue."
    ],
    "decision_summary": "**Case Summary: Aktiebolaget Volvo & Ors. v. Volvo White Paints Industries & Ors.**\n\n**Background:**\n\nThe plaintiffs, Aktiebolaget Volvo, Volvo Trademark Holding AB, and Volvo Car Corporation, are Swedish companies that manufacture and sell vehicles, spare parts, and accessories under the trademark \"VOLVO\". The defendants, Volvo White Paints Industries, a partnership firm, and its partners, were found to be using the trade name \"Volvo White Paints Industries\" and operating the domain name \"www.volvowhite.com\" for their business of manufacturing and selling products like wall putty, tile adhesive, and gypsum plaster.\n\n**Legal Issues:**\n\nThe plaintiffs filed a suit seeking relief of permanent injunction restraining the defendants from infringing their trademarks, passing off their goods as those of the plaintiffs, and other ancillary reliefs. The main legal issues in the case were:\n\n1. Whether the defendants' use of the trade name \"Volvo White Paints Industries\" and the domain name \"www.volvowhite.com\" infringed the plaintiffs' registered and well-known trademark \"VOLVO\".\n2. Whether the defendants' actions constituted passing off their goods as those of the plaintiffs.\n\n**Arguments:**\n\nThe plaintiffs argued that their trademark \"VOLVO\" was a well-known mark, registered in various classes, including Classes 1, 2, 16, and 37, and that the defendants' use of the similar mark \"Volvo White Paints Industries\" was likely to cause confusion and dilute the distinctiveness of their mark. The plaintiffs also contended that the defendants' actions were a clear case of passing off, as they were trying to benefit from the reputation and goodwill of the plaintiffs' mark.\n\nThe defendants did not appear in court to argue their case.\n\n**Court Findings:**\n\nThe court found that the plaintiffs had established a strong case of trademark infringement and passing off. The court observed that the plaintiffs' trademark \"VOLVO\" was a well-known mark, and the defendants' use of a similar mark was likely to cause confusion and deception among consumers. The court also noted that the defendants' actions were not bonafide, as they had no legitimate reason to use the mark \"VOLVO\" in their trade name and domain name.\n\n**Decision:**\n\nThe court granted a permanent injunction restraining the defendants from using the trade name \"Volvo White Paints Industries\" and the domain name \"www.volvowhite.com\" or any other mark that was similar to the plaintiffs' trademark \"VOLVO\". The court also ordered the defendants to surrender all materials, including stationery, brochures, and website content, that bore the infringing mark. The court's decision was based on the principles of trademark law, including the protection of well-known marks and the prevention of passing off.\n\n**Key Takeaways:**\n\n1. The court recognized the plaintiffs' trademark \"VOLVO\" as a well-known mark, which entitled it to enhanced protection under the Trade Marks Act, 1999.\n2. The court held that the defendants' use of a similar mark was likely to cause confusion and dilute the distinctiveness of the plaintiffs' mark, and therefore, constituted trademark infringement.\n3. The court's decision highlights the importance of protecting intellectual property rights, including trademarks, and the need for businesses to conduct thorough searches and clearance before adopting a trade name or domain name.",
    "legal_precedents": [
      "In Anugya Gupta Ajay Kumar",
      "Sweden Volvo Steels Ltd"
    ],
    "full_text": "\n--- PAGE 1 ---\n \n2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 1 of 11 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n% \n \n \n \n     Reserved on :   1st February, 2023  \n            \n \n \n \n    Decided on   :   7th  February, 2023 \n+  \nCS(COMM) 198/2022 & I.A. 4963/2022(O-XXXIX R-1 & 2 of CPC) \n \n \nAKTIEBOLAGET VOLVO & ORS.  \n \n  ..... Plaintiffs \nThrough: \nMr. Pravin Anand with Ms. Vaishali \nMittal \nand \nMr. \nKaran \nKamra, \nAdvocates. \n \n \n \n \nversus \n \n \nVOLVO WHITE PAINTS INDUSTRIES & ORS.   ..... Defendants \n \n \n \n \nThrough: \nNone. \n \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nJUDGMENT \n \nI.A. 1921/2023 (O-XIII A R-2, 3 & 6 of CPC for Summary Judgment) & \nCS(COMM) 198/2022  \n \n1. \nThe present suit has been filed seeking relief of permanent injunction \nrestraining the defendants from infringing the trademarks of the plaintiffs, \npassing off their goods as that of the plaintiffs‟ and other ancillary reliefs. \nPLEADINGS IN THE PLAINT \n2. \nThe case set up by the plaintiffs in the plaint is as follows: \n2.1. Plaintiff no.1, AB Volvo, plaintiff no.2, Volvo Trademark Holding \nAB and plaintiff no.3, Volvo Car Corporation (hereinafter collectively \nreferred to as „the plaintiffs‟), incorporated under the laws of Sweden, have \ntheir core business in transportation and automotive sector, including the \nbusiness of manufacturing spare parts, accessories and ancillary parts for \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified\n\n--- PAGE 2 ---\n \n2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 2 of 11 \n \nvehicles under the trademark „VOLVO‟. \n2.2. Plaintiff no.1, incorporated on 5th May, 1915, executed a global deed \nof assignment in favour of plaintiff no.2, who became the subsequent \nproprietor of the plaintiffs‟ trademark „VOLVO‟ and subsequently licensed \nthe use of the trademark „VOLVO‟ to plaintiffs no.1 and 3 in relation to \ntheir respective businesses.  \n2.3. Plaintiff no.1 is an international automotive and transport vehicle \ngroup and employs approximately 1,15,000 persons worldwide. Plaintiff \nno.1 provides a wide spectrum of transportation related products and \nservices, with superior quality and high standards of safety and \nenvironmental care to customers.  \n2.4. The plaintiffs established an Indian flagship company, Volvo India \nPvt. Ltd. in 1996 and launched their first „VOLVO‟ bus in India in 2001, \nfollowed by two car models in 2007. Plaintiffs sold almost 1361 cars in \nIndia in the year 2020. \n2.5. The plaintiffs are the registered proprietor of the trademark „VOLVO‟ \nand „VOLVO‟ formative marks in Classes 1, 2, 16, 37 and various other \nClasses of the Trade Marks Act, 1999. The earliest registration for the word \nmark „VOLVO‟ dates back to the year 1977. Details of the trademarks \nregistrations of the plaintiffs‟ „VOLVO‟ marks in India have been tabulated \nat page no. 145 to 148 of the plaintiffs‟ documents filed with the plaint. The \nsaid marks of the plaintiffs are also registered by the plaintiffs in various \nforeign countries.  \n2.6. The plaintiffs‟ „VOLVO‟ marks have acquired the status of „well-\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified\n\n--- PAGE 3 ---\n \n2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 3 of 11 \n \nknown trademarks‟ within the meaning of Section 2(1)(zg) of the Trade \nMarks Act, 1999, which fact is recognised in the judgment of Aktiebolaget \nVolvo of Sweden v. Volvo Steels Ltd. of Gujarat (India), (1998) 18 PTC 47. \n2.7. The plaintiffs are the registered domain name holders of the website, \n„www.volvobuses.com‟ and „www.volvobuses.in‟ catering to their segment \nof customers in India with the „.in‟ domain name. Additionally, the plaintiffs \nalso hold the registration of the domain name „www.volvotrucks.in‟. \n2.8. Defendant no.1, Volvo White Paints Industries, is believed to be a \npartnership firm comprising the defendant no.2 and defendant no.3 \n(hereinafter collectively referred to as „the defendants‟).  \n2.9. In September, 2021, the plaintiffs got the knowledge that the \ndefendants through the defendant no.1 were engaged in the business of \nmanufacturing, dealing, selling/supplying products like wall putty, tile \nadhesive, LWC, Gypsum plaster etc., under the trade name „Volvo White \nPaints Industries‟. Pursuant thereto, the plaintiffs availed the services of an \ninvestigator in September - October 2021, to ascertain the business activities \nof the defendants as mentioned on their website.  \n2.10. The investigation confirmed that the defendants are infringing the \nplaintiffs‟ registered and „well-known trademark‟ „VOLVO‟ as a part of \ntheir trade name „Volvo White Paints Industries‟ and in relation to their \nbusiness activities. The defendants also operate the impugned domain name \n„www.volvowhite.com‟, \nwhich \ndisplays \nand \nuse \nthe \nmark, \n as part of its trade name and uses the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified\n\n--- PAGE 4 ---\n \n2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 4 of 11 \n \nplaintiffs‟   mark   in  the   meta-tags associated with the domain name, \nsource code of the website hosted on the domain name. The defendants‟ \nemail \nIds \n„info@volvowhite.com‟, \n„sales@volvowhite.com‟ \nand \n„volvowhitepaints@gmail.com‟ also infringe the plaintiffs‟ mark. The \npackaging of the products of the defendant no.1 also bears the marks, \nVOLVO White Wall Putty, VOLVO White Tile adhesive, VOLVO White \nLWC, etc. which infringes the plaintiffs‟ registered and „well-known \ntrademark‟ „VOLVO‟.  \n2.11. The use of the mark „VOLVO‟ of the plaintiffs by the defendants in \nits trade name is intended to pass off the goods of the defendants as that of \nthe plaintiffs‟. \n2.12. An application for registration of the trademark „VOLVO WHITE‟ \n(device) in Class 2 has been made by the defendants on a „proposed to be \nused basis‟, the status of which is reflected as „objected to‟ on the website of \nIndian Trademark Registry. \n2.13. Accordingly, the plaintiffs have filed the present suit. \nPROCEEDINGS IN THE SUIT \n3. \nThis Court, vide order dated 31st March, 2022 granted an ex parte ad \ninterim injunction in favour of the plaintiffs under I.A.4963/2022, \nrestraining the defendants from using the mark „VOLVO‟. The relevant \nportion of the said order is as under: \n“25. Having heard learned counsel appearing on behalf of the \nPlaintiffs, this Court is of the view that Plaintiffs have made \nout a prima facie case for grant of ex parte ad-interim \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified\n\n--- PAGE 5 ---\n \n2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 5 of 11 \n \ninjunction. Balance of convenience lies in favour of the \nPlaintiffs and they are likely to suffer irreparable harm in case \nthe injunction, as prayed for, is not granted.  \n26. Accordingly, Defendants, their subsidiaries, affiliates, \nfranchisees, \nproprietors, \nofficers, \nservants, \nagents, \ndistributors, stockists, representatives and anyone acting for \nor on their behalf are hereby restrained from using the \nPlaintiffs’ name/trademark ‘VOLVO’ and/or any other \nname/trademark confusingly or deceptively similar there to, \nin relation to their business activities of manufacturing, \nselling and/or supplying, distribution and dealing in Wall \nPutty, Tile Adhesive, LWC, Gypsum Plaster, Exterior Cement \nPaint products etc or in relation to any other goods or \nservices, in any manner, including but not limited to the \ntrade name ‘VOLVO White Industries’; impugned domain \nname, www.volvowhite.com; in the meta-tags associated with \nthe website; the source code of website hosted on the \nimpugned domain name; as a part of the email ids \ninfo@volvowhite.com, \nsales@volvowhite.com \nand \nvolvowhitepaints@gmail.com; third party listings, references \nin social media and/or any representation made by the \nDefendants, their affiliates, subsidiaries and on their behalf, \nin terms of relief sought in paragraph 78 (i) of the present \napplication.” \n4. \nVide the aforesaid order, two Local Commissioners were also \nappointed by this Court to seize and inventorize the infringing goods bearing \nthe mark „VOLVO‟. The Local Commissioners found a large stock of \ninfringing goods at the premises of the defendants, which were inventorized \nby them and seized and handed over on supardari to the defendants. The \nreports of the Local Commissioners have been placed on record. \n5. \nOffice report notes that the defendants no.1, 2 and 3 were served \nthrough e-mail and WhatsApp. An affidavit of service has been filed on \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified\n\n--- PAGE 6 ---\n \n2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 6 of 11 \n \nbehalf of the plaintiffs. As per the affidavit of service filed on behalf of the \nplaintiffs, the defendants were served through speed post, courier and e-\nmail. The original speed post, courier receipts, tracking report and proof of \nservice via e-mail have been filed along with the said affidavit. \nConsequently, the defendants were proceeded against ex parte on 28th July, \n2022. \n6. \nIn view of the above, the counsel for the plaintiffs has filed the \npresent application under Order XIII A Rules 2, 3 and 6 of the CPC for \npassing of a summary judgment.  \n7. \nCounsel for the plaintiffs places reliance on the judgment of this \nCourt in EBAY Inc. v. Mohd. Waseem, 2022 SCC OnLine Del 3879 to \ncontend that in the event the defendants have failed to appear in the \nproceedings and voluntarily chosen not to respond to the plaint, it is \nindicative of the fact that the defendants have nothing substantial to urge, by \nway of a response to the allegations in the plaint. Counsel for the plaintiffs \nsubmits that this is a fit case where a Summary Judgment in terms of Order \nXIII-A of the Code of Civil Procedure, as applicable to commercial disputes \nof a specified value, read with Rule 27 of the Delhi High Court Intellectual \nProperty Rights Division Rules, 2022 (in short, „IPD Rules‟), deserves to be \npassed in favour of the plaintiffs and against the defendants.  \nANALYSIS AND FINDINGS \n8. \nI have heard the counsel for the plaintiffs and perused the record of \nthe case. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified\n\n--- PAGE 7 ---\n \n2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 7 of 11 \n \n9. \nFrom the averments made in the plaint and the documents filed \ntherewith, the plaintiffs have been able to prove that they are the registered \nproprietors of the mark „VOLVO‟. The plaintiffs have also been able to \nshow their goodwill and reputation in respect of the mark „VOLVO‟ not \nonly internationally but in India as well. The mark has acquired the status of \na „well-known trademark‟ in terms of section 2(zg) of the Trade Marks Act, \n1999. The defendants have used the word mark „VOLVO‟ in its trade name, \nwhich is identical to the plaintiffs‟ name, to ride on the goodwill and \nreputation of the mark of the plaintiffs. The acts of the defendants amount to \ninfringement of the mark of the plaintiffs and passing off the goods of the \ndefendants as that of the plaintiffs. The defendants have not only taken \nunfair advantage of the reputation and goodwill of the plaintiffs‟ mark but \nalso deceive unwary consumers of their association with the plaintiffs. Such \nacts of the defendants would also lead to dilution of the plaintiffs‟ mark. \n10. \nThe domain name of the defendants is also deceptively similar to that \nof the plaintiffs and is likely to deceive the public of its association with the \nplaintiffs. In Anugya Gupta v. Ajay Kumar and Anr., 2022 SCC OnLine \nDel 1922, this Court applying the principles of the trade mark law has held \nthat the right of a proprietor in a domain name is entitled to equal protection. \nThe user traffic may be diverted due to the use of the same or similar \ndomain name, which could result in a user mistakenly accessing one domain \nname instead of the one intended. A domain name may therefore, have all \nthe characteristics of a trademark and could result in an act of passing off. \nSimilarly, the use of „Volvo White Paints Industries‟ as a part of their trade \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified\n\n--- PAGE 8 ---\n \n2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 8 of 11 \n \nname/corporate name is also likely to deceive unwary consumers of their \nassociation with the plaintiffs. \n11. \nAt this stage, it may be relevant to note that the defendants have been \nserved through speed post, courier and e-mail. Moreover, the fact that local \ncommissions were executed at the premises of the defendants would show \nthat the defendants are aware of the pendency of the present suits. Despite \nthe above, the defendants have failed to enter appearance in the suit and \nhence, were proceeded against ex parte on 28th July 2022.  \n12. \nPlaintiffs have established statutory as well as common law rights on \naccount of the long usage of the „VOLVO‟ marks. The plaintiffs would be \ngravely prejudiced if the defendants are permitted to use the impugned trade \nname and marks. Since the defendants have failed to enter appearance or \neven take any steps requisite to contest the present suit, despite having \nsuffered an ad interim injunction order, it is evident that they have no \ndefence to put forth on merits. The plaint is duly supported by the affidavit \nof the plaintiffs. I am of the opinion that no purpose would be served by \ndirecting the plaintiffs to lead ex parte evidence by filing an affidavit of \nexamination in chief. Therefore, in my opinion, this is a fit case where a \nSummary Judgment in terms of Order XIII-A of the CPC, as applicable to \ncommercial disputes of a specified value, read with Rule 27 of the IPD \nRules, deserves to be passed in favour of the plaintiffs and against the \ndefendants. Reference in this regard may be made to the judgment in Su-\nKam Power Systems Ltd. v. Kunwer Sachdev, 2019 SCC OnLine Del \n10764, has observed as under: \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified\n\n--- PAGE 9 ---\n \n2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 9 of 11 \n \n“90. To reiterate, the intent behind incorporating the summary \njudgment procedure in the Commercial Court Act, 2015 is to \nensure disposal of commercial disputes in a time-bound \nmanner. In fact, the applicability of Order XIIIA, CPC to \ncommercial disputes, demonstrates that the trial is no longer \nthe default procedure/norm. \n91. Rule 3 of Order XIIIA, CPC, as applicable to commercial \ndisputes, empowers the Court to grant a summary judgement \nagainst the defendant where the Court considers that the \ndefendant has no real prospects of successfully defending the \nclaim and there is no other compelling reason why the claim \nshould not be disposed of before recording of oral evidence. \nThe expression “real” directs the Court to examine whether \nthere is a “realistic” as opposed to “fanciful” prospects of \nsuccess. This Court is of the view that the expression “no \ngenuine issue requiring a trial” in Ontario Rules of Civil \nProcedure and “no other compelling reason…..for trial” in \nCommercial Courts Act can be read mutatis mutandis. \nConsequently, Order XIIIA, CPC would be attracted if the \nCourt, while hearing such an application, can make the \nnecessary finding of fact, apply the law to the facts and the \nsame is a proportionate, more expeditious and less expensive \nmeans of achieving a fair and just result. \n92. Accordingly, unlike ordinary suits, Courts need not hold \ntrial in commercial suits, even if there are disputed questions \nof fact as held by the Canadian Supreme Court in Robert \nHryniak (supra), in the event, the Court comes to the \nconclusion that the defendant lacks a real prospect of \nsuccessfully defending the claim.” \n13. \nThe aforesaid principles are fully applicable in the facts and \ncircumstances of the present case and therefore, the plaintiffs are entitled to \na summary judgment.  \n14. \nIn view of the above, the present application is allowed. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified\n\n--- PAGE 10 ---\n \n2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 10 of 11 \n \nRELIEF \n15. \nThe various registrations and the long usage of the mark „VOLVO‟ by \nthe plaintiffs, as also the goodwill vesting in the mark „VOLVO‟, entitles the \nplaintiffs for grant of permanent injunction and decree in terms of the plaint.  \n16. \nAccordingly, the present suit is decreed in terms of prayer clauses „i‟, \n„ii‟, „iii‟ and „iv‟ of the plaint. \n17. \nSince the defendants have not appeared and rendered any accounts of \nprofits, the said relief as sought in prayer clauses „vii‟ cannot be granted. \nInsofar as delivery up for the purpose of destruction, as sought in prayer \nclause „v‟ is concerned, the representatives of the plaintiffs are permitted to \nvisit the premises of the defendants, where the inventory is lying and take \nseizure of the infringing products for the purpose of destruction.  \n18. \nInsofar as the relief of damages as sought in prayer clause „vi‟ is \nconcerned, reference may be made to the judgment in Hindustan Lever Ltd. \nv. Satish Kumar, 2012 SCC OnLine Del 1378. The relevant observations \nare set out below: \n“23. One of the reasons for granting relief of punitive damages \nis that despite of service of summons/notice, the defendant had \nchosen not to appear before the court. It shows that the \ndefendant is aware of the illegal activities otherwise, he ought \nto have attended the proceedings and give justification for the \nsaid illegal acts. Since, the defendant has maintained silence, \ntherefore, the guilt of the defendant speaks for itself and the \ncourt, under these circumstances, feels that in order to avoid \nfuture infringement, relief of punitive damages is to be granted \nin favour of the plaintiff.” \n19. \nIn the present case, the defendants have blatantly infringed the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified\n\n--- PAGE 11 ---\n \n2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 11 of 11 \n \ntrademark of the plaintiffs and have also failed to appear before this Court. \nApplying the above principles and considering the large quantum of \nproducts that have been seized by the Local Commissioners, the plaintiffs \nare entitled to damages of Rs.5,00,000. \n20. \nAs regard, the prayer clause „viii‟, counsel for the plaintiffs has filed a \nstatement of costs. The statement of costs shows that Rs.4,51,500/- has \nalready been incurred for court fees and the fees of the Local \nCommissioners. In addition, it is claimed that expenses to the tune of Rs. \n1,33,599/- have been incurred and Rs.4,53,707/- is the legal fees. This Court \nis convinced that this is a fit case for award of actual costs to the plaintiffs.  \nAccordingly, Rs.10,00,000/- is awarded to the plaintiffs as costs to be paid \nby the defendants.  \n21. \nLet the decree sheet be drawn up.  \n22. \nAll applications are disposed of in the above terms.  \n \n \nAMIT BANSAL, J. \nFEBRUARY 07, 2023 \nat \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified\n"
  },
  "total_pages": 11,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "According to the PDF document \"AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf\", the case header and parties are as follows:\n\nThe High Court of Delhi at New Delhi heard the case CS(COMM) 198/2022, reserved on February 1, 2023, and decided on February 7, 2023. The plaintiffs, Aktiebolaget Volvo and others, were represented by Mr. Pravin Anand, Ms. Vaishali Mittal, and Mr. Karan Kamra, advocates. The defendants, Volvo White Paints Industries and others, had no representation.\n\nThe plaintiffs sought relief of permanent injunction restraining the defendants from infringing their trademarks, passing off their goods, and other ancillary reliefs. The plaintiffs claimed to be the registered proprietors of the trademark \"VOLVO\" and \"VOLVO\" formative marks in various classes of the Trade Marks Act, 1999, with the earliest registration dating back to 1977.\n\nThe plaintiffs, incorporated under Swedish laws, have their core business in the transportation and automotive sector, manufacturing spare parts, accessories, and ancillary parts for vehicles under the trademark \"VOLVO\". The plaintiffs established an Indian flagship company in 1996 and launched their first \"VOLVO\" bus in India in 2001, followed by two car models in 2007, selling almost 1361 cars in India in 2020.\n\nThe court's judgment was digitally signed by Hon'ble Mr. Justice Amit Bansal on February 7, 2023. (Source: PDF document \"AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf\")",
      "pdf_source": "23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "According to page 1 of the PDF \"23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf\", the case CS(COMM) 198/2022 was decided on February 7, 2023, by Hon'ble Mr. Justice Amit Bansal. The plaintiffs, Aktiebolaget Volvo and others, sought relief of permanent injunction against the defendants, Volvo White Paints Industries and others, for trademark infringement and passing off. The plaintiffs, incorporated under Swedish law, are in the transportation and automotive sector. The case was reserved on February 1, 2023, and the judgment was digitally signed by Amit Bansal on February 7, 2023. The plaintiffs were represented by Mr. Pravin Anand and others, while the defendants had no representation. (Source: 23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf, page 1)",
          "content": "2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 1 of 11 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n% \n \n \n \n     Reserved on :   1st February, 2023  \n            \n \n \n \n    Decided on   :   7th  February, 2023 \n+  \nCS(COMM) 198/2022 & I.A. 4963/2022(O-XXXIX R-1 & 2 of CPC) \n \n \nAKTIEBOLAGET VOLVO & ORS.  \n \n  ..... Plaintiffs \nThrough: \nMr. Pravin Anand with Ms. Vaishali \nMittal \nand \nMr. \nKaran \nKamra, \nAdvocates. \n \n \n \n \nversus \n \n \nVOLVO WHITE PAINTS INDUSTRIES & ORS.   ..... Defendants \n \n \n \n \nThrough: \nNone. \n \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nJUDGMENT \n \nI.A. 1921/2023 (O-XIII A R-2, 3 & 6 of CPC for Summary Judgment) & \nCS(COMM) 198/2022  \n \n1. \nThe present suit has been filed seeking relief of permanent injunction \nrestraining the defendants from infringing the trademarks of the plaintiffs, \npassing off their goods as that of the plaintiffs‟ and other ancillary reliefs. \nPLEADINGS IN THE PLAINT \n2. \nThe case set up by the plaintiffs in the plaint is as follows: \n2.1. Plaintiff no.1, AB Volvo, plaintiff no.2, Volvo Trademark Holding \nAB and plaintiff no.3, Volvo Car Corporation (hereinafter collectively \nreferred to as „the plaintiffs‟), incorporated under the laws of Sweden, have \ntheir core business in transportation and automotive sector, including the \nbusiness of manufacturing spare parts, accessories and ancillary parts for \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified",
          "pdf_source": "23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "According to page 2 of the PDF \"23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf\", the plaintiffs, Aktiebolaget Volvo and others, are the registered proprietors of the trademark \"VOLVO\" in various classes, with the earliest registration dating back to 1977. The plaintiffs have established an Indian flagship company, Volvo India Pvt. Ltd., and have sold approximately 1361 cars in India in 2020. The plaintiffs' \"VOLVO\" marks have acquired the status of \"well-known\" trademarks. The case, CS(COMM) 198/2022, was reserved on February 1, 2023, and decided on February 7, 2023. The plaintiffs are represented by advocates Mr. Pravin Anand, Ms. Vaishali Mittal, and Mr. Karan Kamra. The PDF source provides details of the trademark registrations and the plaintiffs' business operations in India.",
          "content": "2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 2 of 11 \n \nvehicles under the trademark „VOLVO‟. \n2.2. Plaintiff no.1, incorporated on 5th May, 1915, executed a global deed \nof assignment in favour of plaintiff no.2, who became the subsequent \nproprietor of the plaintiffs‟ trademark „VOLVO‟ and subsequently licensed \nthe use of the trademark „VOLVO‟ to plaintiffs no.1 and 3 in relation to \ntheir respective businesses.  \n2.3. Plaintiff no.1 is an international automotive and transport vehicle \ngroup and employs approximately 1,15,000 persons worldwide. Plaintiff \nno.1 provides a wide spectrum of transportation related products and \nservices, with superior quality and high standards of safety and \nenvironmental care to customers.  \n2.4. The plaintiffs established an Indian flagship company, Volvo India \nPvt. Ltd. in 1996 and launched their first „VOLVO‟ bus in India in 2001, \nfollowed by two car models in 2007. Plaintiffs sold almost 1361 cars in \nIndia in the year 2020. \n2.5. The plaintiffs are the registered proprietor of the trademark „VOLVO‟ \nand „VOLVO‟ formative marks in Classes 1, 2, 16, 37 and various other \nClasses of the Trade Marks Act, 1999. The earliest registration for the word \nmark „VOLVO‟ dates back to the year 1977. Details of the trademarks \nregistrations of the plaintiffs‟ „VOLVO‟ marks in India have been tabulated \nat page no. 145 to 148 of the plaintiffs‟ documents filed with the plaint. The \nsaid marks of the plaintiffs are also registered by the plaintiffs in various \nforeign countries.  \n2.6. The plaintiffs‟ „VOLVO‟ marks have acquired the status of „well-\nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified",
          "pdf_source": "23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0007",
      "start_index": 3,
      "end_index": 5,
      "summary": "According to the PDF document \"AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf\", the High Court of Delhi at New Delhi heard a case (CS(COMM) 198/2022) between Aktiebolaget Volvo and others (plaintiffs) and Volvo White Paints Industries and others (defendants). The plaintiffs alleged that the defendants infringed their well-known trademark \"VOLVO\" by using it as part of their trade name and in relation to their business activities.\n\nThe court granted an ex parte ad interim injunction in favor of the plaintiffs on March 31, 2022, restraining the defendants from using the mark \"VOLVO\". The plaintiffs claimed that the defendants' use of the mark was intended to pass off their goods as those of the plaintiffs. The defendants had also applied for registration of the trademark \"VOLVO WHITE\" in Class 2, which was objected to by the Indian Trademark Registry.\n\nThe plaintiffs argued that they had made out a prima facie case for the grant of an ex parte ad interim injunction, and that the balance of convenience lay in their favor. The court agreed, stating that the plaintiffs would likely suffer irreparable harm if the injunction was not granted. The case was reserved on February 1, 2023, and decided on February 7, 2023. The PDF document provides further details on the case, including the proceedings, arguments, and decisions made by the court. (Source: AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf)",
      "pdf_source": "23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "According to page 3 of the PDF \"23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf\", the plaintiffs, Aktiebolaget Volvo, are the registered holders of well-known trademarks under Section 2(1)(zg) of the Trade Marks Act, 1999. They own domain names such as \"www.volvobuses.com\" and \"www.volvobuses.in\". The defendants, Volvo White Paints Industries, are allegedly infringing on the plaintiffs' trademark \"VOLVO\" as part of their trade name and operate the domain name \"www.volvowhite.com\". The investigation revealed that the defendants are manufacturing and selling products under the \"Volvo White Paints Industries\" name, violating the plaintiffs' trademark rights. The case, CS(COMM) 198/2022, was decided on February 7, 2023, in the High Court of Delhi. (Source: PDF page 3)",
          "content": "2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 3 of 11 \n \nknown trademarks‟ within the meaning of Section 2(1)(zg) of the Trade \nMarks Act, 1999, which fact is recognised in the judgment of Aktiebolaget \nVolvo of Sweden v. Volvo Steels Ltd. of Gujarat (India), (1998) 18 PTC 47. \n2.7. The plaintiffs are the registered domain name holders of the website, \n„www.volvobuses.com‟ and „www.volvobuses.in‟ catering to their segment \nof customers in India with the „.in‟ domain name. Additionally, the plaintiffs \nalso hold the registration of the domain name „www.volvotrucks.in‟. \n2.8. Defendant no.1, Volvo White Paints Industries, is believed to be a \npartnership firm comprising the defendant no.2 and defendant no.3 \n(hereinafter collectively referred to as „the defendants‟).  \n2.9. In September, 2021, the plaintiffs got the knowledge that the \ndefendants through the defendant no.1 were engaged in the business of \nmanufacturing, dealing, selling/supplying products like wall putty, tile \nadhesive, LWC, Gypsum plaster etc., under the trade name „Volvo White \nPaints Industries‟. Pursuant thereto, the plaintiffs availed the services of an \ninvestigator in September - October 2021, to ascertain the business activities \nof the defendants as mentioned on their website.  \n2.10. The investigation confirmed that the defendants are infringing the \nplaintiffs‟ registered and „well-known trademark‟ „VOLVO‟ as a part of \ntheir trade name „Volvo White Paints Industries‟ and in relation to their \nbusiness activities. The defendants also operate the impugned domain name \n„www.volvowhite.com‟, \nwhich \ndisplays \nand \nuse \nthe \nmark, \n as part of its trade name and uses the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified",
          "pdf_source": "23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "According to page 4 of the PDF \"23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf\", the plaintiffs, Aktiebolaget Volvo & Ors., allege that the defendants' use of the mark \"VOLVO\" in their trade name, meta-tags, and packaging infringes on the plaintiffs' registered and well-known trademark \"VOLVO\". The defendants had also applied for registration of the trademark \"VOLVO WHITE\" in Class 2, which was objected to by the Indian Trademark Registry.\n\nThe court granted an ex parte ad interim injunction in favor of the plaintiffs on March 31, 2022, restraining the defendants from using the mark \"VOLVO\". The case, CS(COMM) 198/2022, was reserved on February 1, 2023, and decided on February 7, 2023. The plaintiffs were represented by Mr. Pravin Anand and Ms. Vaishali Mittal, among others. (Source: 23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf, page 4)",
          "content": "2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 4 of 11 \n \nplaintiffs‟   mark   in  the   meta-tags associated with the domain name, \nsource code of the website hosted on the domain name. The defendants‟ \nemail \nIds \n„info@volvowhite.com‟, \n„sales@volvowhite.com‟ \nand \n„volvowhitepaints@gmail.com‟ also infringe the plaintiffs‟ mark. The \npackaging of the products of the defendant no.1 also bears the marks, \nVOLVO White Wall Putty, VOLVO White Tile adhesive, VOLVO White \nLWC, etc. which infringes the plaintiffs‟ registered and „well-known \ntrademark‟ „VOLVO‟.  \n2.11. The use of the mark „VOLVO‟ of the plaintiffs by the defendants in \nits trade name is intended to pass off the goods of the defendants as that of \nthe plaintiffs‟. \n2.12. An application for registration of the trademark „VOLVO WHITE‟ \n(device) in Class 2 has been made by the defendants on a „proposed to be \nused basis‟, the status of which is reflected as „objected to‟ on the website of \nIndian Trademark Registry. \n2.13. Accordingly, the plaintiffs have filed the present suit. \nPROCEEDINGS IN THE SUIT \n3. \nThis Court, vide order dated 31st March, 2022 granted an ex parte ad \ninterim injunction in favour of the plaintiffs under I.A.4963/2022, \nrestraining the defendants from using the mark „VOLVO‟. The relevant \nportion of the said order is as under: \n“25. Having heard learned counsel appearing on behalf of the \nPlaintiffs, this Court is of the view that Plaintiffs have made \nout a prima facie case for grant of ex parte ad-interim \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified",
          "pdf_source": "23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 5",
          "node_id": "0006",
          "start_index": 5,
          "end_index": 5,
          "summary": "According to page 5 of the PDF \"23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf\", the court granted an injunction in favor of the plaintiffs, Aktiebolaget Volvo & Ors., restraining the defendants from using the trademark \"VOLVO\" or any similar name in relation to their business activities. The court appointed two Local Commissioners to seize and inventorize infringing goods bearing the \"VOLVO\" mark, which were found at the defendants' premises. The reports of the Local Commissioners have been placed on record. The defendants were served through email and WhatsApp, and an affidavit of service has been filed. The court's decision was made on February 7, 2023, in the case CS(COMM) 198/2022. (Source: 23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf, page 5)",
          "content": "2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 5 of 11 \n \ninjunction. Balance of convenience lies in favour of the \nPlaintiffs and they are likely to suffer irreparable harm in case \nthe injunction, as prayed for, is not granted.  \n26. Accordingly, Defendants, their subsidiaries, affiliates, \nfranchisees, \nproprietors, \nofficers, \nservants, \nagents, \ndistributors, stockists, representatives and anyone acting for \nor on their behalf are hereby restrained from using the \nPlaintiffs’ name/trademark ‘VOLVO’ and/or any other \nname/trademark confusingly or deceptively similar there to, \nin relation to their business activities of manufacturing, \nselling and/or supplying, distribution and dealing in Wall \nPutty, Tile Adhesive, LWC, Gypsum Plaster, Exterior Cement \nPaint products etc or in relation to any other goods or \nservices, in any manner, including but not limited to the \ntrade name ‘VOLVO White Industries’; impugned domain \nname, www.volvowhite.com; in the meta-tags associated with \nthe website; the source code of website hosted on the \nimpugned domain name; as a part of the email ids \ninfo@volvowhite.com, \nsales@volvowhite.com \nand \nvolvowhitepaints@gmail.com; third party listings, references \nin social media and/or any representation made by the \nDefendants, their affiliates, subsidiaries and on their behalf, \nin terms of relief sought in paragraph 78 (i) of the present \napplication.” \n4. \nVide the aforesaid order, two Local Commissioners were also \nappointed by this Court to seize and inventorize the infringing goods bearing \nthe mark „VOLVO‟. The Local Commissioners found a large stock of \ninfringing goods at the premises of the defendants, which were inventorized \nby them and seized and handed over on supardari to the defendants. The \nreports of the Local Commissioners have been placed on record. \n5. \nOffice report notes that the defendants no.1, 2 and 3 were served \nthrough e-mail and WhatsApp. An affidavit of service has been filed on \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified",
          "pdf_source": "23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0012",
      "start_index": 6,
      "end_index": 9,
      "summary": "According to the PDF document \"AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf\", the legal proceedings involve a trademark infringement and passing off case. The plaintiffs, Aktiebolaget Volvo & Ors., filed a complaint against Vovlo White Paints Industries & Ors. in the High Court of Delhi at New Delhi (CS(COMM) 198/2022). The court reserved its judgment on February 1, 2023, and decided on February 7, 2023.\n\nThe plaintiffs' counsel, Mr. Pravin Anand, argued that the defendants had failed to respond to the plaint and had chosen not to appear in the proceedings, indicating that they had no substantial defense. The counsel relied on the judgment in EBAY Inc. v. Mohd. Waseem (2022 SCC OnLine Del 3879) to contend that a summary judgment should be passed in favor of the plaintiffs.\n\nThe court analyzed the case and found that the plaintiffs had proven their ownership of the \"VOLVO\" trademark and its goodwill and reputation in India and internationally. The defendants' use of the \"VOLVO\" mark in their trade name was deemed an infringement and passing off of the plaintiffs' goods. The court also found that the defendants' domain name was deceptively similar to the plaintiffs' domain name, which could lead to user confusion and diversion of traffic.\n\nThe court decided in favor of the plaintiffs, granting a summary judgment against the defendants. The details of the judgment, including any monetary awards or injunctions, are not specified in the provided section of the PDF document. (Source: AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf, pages 6-8)",
      "pdf_source": "23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf",
      "nodes": [
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "According to page 6 of the PDF \"23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf\", the defendants were served through speed post, courier, and email, but failed to respond. Consequently, they were proceeded against ex parte on July 28, 2022. The counsel for the plaintiffs, Mr. Pravin Anand, filed an application for a summary judgment under Order XIII A Rules 2, 3, and 6 of the CPC. The counsel relied on the judgment in EBAY Inc. v. Mohd. Waseem (2022 SCC OnLine Del 3879) to argue that the defendants' failure to respond indicates they have nothing substantial to urge against the allegations. The court heard the counsel for the plaintiffs and perused the record on February 1, 2023, and decided on February 7, 2023. (Source: 2023/DHC/000868, CS(COMM) 198/2022)",
          "content": "2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 6 of 11 \n \nbehalf of the plaintiffs. As per the affidavit of service filed on behalf of the \nplaintiffs, the defendants were served through speed post, courier and e-\nmail. The original speed post, courier receipts, tracking report and proof of \nservice via e-mail have been filed along with the said affidavit. \nConsequently, the defendants were proceeded against ex parte on 28th July, \n2022. \n6. \nIn view of the above, the counsel for the plaintiffs has filed the \npresent application under Order XIII A Rules 2, 3 and 6 of the CPC for \npassing of a summary judgment.  \n7. \nCounsel for the plaintiffs places reliance on the judgment of this \nCourt in EBAY Inc. v. Mohd. Waseem, 2022 SCC OnLine Del 3879 to \ncontend that in the event the defendants have failed to appear in the \nproceedings and voluntarily chosen not to respond to the plaint, it is \nindicative of the fact that the defendants have nothing substantial to urge, by \nway of a response to the allegations in the plaint. Counsel for the plaintiffs \nsubmits that this is a fit case where a Summary Judgment in terms of Order \nXIII-A of the Code of Civil Procedure, as applicable to commercial disputes \nof a specified value, read with Rule 27 of the Delhi High Court Intellectual \nProperty Rights Division Rules, 2022 (in short, „IPD Rules‟), deserves to be \npassed in favour of the plaintiffs and against the defendants.  \nANALYSIS AND FINDINGS \n8. \nI have heard the counsel for the plaintiffs and perused the record of \nthe case. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified",
          "pdf_source": "23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 7",
          "node_id": "0009",
          "start_index": 7,
          "end_index": 7,
          "summary": "According to page 7 of the PDF \"AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf\", the plaintiffs, Aktiebolaget Volvo & Ors., have proven to be the registered proprietors of the mark \"VOLVO\" with goodwill and reputation internationally and in India. The defendants' use of the word mark \"VOLVO\" in their trade name is considered infringement and passing off. The court also finds the defendants' domain name to be deceptively similar to the plaintiffs', which could lead to user confusion and diversion of traffic. The case, CS(COMM) 198/2022, was decided on February 7, 2023, by the High Court of Delhi. The plaintiffs were represented by Mr. Pravin Anand and Ms. Vaishali Mittal, among others. The court applied principles of trade mark law, citing a previous case, Anugya Gupta v. Ajay Kumar and Anr. (Source: 2023/DHC/000868, PDF page 7)",
          "content": "2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 7 of 11 \n \n9. \nFrom the averments made in the plaint and the documents filed \ntherewith, the plaintiffs have been able to prove that they are the registered \nproprietors of the mark „VOLVO‟. The plaintiffs have also been able to \nshow their goodwill and reputation in respect of the mark „VOLVO‟ not \nonly internationally but in India as well. The mark has acquired the status of \na „well-known trademark‟ in terms of section 2(zg) of the Trade Marks Act, \n1999. The defendants have used the word mark „VOLVO‟ in its trade name, \nwhich is identical to the plaintiffs‟ name, to ride on the goodwill and \nreputation of the mark of the plaintiffs. The acts of the defendants amount to \ninfringement of the mark of the plaintiffs and passing off the goods of the \ndefendants as that of the plaintiffs. The defendants have not only taken \nunfair advantage of the reputation and goodwill of the plaintiffs‟ mark but \nalso deceive unwary consumers of their association with the plaintiffs. Such \nacts of the defendants would also lead to dilution of the plaintiffs‟ mark. \n10. \nThe domain name of the defendants is also deceptively similar to that \nof the plaintiffs and is likely to deceive the public of its association with the \nplaintiffs. In Anugya Gupta v. Ajay Kumar and Anr., 2022 SCC OnLine \nDel 1922, this Court applying the principles of the trade mark law has held \nthat the right of a proprietor in a domain name is entitled to equal protection. \nThe user traffic may be diverted due to the use of the same or similar \ndomain name, which could result in a user mistakenly accessing one domain \nname instead of the one intended. A domain name may therefore, have all \nthe characteristics of a trademark and could result in an act of passing off. \nSimilarly, the use of „Volvo White Paints Industries‟ as a part of their trade \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified",
          "pdf_source": "23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 8",
          "node_id": "0010",
          "start_index": 8,
          "end_index": 8,
          "summary": "According to page 8 of the PDF \"23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf\", the plaintiffs (Aktiebolaget Volvo & Ors.) have established statutory and common law rights to the \"VOLVO\" marks due to long usage. The defendants (Vovlo White Paints Industries & Ors.) failed to enter appearance despite being served and aware of the suit's pendency. The court decided to pass a Summary Judgment in favor of the plaintiffs, as the defendants had no defense to put forth on merits. The judgment was passed on February 7, 2023, with reference to the Su-Kam Power Systems Ltd. v. Kunwer Sachdev case (2019 SCC OnLine Del 10764). The plaintiffs were represented by Mr. Pravin Anand, Ms. Vaishali Mittal, and Mr. Karan Kamra, advocates.",
          "content": "2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 8 of 11 \n \nname/corporate name is also likely to deceive unwary consumers of their \nassociation with the plaintiffs. \n11. \nAt this stage, it may be relevant to note that the defendants have been \nserved through speed post, courier and e-mail. Moreover, the fact that local \ncommissions were executed at the premises of the defendants would show \nthat the defendants are aware of the pendency of the present suits. Despite \nthe above, the defendants have failed to enter appearance in the suit and \nhence, were proceeded against ex parte on 28th July 2022.  \n12. \nPlaintiffs have established statutory as well as common law rights on \naccount of the long usage of the „VOLVO‟ marks. The plaintiffs would be \ngravely prejudiced if the defendants are permitted to use the impugned trade \nname and marks. Since the defendants have failed to enter appearance or \neven take any steps requisite to contest the present suit, despite having \nsuffered an ad interim injunction order, it is evident that they have no \ndefence to put forth on merits. The plaint is duly supported by the affidavit \nof the plaintiffs. I am of the opinion that no purpose would be served by \ndirecting the plaintiffs to lead ex parte evidence by filing an affidavit of \nexamination in chief. Therefore, in my opinion, this is a fit case where a \nSummary Judgment in terms of Order XIII-A of the CPC, as applicable to \ncommercial disputes of a specified value, read with Rule 27 of the IPD \nRules, deserves to be passed in favour of the plaintiffs and against the \ndefendants. Reference in this regard may be made to the judgment in Su-\nKam Power Systems Ltd. v. Kunwer Sachdev, 2019 SCC OnLine Del \n10764, has observed as under: \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified",
          "pdf_source": "23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 9",
          "node_id": "0011",
          "start_index": 9,
          "end_index": 9,
          "summary": "According to page 9 of the PDF \"AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf\" (2023/DHC/000868, CS(COMM) 198/2022), the High Court of Delhi discusses the summary judgment procedure in commercial disputes. The court cites Rule 3 of Order XIIIA, CPC, which allows for summary judgment if the defendant has no real prospects of successfully defending the claim. The court applies this principle to the present case, finding that the plaintiffs are entitled to a summary judgment. The application is allowed, as decided on February 7, 2023, by Judge Amit Bansal. The court's decision is based on the Commercial Court Act, 2015, which aims to dispose of commercial disputes in a time-bound manner. (Source: PDF page 9)",
          "content": "2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 9 of 11 \n \n“90. To reiterate, the intent behind incorporating the summary \njudgment procedure in the Commercial Court Act, 2015 is to \nensure disposal of commercial disputes in a time-bound \nmanner. In fact, the applicability of Order XIIIA, CPC to \ncommercial disputes, demonstrates that the trial is no longer \nthe default procedure/norm. \n91. Rule 3 of Order XIIIA, CPC, as applicable to commercial \ndisputes, empowers the Court to grant a summary judgement \nagainst the defendant where the Court considers that the \ndefendant has no real prospects of successfully defending the \nclaim and there is no other compelling reason why the claim \nshould not be disposed of before recording of oral evidence. \nThe expression “real” directs the Court to examine whether \nthere is a “realistic” as opposed to “fanciful” prospects of \nsuccess. This Court is of the view that the expression “no \ngenuine issue requiring a trial” in Ontario Rules of Civil \nProcedure and “no other compelling reason…..for trial” in \nCommercial Courts Act can be read mutatis mutandis. \nConsequently, Order XIIIA, CPC would be attracted if the \nCourt, while hearing such an application, can make the \nnecessary finding of fact, apply the law to the facts and the \nsame is a proportionate, more expeditious and less expensive \nmeans of achieving a fair and just result. \n92. Accordingly, unlike ordinary suits, Courts need not hold \ntrial in commercial suits, even if there are disputed questions \nof fact as held by the Canadian Supreme Court in Robert \nHryniak (supra), in the event, the Court comes to the \nconclusion that the defendant lacks a real prospect of \nsuccessfully defending the claim.” \n13. \nThe aforesaid principles are fully applicable in the facts and \ncircumstances of the present case and therefore, the plaintiffs are entitled to \na summary judgment.  \n14. \nIn view of the above, the present application is allowed. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified",
          "pdf_source": "23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0015",
      "start_index": 10,
      "end_index": 11,
      "summary": "According to the PDF document \"AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf\", the High Court of Delhi at New Delhi decreed in favor of the plaintiffs, Aktiebolaget Volvo & Ors., in a trademark infringement case (CS(COMM) 198/2022). The court reserved its decision on February 1, 2023, and delivered its verdict on February 7, 2023.\n\nThe plaintiffs were represented by Mr. Pravin Anand, Ms. Vaishali Mittal, and Mr. Karan Kamra. The court granted permanent injunction and decree in terms of the plaint, entitling the plaintiffs to relief due to the defendants' blatant infringement of the \"VOLVO\" trademark and their failure to appear in court.\n\nThe court awarded damages of Rs.5,00,000 to the plaintiffs, applying the principle of punitive damages as stated in the judgment of Hindustan Lever Ltd. v. Satish Kumar (2012 SCC OnLine Del 1378). Additionally, the court awarded Rs.10,00,000 as costs to the plaintiffs, considering the expenses incurred for court fees, Local Commissioners' fees, and legal fees.\n\nThe defendants were ordered to deliver up the infringing products for destruction, and the plaintiffs' representatives were permitted to visit the defendants' premises to seize the inventory. The court disposed of all applications in the above terms, and the decree sheet was directed to be drawn up. The judgment was delivered by Amit Bansal, J., on February 7, 2023, as stated in the PDF document.",
      "pdf_source": "23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf",
      "nodes": [
        {
          "title": "Page 10",
          "node_id": "0013",
          "start_index": 10,
          "end_index": 10,
          "summary": "According to page 10 of the PDF \"23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf\", the court has decreed the present suit in favor of the plaintiffs, Aktiebolaget Volvo & Ors., granting permanent injunction and decree in terms of prayer clauses \"i\", \"ii\", \"iii\", and \"iv\" of the plaint. The defendants, who did not appear in court, have been found to have blatantly infringed the plaintiffs' mark \"VOLVO\". The court has permitted the plaintiffs to seize and destroy infringing products. The court also considered granting punitive damages, citing the judgment in Hindustan Lever Ltd. v. Satish Kumar (2012 SCC OnLine Del 1378), but the amount is not specified. The decision was made on February 7, 2023, by the High Court of Delhi. (Source: 23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf, page 10)",
          "content": "2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 10 of 11 \n \nRELIEF \n15. \nThe various registrations and the long usage of the mark „VOLVO‟ by \nthe plaintiffs, as also the goodwill vesting in the mark „VOLVO‟, entitles the \nplaintiffs for grant of permanent injunction and decree in terms of the plaint.  \n16. \nAccordingly, the present suit is decreed in terms of prayer clauses „i‟, \n„ii‟, „iii‟ and „iv‟ of the plaint. \n17. \nSince the defendants have not appeared and rendered any accounts of \nprofits, the said relief as sought in prayer clauses „vii‟ cannot be granted. \nInsofar as delivery up for the purpose of destruction, as sought in prayer \nclause „v‟ is concerned, the representatives of the plaintiffs are permitted to \nvisit the premises of the defendants, where the inventory is lying and take \nseizure of the infringing products for the purpose of destruction.  \n18. \nInsofar as the relief of damages as sought in prayer clause „vi‟ is \nconcerned, reference may be made to the judgment in Hindustan Lever Ltd. \nv. Satish Kumar, 2012 SCC OnLine Del 1378. The relevant observations \nare set out below: \n“23. One of the reasons for granting relief of punitive damages \nis that despite of service of summons/notice, the defendant had \nchosen not to appear before the court. It shows that the \ndefendant is aware of the illegal activities otherwise, he ought \nto have attended the proceedings and give justification for the \nsaid illegal acts. Since, the defendant has maintained silence, \ntherefore, the guilt of the defendant speaks for itself and the \ncourt, under these circumstances, feels that in order to avoid \nfuture infringement, relief of punitive damages is to be granted \nin favour of the plaintiff.” \n19. \nIn the present case, the defendants have blatantly infringed the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified",
          "pdf_source": "23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 11",
          "node_id": "0014",
          "start_index": 11,
          "end_index": 11,
          "summary": "According to page 11 of the PDF \"23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf\", the court ruled in favor of the plaintiffs, Aktiebolaget Volvo & Ors. The defendants were found to have infringed on the plaintiffs' trademark and failed to appear in court. The court awarded damages of Rs.5,00,000 to the plaintiffs. Additionally, the court awarded actual costs of Rs.10,00,000 to the plaintiffs, as claimed by their counsel, Mr. Pravin Anand. The case, CS(COMM) 198/2022, was decided on February 7, 2023, by Judge Amit Bansal. The decree sheet was ordered to be drawn up, and all applications were disposed of in the above terms. (Source: PDF \"23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf\", page 11)",
          "content": "2023/DHC/000868 \n \n \nCS(COMM) 198/2022 \n                                                               Page 11 of 11 \n \ntrademark of the plaintiffs and have also failed to appear before this Court. \nApplying the above principles and considering the large quantum of \nproducts that have been seized by the Local Commissioners, the plaintiffs \nare entitled to damages of Rs.5,00,000. \n20. \nAs regard, the prayer clause „viii‟, counsel for the plaintiffs has filed a \nstatement of costs. The statement of costs shows that Rs.4,51,500/- has \nalready been incurred for court fees and the fees of the Local \nCommissioners. In addition, it is claimed that expenses to the tune of Rs. \n1,33,599/- have been incurred and Rs.4,53,707/- is the legal fees. This Court \nis convinced that this is a fit case for award of actual costs to the plaintiffs.  \nAccordingly, Rs.10,00,000/- is awarded to the plaintiffs as costs to be paid \nby the defendants.  \n21. \nLet the decree sheet be drawn up.  \n22. \nAll applications are disposed of in the above terms.  \n \n \nAMIT BANSAL, J. \nFEBRUARY 07, 2023 \nat \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:07.02.2023 17:07:54\nSignature Not Verified",
          "pdf_source": "23. AKTIEBOLAGET VOLVO & ORS.VS. VOVLO WHITE PAINTS INDUSTRIES & ORS.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-15T18:38:11.213477",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}