{
  "doc_name": "24.A VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS",
  "pdf_source": "24.A VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
  "metadata": {
    "document_name": "24.A VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS",
    "source_pdf": "24.A VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
    "judges": [
      "AMIT BANSAL"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "1018/2016",
      "814/2018",
      "1018/2016",
      "814/2018",
      "1018/2016",
      "1018/2016",
      "814/2018",
      "814/2018",
      "1018/2016",
      "814/2018",
      "1018/2016",
      "814/2018",
      "1018/2016",
      "814/2018",
      "1018/2016",
      "1018/2016",
      "814/2018",
      "1018/2016",
      "1018/2016",
      "1018/2016",
      "814/2018",
      "814/2018",
      "1018/2016",
      "814/2018",
      "1018/2016",
      "814/2018",
      "1018/2016",
      "814/2018",
      "1018/2016",
      "814/2018",
      "814/2018",
      "814/2018",
      "1018/2016",
      "814/2018",
      "1018/2016",
      "814/2018",
      "1018/2016",
      "814/2018",
      "1018/2016",
      "814/2018",
      "1018/2016",
      "1018/2016",
      "814/2018",
      "1018/2016",
      "814/2018",
      "1018/2016",
      "814/2018",
      "1018/2016",
      "814/2018",
      "1018/2016",
      "814/2018",
      "1018/2016",
      "814/2018",
      "1018/2016",
      "814/2018",
      "1018/2016",
      "1018/2016",
      "814/2018",
      "1018/2016",
      "814/2018",
      "8759/2019",
      "8760/2019",
      "8760/2019",
      "10323/2017"
    ],
    "dhc_numbers": [
      "2023/DHC/000133",
      "2023/DHC/000133",
      "2023/DHC/000133",
      "2023/DHC/000133",
      "2023/DHC/000133",
      "2023/DHC/000133",
      "2023/DHC/000133",
      "2023/DHC/000133",
      "2023/DHC/000133",
      "2023/DHC/000133",
      "2023/DHC/000133",
      "2023/DHC/000133",
      "2023/DHC/000133",
      "2023/DHC/000133",
      "2023/DHC/000133",
      "2023/DHC/000133",
      "2023/DHC/000133",
      "2023/DHC/000133",
      "2023/DHC/000133"
    ],
    "ia_numbers": [],
    "decision_date": "15 December, 2022",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      "V-GUARD INDUSTRIES LTD"
    ],
    "defendants": [
      "RAKESH MALHOTRA & ORS",
      "VAVE INDIA ENERGY SOLUTIONS PRIVATE LIMITED & ORS"
    ],
    "appellants": [],
    "respondents": [],
    "plaintiff_advocates": [
      "Mr. Akhil Sibal, Senior Advocate",
      "Ms. Asavari Jain",
      "Ms. Sabia",
      "Mr. Siddharth Vardhman"
    ],
    "defendant_advocates": [
      "Mr. Rajeev Virmani, Senior Advocate",
      "Mr. Jithin M. George",
      "Mr. Vivek Dhokalia"
    ],
    "appellant_advocates": [],
    "respondent_advocates": [],
    "damages_claimed": null,
    "damages_awarded": null,
    "key_issues": [
      "Stay of suit under Section 10 of the Code of Civil Procedure, 1908, in relation to pending appeals before the Kerala High Court",
      "Passing off and trademark infringement claims under the plaintiff's trademark \"V-GUARD\" and the defendant's trademark \"LIVGUARD\"",
      "Grant of permanent injunction to restrain the defendants from using a deceptively similar trademark",
      "Trade dress infringement and passing off claims in relation to the plaintiff's products",
      "Ex parte injunctions and their vacation in relation to trademark infringement claims",
      "Similarity and deceptive similarity between trademarks, specifically \"V-GUARD\" and \"LIVGUARD\"",
      "Applicability of Section 10 of the CPC to stay suits pending disposal of appeals in other courts",
      "Interim relief and interim applications in trademark infringement and passing off cases",
      "Jurisdiction and parallel proceedings in multiple courts, including the Delhi High Court and the Kerala High Court",
      "Appeals against orders granting or refusing interim relief in trademark infringement cases"
    ],
    "decision_summary": "**Background:**\nThe case involves a trademark dispute between V-Guard Industries Ltd. (the plaintiff) and Rakesh Malhotra & Ors. (the defendants) regarding the use of the trademark \"LIVGUARD\" by the defendants, which the plaintiff claims is deceptively similar to its trademark \"V-GUARD\". The plaintiff had previously filed a suit (OS no. 12/2013) before the District Court, Ernakulam, seeking relief of permanent injunction restraining the defendants from infringing its trademark \"V-GUARD\" and from passing off its goods.\n\n**History of Litigation:**\nThe plaintiff's previous suit (OS no. 12/2013) was filed against Shri Rakesh Malhotra, who is the defendant no.1 in CS(COMM) 1018/2016 and the defendant no.2 in CS(COMM) 814/2018. An ex parte injunction was granted in the suit on 11th April, 2013, but it was later vacated, and the interim application filed by the plaintiff was dismissed by the District Court, Ernakulam, on 1st June, 2013. The court held that there was no similarity between the plaintiff's trademark \"V-GUARD\" and the defendant's trademark \"LIVGUARD\".\n\nThe plaintiff appealed against this order before the Kerala High Court, which dismissed the appeal on 5th July, 2013, holding that the defendant's trademark \"LIVGUARD\" was not similar to the plaintiff's trademark \"V-GUARD\". The plaintiff then filed a Special Leave Petition (SLP) before the Supreme Court, which was dismissed as withdrawn on 22nd November, 2013.\n\n**Current Case:**\nThe plaintiff later filed two suits before the Delhi High Court: CS(COMM) 1018/2016 and CS(COMM) 814/2018. In CS(COMM) 1018/2016, the plaintiff sought a permanent injunction restraining the defendants from passing off its goods by using the trademark \"LIVGUARD\", claiming that it was deceptively similar to its trademark \"V-GUARD\". In CS(COMM) 814/2018, the plaintiff sought a permanent injunction restraining the defendants from passing off its trade dress.\n\n**Legal Issues:**\nThe legal issues in this case revolve around the principles of trademark law, specifically the concept of passing off and the similarity between the plaintiff's trademark \"V-GUARD\" and the defendant's trademark \"LIVGUARD\".\n\n**Arguments:**\nThe defendants filed applications under Section 10 of the Code of Civil Procedure (CPC) seeking a stay of the suits until the disposal of an appeal (RFA 117/2017) filed by the plaintiff before the Kerala High Court against a judgment and decree dated 22nd November, 2016, passed by the Additional District Judge, Ernakulam, in OS no. 12/2013.\n\n**Court Findings:**\nThe Delhi High Court, after considering the history of litigation and the current suits, observed that the plaintiff had previously filed a suit before the District Court, Ernakulam, which was dismissed, and the appeal before the Kerala High Court was also dismissed. The plaintiff's SLP before the Supreme Court was dismissed as withdrawn.\n\n**Decision:**\nThe court decided to dispose of the applications filed by the defendants under Section 10 of the CPC, seeking a stay of the suits. The court held that the suits before it were filed by the plaintiff after the previous suit was withdrawn, and the plaintiff had been given liberty to file a fresh suit in a court of competent jurisdiction. The court noted that the appeal filed by the plaintiff before the Kerala High Court (RFA 117/2017) was a separate proceeding and did not affect the current suits before the Delhi",
    "legal_precedents": [
      "Aspi Jal Khushroo Rustom Dadyburjor",
      "(2013) 4 SCC 333",
      "Sons Kishan Chand",
      "Manohar Lal Chopra Rai Bahadur Rao Raja Set Hiralal",
      "(1969) 2 SCC 727",
      "Guruswami Asari Raju Asari",
      "(2004) 7 SCC 251",
      "Romesh \nKumar Bhatia Zorrik Enterprises",
      "Shorab Merwanji Modi Mansata Film \nDistributors",
      "(2005) 2 \nSCC 256"
    ],
    "full_text": "\n--- PAGE 1 ---\n2023/DHC/000133 \n \n \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 1 of 19 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n% \n \n \n Judgment Reserved on :  15th December, 2022 \nJudgment Delivered on : 9th January, 2023 \n \n+  \n  \n \n \nCS(COMM) 1018/2016 \n \n \nV-GUARD INDUSTRIES LTD \n \n \n..... Plaintiff \nThrough: \nMr. Akhil Sibal, Senior Advocate \nwith Ms. Asavari Jain, Ms. Sabia and \nMr.Siddharth Vardhman, Advocates \n \n \n \n \nversus \n \n \nRAKESH MALHOTRA & ORS \n \n \n..... Defendants \nThrough: \nMr. Rajeev Virmani, Senior Advocate \nwith Mr.Jithin M. George, Advocate \n \n+  \n \n \n \nCS(COMM) 814/2018 \n \n \nV-GUARD INDUSTRIES LTD. \n \n \n..... Plaintiff \nThrough: \nMr. Akhil Sibal, Senior Advocate \nwith Ms. Asavari Jain, Ms. Sabia and \nMr.Siddharth Vardhman, Advocates \n \n \nversus \n \n \nVAVE INDIA ENERGY SOLUTIONS \nPRIVATE LIMITED & ORS \n \n \n \n..... Defendants \nThrough: \nMr. Rajeev Virmani, Senior Advocate \nwith, \nMr. \nVivek \nDhokalia \nand \nMr.Jithin M. George, Advocates for \ndefendant No.1 \n \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nJUDGMENT \nAMIT BANSAL, J. \n \nI.A. 8759/2019 (u/S 10 of the CPC for stay of suit) in CS(COMM) \n1018/2016 \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified\n\n--- PAGE 2 ---\n2023/DHC/000133 \n \n \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 2 of 19 \n \nI.A. 8760/2019 (u/S 10 of the CPC for stay of suit) in CS(COMM) \n814/2018 \n \n1. \nBy way of the present judgment, I shall dispose of I.A 8759/2019 and \nI.A. 8760/2019 filed on behalf of the defendants under Section 10 of the \nCode of Civil Procedure, 1908 (CPC) seeking stay of the present suits, till \nthe disposal of appeal, bearing no. RFA 117/2017 filed by the plaintiff \nherein before the Kerala High Court against the judgment and decree dated \n22nd November, 2016 passed by the Additional District Judge, Ernakulam in \nOS no. 12/2013. \n2. \nAt the hearing on 4th July, 2019 the senior counsel for the plaintiff \nstated that no reply is required to be filed to the aforesaid applications. \n3. \nCS(COMM) 1018/2016 has been filed on behalf of the plaintiff \nseeking permanent injunction restraining the defendants from passing off the \ngoods of the plaintiff by using the trademark “LIVGUARD” claiming that \nthe same is deceptively similar to the plaintiff‟s trademark “V-GUARD” \nalong with other ancillary reliefs. \n4. \nCS(COMM) 814/2018 has been filed on behalf of the plaintiff seeking \npermanent injunction restraining the defendants from passing off the \nplaintiffs‟ trade dress by the defendants along with other ancillary reliefs. \n5. \nAt the outset it may be relevant to refer to the history of the litigation \nbetween the parties with regard to their competing trademarks. \nI. \nThe plaintiff previously filed a suit, being OS no. 12/2013, before the \nDistrict Court, Ernakulam against Shri Rakesh Malhotra, being the \ndefendant no.1 in CS(COMM) 1018/2016 and the defendant no.2 in \nCS(COMM) 814/2018 seeking relief of permanent injunction \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified\n\n--- PAGE 3 ---\n2023/DHC/000133 \n \n \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 3 of 19 \n \nrestraining him from infringing plaintiff‟s trademark “V-GUARD” \nand from passing off the plaintiff‟s goods. \nII. \nAn ex parte injunction was granted in the aforesaid suit on 11th April, \n2013 restraining Shri Rakesh Malhotra from using the trademark \n“LIVGUARD”. The ex parte injunction order was vacated and the \ninterim application filed on behalf of the plaintiff was dismissed by \nthe District Court, Ernakulam vide order dated 1st June, 2013 holding \nthat there is no similarity between the plaintiff‟s trademark “V-\nGUARD” and the defendant‟s trademark “LIVGUARD”. \nIII. \nAn appeal was filed by the plaintiff against the aforesaid order dated \n1st June, 2013 before the Kerala High Court, which was dismissed by \nthe Kerala High Court vide judgment dated 5th July, 2013, by holding \nthat the defendant‟s trademark “LIVGUARD” is not similar to the \nplaintiff‟s trademark “V-GUARD”. \nIV. \nThe SLP, bearing no. 36230/2013, filed on behalf of the plaintiff \nagainst the aforesaid judgment dated 5th July, 2013, was dismissed as \nwithdrawn on 22nd November, 2013. \nV. \nAn application was filed on behalf of the plaintiff before the District \nCourt, Ernakulam seeking withdrawal of OS no. 12/2013 insofar as it \nrelated to the relief of passing off with liberty to file the same in a \nCourt of competent jurisdiction, which was allowed on 24th \nNovember, 2015. \nVI. \nPursuant to the aforesaid liberty, CS(COMM) 1018/2016 was filed on \nbehalf of the plaintiff before this Court. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified\n\n--- PAGE 4 ---\n2023/DHC/000133 \n \n \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 4 of 19 \n \nVII. \nAfter the trial, a final judgment and decree was passed by the District \nCourt, Ernakulam, dismissing the suit filed by the plaintiff on 22nd \nNovember, 2016. \nVIII. \nAgainst the aforesaid dismissal, the plaintiff filed an appeal, bearing \nno. RFA 117/2017 before the Kerala High Court, which appeal is \nstated to be pending. \nIX. \nOn 16th August, 2017, issues were framed in CS(COMM) 1018/2016 \nand it was recorded that no oral evidence is required to be led and that \nthe suit would be decided on the basis of the pleadings of the parties. \nX. \nSubsequently, an application, being I.A.10323/2017 in CS(COMM) \n1018/2016 was filed on behalf of the plaintiff seeking leave to lead \nevidence. The said application was disposed of as not pressed on 1st \nFebruary, 2018 and liberty was granted to the plaintiff to file a suit on \nany cause of action that was not the subject matter of CS(COMM) \n1018/2016. \nXI. \nOn 19th April, 2018, the plaintiff filed a fresh suit being CS(COMM) \n814/2018 against Shri Rakesh Malhotra, SAR Group (defendant no.3) \nand Vave India Energy Solutions Pvt. Ltd. (defendant no.1) alleging \npassing off of its trade dress. \nXII. \nOn 6th March, 2019, issues were framed in CS(COMM) 814/2018 and \nit was noted that no oral evidence is required to be led in the aforesaid \nsuit. It was further directed that both the suits shall be heard together \nand were posted for final hearing. \nXIII. \nOn 4th July, 2019, the present applications were filed on behalf of the \ndefendants seeking stay of both the aforesaid suits in view of the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified\n\n--- PAGE 5 ---\n2023/DHC/000133 \n \n \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 5 of 19 \n \npendency of the appeal filed by the plaintiff before the Kerala High \nCourt.  \n6. \nSenior counsel appearing on behalf of the defendants has made the \nfollowing submissions:  \nI. The District Court, Ernakulam as well as the Kerala High Court have \nboth returned findings that there is no similarity between the marks of \nthe plaintiff and the defendant. Reliance in this regard is placed on (i) \nthe order dated 1st June, 2013 passed by the District Court, Ernakulam \nwhile dismissing the interim application of the plaintiff; (ii) order \ndated 5th July, 2013 passed by the Kerala High Court while dismissing \nthe appeal filed by the plaintiff against the order dated 1st June, 2013 \npassed by the District Court, Ernakulam and (iii) the judgment and \ndecree dated 22nd November, 2016 passed by the District Court, \nErnakulam. \nII. Since, the issues to be determined in both the present suits are with \nregard to similarity between the marks of the plaintiff and the \ndefendants and the subject matter of the present suits is directly and \nsubstantially the same as in the suit filed by the plaintiff before the \nDistrict Court, Ernakulam and the appeal pending before the Kerala \nHigh Court, the present suits liable to be stayed till the appeal filed by \nthe plaintiff is finally decided.  \nIII. Reliance is placed on: \na) The judgment of a four Judge Bench in Manohar Lal Chopra v. \nRai Bahadur Rao Raja Set Hiralal, 1962 Supp (1) SCR 450. The \njudgment of a Co-ordinate Bench of this Court in H.S. SAHNI v. \nMukul Singhal, (2022) 1 HCC (Del) 155 to submit that provisions \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified\n\n--- PAGE 6 ---\n2023/DHC/000133 \n \n \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 6 of 19 \n \nof Section 10 of the CPC are mandatory and the objective behind \nSection 10 of the CPC is to avoid possibility of contradictory \nverdicts by two Courts in respect of the same relief.  \nb) The judgment of a Co-ordinate Bench of this Court in Romesh \nKumar Bhatia v. Zorrik Enterprises, 1980 SCC OnLine Del 202, \nwhere in similar circumstances, this Court had stayed a suit \npending before this Court on the ground that a similar earlier suit \nwas filed before the District Court.  \nc) The judgment of the Supreme Court in Ruston & Hornsby Ltd. v. \nZamindara Engineering Co., (1969) 2 SCC 727 to contend that \nboth, for the purposes of infringement and for passing off, same \ntest has to be applied by the Court with regard to likelihood of \nconfusion or deception arising from similarity of marks. \n7. \nPer contra, senior counsel appearing on behalf of the plaintiff has \nmade the following submissions: \nI. \nThe aforesaid applications have been filed belatedly only when the \nsuits were set for final hearing. \nII. \nFor a suit to be stayed under Section 10 of the CPC, the subject matter \nin both the suits have to be identical. Reliance in this regard is placed \non the judgment of the Supreme Court in National Institute of \nMental Health & Neuro Sciences v. C. Parameshwara, (2005) 2 \nSCC 256. \nIII. \nThe reliefs of passing off and infringement are arising from entirely \ndifferent causes of action and therefore, it cannot be said that the \nsubject matters in issue in the two suits are directly and substantially \nthe same. Reliance is placed on Mind Gym Ltd. v. Mindgym Kids \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified\n\n--- PAGE 7 ---\n2023/DHC/000133 \n \n \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 7 of 19 \n \nLibrary Pvt. Ltd., 2014 SCC OnLine Del 1240 and Pernod Ricard \nIndia (P) Ltd. v. Frost Falcon Distilleries Ltd., 2022 SCC OnLine \nDel 646. \nIV. \nThe Section 10 is merely a rule of procedure and the Courts are not \nbound by the same. Reliance is placed on the judgment of the \nSupreme Court in Pukhraj D. Jain And Ors. v. G. Gopalakrishna \n(2004) 7 SCC 251.  \nV. \nFor provisions of Section 10 of the CPC to apply, the Court in which \nearlier suit has been filed has to be a Court with competent \njurisdiction to decide the said suit. In the present case, the District \nCourt, Ernakulam did not have the territorial jurisdiction in respect of \nthe claim of the plaintiff for passing off and therefore, the bar under \nSection 10 would not apply. Reliance is placed on the order passed by \nthe Kerala High Court on 24th November, 2015, whereby the plaintiff \nhas been allowed to withdraw its claim in so far as the relief of \npassing off is concerned, with liberty to file it before a competent \nCourt. Reliance is placed on the judgment in Bristol-Myers Squibb \nHoldings Ireland Unlimited Company And Ors. v. Natco Pharma, \n2020 SCC OnLine Del 200. \nVI. \nThe Section 10 of the CPC only envisages a stay of the trial and the \nsame cannot apply to the present suit, where it has been recorded that \nno evidence is to be recorded and the suit has been set for final \nhearing. \n8. \n  In rejoinder, senior counsel on behalf of the defendants has made the \nfollowing submissions: \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified\n\n--- PAGE 8 ---\n2023/DHC/000133 \n \n \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 8 of 19 \n \nI. \nThere is no delay on the part of the defendants in filing the present \napplication. The present application was filed immediately after the \nissues were framed in CS(COMM) 814/2018 on 6th March, 2019. \nII. \nThe word „jurisdiction‟ used in Section 10 of the CPC is not in \nrelation to territorial jurisdiction of the Court but in the context of \ninherent jurisdiction. It cannot be denied that the District Court, \nErnakulam, Kochi had the inherent jurisdiction to entertain a suit for \npassing off. Reliance in this regard is placed on the judgment of the \nKarnataka High Court in Channabasappa Kamadal & Sons v. \nKishan Chand & Co. & Anr., 1971 SCC OnLine Kar 182. \nIII. \nIt is wrong to contend that the word „trial‟ in Section 10 of the CPC is \nconfined to the recording of evidence in the suit. The term „trial‟ \nincludes the final hearing of the suit as well. \n9. \nI have heard the counsels for the parties and perused the record. \n10. \nI do not find any merit in the submissions made on behalf of the \nplaintiff that the present applications have been filed belatedly only to delay \nthe final adjudication of the suit. CS(COMM) 814/2018 was filed on behalf \nof the plaintiff only on 19th April, 2018 and issues were framed therein on 6th \nMarch, 2019 and it was directed that both the suits were to be heard \ntogether. The present applications were filed on behalf of the defendants on \n1st July, 2019. Therefore, it cannot be said that there was a delay in filing the \npresent applications.  \n11. \nAs far back in 1962, the four Judge Bench in the Manohar Lal \nChopra (supra) has held that the provisions of Section 10 of the CPC are \nclear, definite and mandatory, and the Court in which the subsequent suit \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified\n\n--- PAGE 9 ---\n2023/DHC/000133 \n \n \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 9 of 19 \n \nhas been filed is prohibited from proceeding with the trial of the suit if the \nparameters of Section 10 of the CPC are fulfilled.  \n12. \nRelying upon the judgment of the Supreme Court in Aspi Jal v. \nKhushroo Rustom Dadyburjor, (2013) 4 SCC 333, a Co-ordinate Bench of \nthis Court in H.S. SAHNI (supra) has reiterated the position that provision \nof Section 10 of the CPC is mandatory in nature. The relevant observations \nin H.S. SAHNI (supra) are set out below: \n“22. \nEven in Aspi Jal (supra), which is relied upon by the \nlearned senior counsel for the plaintiff, the Supreme Court has \nreiterated that the use of the negative expression in Section 10 \nCPC makes the provision mandatory and the court in which the \nsubsequent suit has been filed is prohibited from proceeding with \nthe trial of that suit. It was reaffirmed that the basic purpose and \nthe underlying object of Section 10 of the Code is to prevent the \ncourts \nof \nconcurrent \njurisdiction \nfrom \nsimultaneously \nentertaining and adjudicating upon two parallel litigations in \nrespect of same cause of action, same subject matter and the \nsame relief. The objective is also to avoid the possibility of \ncontradictory verdicts by two courts in respect of the same relief \nand is aimed to protect the defendant from multiplicity of \nproceedings.  \n \n23. \nThe fundamental test that is to be applied to determine \nwhether Section 10 was applicable or not, is to see whether on \nthe final decision being reached in the first suit, such decision \nwould operate as res-judicata in the subsequent suit. Where there \nwas “identity of matter” in both the suits i.e., the whole of the \nsubject matter in both the proceedings were identical, even if \nfurther reliefs were claimed in the subsequent suit, it would be \nimmaterial and the second suit would necessarily have to be \nstayed.”  \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified\n\n--- PAGE 10 ---\n2023/DHC/000133 \n \n \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 10 of 19 \n \n13. \nThe appeal against the aforesaid judgment, being FAO(OS) (COMM) \n70/2022, was dismissed by a Division Bench of this Court vide order dated \n11th November, 2022. \n14. \nIn Romesh Kumar Bhatia (supra) a Co-ordinate Bench of this Court \nwas seized of a similar issue. In the said case, a suit was filed by the plaintiff \nbefore an Additional District Judge based on the claim of passing off and the \nsaid suit was dismissed. An appeal against the said dismissal was pending \nbefore the High Court. During the pendency of the appeal, a suit for \ninfringement of registered trade mark was filed by the plaintiffs. One of the \nissues framed in the infringement suit was whether the said suit was liable to \nbe stayed. While considering the issue of grant of stay under Section 10 of \nthe CPC, the following observations were made: \n“17. \nThe question that therefore, arises is whether an \nindependent and different finding on the matter of deception \nand conclusion can be given in this suit. This will be \ninescapable as no relief can be granted to the plaintiffs unless it \nis held that the use of the word “Zorrik” by the defendants \nresults in deception and confusion so as to infringe the trade \nmark of the plaintiffs. \n \nXXX \n \n \n \nXXX  \n \n \n \nXXX \n \n22. \nWith this state of law, there is no escape from the \nconclusion that as long as the finding of the Additional District \nJudge in the earlier suit that the sale of ties by the defendants \nunder the mark “Zorrik” does not result in deception and \nconfusion with the consumers in the market so as to identify them \nas those of the plaintiffs stands, no relief whatsoever can be \ngranted to the plaintiffs in the present suit. The proper course \nfor the plaintiffs, therefore, is to pursue their remedy in the \nappeal now pending in the High Court. The subject-matter in \nthe present suit to this extent, therefore, must be held as directly \nand substantially similar to that involved in that appeal. The \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified\n\n--- PAGE 11 ---\n2023/DHC/000133 \n \n \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 11 of 19 \n \nprovisions of S. 10 of the Code of Civil Procedure are, \ntherefore, attracted. It is not necessary that the subject matter \nand cause of action in two suits should be identical. Where \nthere is substantial identity between matters in dispute in earlier \nand later suits, the final decision in the earlier suit would \noperate as binding in the subsequent suit. It is also immaterial \nthat different reliefs are claimed, in case the matters in issue in \nthe two suits are substantially the same. (See in this respect AIR \n1973 Madras 473, in Shorab Merwanji Modi v. Mansata Film \nDistributors, AIR 1957 Calcutta 727, in Guruswami Asari v. \nRaju Asari.” \n \n15. \nThe aforesaid legal principles and particularly, the aforesaid \nobservations in Romesh Kumar Bhatia (supra) as set out above are squarely \napplicable in the facts and circumstances of the present case.  \n16. \nIn the suit filed before the District Court, Ernakulam, the following \nissue was framed as issue no.3: \n“3. Is the trademark „LIVGUARD‟ identical with or deceptively \nsimilar to the trademark „V-GUARD‟?” \n \n17. \nThe District Court, Ernakulam, after a detailed discussion gave a \nfinding that the aforesaid marks of the plaintiff and the defendants are not \ndeceptively similar. The conclusion as set out in paragraph 43 of the \njudgment dated 22nd November, 2016 is set out below:  \n“43. \nTo conclude, what is revealed is that on scores of \nphonetic similarity, visual similarity, similarity of the nature of \npresentation like words similarity and label similarity, and other \ngiven scores of comparison, as revealed from the law trite on the \npoint discussed supra, the plaintiff is not able to establish that \neither the marks are similar or even deceptively similar. Issue \nno.3 is, therefore, found against the plaintiff. It necessarily \nfollows that both marks shall not go to create any confusion in \nthe mindsets of those intended purchasers buying these products \nfrom the often market. This is answer to Issue number 4.” \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified\n\n--- PAGE 12 ---\n2023/DHC/000133 \n \n \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 12 of 19 \n \n18. \nAdmittedly, an appeal has been filed by the plaintiff against the \naforesaid judgment dated 22nd November, 2016, which is pending \nadjudication before the Kerala High Court. \n19. \nIn the amended plaint filed by the plaintiff in CS(COMM) 1018/2016, \nthe case set up by the plaintiff is that the wordmark “LIVGUARD” is \nconfusingly visually, structurally, phonetically and deceptively similar to the \nplaintiff‟s mark “V-GUARD”. Reference in this regard may be made to \nparagraphs 2A, 2C and 2K of the amended plaint. Based on the above, a \ndecree of permanent injunction is sought against the defendants restraining \nthe defendants from passing off the defendants‟ goods as that of the \nplaintiff‟s on the ground of the defendants‟ mark “LIVGUARD” being \ndeceptively similar to the plaintiff‟s mark “V-GUARD”. \n20. \nIssues were framed in CS(COMM) 1018/2016 on 16th August, 2017. \nReference may be made to issues no.1 and 4, which are set out below: \n“1. \nWhether defendants' adoption and use of the mark \n\"Livguard\" amounts to passing off of, goods as those originating \nfrom the plaintiff?  \n \n \n \n \n \nOPP \nXXX \n \n \n \nXXX  \n \n \n \nXXX \n \n4. \nWhether use of defendant's mark \"Livguard\" word per se \nand/ or as it is being actually used, does not amount to passing \noff as plaintiff s mark?  \n \n \n \n \n        OPD” \n \n21. \nIn CS(COMM) 814/2018, the plaintiff has sought an injunction \nagainst the defendants in respect of defendants passing off the \nplaintiffs‟ trade dress. A comparison has been drawn out in respect of \nthe trade dress of the plaintiff and the defendants in paragraph 2 of the \nplaint, which shows that the wordmark “LIVGUARD” is a prominent \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified\n\n--- PAGE 13 ---\n2023/DHC/000133 \n \n \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 13 of 19 \n \npart of defendants‟ trade dress and the wordmark „V-GUARD‟ is a \nprominent part of the plaintiff‟s trade dress. Issues were framed in the \nsaid suit on 6th March, 2019. A reference may be made to the following \nissues: \n“(i) Whether the trade dress of the defendants is similar / deceptively \nsimilar to the trade dress of the plaintiff?  \n \n \nOPP. \n \n(ii) Whether the cumulative effect of the use of the trade dress along \nwith trade mark by the defendants amounts to the defendants passing \noff their goods as that of the plaintiff?  \n \n \nOPP.” \n \n22. \nOn 6th March, 2019, the Court also made an observation that the \noutcome of the suit would be governed only on a comparison of the \ntwo marks, whether there is any similarity/ dissimilarity between the \ntwo marks. \n23. \nThe intent behind Section 10 of the CPC is to prevent Courts of \nconcurrent jurisdiction from simultaneously deciding suits between the same \nparties, involving directly and substantially the same cause of action. The \nobjective is based on the principle of judicial comity and to avoid two \ncontradictory verdicts by Courts of competent jurisdiction.   \n24. \nA reading of the judgment and decree dated 22nd November, 2016, \npassed by the District Court, Ernakulam, the pleadings in the present suits \nand the issues framed herein, leaves no doubt in my mind that the issues that \nhave to be adjudicated in the present suits, were subject matter of the suit \nbefore the District Court, Ernakulam, and a definite finding has been given \nin the said suit. The finding given by the District Court, Ernakulam that \nthere is no phonetic or visual similarity between the trademarks of the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified\n\n--- PAGE 14 ---\n2023/DHC/000133 \n \n \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 14 of 19 \n \nplaintiff and the defendant, constitutes res judicata and is binding on the \nplaintiff and in light of the aforesaid finding, no relief can be granted to the \nplaintiffs in the present suit. Therefore, in my considered view the subject \nmatter of the present suits is directly and substantially identical to the \nsubject matter of the suit before the District Court, Ernakulam, and is now \nthe subject matter of an appeal pending before the Kerala High Court. It is to \nbe noted that no submission has been made on behalf of the plaintiff to the \neffect that the issues to be determined in the present suits and the suit before \nthe District Court, Eranakulam are not directly and substantially the same.  \nTherefore, if the present suits are permitted to proceed, there could be a \npossibility of conflicting judgments in respect of similar issues between the \nsame parties.   \n25. \nCounsel for the plaintiff has placed reliance on National Institute of \nMental Health & Neuro Sciences (supra)  to contend that for a suit to be \nstayed under Section 10 of the CPC, the subject matter in both the suits have \nto be identical. Paragraph 8 of the aforesaid judgment relied upon by the \nplaintiff is set out below: \n“8.  The object underlying Section 10 is to prevent courts of \nconcurrent jurisdiction from simultaneously trying two parallel \nsuits in respect of the same matter in issue. The object underlying \nSection 10 is to avoid two parallel trials on the same issue by two \ncourts and to avoid recording of conflicting findings on issues \nwhich are directly and substantially in issue in previously \ninstituted suit. The language of Section 10 suggests that it is \nreferable to a suit instituted in the civil court and it cannot apply \nto proceedings of other nature instituted under any other statute. \nThe object of Section 10 is to prevent courts of concurrent \njurisdiction from simultaneously trying two parallel suits \nbetween the same parties in respect of the same matter in issue. \nThe fundamental test to attract Section 10 is, whether on final \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified\n\n--- PAGE 15 ---\n2023/DHC/000133 \n \n \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 15 of 19 \n \ndecision being reached in the previous suit, such decision would \noperate as res judicata in the subsequent suit. Section 10 applies \nonly in cases where the whole of the subject-matter in both the \nsuits is identical. The key words in Section 10 are “the matter in \nissue is directly and substantially in issue” in the previous \ninstituted suit. The words “directly and substantially in issue” \nare used in contradistinction to the words “incidentally or \ncollaterally in issue”. Therefore, Section 10 would apply only if \nthere is identity of the matter in issue in both the suits, meaning \nthereby, that the whole of the subject-matter in both the \nproceedings is identical.” \n \n26. \nAs can be seen from the extract quoted above, the Supreme Court \nsought to distinguish the key words used in Section 10 of the CPC, matter in \nissue is “directly and substantially in issue” in a previously instituted suit, \nfrom the words “incidentally or collaterally in issue”.  In the case before the \nSupreme Court, the respondent sought stay of a suit under Section 10 of the \nCPC on the ground that appellant had filed a Writ Petition against the award \nof the Labour Court and the same was pending before the High Court. The \nSupreme Court held that since the scope of the Writ Petition was entirely \ndistinct and separate from the suit filed before the Civil Court, stay under \nSection 10 of the CPC could not have been granted. Therefore, the reliance \nplaced by the plaintiff on National Institute of Mental Health & Neuro \nSciences (supra)  is misplaced.  \n27. \nThe Supreme Court in Ruston & Hornsby Ltd. (supra) has \ncategorically held that where the marks of the defendant and the plaintiff are \nnot exactly identical, but are similar, the test of infringement would be the \nsame as in an action for passing off i.e., whether there is a likelihood of \nconfusion or deception arising from the similarity of marks. The causes of \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified\n\n--- PAGE 16 ---\n2023/DHC/000133 \n \n \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 16 of 19 \n \naction in a suit for infringement and in a suit for passing off may be \ndifferent, as infringement is a statutory remedy and passing off is a common \nlaw remedy, however, the issue with regard to likelihood of confusion \narising from the similarity of marks has to be decided in both the actions. In \nview thereof reliance placed by the plaintiff on the judgment in Mind Gym \nLtd. (supra) and Pernod Ricard (supra), is misplaced.   \n28. \nReliance has been placed on behalf of the plaintiff on the judgment in \nPukhraj D. Jain (supra) to contend that provisions of Section 10 of the CPC \nare procedural and mere filing of an application under Section 10 of the CPC \ndoes not preclude the Court from examining the merits of the matter. \nHowever, the said judgment does not bar the Court from dealing with an \napplication under Section 10 of the CPC before the final adjudication of the \nsuit.  As noted above, a four Judge Bench of Supreme Court in Manohar \nLal Chopra (supra) has categorically held that provisions of Section 10 of \nthe CPC are mandatory. Therefore, reliance placed on Pukhraj D. Jain \n(supra) is also misplaced. \n29. \nNext, it has been contended on behalf of the plaintiff that the District \nCourt, Ernakulam did not have the territorial jurisdiction to entertain the \nclaim of passing off and therefore, the bar under Section 10 of the CPC \nwould not apply in view of the language used in Section 10 i.e., “Court in \nIndia having jurisdiction to grant the relief claimed”. In this regard, reliance \nhas been placed on a judgment of a Co-ordinate Bench in Bristol-Myers \n(supra). \n30. \nOn the other hand, senior counsel on behalf of the defendants submits \nthat the expression “Court in India having jurisdiction to grant the relief \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified\n\n--- PAGE 17 ---\n2023/DHC/000133 \n \n \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 17 of 19 \n \nclaimed” refers to a Court having inherent jurisdiction to entertain the suit \nand not territorial jurisdiction. \n31. \nReliance placed on behalf of the plaintiff on the judgment in Bristol-\nMyers (supra) is misplaced as the findings in the aforesaid judgment were \nmade in the context of a prior suit having been instituted by the defendant \ntherein in a Court which did not have the inherent jurisdiction to entertain \nthe suit. Therefore, in Bristol-Myers (supra) the Court held that the earlier \nsuit was an abuse of the process of law. In the present case, it was the \nplaintiff itself that had filed the earlier suit in District Court, Ernakulam and \nit is nobodies‟ case that the District Court, Ernakulam lacked inherent \njurisdiction to try the suit. \n32. \nIn Channabasappa Kamadal & Sons (supra), the Karnataka High \nCourt expressed the view that the expression “Court in India having \njurisdiction to grant the relief claimed” used in Section 10 of the CPC does \nnot deal with territorial jurisdiction and only refers to the competency of the \nCourt to entertain and grant the relief sought in the suit. I am in respectful \nagreement with the view expressed by the Karnataka High Court in  \nChannabasappa Kamadal & Sons (supra). The expression “Court in India \nhaving jurisdiction to grant the relief claimed” used in Section 10 of the \nCPC cannot be applied in the context of a Court in India not having \nterritorial jurisdiction and would be applicable only when the Court where \nthe earlier suit has been instituted lacks the inherent jurisdiction to try the \nsaid suit.   \n33. \nThere is another aspect to be considered with regard to the aforesaid \nissue. The plaintiff had filed the suit based on both infringement as well as \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified\n\n--- PAGE 18 ---\n2023/DHC/000133 \n \n \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 18 of 19 \n \npassing off before the District Court, Ernakulam. The interim application \nfiled on behalf of the plaintiff was dismissed by the District Court, \nErnakulam and appeal against the said order was dismissed by the Kerala \nHigh Court and subsequently, the SLP filed before the Supreme Court was \nwithdrawn by the plaintiff. It was only thereafter that the plaintiff filed an \napplication under Order XXIII Rule 1 of the CPC seeking to withdraw a part \nof the claim in the said suit relating to passing off with liberty to file the \nsame before a Court with competent jurisdiction. This application was \nallowed by the District Judge, Ernakulam, Kochi by permitting the plaintiff \nto withdraw the part of the claim relating to passing off with liberty to \ninstitute a fresh suit. Pursuant to the said liberty, CS(COMM) 1018/2016 \nwas filed on behalf of the plaintiff. \n34. \nThere is no definite finding given by the District Court, Ernakulam \nwith regard to the District Court, Ernakulam not having territorial \njurisdiction. It was only at the asking of the plaintiff that the plaintiff was \npermitted to withdraw the part of the claim in the said suit with liberty to file \na fresh suit in respect of the subject matter of the part of the claim. The \nplaintiff did not wait for the District Court, Ernakulam to give a finding that \nit lacked territorial jurisdiction and straight away filed an application for \nwithdrawal of part of the claim on the ground of District Court, Ernakulam \nnot having the territorial jurisdiction to try the said suit.  It appears that not \nhaving got an interim injunction in its favour, the plaintiff withdrew the part \nof the claim in the said suit to take a chance before another Court.  \n35. \nThe submission of the plaintiff that the bar under Section 10 of the \nCPC is only in respect of trial of the suit and the expression „trial‟ has to be \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified\n\n--- PAGE 19 ---\n2023/DHC/000133 \n \n \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 19 of 19 \n \ngiven a narrow meaning to include only the recording of evidence in the \nsuit, is wholly misplaced. A reference to Order XVIII of the CPC would \ndemonstrate that the recording of evidence in a suit cannot be treated \nseparately from the final arguments in the case.  The term „trial‟ would \ninclude the entire composite process of recording of evidence as well as \naddressing final arguments.  \n36. \nAccordingly, both the applications are allowed and both the present \nsuits are stayed with liberty to the parties to get the same revived after the \ndecision in RFA 117/2017 pending before the Kerala High Court. \nCS(COMM) 1018/2016 & CS(COMM) 814/2018  \n37. \nThe date 23rd January, 2023 stands cancelled. \n \n \nAMIT BANSAL, J. \nJanuary 09, 2023 \nsr \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified\n"
  },
  "total_pages": 19,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "According to the PDF document \"VGUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & ORS.pdf\", the High Court of Delhi at New Delhi heard two commercial suits, CS(COMM) 1018/2016 and CS(COMM) 814/2018. The plaintiff, V-Guard Industries Ltd, sought permanent injunctions against the defendants, Rakesh Malhotra and others, and Vave India Energy Solutions Private Limited and others, respectively.\n\nThe plaintiff claimed that the defendants' use of the trademark \"LIVGUARD\" was deceptively similar to their own trademark \"V-GUARD\" and sought to restrain them from passing off their goods. The defendants filed applications under Section 10 of the Code of Civil Procedure, 1908, seeking a stay of the suits until the disposal of an appeal filed by the plaintiff before the Kerala High Court.\n\nThe court heard the applications on July 4, 2019, and the senior counsel for the plaintiff stated that no reply was required. The court noted that the plaintiff had previously filed a suit, OS no. 12/2013, before the District Court, Ernakulam, seeking a permanent injunction against Rakesh Malhotra. The judgment was reserved on December 15, 2022, and delivered on January 9, 2023. The court's decision on the applications and the suits is not specified in the provided section of the PDF document. (Source: 2023/DHC/000133, VGUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & ORS.pdf)",
      "pdf_source": "24.A VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "According to page 1 of the PDF \"24.A VGUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & ORS.pdf\", the case involves V-Guard Industries Ltd as the plaintiff and Rakesh Malhotra & Ors as the defendants in CS(COMM) 1018/2016, and V-Guard Industries Ltd as the plaintiff and Vave India Energy Solutions Private Limited & Ors as the defendants in CS(COMM) 814/2018. The judgment was reserved on December 15, 2022, and delivered on January 9, 2023, by Hon'ble Mr. Justice Amit Bansal. The plaintiff was represented by Mr. Akhil Sibal, Senior Advocate, and the defendants were represented by Mr. Rajeev Virmani, Senior Advocate. The case also mentions an Interim Application (I.A. 8759/2019) under Section 10 of the CPC for a stay of suit in CS(COMM) 1018/2016. (Source: 2023/DHC/000133, PDF page 1 of 19)",
          "content": "2023/DHC/000133 \n \n \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 1 of 19 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n% \n \n \n Judgment Reserved on :  15th December, 2022 \nJudgment Delivered on : 9th January, 2023 \n \n+  \n  \n \n \nCS(COMM) 1018/2016 \n \n \nV-GUARD INDUSTRIES LTD \n \n \n..... Plaintiff \nThrough: \nMr. Akhil Sibal, Senior Advocate \nwith Ms. Asavari Jain, Ms. Sabia and \nMr.Siddharth Vardhman, Advocates \n \n \n \n \nversus \n \n \nRAKESH MALHOTRA & ORS \n \n \n..... Defendants \nThrough: \nMr. Rajeev Virmani, Senior Advocate \nwith Mr.Jithin M. George, Advocate \n \n+  \n \n \n \nCS(COMM) 814/2018 \n \n \nV-GUARD INDUSTRIES LTD. \n \n \n..... Plaintiff \nThrough: \nMr. Akhil Sibal, Senior Advocate \nwith Ms. Asavari Jain, Ms. Sabia and \nMr.Siddharth Vardhman, Advocates \n \n \nversus \n \n \nVAVE INDIA ENERGY SOLUTIONS \nPRIVATE LIMITED & ORS \n \n \n \n..... Defendants \nThrough: \nMr. Rajeev Virmani, Senior Advocate \nwith, \nMr. \nVivek \nDhokalia \nand \nMr.Jithin M. George, Advocates for \ndefendant No.1 \n \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nJUDGMENT \nAMIT BANSAL, J. \n \nI.A. 8759/2019 (u/S 10 of the CPC for stay of suit) in CS(COMM) \n1018/2016 \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified",
          "pdf_source": "24.A VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "According to the PDF \"24.A VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf\" (2023/DHC/000133), the High Court of Delhi at New Delhi is hearing two cases: CS(COMM) 1018/2016 and CS(COMM) 814/2018. The plaintiff, V-Guard Industries Ltd, is seeking permanent injunctions against the defendants for passing off their goods using the trademark \"LIVGUARD\" and trade dress. The defendants filed I.A. 8760/2019 under Section 10 of the CPC, seeking a stay of the suits until the disposal of an appeal (RFA 117/2017) filed by the plaintiff in the Kerala High Court. The appeal is against a judgment dated 22nd November, 2016, passed by the Additional District Judge, Ernakulam. The court reserved judgment on 15th December, 2022, and delivered it on 9th January, 2023. (Source: PDF page 2)",
          "content": "2023/DHC/000133 \n \n \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 2 of 19 \n \nI.A. 8760/2019 (u/S 10 of the CPC for stay of suit) in CS(COMM) \n814/2018 \n \n1. \nBy way of the present judgment, I shall dispose of I.A 8759/2019 and \nI.A. 8760/2019 filed on behalf of the defendants under Section 10 of the \nCode of Civil Procedure, 1908 (CPC) seeking stay of the present suits, till \nthe disposal of appeal, bearing no. RFA 117/2017 filed by the plaintiff \nherein before the Kerala High Court against the judgment and decree dated \n22nd November, 2016 passed by the Additional District Judge, Ernakulam in \nOS no. 12/2013. \n2. \nAt the hearing on 4th July, 2019 the senior counsel for the plaintiff \nstated that no reply is required to be filed to the aforesaid applications. \n3. \nCS(COMM) 1018/2016 has been filed on behalf of the plaintiff \nseeking permanent injunction restraining the defendants from passing off the \ngoods of the plaintiff by using the trademark “LIVGUARD” claiming that \nthe same is deceptively similar to the plaintiff‟s trademark “V-GUARD” \nalong with other ancillary reliefs. \n4. \nCS(COMM) 814/2018 has been filed on behalf of the plaintiff seeking \npermanent injunction restraining the defendants from passing off the \nplaintiffs‟ trade dress by the defendants along with other ancillary reliefs. \n5. \nAt the outset it may be relevant to refer to the history of the litigation \nbetween the parties with regard to their competing trademarks. \nI. \nThe plaintiff previously filed a suit, being OS no. 12/2013, before the \nDistrict Court, Ernakulam against Shri Rakesh Malhotra, being the \ndefendant no.1 in CS(COMM) 1018/2016 and the defendant no.2 in \nCS(COMM) 814/2018 seeking relief of permanent injunction \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified",
          "pdf_source": "24.A VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0007",
      "start_index": 3,
      "end_index": 5,
      "summary": "According to the PDF document \"24.A VGUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & ORS.pdf\", the legal proceedings involve a trademark dispute between V-Guard Industries Ltd (plaintiff) and Rakesh Malhotra (defendant). The plaintiff filed a suit (CS(COMM) 1018/2016) against the defendant, alleging infringement of their trademark \"V-GUARD\" and passing off of their goods. \n\nThe case has a complex history, with multiple proceedings and appeals. Key dates include:\n- 11th April 2013: An ex parte injunction was granted, which was later vacated.\n- 1st June 2013: The District Court, Ernakulam, dismissed the plaintiff's interim application.\n- 5th July 2013: The Kerala High Court dismissed the plaintiff's appeal.\n- 22nd November 2013: The plaintiff's Special Leave Petition (SLP) was dismissed.\n- 22nd November 2016: The District Court, Ernakulam, dismissed the plaintiff's suit.\n- 16th August 2017: Issues were framed in CS(COMM) 1018/2016.\n- 19th April 2018: The plaintiff filed a fresh suit (CS(COMM) 814/2018) against the defendant and other parties.\n- 6th March 2019: Issues were framed in CS(COMM) 814/2018.\n\nThe defendants have sought a stay of both suits due to the pendency of the plaintiff's appeal before the Kerala High Court. The Senior Counsel for the defendants has argued that the District Court and Kerala High Court have found no similarity between the plaintiff's and defendant's marks. The judgment was reserved on 15th December 2022 and delivered on 9th January 2023. (Source: 2023/DHC/000133, PDF)",
      "pdf_source": "24.A VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "According to page 3 of the PDF \"24.A VGUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & ORS.pdf\", the plaintiff, V-Guard Industries Ltd, filed a suit against Rakesh Malhotra for trademark infringement and passing off. An ex parte injunction was granted on April 11, 2013, but later vacated by the District Court, Ernakulam on June 1, 2013. The Kerala High Court dismissed the plaintiff's appeal on July 5, 2013. A Special Leave Petition (SLP) filed by the plaintiff was dismissed as withdrawn on November 22, 2013. The plaintiff then filed a new suit, CS(COMM) 1018/2016, in the Delhi High Court after withdrawing the previous suit from the District Court, Ernakulam on November 24, 2015. The judgment in this case was delivered on January 9, 2023. (Source: 2023/DHC/000133)",
          "content": "2023/DHC/000133 \n \n \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 3 of 19 \n \nrestraining him from infringing plaintiff‟s trademark “V-GUARD” \nand from passing off the plaintiff‟s goods. \nII. \nAn ex parte injunction was granted in the aforesaid suit on 11th April, \n2013 restraining Shri Rakesh Malhotra from using the trademark \n“LIVGUARD”. The ex parte injunction order was vacated and the \ninterim application filed on behalf of the plaintiff was dismissed by \nthe District Court, Ernakulam vide order dated 1st June, 2013 holding \nthat there is no similarity between the plaintiff‟s trademark “V-\nGUARD” and the defendant‟s trademark “LIVGUARD”. \nIII. \nAn appeal was filed by the plaintiff against the aforesaid order dated \n1st June, 2013 before the Kerala High Court, which was dismissed by \nthe Kerala High Court vide judgment dated 5th July, 2013, by holding \nthat the defendant‟s trademark “LIVGUARD” is not similar to the \nplaintiff‟s trademark “V-GUARD”. \nIV. \nThe SLP, bearing no. 36230/2013, filed on behalf of the plaintiff \nagainst the aforesaid judgment dated 5th July, 2013, was dismissed as \nwithdrawn on 22nd November, 2013. \nV. \nAn application was filed on behalf of the plaintiff before the District \nCourt, Ernakulam seeking withdrawal of OS no. 12/2013 insofar as it \nrelated to the relief of passing off with liberty to file the same in a \nCourt of competent jurisdiction, which was allowed on 24th \nNovember, 2015. \nVI. \nPursuant to the aforesaid liberty, CS(COMM) 1018/2016 was filed on \nbehalf of the plaintiff before this Court. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified",
          "pdf_source": "24.A VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "According to page 4 of the PDF \"24.A VGUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & ORS.pdf\" (2023/DHC/000133), the District Court, Ernakulam, dismissed the plaintiff's suit on November 22, 2016. The plaintiff filed an appeal (RFA 117/2017) with the Kerala High Court, which is pending. In CS(COMM) 1018/2016, issues were framed on August 16, 2017, and it was decided that no oral evidence was required. The plaintiff filed a fresh suit (CS(COMM) 814/2018) on April 19, 2018, alleging passing off of its trade dress. Issues were framed in CS(COMM) 814/2018 on March 6, 2019, and both suits were directed to be heard together. On July 4, 2019, the defendants filed applications seeking a stay of both suits. Key dates and case numbers are mentioned, including CS(COMM) 1018/2016 and CS(COMM) 814/2018. (Source: 2023/DHC/000133, PDF page 4)",
          "content": "2023/DHC/000133 \n \n \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 4 of 19 \n \nVII. \nAfter the trial, a final judgment and decree was passed by the District \nCourt, Ernakulam, dismissing the suit filed by the plaintiff on 22nd \nNovember, 2016. \nVIII. \nAgainst the aforesaid dismissal, the plaintiff filed an appeal, bearing \nno. RFA 117/2017 before the Kerala High Court, which appeal is \nstated to be pending. \nIX. \nOn 16th August, 2017, issues were framed in CS(COMM) 1018/2016 \nand it was recorded that no oral evidence is required to be led and that \nthe suit would be decided on the basis of the pleadings of the parties. \nX. \nSubsequently, an application, being I.A.10323/2017 in CS(COMM) \n1018/2016 was filed on behalf of the plaintiff seeking leave to lead \nevidence. The said application was disposed of as not pressed on 1st \nFebruary, 2018 and liberty was granted to the plaintiff to file a suit on \nany cause of action that was not the subject matter of CS(COMM) \n1018/2016. \nXI. \nOn 19th April, 2018, the plaintiff filed a fresh suit being CS(COMM) \n814/2018 against Shri Rakesh Malhotra, SAR Group (defendant no.3) \nand Vave India Energy Solutions Pvt. Ltd. (defendant no.1) alleging \npassing off of its trade dress. \nXII. \nOn 6th March, 2019, issues were framed in CS(COMM) 814/2018 and \nit was noted that no oral evidence is required to be led in the aforesaid \nsuit. It was further directed that both the suits shall be heard together \nand were posted for final hearing. \nXIII. \nOn 4th July, 2019, the present applications were filed on behalf of the \ndefendants seeking stay of both the aforesaid suits in view of the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified",
          "pdf_source": "24.A VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 5",
          "node_id": "0006",
          "start_index": 5,
          "end_index": 5,
          "summary": "According to page 5 of the PDF \"24.A VGUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & ORS.pdf\", the senior counsel for the defendants made submissions regarding the similarity between the plaintiff's and defendants' marks. The District Court, Ernakulam, and the Kerala High Court had previously found no similarity between the marks. The counsel argued that the present suits should be stayed until the plaintiff's appeal is decided, as the issues and subject matter are the same as in the previous suit. The counsel relied on judgments in Manohar Lal Chopra v. Rai Bahadur Rao Raja Set Hiralal (1962) and H.S. SAHNI v. Mukul Singhal (2022) to support their argument. The case details are CS(COMM) 1018/2016 and CS(COMM) 814/2018, with judgment reserved on December 15, 2022, and delivered on January 9, 2023. (Source: 2023/DHC/000133)",
          "content": "2023/DHC/000133 \n \n \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 5 of 19 \n \npendency of the appeal filed by the plaintiff before the Kerala High \nCourt.  \n6. \nSenior counsel appearing on behalf of the defendants has made the \nfollowing submissions:  \nI. The District Court, Ernakulam as well as the Kerala High Court have \nboth returned findings that there is no similarity between the marks of \nthe plaintiff and the defendant. Reliance in this regard is placed on (i) \nthe order dated 1st June, 2013 passed by the District Court, Ernakulam \nwhile dismissing the interim application of the plaintiff; (ii) order \ndated 5th July, 2013 passed by the Kerala High Court while dismissing \nthe appeal filed by the plaintiff against the order dated 1st June, 2013 \npassed by the District Court, Ernakulam and (iii) the judgment and \ndecree dated 22nd November, 2016 passed by the District Court, \nErnakulam. \nII. Since, the issues to be determined in both the present suits are with \nregard to similarity between the marks of the plaintiff and the \ndefendants and the subject matter of the present suits is directly and \nsubstantially the same as in the suit filed by the plaintiff before the \nDistrict Court, Ernakulam and the appeal pending before the Kerala \nHigh Court, the present suits liable to be stayed till the appeal filed by \nthe plaintiff is finally decided.  \nIII. Reliance is placed on: \na) The judgment of a four Judge Bench in Manohar Lal Chopra v. \nRai Bahadur Rao Raja Set Hiralal, 1962 Supp (1) SCR 450. The \njudgment of a Co-ordinate Bench of this Court in H.S. SAHNI v. \nMukul Singhal, (2022) 1 HCC (Del) 155 to submit that provisions \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified",
          "pdf_source": "24.A VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0020",
      "start_index": 6,
      "end_index": 17,
      "summary": "According to the PDF document \"VGUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & ORS\" (2023/DHC/000133), a legal proceeding is ongoing in the High Court of Delhi. The case involves two suits, CS(COMM) 1018/2016 and CS(COMM) 814/2018, where V-Guard Industries Ltd is the plaintiff and Rakesh Malhotra & Ors are the defendants.\n\nThe defendants have filed an application to stay the suit under Section 10 of the Civil Procedure Code (CPC), citing that a similar suit is pending before the District Court, Ernakulam. The defendants argue that the suits have the same subject matter and that the Court should exercise its discretion to stay the suit to avoid contradictory verdicts.\n\nThe plaintiff, however, contends that the applications were filed belatedly and that the subject matter of the two suits is not identical. The plaintiff also argues that the reliefs of passing off and infringement arise from different causes of action and that Section 10 of the CPC is merely a rule of procedure.\n\nThe Court has reserved judgment on December 15, 2022, and delivered its judgment on January 9, 2023. The PDF document outlines the legal arguments, facts, and decisions made by the Court, including the reliance on various judgments and orders, such as Ruston & Hornsby Ltd. v. Zamindara Engineering Co. and National Institute of Mental Health & Neuro Sciences v. C. Parameshwara. (Source: 2023/DHC/000133, PDF)",
      "pdf_source": "24.A VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
      "nodes": [
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "According to page 6 of the PDF \"24.A VGUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & ORS.pdf\", the defendants argued that the suit should be stayed under Section 10 of the CPC to avoid contradictory verdicts. They cited judgments from Romesh Kumar Bhatia v. Zorrik Enterprises and Ruston & Hornsby Ltd. v. Zamindara Engineering Co. In response, the plaintiff's senior counsel argued that the applications were filed belatedly and that the subject matter of both suits must be identical for a stay under Section 10 of the CPC. The plaintiff cited the Supreme Court's judgment in National Institute of Mental Health & Neuro Sciences v. C. Parameshwara. The plaintiff also argued that the reliefs of passing off and infringement arise from different causes of action, citing Mind Gym Ltd. v. Mindgym Kids. (Source: 2023/DHC/000133, CS(COMM) 1018/2016 & CS(COMM) 814/2018)",
          "content": "2023/DHC/000133 \n \n \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 6 of 19 \n \nof Section 10 of the CPC are mandatory and the objective behind \nSection 10 of the CPC is to avoid possibility of contradictory \nverdicts by two Courts in respect of the same relief.  \nb) The judgment of a Co-ordinate Bench of this Court in Romesh \nKumar Bhatia v. Zorrik Enterprises, 1980 SCC OnLine Del 202, \nwhere in similar circumstances, this Court had stayed a suit \npending before this Court on the ground that a similar earlier suit \nwas filed before the District Court.  \nc) The judgment of the Supreme Court in Ruston & Hornsby Ltd. v. \nZamindara Engineering Co., (1969) 2 SCC 727 to contend that \nboth, for the purposes of infringement and for passing off, same \ntest has to be applied by the Court with regard to likelihood of \nconfusion or deception arising from similarity of marks. \n7. \nPer contra, senior counsel appearing on behalf of the plaintiff has \nmade the following submissions: \nI. \nThe aforesaid applications have been filed belatedly only when the \nsuits were set for final hearing. \nII. \nFor a suit to be stayed under Section 10 of the CPC, the subject matter \nin both the suits have to be identical. Reliance in this regard is placed \non the judgment of the Supreme Court in National Institute of \nMental Health & Neuro Sciences v. C. Parameshwara, (2005) 2 \nSCC 256. \nIII. \nThe reliefs of passing off and infringement are arising from entirely \ndifferent causes of action and therefore, it cannot be said that the \nsubject matters in issue in the two suits are directly and substantially \nthe same. Reliance is placed on Mind Gym Ltd. v. Mindgym Kids \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified",
          "pdf_source": "24.A VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 7",
          "node_id": "0009",
          "start_index": 7,
          "end_index": 7,
          "summary": "According to page 7 of the PDF \"24.A VGUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & ORS.pdf\" (2023/DHC/000133), the plaintiff's arguments include that Section 10 of the CPC is a rule of procedure and courts are not bound by it, citing Pukhraj D. Jain And Ors. v. G. Gopalakrishna (2004) 7 SCC 251. The plaintiff also argues that the bar under Section 10 would not apply since the District Court, Ernakulam lacked territorial jurisdiction. The plaintiff relies on the Kerala High Court's order of November 24, 2015, and the judgment in Bristol-Myers Squibb Holdings Ireland Unlimited Company And Ors. v. Natco Pharma, 2020 SCC OnLine Del 200. The senior counsel for the defendants made submissions in rejoinder. The case involves CS(COMM) 1018/2016 and CS(COMM) 814/2018, with judgment reserved on December 15, 2022, and delivered on January 9, 2023. (Source: 24.A VGUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & ORS.pdf)",
          "content": "2023/DHC/000133 \n \n \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 7 of 19 \n \nLibrary Pvt. Ltd., 2014 SCC OnLine Del 1240 and Pernod Ricard \nIndia (P) Ltd. v. Frost Falcon Distilleries Ltd., 2022 SCC OnLine \nDel 646. \nIV. \nThe Section 10 is merely a rule of procedure and the Courts are not \nbound by the same. Reliance is placed on the judgment of the \nSupreme Court in Pukhraj D. Jain And Ors. v. G. Gopalakrishna \n(2004) 7 SCC 251.  \nV. \nFor provisions of Section 10 of the CPC to apply, the Court in which \nearlier suit has been filed has to be a Court with competent \njurisdiction to decide the said suit. In the present case, the District \nCourt, Ernakulam did not have the territorial jurisdiction in respect of \nthe claim of the plaintiff for passing off and therefore, the bar under \nSection 10 would not apply. Reliance is placed on the order passed by \nthe Kerala High Court on 24th November, 2015, whereby the plaintiff \nhas been allowed to withdraw its claim in so far as the relief of \npassing off is concerned, with liberty to file it before a competent \nCourt. Reliance is placed on the judgment in Bristol-Myers Squibb \nHoldings Ireland Unlimited Company And Ors. v. Natco Pharma, \n2020 SCC OnLine Del 200. \nVI. \nThe Section 10 of the CPC only envisages a stay of the trial and the \nsame cannot apply to the present suit, where it has been recorded that \nno evidence is to be recorded and the suit has been set for final \nhearing. \n8. \n  In rejoinder, senior counsel on behalf of the defendants has made the \nfollowing submissions: \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified",
          "pdf_source": "24.A VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 8",
          "node_id": "0010",
          "start_index": 8,
          "end_index": 8,
          "summary": "According to page 8 of the PDF \"24.A VGUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & ORS.pdf\" (2023/DHC/000133), the court addresses the defendants' application. The court notes that there is no delay in filing the application, as it was filed immediately after issues were framed in CS(COMM) 814/2018 on March 6, 2019. The court also interprets Section 10 of the CPC, stating that \"jurisdiction\" refers to inherent jurisdiction, not territorial jurisdiction. The term \"trial\" in Section 10 includes the final hearing of the suit. The court heard counsels for both parties and found no merit in the plaintiff's claim that the application was filed belatedly to delay the suit's adjudication. The applications were filed on July 1, 2019, after issues were framed, and the court does not consider this a delay. (Source: 2023/DHC/000133, PDF page 8)",
          "content": "2023/DHC/000133 \n \n \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 8 of 19 \n \nI. \nThere is no delay on the part of the defendants in filing the present \napplication. The present application was filed immediately after the \nissues were framed in CS(COMM) 814/2018 on 6th March, 2019. \nII. \nThe word „jurisdiction‟ used in Section 10 of the CPC is not in \nrelation to territorial jurisdiction of the Court but in the context of \ninherent jurisdiction. It cannot be denied that the District Court, \nErnakulam, Kochi had the inherent jurisdiction to entertain a suit for \npassing off. Reliance in this regard is placed on the judgment of the \nKarnataka High Court in Channabasappa Kamadal & Sons v. \nKishan Chand & Co. & Anr., 1971 SCC OnLine Kar 182. \nIII. \nIt is wrong to contend that the word „trial‟ in Section 10 of the CPC is \nconfined to the recording of evidence in the suit. The term „trial‟ \nincludes the final hearing of the suit as well. \n9. \nI have heard the counsels for the parties and perused the record. \n10. \nI do not find any merit in the submissions made on behalf of the \nplaintiff that the present applications have been filed belatedly only to delay \nthe final adjudication of the suit. CS(COMM) 814/2018 was filed on behalf \nof the plaintiff only on 19th April, 2018 and issues were framed therein on 6th \nMarch, 2019 and it was directed that both the suits were to be heard \ntogether. The present applications were filed on behalf of the defendants on \n1st July, 2019. Therefore, it cannot be said that there was a delay in filing the \npresent applications.  \n11. \nAs far back in 1962, the four Judge Bench in the Manohar Lal \nChopra (supra) has held that the provisions of Section 10 of the CPC are \nclear, definite and mandatory, and the Court in which the subsequent suit \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified",
          "pdf_source": "24.A VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 9",
          "node_id": "0011",
          "start_index": 9,
          "end_index": 9,
          "summary": "According to page 9 of the PDF \"24.A VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf\" (2023/DHC/000133), the court discusses the mandatory nature of Section 10 of the Civil Procedure Code (CPC). The Supreme Court's judgment in Aspi Jal v. Khushroo Rustom Dadyburjor (2013) 4 SCC 333 is cited, which states that Section 10 CPC is mandatory and prohibits the court from proceeding with the trial of a subsequent suit if the parameters are fulfilled. The objective is to prevent concurrent jurisdiction courts from entertaining parallel litigations and to avoid contradictory verdicts. The fundamental test to determine applicability is whether the final decision in the first suit would operate as res-judicata in the subsequent suit. This is mentioned in the context of CS(COMM) 1018/2016 and CS(COMM) 814/2018, with judgment reserved on December 15, 2022, and delivered on January 9, 2023.",
          "content": "2023/DHC/000133 \n \n \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 9 of 19 \n \nhas been filed is prohibited from proceeding with the trial of the suit if the \nparameters of Section 10 of the CPC are fulfilled.  \n12. \nRelying upon the judgment of the Supreme Court in Aspi Jal v. \nKhushroo Rustom Dadyburjor, (2013) 4 SCC 333, a Co-ordinate Bench of \nthis Court in H.S. SAHNI (supra) has reiterated the position that provision \nof Section 10 of the CPC is mandatory in nature. The relevant observations \nin H.S. SAHNI (supra) are set out below: \n“22. \nEven in Aspi Jal (supra), which is relied upon by the \nlearned senior counsel for the plaintiff, the Supreme Court has \nreiterated that the use of the negative expression in Section 10 \nCPC makes the provision mandatory and the court in which the \nsubsequent suit has been filed is prohibited from proceeding with \nthe trial of that suit. It was reaffirmed that the basic purpose and \nthe underlying object of Section 10 of the Code is to prevent the \ncourts \nof \nconcurrent \njurisdiction \nfrom \nsimultaneously \nentertaining and adjudicating upon two parallel litigations in \nrespect of same cause of action, same subject matter and the \nsame relief. The objective is also to avoid the possibility of \ncontradictory verdicts by two courts in respect of the same relief \nand is aimed to protect the defendant from multiplicity of \nproceedings.  \n \n23. \nThe fundamental test that is to be applied to determine \nwhether Section 10 was applicable or not, is to see whether on \nthe final decision being reached in the first suit, such decision \nwould operate as res-judicata in the subsequent suit. Where there \nwas “identity of matter” in both the suits i.e., the whole of the \nsubject matter in both the proceedings were identical, even if \nfurther reliefs were claimed in the subsequent suit, it would be \nimmaterial and the second suit would necessarily have to be \nstayed.”  \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified",
          "pdf_source": "24.A VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 10",
          "node_id": "0012",
          "start_index": 10,
          "end_index": 10,
          "summary": "According to page 10 of the PDF \"24.A VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf\" (2023/DHC/000133), a Division Bench of the Delhi High Court dismissed an appeal (FAO(OS) (COMM) 70/2022) on November 11, 2022. The court cited a similar case, Romesh Kumar Bhatia, where a Co-ordinate Bench observed that an independent finding on deception and confusion cannot be made in a separate suit for infringement of a registered trade mark. The court concluded that as long as the finding of the Additional District Judge in the earlier suit stands, no relief can be granted to the plaintiffs in the present suit. The proper course for the plaintiffs is to pursue their remedy in the appeal pending in the High Court. The case numbers involved are CS(COMM) 1018/2016 and CS(COMM) 814/2018.",
          "content": "2023/DHC/000133 \n \n \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 10 of 19 \n \n13. \nThe appeal against the aforesaid judgment, being FAO(OS) (COMM) \n70/2022, was dismissed by a Division Bench of this Court vide order dated \n11th November, 2022. \n14. \nIn Romesh Kumar Bhatia (supra) a Co-ordinate Bench of this Court \nwas seized of a similar issue. In the said case, a suit was filed by the plaintiff \nbefore an Additional District Judge based on the claim of passing off and the \nsaid suit was dismissed. An appeal against the said dismissal was pending \nbefore the High Court. During the pendency of the appeal, a suit for \ninfringement of registered trade mark was filed by the plaintiffs. One of the \nissues framed in the infringement suit was whether the said suit was liable to \nbe stayed. While considering the issue of grant of stay under Section 10 of \nthe CPC, the following observations were made: \n“17. \nThe question that therefore, arises is whether an \nindependent and different finding on the matter of deception \nand conclusion can be given in this suit. This will be \ninescapable as no relief can be granted to the plaintiffs unless it \nis held that the use of the word “Zorrik” by the defendants \nresults in deception and confusion so as to infringe the trade \nmark of the plaintiffs. \n \nXXX \n \n \n \nXXX  \n \n \n \nXXX \n \n22. \nWith this state of law, there is no escape from the \nconclusion that as long as the finding of the Additional District \nJudge in the earlier suit that the sale of ties by the defendants \nunder the mark “Zorrik” does not result in deception and \nconfusion with the consumers in the market so as to identify them \nas those of the plaintiffs stands, no relief whatsoever can be \ngranted to the plaintiffs in the present suit. The proper course \nfor the plaintiffs, therefore, is to pursue their remedy in the \nappeal now pending in the High Court. The subject-matter in \nthe present suit to this extent, therefore, must be held as directly \nand substantially similar to that involved in that appeal. The \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified",
          "pdf_source": "24.A VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 11",
          "node_id": "0013",
          "start_index": 11,
          "end_index": 11,
          "summary": "According to page 11 of the PDF \"24.A VGUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & ORS.pdf\" (2023/DHC/000133), the court discusses the applicability of Section 10 of the Code of Civil Procedure. The court states that there need not be an identical subject matter and cause of action in two suits, but rather a substantial identity between matters in dispute. \n\nThe court references previous cases, including Shorab Merwanji Modi v. Mansata Film Distributors and Guruswami Asari v. Raju Asari. The court also mentions a suit filed before the District Court, Ernakulam, where issue no.3 was framed regarding the similarity between the trademarks \"LIVGUARD\" and \"V-GUARD\". The District Court gave a finding that the marks are not deceptively similar. The judgment was dated 22nd November, 2016.",
          "content": "2023/DHC/000133 \n \n \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 11 of 19 \n \nprovisions of S. 10 of the Code of Civil Procedure are, \ntherefore, attracted. It is not necessary that the subject matter \nand cause of action in two suits should be identical. Where \nthere is substantial identity between matters in dispute in earlier \nand later suits, the final decision in the earlier suit would \noperate as binding in the subsequent suit. It is also immaterial \nthat different reliefs are claimed, in case the matters in issue in \nthe two suits are substantially the same. (See in this respect AIR \n1973 Madras 473, in Shorab Merwanji Modi v. Mansata Film \nDistributors, AIR 1957 Calcutta 727, in Guruswami Asari v. \nRaju Asari.” \n \n15. \nThe aforesaid legal principles and particularly, the aforesaid \nobservations in Romesh Kumar Bhatia (supra) as set out above are squarely \napplicable in the facts and circumstances of the present case.  \n16. \nIn the suit filed before the District Court, Ernakulam, the following \nissue was framed as issue no.3: \n“3. Is the trademark „LIVGUARD‟ identical with or deceptively \nsimilar to the trademark „V-GUARD‟?” \n \n17. \nThe District Court, Ernakulam, after a detailed discussion gave a \nfinding that the aforesaid marks of the plaintiff and the defendants are not \ndeceptively similar. The conclusion as set out in paragraph 43 of the \njudgment dated 22nd November, 2016 is set out below:  \n“43. \nTo conclude, what is revealed is that on scores of \nphonetic similarity, visual similarity, similarity of the nature of \npresentation like words similarity and label similarity, and other \ngiven scores of comparison, as revealed from the law trite on the \npoint discussed supra, the plaintiff is not able to establish that \neither the marks are similar or even deceptively similar. Issue \nno.3 is, therefore, found against the plaintiff. It necessarily \nfollows that both marks shall not go to create any confusion in \nthe mindsets of those intended purchasers buying these products \nfrom the often market. This is answer to Issue number 4.” \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified",
          "pdf_source": "24.A VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 12",
          "node_id": "0014",
          "start_index": 12,
          "end_index": 12,
          "summary": "According to page 12 of the PDF \"24.A VGUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & ORS.pdf\" (2023/DHC/000133), the plaintiff, V-Guard Industries Ltd, has filed a case against the defendants, alleging that their mark \"LIVGUARD\" is deceptively similar to the plaintiff's mark \"V-GUARD\". The plaintiff seeks a decree of permanent injunction to restrain the defendants from passing off their goods as the plaintiff's. Issues were framed in CS(COMM) 1018/2016 on August 16, 2017, including whether the defendants' adoption of the mark \"LIVGUARD\" amounts to passing off. In CS(COMM) 814/2018, the plaintiff seeks an injunction against the defendants for passing off the plaintiff's trade dress. The case is pending adjudication before the Kerala High Court, with a judgment reserved on December 15, 2022, and delivered on January 9, 2023.",
          "content": "2023/DHC/000133 \n \n \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 12 of 19 \n \n18. \nAdmittedly, an appeal has been filed by the plaintiff against the \naforesaid judgment dated 22nd November, 2016, which is pending \nadjudication before the Kerala High Court. \n19. \nIn the amended plaint filed by the plaintiff in CS(COMM) 1018/2016, \nthe case set up by the plaintiff is that the wordmark “LIVGUARD” is \nconfusingly visually, structurally, phonetically and deceptively similar to the \nplaintiff‟s mark “V-GUARD”. Reference in this regard may be made to \nparagraphs 2A, 2C and 2K of the amended plaint. Based on the above, a \ndecree of permanent injunction is sought against the defendants restraining \nthe defendants from passing off the defendants‟ goods as that of the \nplaintiff‟s on the ground of the defendants‟ mark “LIVGUARD” being \ndeceptively similar to the plaintiff‟s mark “V-GUARD”. \n20. \nIssues were framed in CS(COMM) 1018/2016 on 16th August, 2017. \nReference may be made to issues no.1 and 4, which are set out below: \n“1. \nWhether defendants' adoption and use of the mark \n\"Livguard\" amounts to passing off of, goods as those originating \nfrom the plaintiff?  \n \n \n \n \n \nOPP \nXXX \n \n \n \nXXX  \n \n \n \nXXX \n \n4. \nWhether use of defendant's mark \"Livguard\" word per se \nand/ or as it is being actually used, does not amount to passing \noff as plaintiff s mark?  \n \n \n \n \n        OPD” \n \n21. \nIn CS(COMM) 814/2018, the plaintiff has sought an injunction \nagainst the defendants in respect of defendants passing off the \nplaintiffs‟ trade dress. A comparison has been drawn out in respect of \nthe trade dress of the plaintiff and the defendants in paragraph 2 of the \nplaint, which shows that the wordmark “LIVGUARD” is a prominent \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified",
          "pdf_source": "24.A VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 13",
          "node_id": "0015",
          "start_index": 13,
          "end_index": 13,
          "summary": "According to page 13 of the PDF \"24.A VGUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & ORS.pdf\", the court framed issues on March 6, 2019, including whether the defendants' trade dress is similar to the plaintiff's and whether the use of the trade dress amounts to passing off. The court noted that the outcome of the suit would depend on the comparison of the two marks. The court also referenced Section 10 of the CPC, which aims to prevent concurrent jurisdiction from deciding suits between the same parties with the same cause of action. The District Court, Ernakulam, had previously given a finding that there is no phonetic or visual similarity between the trademarks. The judges involved include Mr. Akhil Sibal, Senior Advocate, and the judgment was delivered on January 9, 2023. (Source: 2023/DHC/000133)",
          "content": "2023/DHC/000133 \n \n \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 13 of 19 \n \npart of defendants‟ trade dress and the wordmark „V-GUARD‟ is a \nprominent part of the plaintiff‟s trade dress. Issues were framed in the \nsaid suit on 6th March, 2019. A reference may be made to the following \nissues: \n“(i) Whether the trade dress of the defendants is similar / deceptively \nsimilar to the trade dress of the plaintiff?  \n \n \nOPP. \n \n(ii) Whether the cumulative effect of the use of the trade dress along \nwith trade mark by the defendants amounts to the defendants passing \noff their goods as that of the plaintiff?  \n \n \nOPP.” \n \n22. \nOn 6th March, 2019, the Court also made an observation that the \noutcome of the suit would be governed only on a comparison of the \ntwo marks, whether there is any similarity/ dissimilarity between the \ntwo marks. \n23. \nThe intent behind Section 10 of the CPC is to prevent Courts of \nconcurrent jurisdiction from simultaneously deciding suits between the same \nparties, involving directly and substantially the same cause of action. The \nobjective is based on the principle of judicial comity and to avoid two \ncontradictory verdicts by Courts of competent jurisdiction.   \n24. \nA reading of the judgment and decree dated 22nd November, 2016, \npassed by the District Court, Ernakulam, the pleadings in the present suits \nand the issues framed herein, leaves no doubt in my mind that the issues that \nhave to be adjudicated in the present suits, were subject matter of the suit \nbefore the District Court, Ernakulam, and a definite finding has been given \nin the said suit. The finding given by the District Court, Ernakulam that \nthere is no phonetic or visual similarity between the trademarks of the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified",
          "pdf_source": "24.A VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 14",
          "node_id": "0016",
          "start_index": 14,
          "end_index": 14,
          "summary": "According to page 14 of the PDF \"24.A VGUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & ORS.pdf\", the court states that the subject matter of the present suits is substantially identical to the subject matter of the suit before the District Court, Ernakulam, which is now pending before the Kerala High Court. The court notes that no submission was made to suggest the issues are not the same, and proceeding with the present suits could result in conflicting judgments. The plaintiff's counsel relies on National Institute of Mental Health & Neuro Sciences to argue that suits under Section 10 of the CPC require identical subject matters. The court aims to prevent parallel trials and conflicting findings on the same issues. Key dates mentioned include Judgment Reserved on December 15, 2022, and Judgment Delivered on January 9, 2023. (Source: 2023/DHC/000133)",
          "content": "2023/DHC/000133 \n \n \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 14 of 19 \n \nplaintiff and the defendant, constitutes res judicata and is binding on the \nplaintiff and in light of the aforesaid finding, no relief can be granted to the \nplaintiffs in the present suit. Therefore, in my considered view the subject \nmatter of the present suits is directly and substantially identical to the \nsubject matter of the suit before the District Court, Ernakulam, and is now \nthe subject matter of an appeal pending before the Kerala High Court. It is to \nbe noted that no submission has been made on behalf of the plaintiff to the \neffect that the issues to be determined in the present suits and the suit before \nthe District Court, Eranakulam are not directly and substantially the same.  \nTherefore, if the present suits are permitted to proceed, there could be a \npossibility of conflicting judgments in respect of similar issues between the \nsame parties.   \n25. \nCounsel for the plaintiff has placed reliance on National Institute of \nMental Health & Neuro Sciences (supra)  to contend that for a suit to be \nstayed under Section 10 of the CPC, the subject matter in both the suits have \nto be identical. Paragraph 8 of the aforesaid judgment relied upon by the \nplaintiff is set out below: \n“8.  The object underlying Section 10 is to prevent courts of \nconcurrent jurisdiction from simultaneously trying two parallel \nsuits in respect of the same matter in issue. The object underlying \nSection 10 is to avoid two parallel trials on the same issue by two \ncourts and to avoid recording of conflicting findings on issues \nwhich are directly and substantially in issue in previously \ninstituted suit. The language of Section 10 suggests that it is \nreferable to a suit instituted in the civil court and it cannot apply \nto proceedings of other nature instituted under any other statute. \nThe object of Section 10 is to prevent courts of concurrent \njurisdiction from simultaneously trying two parallel suits \nbetween the same parties in respect of the same matter in issue. \nThe fundamental test to attract Section 10 is, whether on final \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified",
          "pdf_source": "24.A VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 15",
          "node_id": "0017",
          "start_index": 15,
          "end_index": 15,
          "summary": "According to page 15 of the PDF \"24.A VGUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & ORS.pdf\" (2023/DHC/000133), the court discusses Section 10 of the CPC, which applies to cases with identical subject-matter in both suits. The Supreme Court distinguishes between \"directly and substantially in issue\" and \"incidentally or collaterally in issue\". The plaintiff's reliance on National Institute of Mental Health & Neuro Sciences is deemed misplaced. The Supreme Court in Ruston & Hornsby Ltd. states that for similar marks, the test of infringement is the same as in an action for passing off, considering likelihood of confusion or deception. The case involves V-Guard Industries Ltd (plaintiff) and Rakesh Malhotra & Ors (defendants), with judgments reserved on December 15, 2022, and delivered on January 9, 2023.",
          "content": "2023/DHC/000133 \n \n \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 15 of 19 \n \ndecision being reached in the previous suit, such decision would \noperate as res judicata in the subsequent suit. Section 10 applies \nonly in cases where the whole of the subject-matter in both the \nsuits is identical. The key words in Section 10 are “the matter in \nissue is directly and substantially in issue” in the previous \ninstituted suit. The words “directly and substantially in issue” \nare used in contradistinction to the words “incidentally or \ncollaterally in issue”. Therefore, Section 10 would apply only if \nthere is identity of the matter in issue in both the suits, meaning \nthereby, that the whole of the subject-matter in both the \nproceedings is identical.” \n \n26. \nAs can be seen from the extract quoted above, the Supreme Court \nsought to distinguish the key words used in Section 10 of the CPC, matter in \nissue is “directly and substantially in issue” in a previously instituted suit, \nfrom the words “incidentally or collaterally in issue”.  In the case before the \nSupreme Court, the respondent sought stay of a suit under Section 10 of the \nCPC on the ground that appellant had filed a Writ Petition against the award \nof the Labour Court and the same was pending before the High Court. The \nSupreme Court held that since the scope of the Writ Petition was entirely \ndistinct and separate from the suit filed before the Civil Court, stay under \nSection 10 of the CPC could not have been granted. Therefore, the reliance \nplaced by the plaintiff on National Institute of Mental Health & Neuro \nSciences (supra)  is misplaced.  \n27. \nThe Supreme Court in Ruston & Hornsby Ltd. (supra) has \ncategorically held that where the marks of the defendant and the plaintiff are \nnot exactly identical, but are similar, the test of infringement would be the \nsame as in an action for passing off i.e., whether there is a likelihood of \nconfusion or deception arising from the similarity of marks. The causes of \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified",
          "pdf_source": "24.A VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 16",
          "node_id": "0018",
          "start_index": 16,
          "end_index": 16,
          "summary": "According to page 16 of the PDF \"24.A VGUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & ORS.pdf\" (2023/DHC/000133), the court discusses the difference between infringement and passing off. The plaintiff's reliance on judgments in Mind Gym Ltd. and Pernod Ricard is deemed misplaced. The court also addresses the plaintiff's argument regarding Section 10 of the CPC, citing a four-Judge Bench of the Supreme Court in Manohar Lal Chopra, which held that provisions of Section 10 are mandatory. The plaintiff contests the territorial jurisdiction of the District Court, Ernakulam, to entertain the claim of passing off, but the defendants' senior counsel argues that the expression \"Court in India having jurisdiction to grant the relief\" applies. Judgment was reserved on December 15, 2022, and delivered on January 9, 2023. (Source: 2023/DHC/000133)",
          "content": "2023/DHC/000133 \n \n \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 16 of 19 \n \naction in a suit for infringement and in a suit for passing off may be \ndifferent, as infringement is a statutory remedy and passing off is a common \nlaw remedy, however, the issue with regard to likelihood of confusion \narising from the similarity of marks has to be decided in both the actions. In \nview thereof reliance placed by the plaintiff on the judgment in Mind Gym \nLtd. (supra) and Pernod Ricard (supra), is misplaced.   \n28. \nReliance has been placed on behalf of the plaintiff on the judgment in \nPukhraj D. Jain (supra) to contend that provisions of Section 10 of the CPC \nare procedural and mere filing of an application under Section 10 of the CPC \ndoes not preclude the Court from examining the merits of the matter. \nHowever, the said judgment does not bar the Court from dealing with an \napplication under Section 10 of the CPC before the final adjudication of the \nsuit.  As noted above, a four Judge Bench of Supreme Court in Manohar \nLal Chopra (supra) has categorically held that provisions of Section 10 of \nthe CPC are mandatory. Therefore, reliance placed on Pukhraj D. Jain \n(supra) is also misplaced. \n29. \nNext, it has been contended on behalf of the plaintiff that the District \nCourt, Ernakulam did not have the territorial jurisdiction to entertain the \nclaim of passing off and therefore, the bar under Section 10 of the CPC \nwould not apply in view of the language used in Section 10 i.e., “Court in \nIndia having jurisdiction to grant the relief claimed”. In this regard, reliance \nhas been placed on a judgment of a Co-ordinate Bench in Bristol-Myers \n(supra). \n30. \nOn the other hand, senior counsel on behalf of the defendants submits \nthat the expression “Court in India having jurisdiction to grant the relief \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified",
          "pdf_source": "24.A VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 17",
          "node_id": "0019",
          "start_index": 17,
          "end_index": 17,
          "summary": "According to page 17 of the PDF \"24.A VGUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & ORS.pdf\" (2023/DHC/000133), the Court discusses the concept of \"Court in India having jurisdiction to grant the relief claimed\" under Section 10 of the CPC. The Court agrees with the Karnataka High Court's view in Channabasappa Kamadal & Sons that this phrase refers to a Court's inherent jurisdiction, not territorial jurisdiction. The plaintiff's reliance on the judgment in Bristol-Myers is deemed misplaced, as the earlier suit was filed by the defendant in a Court lacking inherent jurisdiction, whereas in this case, the plaintiff filed the earlier suit in the District Court, Ernakulam, which had inherent jurisdiction. The Court is deciding on CS(COMM) 1018/2016 and CS(COMM) 814/2018, with judgment reserved on December 15, 2022, and delivered on January 9, 2023.",
          "content": "2023/DHC/000133 \n \n \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 17 of 19 \n \nclaimed” refers to a Court having inherent jurisdiction to entertain the suit \nand not territorial jurisdiction. \n31. \nReliance placed on behalf of the plaintiff on the judgment in Bristol-\nMyers (supra) is misplaced as the findings in the aforesaid judgment were \nmade in the context of a prior suit having been instituted by the defendant \ntherein in a Court which did not have the inherent jurisdiction to entertain \nthe suit. Therefore, in Bristol-Myers (supra) the Court held that the earlier \nsuit was an abuse of the process of law. In the present case, it was the \nplaintiff itself that had filed the earlier suit in District Court, Ernakulam and \nit is nobodies‟ case that the District Court, Ernakulam lacked inherent \njurisdiction to try the suit. \n32. \nIn Channabasappa Kamadal & Sons (supra), the Karnataka High \nCourt expressed the view that the expression “Court in India having \njurisdiction to grant the relief claimed” used in Section 10 of the CPC does \nnot deal with territorial jurisdiction and only refers to the competency of the \nCourt to entertain and grant the relief sought in the suit. I am in respectful \nagreement with the view expressed by the Karnataka High Court in  \nChannabasappa Kamadal & Sons (supra). The expression “Court in India \nhaving jurisdiction to grant the relief claimed” used in Section 10 of the \nCPC cannot be applied in the context of a Court in India not having \nterritorial jurisdiction and would be applicable only when the Court where \nthe earlier suit has been instituted lacks the inherent jurisdiction to try the \nsaid suit.   \n33. \nThere is another aspect to be considered with regard to the aforesaid \nissue. The plaintiff had filed the suit based on both infringement as well as \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified",
          "pdf_source": "24.A VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0023",
      "start_index": 18,
      "end_index": 19,
      "summary": "According to the PDF document \"VGUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & ORS.pdf\", the High Court of Delhi at New Delhi delivered a judgment on January 9, 2023, in the case of CS(COMM) 1018/2016 and CS(COMM) 814/2018. The plaintiff, V-Guard Industries Ltd, had filed a suit against Rakesh Malhotra and others.\n\nThe court decision revealed that the plaintiff had initially filed a suit before the District Court, Ernakulam, which was later withdrawn in part, with liberty to file a fresh suit. The plaintiff then filed a new suit, CS(COMM) 1018/2016, before the High Court of Delhi. The defendant argued that the High Court of Delhi lacked territorial jurisdiction, while the plaintiff claimed that the bar under Section 10 of the CPC only applied to the trial of the suit.\n\nThe court disagreed with the plaintiff's submission, stating that the term \"trial\" included the entire process of recording evidence and final arguments. The court allowed both applications, staying the present suits with liberty to the parties to revive them after the decision in RFA 117/2017 pending before the Kerala High Court.\n\nKey dates mentioned in the document include December 15, 2022, when the judgment was reserved, and January 9, 2023, when the judgment was delivered. The court also cancelled a previously set date of January 23, 2023. The PDF document (2023/DHC/000133) provides further details on the case, including the parties involved, their arguments, and the court's decision.",
      "pdf_source": "24.A VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
      "nodes": [
        {
          "title": "Page 18",
          "node_id": "0021",
          "start_index": 18,
          "end_index": 18,
          "summary": "According to page 18 of the PDF \"24.A VGUARD INDUSTRIES LTD VS. RAKESH MALHOTRA & ORS.pdf\" (2023/DHC/000133), the plaintiff V-Guard Industries Ltd had filed a suit before the District Court, Ernakulam, which was later withdrawn in part due to jurisdictional issues. The plaintiff was permitted to withdraw the part of the claim relating to passing off with liberty to file a fresh suit. This was done after the plaintiff's interim application was dismissed by the District Court, Ernakulam, and appeals to the Kerala High Court and Supreme Court were also unsuccessful. The plaintiff then filed a new suit, CS(COMM) 1018/2016, pursuant to the liberty granted by the District Court, Ernakulam. The court noted that the plaintiff did not wait for a finding on territorial jurisdiction and instead chose to withdraw the part of the claim to file a fresh suit. (Source: PDF page 18)",
          "content": "2023/DHC/000133 \n \n \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 18 of 19 \n \npassing off before the District Court, Ernakulam. The interim application \nfiled on behalf of the plaintiff was dismissed by the District Court, \nErnakulam and appeal against the said order was dismissed by the Kerala \nHigh Court and subsequently, the SLP filed before the Supreme Court was \nwithdrawn by the plaintiff. It was only thereafter that the plaintiff filed an \napplication under Order XXIII Rule 1 of the CPC seeking to withdraw a part \nof the claim in the said suit relating to passing off with liberty to file the \nsame before a Court with competent jurisdiction. This application was \nallowed by the District Judge, Ernakulam, Kochi by permitting the plaintiff \nto withdraw the part of the claim relating to passing off with liberty to \ninstitute a fresh suit. Pursuant to the said liberty, CS(COMM) 1018/2016 \nwas filed on behalf of the plaintiff. \n34. \nThere is no definite finding given by the District Court, Ernakulam \nwith regard to the District Court, Ernakulam not having territorial \njurisdiction. It was only at the asking of the plaintiff that the plaintiff was \npermitted to withdraw the part of the claim in the said suit with liberty to file \na fresh suit in respect of the subject matter of the part of the claim. The \nplaintiff did not wait for the District Court, Ernakulam to give a finding that \nit lacked territorial jurisdiction and straight away filed an application for \nwithdrawal of part of the claim on the ground of District Court, Ernakulam \nnot having the territorial jurisdiction to try the said suit.  It appears that not \nhaving got an interim injunction in its favour, the plaintiff withdrew the part \nof the claim in the said suit to take a chance before another Court.  \n35. \nThe submission of the plaintiff that the bar under Section 10 of the \nCPC is only in respect of trial of the suit and the expression „trial‟ has to be \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified",
          "pdf_source": "24.A VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
          "nodes": []
        },
        {
          "title": "Page 19",
          "node_id": "0022",
          "start_index": 19,
          "end_index": 19,
          "summary": "According to page 19 of the PDF \"24.A VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf\" (2023/DHC/000133), the court ruled that the term \"trial\" includes the entire process of recording evidence and addressing final arguments. The court allowed both applications and stayed the present suits (CS(COMM) 1018/2016 & CS(COMM) 814/2018) with liberty to revive them after the decision in RFA 117/2017 pending before the Kerala High Court. The date of January 23, 2023, was cancelled. The judgment was delivered by Amit Bansal, J. on January 9, 2023. The case involved V-Guard Industries Ltd, represented by Senior Advocate Akhil Sibal, among others. The court's decision was based on the interpretation of Order XVIII of the CPC. (Source: 2023/DHC/000133, PDF page 19)",
          "content": "2023/DHC/000133 \n \n \nCS(COMM) 1018/2016 & CS(COMM) 814/2018                                                             Page 19 of 19 \n \ngiven a narrow meaning to include only the recording of evidence in the \nsuit, is wholly misplaced. A reference to Order XVIII of the CPC would \ndemonstrate that the recording of evidence in a suit cannot be treated \nseparately from the final arguments in the case.  The term „trial‟ would \ninclude the entire composite process of recording of evidence as well as \naddressing final arguments.  \n36. \nAccordingly, both the applications are allowed and both the present \nsuits are stayed with liberty to the parties to get the same revived after the \ndecision in RFA 117/2017 pending before the Kerala High Court. \nCS(COMM) 1018/2016 & CS(COMM) 814/2018  \n37. \nThe date 23rd January, 2023 stands cancelled. \n \n \nAMIT BANSAL, J. \nJanuary 09, 2023 \nsr \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:09.01.2023 18:24:55\nSignature Not Verified",
          "pdf_source": "24.A VGUARD INDUSTRIES LTD VS.  RAKESH MALHOTRA & ORS.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-15T18:30:50.995645",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}