{
  "doc_name": "27. Ashok Kumar Gupta & Anr v. Rishabh Bansal",
  "pdf_source": "27. Ashok Kumar Gupta & Anr v. Rishabh Bansal.pdf",
  "metadata": {
    "document_name": "27. Ashok Kumar Gupta & Anr v. Rishabh Bansal",
    "source_pdf": "27. Ashok Kumar Gupta & Anr v. Rishabh Bansal.pdf",
    "judges": [
      "C.HARI SHANKAR JUDGMENT(ORAL) % 29.03.2023 1."
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "15915/2022",
      "1627/2023"
    ],
    "dhc_numbers": [
      "2023:DHC:2449"
    ],
    "ia_numbers": [],
    "decision_date": "14 March, 2023",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      "Ashok Kumar Gupta & Anr"
    ],
    "defendants": [
      "Rishabh Bansal"
    ],
    "appellants": [
      "Ashok Kumar Gupta & Anr"
    ],
    "respondents": [
      "Rishabh Bansal & Anr"
    ],
    "plaintiff_advocates": [
      "Mr. Vishal Patel"
    ],
    "defendant_advocates": [
      "Ms. Akanksha Singh"
    ],
    "appellant_advocates": [
      "Mr. Vishal Patel"
    ],
    "respondent_advocates": [
      "Ms. Akanksha Singh"
    ],
    "damages_claimed": "1,25,000",
    "damages_awarded": null,
    "key_issues": [
      "Trademark infringement is a key issue in the case, with the respondent admitting to the plaintiffs' proprietary rights in the 'SAKARNI' trademark.",
      "The plaintiffs' copyright in the artistic features of their packaging pouches, labels, and other materials is acknowledged by the respondent.",
      "The prior use of the 'SAKARNI' trademark by the plaintiffs is recognized, giving them priority over the respondent.",
      "The respondent's undertaking not to commit any acts of infringement or passing off by using similar trademarks or marks is a crucial aspect of the settlement.",
      "The protection of the plaintiffs' registered trademarks and labels, including their scripts, fonts, and get-ups, is ensured through the respondent's admissions and undertakings.",
      "The respondent's admission of the plaintiffs' ownership of copyright in artistic works related to the 'SAKARNI' trademark is significant.",
      "The settlement agreement's provision for the respondent not to reproduce or adapt the artistic features of the plaintiffs' packaging material without permission is essential.",
      "The registration of the plaintiffs' pending trademark and copyright applications is not to be objected to by the respondent, according to the settlement.",
      "The prevention of unfair competition through the use of deceptively similar marks or names is a key objective of the settlement agreement.",
      "The enforcement of intellectual property rights, including trademarks and copyrights, is a critical aspect of the case, with the court's mediation and conciliation process facilitating a settlement between the parties."
    ],
    "decision_summary": "**Case Summary: Ashok Kumar Gupta & Anr. vs. Rishabh Bansal & Anr.**\n\n**Background:**\nThe case involves a trademark and copyright dispute between Ashok Kumar Gupta & Anr. (Plaintiffs/Petitioners) and Rishabh Bansal & Anr. (Respondents/Defendant) in the High Court of Delhi. The dispute centered around the trademark \"SAKARNI\" used by the Plaintiffs for goods falling under Class 19 of the Trade Marks Act, 1999.\n\n**Legal Issues:**\n\n1. **Trademark Infringement:** The Plaintiffs alleged that the Respondents had infringed their trademark \"SAKARNI\" by using a similar mark \"SATKARMI\" for similar goods.\n2. **Copyright Infringement:** The Plaintiffs also alleged that the Respondents had infringed their copyright in the artistic features of their packaging pouches, labels, and other materials.\n3. **Passing Off:** The Plaintiffs claimed that the Respondents' use of the similar mark \"SATKARMI\" was an attempt to pass off their goods as those of the Plaintiffs.\n\n**Arguments:**\n\n* The Plaintiffs argued that they were the original and registered proprietors of the trademark \"SAKARNI\" and had been using it since before the Respondents.\n* The Respondents argued that their use of the mark \"SATKARMI\" was not an infringement of the Plaintiffs' trademark, as it was distinct and not likely to cause confusion.\n\n**Settlement Agreement:**\nBefore the court could rule on the matter, the parties entered into a settlement agreement on March 14, 2023, under the aegis of the Delhi High Court Mediation and Conciliation Centre. The terms of the settlement agreement were as follows:\n\n* The Respondents admitted that the Plaintiffs were the original and registered proprietors of the trademark \"SAKARNI\" and acknowledged their proprietary rights.\n* The Respondents acknowledged the Plaintiffs' copyright in the artistic features of their packaging pouches, labels, and other materials.\n* The Respondents undertook not to commit any act of infringement or passing off by using the mark \"SATKARMI\" or any other mark similar to the Plaintiffs' trademarks.\n* The Respondents agreed to withdraw their application for registration of the mark \"SATKARMI\" and not to file any future applications for similar marks.\n\n**Court Findings and Decision:**\nThe High Court of Delhi, presided over by Hon'ble Mr. Justice C. Hari Shankar, accepted the settlement agreement and disposed of the case. The court found that the settlement agreement had resolved all the disputes between the parties and that the Respondents had acknowledged the Plaintiffs' proprietary rights in the trademark \"SAKARNI\" and their copyright in the artistic features of their packaging materials. The court ordered the Respondents to comply with the terms of the settlement agreement, including withdrawing their application for registration of the mark \"SATKARMI\" and not using any similar marks in the future.\n\n**Conclusion:**\nThe case highlights the importance of settlement agreements in resolving intellectual property disputes. The settlement agreement in this case allowed the parties to avoid a lengthy and costly trial, while also ensuring that the Plaintiffs' proprietary rights in their trademark and copyright were protected. The court's acceptance of the settlement agreement and its order for the Respondents to comply with its terms demonstrate the court's commitment to upholding intellectual property rights and preventing infringement and passing off.",
    "legal_precedents": [],
    "full_text": "\n--- PAGE 1 ---\nNeutral Citation Number : 2023:DHC:2449 \nC.O. (COMM.IPD-TM) 752/2022 & cont. matter \nPage 1 of 5 \n \n$~2 and 7 \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.O. (COMM.IPD-TM) 752/2022 and I.A. 15915/2022 (Order \nXXXIX Rules 1 and 2 of the CPC) \n \n \nASHOK KUMAR GUPTA & ANR.  \n        ..... Petitioners \nThrough: \nMr. Vishal Patel, Adv. \n \n \n \n \n \n \nVersus \n \n \n \nRISHABH BANSAL & ANR.  \n \n    ..... Respondents \nThrough: \nMs. Akanksha Singh, Adv. \n \n \n \n+  \nC.S.(COMM.) 48/2023 and I.A. 1627/2023 (Order XXXIX \nRules 1 and 2 of the CPC) \n  \n \nASHOK KUMAR GUPTA & ANR.  \n         ..... Plaintiffs \nThrough: \nMr. Vishal Patel, Adv. \n \n \n \n \n \n \n \nversus \n \n \nRISHABH BANSAL \n \n \n \n      ..... Defendant \nThrough: \nMs. Akanksha Singh, Adv. \n \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C.HARI SHANKAR \n \n \n \n \n    JUDGMENT(ORAL) \n% \n \n \n           29.03.2023 \n \n1. \nThe Disputes between the parties stand settled, vide Settlement \nAgreement dated 14th March 2023 executed under the aegis of the \nDelhi High Court Mediation and Conciliation Centre, which has been \nplaced on record.  The terms of settlement read thus: \n \n“a. \nThe \nRespondent \nno. \n1/Defendant \nadmits \nthat \nthe \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:11.04.2023\n15:25:22\nSignature Not Verified\n\n--- PAGE 2 ---\nNeutral Citation Number : 2023:DHC:2449 \nC.O. (COMM.IPD-TM) 752/2022 & cont. matter \nPage 2 of 5 \n \nPlaintiffs/Petitioners are original and registered proprietor of the \ntrademark/label \n'SAKARNI \nPLASTER/SAKARNI \nWALL \nGUARD/SAKARNI’ in respect of the goods falling in class 19 of \nthe Trade Marks Act, 1999 and the Respondent no. 1/Defendant \nacknowledges the proprietary light of the Plaintiffs/Petitioners in \nthe said trademarks as enumerated in the plaint of CS (Comm.) No. \n48 of 2023. \n \nb.  \nThe Respondent no. 1/Defendant also admits and \nacknowledges the Plaintiffs/Petitioners' Copyright in the artistic \nfeatures of the packaging pouches, labels including their distinctive \nscripts, fonts, positions and placing of features, their respective get \nups, lay outs, combination of colours and arrangements of general \nand descriptive materials in respect of goods falling in class 19. \n \nc.  \nThe Respondent no. 1/Defendant also admits and \nacknowledges that the Plaintiffs/Petitioners are prior user of the \ntrademark/label \n'SAKARNI \nPLASTER/SAKARNI \nWALL \nGUARD/SAKARNI’ for the goods falling in class 19. \n \nd.  \nThe Respondent no. 1/Defendant further admits the \nPlaintiffs/Petitioners to be the owner of Copyright in the artistic \nworks \nas \ninvolved \nin \nthe \ntrademark/label \n'SAKARNI  \nPLASTER/SAKARNI WALL GUARD/SAKARNl' and the \nRespondent no. 1/Defendant shall not have any objection with \nrespect to the registration of the pending trademarks and copyright \napplications of the Plaintiffs/Petitioners in any manner whatsoever. \n \ne. \nThe Respondent no. 1/Defendant undertakes before this \nHon'ble Court not to commit any act of infringement and/or \npassing off by the use of the trade mark/device SATKARMI/ \n/SAKARNI and/or any other mark/name which is \nidentical and/or deceptively similar to the Plaintiffs/Petitioners \nregistered trademarks/labels in any manner whatsoever. \n \nf.  \nThe Respondent no. 1/Defendant undertakes before this \nHon'ble Court not to use the scripts, fonts, positions and placement \nof any features, get ups, lay outs, combination of colours and \narrangement as are or is identical or deceptively similar to the \nfeatures, get ups, lay-outs, positions and placement or combination \nof colours of the Plaintiffs/Petitioners' pouches/packaging material \nin respect of and in relation to the product P.O.P etc. \n \ng.  \nThe Respondent no. 1/Defendant undertakes before this \nHon'ble Court not to reproduce and/or to make any adaptation of \nany of the artistic features of the Plaintiffs/Petitioners' \npouches/packaging material including get up, lay out, arrangement \nand/or combination of colours constituting infringement of \nplaintiffs/petitioners' copyright herein including the works as are \nsubject matter of copyright registration. \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:11.04.2023\n15:25:22\nSignature Not Verified\n\n--- PAGE 3 ---\nNeutral Citation Number : 2023:DHC:2449 \nC.O. (COMM.IPD-TM) 752/2022 & cont. matter \nPage 3 of 5 \n \n \nh. That Respondent no. 1/Defendant further undertakes this \nHon'ble Court to withdraw the application/registration of the \nimpugned mark/device SATKARMI bearing no. 3564551 in Class \n19 within two weeks from the date of the execution of the present \nsettlement.  That the Respondent no. 1/Defendant further \nundertakes that there is no application pending before the Registrar \nof Trade Marks or any other authority filed by the \nDefendant/Respondent No. 1 bearing the trademark/device \n“SATKARMI/ \n/SAKARNI” and even in future also the \nrespondent no. 1/defendant shall not file any such application for \nthe registration which may be similar or identical to the \nPlaintiffs/Petitioners' trademark/label/artistic work/trade dress. In \nview of the said undertaking by the Respondent no. 1/Defendant, \nthe plaintiffs/petitioners agree to withdraw the rectification petition \nC.O. (Comm. IPD-TM) No. 752/2022. \n \ni.  \nThe Respondent no. 1/Defendant undertakes to this Hon'ble \nCourt to recall all the marketing, promotional and advertising \nmaterials that bear or incorporate the mark “SATKARMI/ \n/SAKARNI” or any other mark similar to the \nPlaintiffs/Petitioners' \"SAKARNI PLASTER/SAKARNI WALL \nGUARD/SAKARNI\" mark, which have been distributed, sold or \nshipped before entering into the present settlement. \n \nj.  \nThe Respondent no. 1/Defendant undertakes before this \nHon'ble Court that he will destroy all the blocks, dies, screens, \nworks, wrappers and any other material in which the impugned \nmark or infringing trade dress or copyright within fifteen days \nfrom the date of the order passed by this Hon'ble Court. \n \nk.  \nThe Respondent no. 1/Defendant further undertakes to this \nHon'ble Court that he will not either directly or indirectly, or \nthrough any of its entity apply or encourage others directly or \nindirectly for the registration of any trade mark/trade name \n“SATKARMI/\n/SAKARNI” or any word/mark deceptively \nsimilar to the trademark \"SAKARNI PLASTER/SAKARNI \nWALL GUARD/SAKARNI\" of the Plaintiffs/Petitioners. \n \n1.  \nThat the Respondent no. 1/Defendant has already paid a \nsum of Rs. 1,25,000/- by way of two transactions through UPI \naggregating the settlement amount being Rs. 1,25,000/- to the \nplaintiffs towards token damages in the Bank Account of the \nPlaintiff No. 1/Petitioner No.l's Firm i.e. Jai Durga Plaster \nIndustries receipt whereof duly acknowledged. \n \nm. \nThe Respondent no. 1/Defendant further agrees to pay the \nplaintiffs/petitioners without any demur or protest a sum of INR \n25,00,000/- (Twenty Five Lakhs Only) in the event of the \noccurrence of any default/breach by them of any condition set forth \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:11.04.2023\n15:25:22\nSignature Not Verified\n\n--- PAGE 4 ---\nNeutral Citation Number : 2023:DHC:2449 \nC.O. (COMM.IPD-TM) 752/2022 & cont. matter \nPage 4 of 5 \n \nherein above provided that such breach/default arises out of the \nact(s) which are directly within the power and control of the \nRespondent no. 1/Defendant; \n \nn.  \nThe Respondent no. 1/Defendant has no objection if a \ndecree of perpetual injunction is passed by this Hon'ble Court in \nfavour of the plaintiffs according to the prayer clause of the \nparagraph 32 (a)&(b) of the plaint in CS (Comm.) No. 48 of 2023 \nalong with terms and conditions of the present settlement. \n \no.  \nThe parties have gone through the terms and conditions \nherein and confirm and verify the same to be correct and that they \nput their signatures hereunder without any threat, coercion, \npressure, or undue influence from any quarter and both sides agree \nto abide by the terms and conditions herein. \n \np.  \nThe Parties have gone through this present Settlement \nAgreement and have understood the same and have no objections \nto the present terms and conditions. The parties also understand \nthat bleach of the terms and conditions of this Settlement \nAgreement shall invite lawful action for contempt of court against \nthem by the other party in the concerned Court \n \nq.  \nThat the Parties undertake before the Hon'ble Court to \nabide by the terms and conditions set out in the agreement and not \nto dispute the same hereinafter in future. \n \nr.  \nThe parties agree that they shall appear before the Hon'ble \ncourt during the hearing to make their statements in terms of the \npresent settlement agreement.” \n \n2. \nLearned Counsel are present on behalf of their respective \nparties.  They undertake to abide by the aforesaid terms of settlement. \n \n3. \nAs such, nothing survives for adjudication in the suit as well as \nthe rectification petition.  Rectification petition stands disposed of and \nthe suit stands decreed in terms of the aforesaid Settlement Agreement \nexecuted between the parties to which they shall remain bound. \n \n4. \nLet a decree-sheet be drawn up by the Registry.  \n \n5. \nThe plaintiffs would be entitled to refund of court fee, if any, \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:11.04.2023\n15:25:22\nSignature Not Verified\n\n--- PAGE 5 ---\nNeutral Citation Number : 2023:DHC:2449 \nC.O. (COMM.IPD-TM) 752/2022 & cont. matter \nPage 5 of 5 \n \ndeposited by them. \n \n6. \nMiscellaneous applications do not survive for consideration and \nare disposed of accordingly. \n \n \n \nC.HARI SHANKAR, J \nMARCH 29, 2023 \nrb \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:11.04.2023\n15:25:22\nSignature Not Verified\n"
  },
  "total_pages": 5,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0002",
      "start_index": 1,
      "end_index": 1,
      "summary": "According to the provided PDF document, \"Ashok Kumar Gupta & Anr v. Rishabh Bansal.pdf\", the legal proceedings involve a dispute between Ashok Kumar Gupta & Anr (Petitioners) and Rishabh Bansal & Anr (Respondents) in the High Court of Delhi at New Delhi. The case is listed as C.O. (COMM.IPD-TM) 752/2022 and I.A. 15915/2022, with a Neutral Citation Number of 2023:DHC:2449.\n\nThe parties were represented by their respective advocates, Mr. Vishal Patel for the Petitioners and Ms. Akanksha Singh for the Respondents. The matter was heard by Hon'ble Mr. Justice C. Hari Shankar. \n\nA settlement agreement was executed on March 14, 2023, under the aegis of the Delhi High Court Mediation and Conciliation Centre. The terms of the settlement were placed on record, with Respondent No. 1/Defendant admitting to certain terms. The judgment (oral) was delivered on March 29, 2023.\n\nThe PDF document provides details of the legal proceedings, including the case number, parties, dates, and representation. However, specific facts, arguments, and amounts are not mentioned in the provided section. The settlement agreement and its terms are also not fully disclosed in the given excerpt. The document is a court record, and further details may be available in the complete PDF file, \"Ashok Kumar Gupta & Anr v. Rishabh Bansal.pdf\".",
      "pdf_source": "27. Ashok Kumar Gupta & Anr v. Rishabh Bansal.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "According to page 1 of the PDF \"27. Ashok Kumar Gupta & Anr v. Rishabh Bansal.pdf\", a settlement agreement was reached between the parties on March 14, 2023, under the Delhi High Court Mediation and Conciliation Centre. The case involves Ashok Kumar Gupta & Anr (Petitioners) and Rishabh Bansal & Anr (Respondents). The settlement terms were placed on record, with Respondent No. 1/Defendant admitting to certain terms. The matter was heard by Hon'ble Mr. Justice C. Hari Shankar on March 29, 2023. The PDF source provides the Neutral Citation Number: 2023:DHC:2449 and case numbers C.O. (COMM.IPD-TM) 752/2022 and C.S.(COMM.) 48/2023.",
          "content": "Neutral Citation Number : 2023:DHC:2449 \nC.O. (COMM.IPD-TM) 752/2022 & cont. matter \nPage 1 of 5 \n \n$~2 and 7 \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.O. (COMM.IPD-TM) 752/2022 and I.A. 15915/2022 (Order \nXXXIX Rules 1 and 2 of the CPC) \n \n \nASHOK KUMAR GUPTA & ANR.  \n        ..... Petitioners \nThrough: \nMr. Vishal Patel, Adv. \n \n \n \n \n \n \nVersus \n \n \n \nRISHABH BANSAL & ANR.  \n \n    ..... Respondents \nThrough: \nMs. Akanksha Singh, Adv. \n \n \n \n+  \nC.S.(COMM.) 48/2023 and I.A. 1627/2023 (Order XXXIX \nRules 1 and 2 of the CPC) \n  \n \nASHOK KUMAR GUPTA & ANR.  \n         ..... Plaintiffs \nThrough: \nMr. Vishal Patel, Adv. \n \n \n \n \n \n \n \nversus \n \n \nRISHABH BANSAL \n \n \n \n      ..... Defendant \nThrough: \nMs. Akanksha Singh, Adv. \n \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C.HARI SHANKAR \n \n \n \n \n    JUDGMENT(ORAL) \n% \n \n \n           29.03.2023 \n \n1. \nThe Disputes between the parties stand settled, vide Settlement \nAgreement dated 14th March 2023 executed under the aegis of the \nDelhi High Court Mediation and Conciliation Centre, which has been \nplaced on record.  The terms of settlement read thus: \n \n“a. \nThe \nRespondent \nno. \n1/Defendant \nadmits \nthat \nthe \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:11.04.2023\n15:25:22\nSignature Not Verified",
          "pdf_source": "27. Ashok Kumar Gupta & Anr v. Rishabh Bansal.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Facts and Arguments",
      "node_id": "0006",
      "start_index": 2,
      "end_index": 4,
      "summary": "According to the PDF document \"Ashok Kumar Gupta & Anr v. Rishabh Bansal.pdf\", the High Court of Delhi at New Delhi heard the case C.O. (COMM.IPD-TM) 752/2022 and cont. matter. The plaintiffs/petitioners, Ashok Kumar Gupta & Anr, are the original and registered proprietors of the trademark/label 'SAKARNI' in respect of goods falling in class 19 of the Trade Marks Act, 1999. \n\nThe respondent, Rishabh Bansal, acknowledged the proprietary rights of the plaintiffs/petitioners in the trademarks and admitted to their copyright in the artistic features of the packaging pouches and labels. The respondent undertook not to commit any act of infringement or passing off by using the trademark/device SATKARMI/SAKARNI or any other mark/name identical or deceptively similar to the plaintiffs/petitioners' registered trademarks/labels.\n\nThe respondent also undertook not to use scripts, fonts, positions, and placement of features, get-ups, lay-outs, combination of colors, and arrangements identical or deceptively similar to the plaintiffs/petitioners' pouches/packaging material. Additionally, the respondent agreed to withdraw the application/registration of the impugned mark/device SATKARMI bearing no. 3564551 in Class 19 within two weeks from the date of execution of the present settlement.\n\nIn view of the undertakings by the respondent, the plaintiffs/petitioners agreed to withdraw the rectification petition C.O. (Comm. IPD-TM) No. 752/2022. The settlement was digitally signed by Sunil Singh Negi on 11.04.2023. (Source: Ashok Kumar Gupta & Anr v. Rishabh Bansal.pdf, Neutral Citation Number: 2023:DHC:2449)",
      "pdf_source": "27. Ashok Kumar Gupta & Anr v. Rishabh Bansal.pdf",
      "nodes": [
        {
          "title": "Page 2",
          "node_id": "0003",
          "start_index": 2,
          "end_index": 2,
          "summary": "According to page 2 of the PDF \"27. Ashok Kumar Gupta & Anr v. Rishabh Bansal.pdf\", the Respondent no. 1/Defendant acknowledges the proprietary rights of the Plaintiffs/Petitioners in the trademarks 'SAKARNI PLASTER/SAKARNI WALL GUARD/SAKARNI' and their copyright in the artistic features of packaging pouches and labels. The Respondent also admits to the Plaintiffs/Petitioners being prior users of the trademark and undertakes not to commit any act of infringement or passing off by using similar marks or features. The Respondent further undertakes not to reproduce or adapt any of the artistic features of the Plaintiffs/Petitioners' packaging material, constituting infringement of their copyright. The document is dated 11.04.2023, and the case number is C.O. (COMM.IPD-TM) 752/2022. The parties involved are Ashok Kumar Gupta & Anr (Petitioners) and Rishabh Bansal & Anr (Respondents).",
          "content": "Neutral Citation Number : 2023:DHC:2449 \nC.O. (COMM.IPD-TM) 752/2022 & cont. matter \nPage 2 of 5 \n \nPlaintiffs/Petitioners are original and registered proprietor of the \ntrademark/label \n'SAKARNI \nPLASTER/SAKARNI \nWALL \nGUARD/SAKARNI’ in respect of the goods falling in class 19 of \nthe Trade Marks Act, 1999 and the Respondent no. 1/Defendant \nacknowledges the proprietary light of the Plaintiffs/Petitioners in \nthe said trademarks as enumerated in the plaint of CS (Comm.) No. \n48 of 2023. \n \nb.  \nThe Respondent no. 1/Defendant also admits and \nacknowledges the Plaintiffs/Petitioners' Copyright in the artistic \nfeatures of the packaging pouches, labels including their distinctive \nscripts, fonts, positions and placing of features, their respective get \nups, lay outs, combination of colours and arrangements of general \nand descriptive materials in respect of goods falling in class 19. \n \nc.  \nThe Respondent no. 1/Defendant also admits and \nacknowledges that the Plaintiffs/Petitioners are prior user of the \ntrademark/label \n'SAKARNI \nPLASTER/SAKARNI \nWALL \nGUARD/SAKARNI’ for the goods falling in class 19. \n \nd.  \nThe Respondent no. 1/Defendant further admits the \nPlaintiffs/Petitioners to be the owner of Copyright in the artistic \nworks \nas \ninvolved \nin \nthe \ntrademark/label \n'SAKARNI  \nPLASTER/SAKARNI WALL GUARD/SAKARNl' and the \nRespondent no. 1/Defendant shall not have any objection with \nrespect to the registration of the pending trademarks and copyright \napplications of the Plaintiffs/Petitioners in any manner whatsoever. \n \ne. \nThe Respondent no. 1/Defendant undertakes before this \nHon'ble Court not to commit any act of infringement and/or \npassing off by the use of the trade mark/device SATKARMI/ \n/SAKARNI and/or any other mark/name which is \nidentical and/or deceptively similar to the Plaintiffs/Petitioners \nregistered trademarks/labels in any manner whatsoever. \n \nf.  \nThe Respondent no. 1/Defendant undertakes before this \nHon'ble Court not to use the scripts, fonts, positions and placement \nof any features, get ups, lay outs, combination of colours and \narrangement as are or is identical or deceptively similar to the \nfeatures, get ups, lay-outs, positions and placement or combination \nof colours of the Plaintiffs/Petitioners' pouches/packaging material \nin respect of and in relation to the product P.O.P etc. \n \ng.  \nThe Respondent no. 1/Defendant undertakes before this \nHon'ble Court not to reproduce and/or to make any adaptation of \nany of the artistic features of the Plaintiffs/Petitioners' \npouches/packaging material including get up, lay out, arrangement \nand/or combination of colours constituting infringement of \nplaintiffs/petitioners' copyright herein including the works as are \nsubject matter of copyright registration. \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:11.04.2023\n15:25:22\nSignature Not Verified",
          "pdf_source": "27. Ashok Kumar Gupta & Anr v. Rishabh Bansal.pdf",
          "nodes": []
        },
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "According to page 3 of the PDF \"27. Ashok Kumar Gupta & Anr v. Rishabh Bansal.pdf\", the Respondent no. 1/Defendant, Rishabh Bansal, undertakes to withdraw the application/registration of the impugned mark \"SATKARMI\" and not file any similar applications in the future. The Respondent also agrees to recall marketing materials, destroy blocks and dies with the impugned mark, and not apply for registration of any trade mark/trade name deceptively similar to the Plaintiff's \"SAKARNI\" mark. The Respondent has paid Rs. 1,25,000/- as token damages and agrees to pay Rs. 25,00,000/- in case of default. The settlement was digitally signed by Sunil Singh Negi on 11.04.2023. The case details are C.O. (COMM.IPD-TM) 752/2022 and Neutral Citation Number: 2023:DHC:2449.",
          "content": "Neutral Citation Number : 2023:DHC:2449 \nC.O. (COMM.IPD-TM) 752/2022 & cont. matter \nPage 3 of 5 \n \n \nh. That Respondent no. 1/Defendant further undertakes this \nHon'ble Court to withdraw the application/registration of the \nimpugned mark/device SATKARMI bearing no. 3564551 in Class \n19 within two weeks from the date of the execution of the present \nsettlement.  That the Respondent no. 1/Defendant further \nundertakes that there is no application pending before the Registrar \nof Trade Marks or any other authority filed by the \nDefendant/Respondent No. 1 bearing the trademark/device \n“SATKARMI/ \n/SAKARNI” and even in future also the \nrespondent no. 1/defendant shall not file any such application for \nthe registration which may be similar or identical to the \nPlaintiffs/Petitioners' trademark/label/artistic work/trade dress. In \nview of the said undertaking by the Respondent no. 1/Defendant, \nthe plaintiffs/petitioners agree to withdraw the rectification petition \nC.O. (Comm. IPD-TM) No. 752/2022. \n \ni.  \nThe Respondent no. 1/Defendant undertakes to this Hon'ble \nCourt to recall all the marketing, promotional and advertising \nmaterials that bear or incorporate the mark “SATKARMI/ \n/SAKARNI” or any other mark similar to the \nPlaintiffs/Petitioners' \"SAKARNI PLASTER/SAKARNI WALL \nGUARD/SAKARNI\" mark, which have been distributed, sold or \nshipped before entering into the present settlement. \n \nj.  \nThe Respondent no. 1/Defendant undertakes before this \nHon'ble Court that he will destroy all the blocks, dies, screens, \nworks, wrappers and any other material in which the impugned \nmark or infringing trade dress or copyright within fifteen days \nfrom the date of the order passed by this Hon'ble Court. \n \nk.  \nThe Respondent no. 1/Defendant further undertakes to this \nHon'ble Court that he will not either directly or indirectly, or \nthrough any of its entity apply or encourage others directly or \nindirectly for the registration of any trade mark/trade name \n“SATKARMI/\n/SAKARNI” or any word/mark deceptively \nsimilar to the trademark \"SAKARNI PLASTER/SAKARNI \nWALL GUARD/SAKARNI\" of the Plaintiffs/Petitioners. \n \n1.  \nThat the Respondent no. 1/Defendant has already paid a \nsum of Rs. 1,25,000/- by way of two transactions through UPI \naggregating the settlement amount being Rs. 1,25,000/- to the \nplaintiffs towards token damages in the Bank Account of the \nPlaintiff No. 1/Petitioner No.l's Firm i.e. Jai Durga Plaster \nIndustries receipt whereof duly acknowledged. \n \nm. \nThe Respondent no. 1/Defendant further agrees to pay the \nplaintiffs/petitioners without any demur or protest a sum of INR \n25,00,000/- (Twenty Five Lakhs Only) in the event of the \noccurrence of any default/breach by them of any condition set forth \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:11.04.2023\n15:25:22\nSignature Not Verified",
          "pdf_source": "27. Ashok Kumar Gupta & Anr v. Rishabh Bansal.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "According to page 4 of the PDF \"Ashok Kumar Gupta & Anr v. Rishabh Bansal.pdf\", the parties have reached a settlement agreement. The Respondent no. 1/Defendant has no objection to a decree of perpetual injunction in favor of the plaintiffs. The parties confirm that they have gone through the terms and conditions of the settlement and agree to abide by them. They also understand that breach of the terms and conditions may invite lawful action for contempt of court. The settlement agreement is binding, and the parties undertake to abide by its terms. The learned counsel for both parties are present and undertake to abide by the terms of settlement. The court disposes of the rectification petition and decrees the suit in terms of the settlement agreement. The PDF is related to the case C.O. (COMM.IPD-TM) 752/2022 and C.S.(COMM.) 48/2023, with a neutral citation number of 2023:DHC:2449.",
          "content": "Neutral Citation Number : 2023:DHC:2449 \nC.O. (COMM.IPD-TM) 752/2022 & cont. matter \nPage 4 of 5 \n \nherein above provided that such breach/default arises out of the \nact(s) which are directly within the power and control of the \nRespondent no. 1/Defendant; \n \nn.  \nThe Respondent no. 1/Defendant has no objection if a \ndecree of perpetual injunction is passed by this Hon'ble Court in \nfavour of the plaintiffs according to the prayer clause of the \nparagraph 32 (a)&(b) of the plaint in CS (Comm.) No. 48 of 2023 \nalong with terms and conditions of the present settlement. \n \no.  \nThe parties have gone through the terms and conditions \nherein and confirm and verify the same to be correct and that they \nput their signatures hereunder without any threat, coercion, \npressure, or undue influence from any quarter and both sides agree \nto abide by the terms and conditions herein. \n \np.  \nThe Parties have gone through this present Settlement \nAgreement and have understood the same and have no objections \nto the present terms and conditions. The parties also understand \nthat bleach of the terms and conditions of this Settlement \nAgreement shall invite lawful action for contempt of court against \nthem by the other party in the concerned Court \n \nq.  \nThat the Parties undertake before the Hon'ble Court to \nabide by the terms and conditions set out in the agreement and not \nto dispute the same hereinafter in future. \n \nr.  \nThe parties agree that they shall appear before the Hon'ble \ncourt during the hearing to make their statements in terms of the \npresent settlement agreement.” \n \n2. \nLearned Counsel are present on behalf of their respective \nparties.  They undertake to abide by the aforesaid terms of settlement. \n \n3. \nAs such, nothing survives for adjudication in the suit as well as \nthe rectification petition.  Rectification petition stands disposed of and \nthe suit stands decreed in terms of the aforesaid Settlement Agreement \nexecuted between the parties to which they shall remain bound. \n \n4. \nLet a decree-sheet be drawn up by the Registry.  \n \n5. \nThe plaintiffs would be entitled to refund of court fee, if any, \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:11.04.2023\n15:25:22\nSignature Not Verified",
          "pdf_source": "27. Ashok Kumar Gupta & Anr v. Rishabh Bansal.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Decision and Orders",
      "node_id": "0008",
      "start_index": 5,
      "end_index": 5,
      "summary": "According to the PDF document \"Ashok Kumar Gupta & Anr v. Rishabh Bansal.pdf\", a legal proceeding was held in the High Court of Delhi at New Delhi. The case involves petitioners Ashok Kumar Gupta and another (represented by Mr. Vishal Patel, Adv.) and respondents Rishabh Bansal and another (represented by Ms. Akanksha Singh, Adv.). The Neutral Citation Number for this case is 2023:DHC:2449.\n\nThe court considered C.O. (COMM.IPD-TM) 752/2022 and I.A. 15915/2022 (Order XXXIX Rules 1 and 2 of the CPC), as well as C.S.(COMM.) 48/2023 and I.A. 16. The decision was made by Hon'ble Justice C. Hari Shankar on March 29, 2023.\n\nThe document mentions that miscellaneous applications do not survive for consideration and are disposed of accordingly. It also mentions that certain amounts were deposited by the parties involved. However, the exact amounts and details of the deposits are not specified in the provided section.\n\nThe digitally signed document was verified by Sunil Singh Negi on April 11, 2023. The source of this information is the PDF document \"Ashok Kumar Gupta & Anr v. Rishabh Bansal.pdf\", which provides the details of the court proceedings and decisions made in the case.",
      "pdf_source": "27. Ashok Kumar Gupta & Anr v. Rishabh Bansal.pdf",
      "nodes": [
        {
          "title": "Page 5",
          "node_id": "0007",
          "start_index": 5,
          "end_index": 5,
          "summary": "According to page 5 of the PDF \"27. Ashok Kumar Gupta & Anr v. Rishabh Bansal.pdf\", the court proceedings relate to C.O. (COMM.IPD-TM) 752/2022 and I.A. 15915/2022. The petitioners are Ashok Kumar Gupta and Anr., represented by Mr. Vishal Patel, while the respondents are Rishabh Bansal and Anr., represented by Ms. Akanksha Singh. The judge, C. Hari Shankar, J, disposed of miscellaneous applications on March 29, 2023. The digitally signed document was verified by Sunil Singh Negi on April 11, 2023. The Neutral Citation Number is 2023:DHC:2449. The case involves commercial matters, but specific details are not mentioned on page 5. (Source: 27. Ashok Kumar Gupta & Anr v. Rishabh Bansal.pdf)",
          "content": "Neutral Citation Number : 2023:DHC:2449 \nC.O. (COMM.IPD-TM) 752/2022 & cont. matter \nPage 5 of 5 \n \ndeposited by them. \n \n6. \nMiscellaneous applications do not survive for consideration and \nare disposed of accordingly. \n \n \n \nC.HARI SHANKAR, J \nMARCH 29, 2023 \nrb \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:11.04.2023\n15:25:22\nSignature Not Verified",
          "pdf_source": "27. Ashok Kumar Gupta & Anr v. Rishabh Bansal.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-15T18:42:32.337830",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}