{
  "doc_name": "29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks",
  "pdf_source": "29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf",
  "metadata": {
    "document_name": "29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks",
    "source_pdf": "29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf",
    "judges": [
      "C. HARI SHANKAR J U D G M E N T (ORAL) % 22.02.2023 1."
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "113/2021",
      "113/2021",
      "113/2021",
      "113/2021",
      "113/2021",
      "113/2021",
      "113/2021",
      "113/2021",
      "113/2021"
    ],
    "dhc_numbers": [
      "2023/DHC/001284",
      "2023/DHC/001284",
      "2023/DHC/001284",
      "2023/DHC/001284",
      "2023/DHC/001284",
      "2023/DHC/001284",
      "2023/DHC/001284",
      "2023/DHC/001284"
    ],
    "ia_numbers": [],
    "decision_date": "7 March, 2017",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [],
    "defendants": [],
    "appellants": [
      "Jainsons Lights Private Limited"
    ],
    "respondents": [
      "The Registrar of Trade Marks"
    ],
    "plaintiff_advocates": [],
    "defendant_advocates": [],
    "appellant_advocates": [
      "Mr. Vikram Grover",
      "Mr. Harish K. Chauhan"
    ],
    "respondent_advocates": [
      "Mr. Harish Vaidyanathan Shankar, CGSC"
    ],
    "damages_claimed": null,
    "damages_awarded": null,
    "key_issues": [
      "The appellant's trade mark application was rejected due to similarity with an earlier mark, raising issues of likelihood of confusion among consumers.",
      "The Trade Marks Act 1999, Section 11(1) was cited as the basis for rejecting the application, which relates to identical or similar marks and goods/services.",
      "The appellant claimed prior use of the mark since 2014, while the earlier mark had a user claim of 2005, potentially impacting the decision.",
      "The Registrar's First Examination Report objected to the registration, citing an earlier mark \"M/s JAINSONS LITES\" with a similar description of goods.",
      "The appellant argued that their mark was a highly stylised representation of their trade name and included the year of adoption, distinguishing it from the earlier mark.",
      "The appellant also emphasized their goodwill and reputation since 1978, which may be relevant to the assessment of likelihood of confusion.",
      "The respondent's mark \"M/s JAINSONS LITES\" was filed by Mr. Rakesh Jain, potentially raising issues of ownership and priority.",
      "The appellant's response to the FER was deemed unsatisfactory, leading to the rejection of their application.",
      "The unique colour combination of the appellant's mark, specifically claimed during the application process, may be a relevant factor in assessing distinctiveness.",
      "The impugned order highlighted the similarity of goods and services between the two marks, which contributed to the likelihood of confusion."
    ],
    "decision_summary": "**Case Summary: JAINSONS LIGHTS PRIVATE LIMITED vs. THE REGISTRAR OF TRADE MARKS**\n\n**Background:**\nThe appellant, JAINSONS LIGHTS PRIVATE LIMITED, filed an application for registration of the trade mark \"JAINSONS LIGHTS\" (the subject mark) in Class 11 for various lighting goods and installations. The application claimed user of the mark since 2014. The Registrar of Trade Marks, however, objected to the registration of the subject mark due to its deceptive similarity to an earlier mark \"M/s JAINSONS LITES\" (Mark No. 2242763), which had a user claim of 2005.\n\n**Legal Issues:**\nThe main issue in this case was whether the subject mark was deceptively similar to the earlier mark \"M/s JAINSONS LITES\", and whether the registration of the subject mark would cause confusion among the public.\n\n**Arguments:**\nThe appellant argued that the subject mark was a highly stylized representation of the predominant feature of the trade name of the appellant, which was Jainsons Lights Pvt. Ltd., and included the year 1978, representing the year of adoption of the mark \"JAINSONS\". The appellant also claimed that the subject mark had a unique color combination of teal and black, which was specifically claimed while applying for registration. Furthermore, the appellant emphasized the goodwill and reputation it had gained since 1978.\n\n**Court Findings:**\nThe Senior Examiner rejected the appellant's application, citing the following grounds:\n\n1. Phonetic similarity between the subject mark and Mark No. 2242763.\n2. Conceptual similarity between the two marks.\n3. The appellant failed to establish the significance and uniqueness in the adoption of the trade mark, as the prefix \"JAINSONS\" was a common English term.\n4. The user claim of the appellant was subsequent to the user of the cited mark.\n\n**Decision:**\nThe High Court of Delhi at New Delhi upheld the decision of the Registrar of Trade Marks, rejecting the appellant's application for registration of the subject mark. The court found that the subject mark was deceptively similar to the earlier mark \"M/s JAINSONS LITES\", and that the registration of the subject mark would cause confusion among the public.\n\n**Rationale:**\nThe court's decision was based on the principles of trademark law, which aim to prevent confusion among consumers. The court held that the phonetic and conceptual similarities between the two marks, combined with the similar goods and services covered by the marks, would likely cause confusion among the public. The court also took into account the appellant's failure to establish the significance and uniqueness of the trade mark, as well as the subsequent user claim.\n\n**Conclusion:**\nIn conclusion, the High Court of Delhi at New Delhi rejected the appellant's application for registration of the subject mark due to its deceptive similarity to the earlier mark \"M/s JAINSONS LITES\". The court's decision highlights the importance of ensuring that trade marks are distinctive and do not cause confusion among consumers. The appellant's failure to establish the significance and uniqueness of the trade mark, combined with the phonetic and conceptual similarities between the two marks, led to the rejection of the application.",
    "legal_precedents": [],
    "full_text": "\n--- PAGE 1 ---\nNeutral Citation Number : 2023/DHC/001284 \nC.A.(COMM.IPD-TM) 113/2021  \nPage 1 of 8    \n \n$~3(Original) \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.A.(COMM.IPD-TM) 113/2021 \n \nJAINSONS LIGHTS PRIVATE LIMITED          ..... Appellant \nThrough: \nMr. Vikram Grover and Mr. \nHarish K. Chauhan, Advs. \n \n \n \n \n \nversus \n \n \nTHE REGISTRAR OF TRADE MARKS \n      ..... Respondent \nThrough: \nMr. \nHarish \nVaidyanathan \nShankar, CGSC \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C. HARI SHANKAR \n \n \n \n     J U D G M E N T (ORAL) \n% \n \n \n \n     22.02.2023 \n \n1. \nApplication no. 3487036  was filed by the appellant before the \nTrade \nMarks \nRegistry \nfor \nregistration \nof \nthe \nMark \n (hereinafter referred to as “the subject mark”) \nin Class 11, for electric lamps, lighting apparatus and installations, \nluminaries chandeliers, lamp shades, lamps, led and fluorescent lights, \nflash lights, lanterns for lighting, lighting fittings and fixtures, \ndecorative lighting, light diffusers, ceiling light, wall lights, outdoor \nlights, water proof lights, desk lamps, floor lamps, hanging lamps, \nlighting tubes, light bulbs, security lights, garden lights, mood \nlighting, display lighting etc.  The appellant claimed user of the \nsubject mark since 2014.  \n \n2. \nThe Registrar, vide First Examination Report (FER) dated 7th \nMarch 2017, objected to the registration of the subject mark.  In the \nFER, “M/s JAINSONS LITES” was cited as an earlier trade mark, for \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.02.2023\n15:30:55\nSignature Not Verified\n\n--- PAGE 2 ---\nNeutral Citation Number : 2023/DHC/001284 \nC.A.(COMM.IPD-TM) 113/2021  \nPage 2 of 8    \n \nwhich Application No. 2242763, submitted by Mr. Rakesh Jain, \nseeking registration of the mark in Class 11 in respect of “electrical \nfancy lights, electrical goods, items and instruments”, was already in \nexistence with user claim of 2005.  The FER objected to the \nregistration of the subject mark on the ground that it was deceptively \nsimilar to the earlier mark “M/s JAINSONS LITES”.  \n \n3. \nThe appellant submitted his response to the FER on 1st May \n2017. It was sought to be contended, in the response, that the trade \nmark “JAINSONS” had been adopted by the predecessor of the \nappellant in 1978 primarily in respect of lighting goods and was in use \nsince then.   The subject mark, it was submitted, was a highly stylised \nrepresentation of the predominant feature of the trade name of the \nappellant, which was Jainsons Lights Pvt. Ltd., and also included 1978 \nas representing the year of adoption of the mark “JAINSONS”. \nMoreover, it was submitted that the subject mark was in a unique \ncolour combination of teal and black, which was specifically claimed \nwhile applying for registration of the subject mark.  The reply also \nemphasised the goodwill and reputation that the appellant had gained \nsince 1978. \n \n4. \nThe impugned order dated 27th April 2020 rejected Application \nNo. 3487036 in the following terms: \n“The mark applied for registration is objectionable under following \nprovision of the Trade Marks Act, 1999-  \n \nThe mark applied for registration is identical with /similar to earlier  \ntrademarks on record, as mentioned in the Examination report and \nby similarity of marks as well as similarity of goods and services \ncovered under such marks, there exists a likelihood of confusion in \nthe mind of public. As such the registration of the mark is \nobjectionable under Section 11(1) of the Trade Marks Act 1999  \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.02.2023\n15:30:55\nSignature Not Verified\n\n--- PAGE 3 ---\nNeutral Citation Number : 2023/DHC/001284 \nC.A.(COMM.IPD-TM) 113/2021  \nPage 3 of 8    \n \nADV. HARISH appeared and argued and submitted that, the cited \nmark is different, heard, and checked the details of application, it \nappeared that. Reply perused not satisfactory, Deceptively and \nphonetically and conceptually similar registered mark no. \n12242763 with the identical goods are on record, so it will cause \nthe confusion to the public and in the market, moreover user claim \nsince 2014, and user affidavit submitted along with the evidence in \nsupport has proved the user since 2014 which is subsequent to the \nuser of the cited mark, and adv. also fails to establish the \nsignificance and uniqueness in the adoption of the trade mark, \nsince the prefix is a common English term, as there is phonetically \nsimilarity with the cited mark, hence no difference between cited \nmark and the applicant mark, so; upon considering the material on \nrecord and submissions made by the adv. And applicant is fail to \nprove the justification for waving off obj. raised under sec. 11 trade \nMark Act 1999.” \n \n5. \nWith some effort, the court has been able to glean, from the \nimpugned order, the grounds on which the Senior Examiner has \nrejected the appellant’s application as \n(i) \nphonetic similarity between the subject mark and Mark \nNo. 2242763, \n(ii) \nconceptual similarity between the subject mark and Mark \nNo. 2242763, \n(iii) \nthe fact that both marks were claimed in respect of \nidentical goods/services.  \n(iv) \nthe possibility, therefore, of confusion to the public were \nboth marks to be registered, \n(v) \nthe user claim of the appellant, of 2014, being subsequent \nto user claim of Mr. Rakesh Jain in respect of Mark No. \n2242763, which was 2005, and \n(vi) \nlack of significance and uniqueness in the subject mark, \nas “lights” was a common English term. \n \n6. \nOf these findings, no cavil, in the opinion of the court, can be \ntaken with the findings no. (i), (iii), (iv) and (v). \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.02.2023\n15:30:55\nSignature Not Verified\n\n--- PAGE 4 ---\nNeutral Citation Number : 2023/DHC/001284 \nC.A.(COMM.IPD-TM) 113/2021  \nPage 4 of 8    \n \n \n7. \nThe court is in agreement with the Senior Examiner in her \nobservation that  \n(i)  \nthe subject mark was phonetically identical to Mark No. \n2242763 as the subject mark was “Jainsons Lights” and Mark \nNo. 2242763 was “M/s Jainsons Lites”,  \n(ii)  \nthe registration of the marks were sought in respect of \nidentical goods, i.e. electrical lamps, lights, electrical goods and \nfittings etc. and   \n(iii)  the claim of user, by the appellant, was subsequent to the \nclaim of user of Rakesh Jain in respect of Mark no. 2242763. \n \n8. \nThe court is also in agreement with the finding of the Senior \nExaminer that permitting registration of both the marks is likely to \nresult in confusion. Section 11(1)(b)1 of the Trade Marks Act \nproscribes registration of a trade mark if, owing to its similarity to an \nearlier trade mark, and the identity of similarity of the goods or \nservices covered by the two marks, a likelihood of confusion on the \npart of the public can be said to exist.   \n \n9. \nThere can be no gainsaying the fact that the mark “Jainsons \nLights” is similar to the mark “Jainsons Lites”. Both marks were used \nin respect of similar goods and services.  \n \n                                          \n1 11.  \nRelative grounds for refusal of registration. –  \n(1)  \nSave as provided in Section 12, a trade mark shall not be registered if, because of –  \n(a)  \nits identity with an earlier trade mark and similarity of goods or services \ncovered by the trade mark; or \n(b)  \nits similarity to an earlier trade mark and the identity or similarity of the goods \nor services covered by the trade mark, \nthere exists a likelihood of confusion on the part of the public, which includes the likelihood of association \nwith the earlier trade mark. \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.02.2023\n15:30:55\nSignature Not Verified\n\n--- PAGE 5 ---\nNeutral Citation Number : 2023/DHC/001284 \nC.A.(COMM.IPD-TM) 113/2021  \nPage 5 of 8    \n \n10. \nMr. Grover has sought to contend that the Senior Examiner as \nerred to note (i) the unique stylised nature of the subject mark, which \ndistinguished it from the “Jainsons Lites” mark of Rakesh Jain and (ii) \nthe inclusion, in the subject mark, of the phrase “since 1978” which \nwas essentially intended to indicate tht the mark “Jainsons”, which \nwas the prominent part of the subject mark, had been in use since \n1978. \n \n11. \nAs already noted, the aspect of likelihood of confusion, for the \npurposes of Section 11(1)(b) has to be examined from the point of \nview of “the public”, as the clause refers to “likelihood of  confusion \non the part of the public”.  Insofar as the aspect of confusion, in the \nmatter of trade marks is concerned, it is settled that the test has to \napply from the point of view of a customer of average intelligence and \nimperfect recollection. Viewed from the perspective of such a \ncustomer, the court cannot characterise the finding, of the Senior \nExaminer, that there is a likelihood of confusion between the subject \nmark “Jainsons Lights” and the earlier mark “Jainsons Lites” as \narbitrary, or otherwise deserving of interference in appeal, especially \nas both the marks were being used in respect of identical goods. The \nunwary customer of average intelligence and imperfect recollection \ncannot be attributed the perspicacity to be able to recollect that, in one \ncase, “lights” was spelt “Lites” and, in the other, “Lights”.  Nor can \nthe mere inclusion, in the subject mark, of the words “since 1978”, or \nof the word “M/s” in Mark No. 2242763, be regarded as factors which \nwould mitigate the possibility of such confusion arising in the minds \nof the customer of average intelligence and imperfect recollection as \nthese are elements of a mark which may change from time to time.   \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.02.2023\n15:30:55\nSignature Not Verified\n\n--- PAGE 6 ---\nNeutral Citation Number : 2023/DHC/001284 \nC.A.(COMM.IPD-TM) 113/2021  \nPage 6 of 8    \n \n12. \nBesides, in the \n, the dominant impression \nthat the average customer, who views the mark without prior \nfamiliarity with it, would carry with him, is of “JAINSONS \nLIGHTS”, rather than of “since 1978”.  An average consumer, \nrealistically speaking, would identify the appellant from its name \n“JAINSONS LIGHTS”, rather than from the year from which it had \nstarted using the mark “JAINSONS”.  This reality is apparent from the \nmark itself, in which the “since 1978” slogan is in disproportionately \nsmall letters, as compared to “JAINSONS LIGHTS”.  If the mythical \ncustomer of imperfect recollection were to to be asked to recollect the \nmark, he would recollect it as “JAINSONS LIGHTS”, not as \n“JAINSONS LIGHTS SINCE 1978”.  Equally, he would recollect \nMark No. 2242763 as “JAINSONS LITES”, not as “M/s JAINSONS \nLITES”.   \n \n13. \nThe Senior Examiner is also correct in her observation that \n“lights” – whether spelt “lights” or “lites” – is an ordinary English \nword.  Perhaps it would be more appropriate to hold that the dominant \npart, whether of “JAINSONS LIGHTS” or “JAINSONS LITES”, is \n“JAINSONS”.  That dominant part, in the two marks, is identical, \nthereby exacerbating the chance of confusion.  \n \n14. \n Mr. Grover has also sought to press into service Sections 122 \nand 343 of the Trade Marks Act.  \n                                          \n2 12.  \nRegistration in the case of honest concurrent use, etc. – In the case of honest concurrent use or \nof other special circumstances which in the opinion of the Registrar, make it proper so to do, he may permit \nthe registration by more than one proprietor of the trade marks which are identical or similar (whether any \nsuch trade mark is already registered or not) in respect of the same or similar goods or services, subject to \nsuch conditions and limitations, if any, as the Registrar may think fit to impose. \n3 34.  \nSaving for vested rights. – Nothing in this Act shall entitle the proprietor or a registered user of \nregistered trade mark to interfere with or restrain the use by any person of a trade mark identical with or \nnearly resembling it in relation to goods or services in relation to which that person or a predecessor in title of \nhis has continuously used that trade mark from a date prior –  \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.02.2023\n15:30:55\nSignature Not Verified\n\n--- PAGE 7 ---\nNeutral Citation Number : 2023/DHC/001284 \nC.A.(COMM.IPD-TM) 113/2021  \nPage 7 of 8    \n \n15. \nI am, unfortunately, unable to accept his submission that either \nof these provisions would serve to vitiate the impugned order.  Section \n12 permits the Registrar, in an appropriate case, to allow registration \nof a mark which is identical, or similar to an earlier trade mark, where \nthe case is one of “honest concurrent use”, or where there are “other \nspecial circumstances”.  \n \n16. \nMr. Grover seeks to submit that the present case has to be \nregarded as one involving “other special circumstances”, the “special \ncircumstance” being that the “Jainsons” mark had been in use by his \nclient since 1978.  For this purpose, Mr. Grover seeks to submit that \nSection 12 may be read in conjunction with Section 34 of the Trade \nMarks Act.    \n \n17. \nSection 34 of the Trade Marks Act allows the Registrar to \nregister a trade mark which is identical with or nearly resembling an \nearlier trade mark, in respect of identical goods or services, provided \nthe user of the former is prior in point of time both to registration and \nuser of the latter.  \n \n18. \nThis defence obviously, cannot come to the aid of the appellant, \nas the claim of user of the appellant, in respect of the subject trade \nmark, is of 2014, whereas the user claim of Rakesh Jain in respect of \nMark No. 2242763 is of 2005.  Though Mr Grover emphasizes that \nthe mark “JAINSONS” was being used since 1978, that is irrelevant.  \nThe court, while applying Section 34, has to take into account the \n                                                                                                                   \n(a)  \nto the use of the first-mentioned trade mark in relation to those goods or services be the \nproprietor or a predecessor in title of his; or \n(b)  \nto the date of registration of the first-mentioned trade mark in respect of those goods or \nservices in the name of the proprietor of a predecessor in title of his; \nwhichever is the earlier, and the Registrar shall not refuse (on such use being proved) to register the second \nmentioned trade mark by reason only of the registration of the first-mentioned trade mark. \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.02.2023\n15:30:55\nSignature Not Verified\n\n--- PAGE 8 ---\nNeutral Citation Number : 2023/DHC/001284 \nC.A.(COMM.IPD-TM) 113/2021  \nPage 8 of 8    \n \nclaim of user in respect of the subject mark which, in the present case, \nis “\n”.  “Since 1978” is only a part of the \ncomplete \n mark, and user, in respect of the \ncomplete mark, is claimed, by the appellant itself, since 2014. \n \n19. \nInasmuch as the appellant itself has claimed user, while \napplying for subject mark, of 2014, it cannot claim prior user over \nRakesh Jain, so as to entitle it to the benefit of Section 34 of the Trade \nMarks Act.  \n \n20. \nFor the aforesaid reasons, I do not find that a case for \ninterference with impugned order dated 27th April 2020 can be said to \nexist.  \n \n21. \nThe appeal is accordingly dismissed.  \n \n \n \nC. HARI SHANKAR, J. \n \nFEBRUARY 22, 2023 \n \ndsn \n \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.02.2023\n15:30:55\nSignature Not Verified\n"
  },
  "total_pages": 8,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "According to the PDF document \"Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf\", a legal proceeding took place in the High Court of Delhi. The case, C.A.(COMM.IPD-TM) 113/2021, involved Jainsons Lights Private Limited (Appellant) and the Registrar of Trade Marks (Respondent). The Appellant was represented by Mr. Vikram Grover and Mr. Harish K. Chauhan, while the Respondent was represented by Mr. Harish Vaidyanathan Shankar.\n\nThe Appellant had filed an application (No. 3487036) for registration of their trade mark in Class 11, which included electric lamps, lighting apparatus, and installations, among others. The application claimed user of the mark since 2014. However, the Registrar objected to the registration, citing an earlier trade mark \"M/s JAINSONS LITES\" (Application No. 2242763) with a user claim of 2005.\n\nThe Appellant responded to the objection, stating that their mark was a highly stylized representation of their trade name and included the year of adoption (1978). They also emphasized their goodwill and reputation since 1978. Despite this, the impugned order dated April 27, 2020, rejected the application, citing likelihood of confusion with the earlier trade mark under Section 11(1) of the Trade Marks Act, 1999.\n\nThe High Court of Delhi, with Hon'ble Mr. Justice C. Hari Shankar presiding, heard the case and delivered a judgment on February 22, 2023. The details of the judgment are not provided in the given section of the PDF document. (Source: Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf)",
      "pdf_source": "29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "According to page 1 of the PDF \"29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf\", a case was filed by Jainsons Lights Private Limited (Appellant) against The Registrar of Trade Marks (Respondent) in the High Court of Delhi. The appellant applied for registration of their mark in Class 11 for various lighting products, claiming usage since 2014. The Registrar objected to the registration, citing an earlier trademark \"M/s JAINSONS LITES\" in the First Examination Report dated March 7, 2017. The case, C.A.(COMM.IPD-TM) 113/2021, was heard by Hon'ble Mr. Justice C. Hari Shankar, with the appellant represented by Mr. Vikram Grover and Mr. Harish K. Chauhan, and the respondent represented by Mr. Harish Vaidyanathan Shankar, CGSC. The judgment was delivered on February 22, 2023. (Source: PDF page 1)",
          "content": "Neutral Citation Number : 2023/DHC/001284 \nC.A.(COMM.IPD-TM) 113/2021  \nPage 1 of 8    \n \n$~3(Original) \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.A.(COMM.IPD-TM) 113/2021 \n \nJAINSONS LIGHTS PRIVATE LIMITED          ..... Appellant \nThrough: \nMr. Vikram Grover and Mr. \nHarish K. Chauhan, Advs. \n \n \n \n \n \nversus \n \n \nTHE REGISTRAR OF TRADE MARKS \n      ..... Respondent \nThrough: \nMr. \nHarish \nVaidyanathan \nShankar, CGSC \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C. HARI SHANKAR \n \n \n \n     J U D G M E N T (ORAL) \n% \n \n \n \n     22.02.2023 \n \n1. \nApplication no. 3487036  was filed by the appellant before the \nTrade \nMarks \nRegistry \nfor \nregistration \nof \nthe \nMark \n (hereinafter referred to as “the subject mark”) \nin Class 11, for electric lamps, lighting apparatus and installations, \nluminaries chandeliers, lamp shades, lamps, led and fluorescent lights, \nflash lights, lanterns for lighting, lighting fittings and fixtures, \ndecorative lighting, light diffusers, ceiling light, wall lights, outdoor \nlights, water proof lights, desk lamps, floor lamps, hanging lamps, \nlighting tubes, light bulbs, security lights, garden lights, mood \nlighting, display lighting etc.  The appellant claimed user of the \nsubject mark since 2014.  \n \n2. \nThe Registrar, vide First Examination Report (FER) dated 7th \nMarch 2017, objected to the registration of the subject mark.  In the \nFER, “M/s JAINSONS LITES” was cited as an earlier trade mark, for \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.02.2023\n15:30:55\nSignature Not Verified",
          "pdf_source": "29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "According to page 2 of the PDF \"Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf\", the appellant, Jainsons Lights Private Limited, applied for trademark registration (Application No. 3487036) in Class 11 for \"electrical fancy lights, electrical goods, items and instruments\". The application was objected to by the FER due to similarity with an earlier mark \"M/s JAINSONS LITES\". The appellant responded on May 1, 2017, claiming the mark \"JAINSONS\" was adopted in 1978 and had gained goodwill since then. The impugned order dated April 27, 2020, rejected the application under Section 11(1) of the Trade Marks Act 1999, citing likelihood of confusion with earlier trademarks. (Source: Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf, page 2)",
          "content": "Neutral Citation Number : 2023/DHC/001284 \nC.A.(COMM.IPD-TM) 113/2021  \nPage 2 of 8    \n \nwhich Application No. 2242763, submitted by Mr. Rakesh Jain, \nseeking registration of the mark in Class 11 in respect of “electrical \nfancy lights, electrical goods, items and instruments”, was already in \nexistence with user claim of 2005.  The FER objected to the \nregistration of the subject mark on the ground that it was deceptively \nsimilar to the earlier mark “M/s JAINSONS LITES”.  \n \n3. \nThe appellant submitted his response to the FER on 1st May \n2017. It was sought to be contended, in the response, that the trade \nmark “JAINSONS” had been adopted by the predecessor of the \nappellant in 1978 primarily in respect of lighting goods and was in use \nsince then.   The subject mark, it was submitted, was a highly stylised \nrepresentation of the predominant feature of the trade name of the \nappellant, which was Jainsons Lights Pvt. Ltd., and also included 1978 \nas representing the year of adoption of the mark “JAINSONS”. \nMoreover, it was submitted that the subject mark was in a unique \ncolour combination of teal and black, which was specifically claimed \nwhile applying for registration of the subject mark.  The reply also \nemphasised the goodwill and reputation that the appellant had gained \nsince 1978. \n \n4. \nThe impugned order dated 27th April 2020 rejected Application \nNo. 3487036 in the following terms: \n“The mark applied for registration is objectionable under following \nprovision of the Trade Marks Act, 1999-  \n \nThe mark applied for registration is identical with /similar to earlier  \ntrademarks on record, as mentioned in the Examination report and \nby similarity of marks as well as similarity of goods and services \ncovered under such marks, there exists a likelihood of confusion in \nthe mind of public. As such the registration of the mark is \nobjectionable under Section 11(1) of the Trade Marks Act 1999  \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.02.2023\n15:30:55\nSignature Not Verified",
          "pdf_source": "29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0006",
      "start_index": 3,
      "end_index": 4,
      "summary": "According to the PDF document \"Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks\" (Neutral Citation Number: 2023/DHC/001284, C.A.(COMM.IPD-TM) 113/2021), the High Court of Delhi at New Delhi heard an appeal by Jainsons Lights Private Limited against the Registrar of Trade Marks. The appellant, represented by Mr. Vikram Grover and Mr. Harish K. Chauhan, argued against the rejection of their trade mark application. The respondent, represented by Mr. Harish Vaidyanathan Shankar, countered that the applicant's mark \"Jainsons Lights\" was phonetically, conceptually, and visually similar to the existing mark \"M/s Jainsons Lites\" (Mark No. 2242763), which could cause public confusion.\n\nThe Senior Examiner had rejected the application, citing the similarity between the two marks, the identical goods and services they covered, and the possibility of public confusion. The court agreed with these findings, noting that the marks were phonetically identical and covered the same goods, including electrical lamps and lights. The court also agreed that the appellant's user claim, dating back to 2014, was subsequent to the claim of user of Rakesh Jain in respect of Mark No. 2242763, which dated back to 2005.\n\nThe court ultimately upheld the rejection of the trade mark application, citing Section 11(1)(b) of the Trade Marks Act, which prohibits registration of a trade mark that could cause confusion due to its similarity to an earlier mark. (Source: \"Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf\", pages 1-4 of 8)",
      "pdf_source": "29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "According to page 3 of the PDF \"Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf\", the Senior Examiner rejected the appellant's application due to several grounds, including:\n\n* Phonetic similarity between the subject mark and Mark No. 2242763\n* Conceptual similarity between the subject mark and Mark No. 2242763\n* Identical goods/services\n* Possibility of confusion to the public\n* Appellant's user claim of 2014 being subsequent to the user claim of 2005\n* Lack of significance and uniqueness in the subject mark\n\nThe court found no issues with findings (i), (iii), (iv), and (v). Advocate Harish argued that the cited mark is different, but the reply was not satisfactory, and the user claim since 2014 was subsequent to the user of the cited mark. The case is C.A.(COMM.IPD-TM) 113/2021, with Neutral Citation Number 2023/DHC/001284, heard by Hon'ble Mr. Justice C. Hari Shankar. (Source: Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf)",
          "content": "Neutral Citation Number : 2023/DHC/001284 \nC.A.(COMM.IPD-TM) 113/2021  \nPage 3 of 8    \n \nADV. HARISH appeared and argued and submitted that, the cited \nmark is different, heard, and checked the details of application, it \nappeared that. Reply perused not satisfactory, Deceptively and \nphonetically and conceptually similar registered mark no. \n12242763 with the identical goods are on record, so it will cause \nthe confusion to the public and in the market, moreover user claim \nsince 2014, and user affidavit submitted along with the evidence in \nsupport has proved the user since 2014 which is subsequent to the \nuser of the cited mark, and adv. also fails to establish the \nsignificance and uniqueness in the adoption of the trade mark, \nsince the prefix is a common English term, as there is phonetically \nsimilarity with the cited mark, hence no difference between cited \nmark and the applicant mark, so; upon considering the material on \nrecord and submissions made by the adv. And applicant is fail to \nprove the justification for waving off obj. raised under sec. 11 trade \nMark Act 1999.” \n \n5. \nWith some effort, the court has been able to glean, from the \nimpugned order, the grounds on which the Senior Examiner has \nrejected the appellant’s application as \n(i) \nphonetic similarity between the subject mark and Mark \nNo. 2242763, \n(ii) \nconceptual similarity between the subject mark and Mark \nNo. 2242763, \n(iii) \nthe fact that both marks were claimed in respect of \nidentical goods/services.  \n(iv) \nthe possibility, therefore, of confusion to the public were \nboth marks to be registered, \n(v) \nthe user claim of the appellant, of 2014, being subsequent \nto user claim of Mr. Rakesh Jain in respect of Mark No. \n2242763, which was 2005, and \n(vi) \nlack of significance and uniqueness in the subject mark, \nas “lights” was a common English term. \n \n6. \nOf these findings, no cavil, in the opinion of the court, can be \ntaken with the findings no. (i), (iii), (iv) and (v). \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.02.2023\n15:30:55\nSignature Not Verified",
          "pdf_source": "29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "According to page 4 of the PDF \"29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf\", the court agrees with the Senior Examiner's observations that the subject mark \"Jainsons Lights\" is phonetically identical to Mark No. 2242763 \"M/s Jainsons Lites\", and both marks are for identical goods. The appellant's claim of user is also subsequent to the claim of user of Rakesh Jain for Mark No. 2242763. The court cites Section 11(1)(b) of the Trade Marks Act, which prohibits registration of a trade mark if it may cause confusion due to similarity with an earlier mark. The court finds that permitting registration of both marks would likely result in confusion, given their similarity and use for similar goods and services. (Source: PDF \"29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf\", Case No. C.A.(COMM.IPD-TM) 113/2021)",
          "content": "Neutral Citation Number : 2023/DHC/001284 \nC.A.(COMM.IPD-TM) 113/2021  \nPage 4 of 8    \n \n \n7. \nThe court is in agreement with the Senior Examiner in her \nobservation that  \n(i)  \nthe subject mark was phonetically identical to Mark No. \n2242763 as the subject mark was “Jainsons Lights” and Mark \nNo. 2242763 was “M/s Jainsons Lites”,  \n(ii)  \nthe registration of the marks were sought in respect of \nidentical goods, i.e. electrical lamps, lights, electrical goods and \nfittings etc. and   \n(iii)  the claim of user, by the appellant, was subsequent to the \nclaim of user of Rakesh Jain in respect of Mark no. 2242763. \n \n8. \nThe court is also in agreement with the finding of the Senior \nExaminer that permitting registration of both the marks is likely to \nresult in confusion. Section 11(1)(b)1 of the Trade Marks Act \nproscribes registration of a trade mark if, owing to its similarity to an \nearlier trade mark, and the identity of similarity of the goods or \nservices covered by the two marks, a likelihood of confusion on the \npart of the public can be said to exist.   \n \n9. \nThere can be no gainsaying the fact that the mark “Jainsons \nLights” is similar to the mark “Jainsons Lites”. Both marks were used \nin respect of similar goods and services.  \n \n                                          \n1 11.  \nRelative grounds for refusal of registration. –  \n(1)  \nSave as provided in Section 12, a trade mark shall not be registered if, because of –  \n(a)  \nits identity with an earlier trade mark and similarity of goods or services \ncovered by the trade mark; or \n(b)  \nits similarity to an earlier trade mark and the identity or similarity of the goods \nor services covered by the trade mark, \nthere exists a likelihood of confusion on the part of the public, which includes the likelihood of association \nwith the earlier trade mark. \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.02.2023\n15:30:55\nSignature Not Verified",
          "pdf_source": "29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0009",
      "start_index": 5,
      "end_index": 6,
      "summary": "According to the PDF document \"Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf\", a legal proceeding (C.A.(COMM.IPD-TM) 113/2021) was held in the High Court of Delhi. The appellant, Jainsons Lights Private Limited, was represented by Mr. Vikram Grover and Mr. Harish K. Chauhan, while the respondent, The Registrar of Trade Marks, was represented by Mr. Harish Vaidyanathan Shankar. \n\nThe court examined the likelihood of confusion between the appellant's mark \"Jainsons Lights\" and the earlier mark \"Jainsons Lites\" owned by Rakesh Jain. The Senior Examiner had noted that the inclusion of \"since 1978\" in the appellant's mark did not mitigate the possibility of confusion. The court agreed, stating that an average customer of imperfect recollection would not be able to distinguish between the two marks.\n\nThe appellant's argument that the stylized nature of their mark and the inclusion of \"since 1978\" distinguished it from the earlier mark was rejected. The court held that the dominant part of both marks was \"Jainsons\", which was identical, increasing the chance of confusion. The court also noted that the words \"since 1978\" and \"M/s\" were not sufficient to mitigate the possibility of confusion.\n\nThe decision was made on February 23, 2023, and was digitally signed by Sunil Singh Negi. The PDF document provides further details on the legal arguments and proceedings.",
      "pdf_source": "29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 5",
          "node_id": "0007",
          "start_index": 5,
          "end_index": 5,
          "summary": "According to page 5 of the PDF \"29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf\", the court is examining the likelihood of confusion between the trade marks \"Jainsons Lights\" and \"Jainsons Lites\" under Section 11(1)(b). The appellant's counsel, Mr. Grover, argued that the unique stylised nature of the subject mark and the inclusion of the phrase \"since 1978\" distinguish it from the earlier mark. However, the court held that from the perspective of a customer of average intelligence and imperfect recollection, the likelihood of confusion cannot be ruled out, especially since both marks are used for identical goods. The court rejected the appeal, citing that the unwary customer may not be able to distinguish between \"Lites\" and \"Lights\". (Source: 29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf, Neutral Citation Number: 2023/DHC/001284, C.A.(COMM.IPD-TM) 113/2021)",
          "content": "Neutral Citation Number : 2023/DHC/001284 \nC.A.(COMM.IPD-TM) 113/2021  \nPage 5 of 8    \n \n10. \nMr. Grover has sought to contend that the Senior Examiner as \nerred to note (i) the unique stylised nature of the subject mark, which \ndistinguished it from the “Jainsons Lites” mark of Rakesh Jain and (ii) \nthe inclusion, in the subject mark, of the phrase “since 1978” which \nwas essentially intended to indicate tht the mark “Jainsons”, which \nwas the prominent part of the subject mark, had been in use since \n1978. \n \n11. \nAs already noted, the aspect of likelihood of confusion, for the \npurposes of Section 11(1)(b) has to be examined from the point of \nview of “the public”, as the clause refers to “likelihood of  confusion \non the part of the public”.  Insofar as the aspect of confusion, in the \nmatter of trade marks is concerned, it is settled that the test has to \napply from the point of view of a customer of average intelligence and \nimperfect recollection. Viewed from the perspective of such a \ncustomer, the court cannot characterise the finding, of the Senior \nExaminer, that there is a likelihood of confusion between the subject \nmark “Jainsons Lights” and the earlier mark “Jainsons Lites” as \narbitrary, or otherwise deserving of interference in appeal, especially \nas both the marks were being used in respect of identical goods. The \nunwary customer of average intelligence and imperfect recollection \ncannot be attributed the perspicacity to be able to recollect that, in one \ncase, “lights” was spelt “Lites” and, in the other, “Lights”.  Nor can \nthe mere inclusion, in the subject mark, of the words “since 1978”, or \nof the word “M/s” in Mark No. 2242763, be regarded as factors which \nwould mitigate the possibility of such confusion arising in the minds \nof the customer of average intelligence and imperfect recollection as \nthese are elements of a mark which may change from time to time.   \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.02.2023\n15:30:55\nSignature Not Verified",
          "pdf_source": "29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "According to page 6 of the PDF \"29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf\", the court observed that the dominant impression of the mark \"JAINSONS LIGHTS\" is the name \"JAINSONS LIGHTS\", not the slogan \"since 1978\". The average consumer would identify the appellant by its name, rather than the year it started using the mark. The court also noted that the word \"lights\" or \"lites\" is an ordinary English word, and the dominant part of both marks is \"JAINSONS\", which is identical and increases the chance of confusion. The case is C.A.(COMM.IPD-TM) 113/2021, with Jainsons Lights Private Limited as the appellant and the Registrar of Trade Marks as the respondent, heard by Hon'ble Mr. Justice C. Hari Shankar. (Source: PDF page 6)",
          "content": "Neutral Citation Number : 2023/DHC/001284 \nC.A.(COMM.IPD-TM) 113/2021  \nPage 6 of 8    \n \n12. \nBesides, in the \n, the dominant impression \nthat the average customer, who views the mark without prior \nfamiliarity with it, would carry with him, is of “JAINSONS \nLIGHTS”, rather than of “since 1978”.  An average consumer, \nrealistically speaking, would identify the appellant from its name \n“JAINSONS LIGHTS”, rather than from the year from which it had \nstarted using the mark “JAINSONS”.  This reality is apparent from the \nmark itself, in which the “since 1978” slogan is in disproportionately \nsmall letters, as compared to “JAINSONS LIGHTS”.  If the mythical \ncustomer of imperfect recollection were to to be asked to recollect the \nmark, he would recollect it as “JAINSONS LIGHTS”, not as \n“JAINSONS LIGHTS SINCE 1978”.  Equally, he would recollect \nMark No. 2242763 as “JAINSONS LITES”, not as “M/s JAINSONS \nLITES”.   \n \n13. \nThe Senior Examiner is also correct in her observation that \n“lights” – whether spelt “lights” or “lites” – is an ordinary English \nword.  Perhaps it would be more appropriate to hold that the dominant \npart, whether of “JAINSONS LIGHTS” or “JAINSONS LITES”, is \n“JAINSONS”.  That dominant part, in the two marks, is identical, \nthereby exacerbating the chance of confusion.  \n \n14. \n Mr. Grover has also sought to press into service Sections 122 \nand 343 of the Trade Marks Act.  \n                                          \n2 12.  \nRegistration in the case of honest concurrent use, etc. – In the case of honest concurrent use or \nof other special circumstances which in the opinion of the Registrar, make it proper so to do, he may permit \nthe registration by more than one proprietor of the trade marks which are identical or similar (whether any \nsuch trade mark is already registered or not) in respect of the same or similar goods or services, subject to \nsuch conditions and limitations, if any, as the Registrar may think fit to impose. \n3 34.  \nSaving for vested rights. – Nothing in this Act shall entitle the proprietor or a registered user of \nregistered trade mark to interfere with or restrain the use by any person of a trade mark identical with or \nnearly resembling it in relation to goods or services in relation to which that person or a predecessor in title of \nhis has continuously used that trade mark from a date prior –  \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.02.2023\n15:30:55\nSignature Not Verified",
          "pdf_source": "29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0012",
      "start_index": 7,
      "end_index": 8,
      "summary": "According to the PDF document \"Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf\", the High Court of Delhi at New Delhi made a decision in the case of Jainsons Lights Private Limited (Appellant) versus The Registrar of Trade Marks (Respondent). The appeal, C.A.(COMM.IPD-TM) 113/2021, was heard by Hon'ble Mr. Justice C. Hari Shankar. \n\nThe Appellant, Jainsons Lights Private Limited, was represented by Mr. Vikram Grover and Mr. Harish K. Chauhan, while the Respondent was represented by Mr. Harish Vaidyanathan Shankar, CGSC. The court considered Sections 12 and 34 of the Trade Marks Act, which pertain to the registration of trade marks with \"honest concurrent use\" or \"other special circumstances\".\n\nThe Appellant claimed prior use of the \"Jainsons\" mark since 1978, but the court held that this was irrelevant as the Appellant's claim of user for the subject mark was only since 2014. The Respondent, Rakesh Jain, had a prior claim of user since 2005 for Mark No. 2242763. The court dismissed the appeal, stating that the Appellant could not claim prior user over Rakesh Jain and therefore was not entitled to the benefit of Section 34 of the Trade Marks Act. The decision was made on February 22, 2023, and the appeal was dismissed. (Source: Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf)",
      "pdf_source": "29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 7",
          "node_id": "0010",
          "start_index": 7,
          "end_index": 7,
          "summary": "According to page 7 of the PDF \"29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf\", the court rejected the appellant's submission that Section 12 of the Trade Marks Act would vitiate the impugned order. The appellant, Jainsons Lights Private Limited, argued that the case involved \"other special circumstances\" due to their prior use of the \"Jainsons\" mark since 1978. However, the court noted that Section 34 of the Trade Marks Act requires prior use and registration, which the appellant failed to establish, as their claim of use was from 2014, while the respondent's claim was from 2005. The court, led by Hon'ble Mr. Justice C. Hari Shankar, made this decision in the case C.A.(COMM.IPD-TM) 113/2021, with the Neutral Citation Number: 2023/DHC/001284.",
          "content": "Neutral Citation Number : 2023/DHC/001284 \nC.A.(COMM.IPD-TM) 113/2021  \nPage 7 of 8    \n \n15. \nI am, unfortunately, unable to accept his submission that either \nof these provisions would serve to vitiate the impugned order.  Section \n12 permits the Registrar, in an appropriate case, to allow registration \nof a mark which is identical, or similar to an earlier trade mark, where \nthe case is one of “honest concurrent use”, or where there are “other \nspecial circumstances”.  \n \n16. \nMr. Grover seeks to submit that the present case has to be \nregarded as one involving “other special circumstances”, the “special \ncircumstance” being that the “Jainsons” mark had been in use by his \nclient since 1978.  For this purpose, Mr. Grover seeks to submit that \nSection 12 may be read in conjunction with Section 34 of the Trade \nMarks Act.    \n \n17. \nSection 34 of the Trade Marks Act allows the Registrar to \nregister a trade mark which is identical with or nearly resembling an \nearlier trade mark, in respect of identical goods or services, provided \nthe user of the former is prior in point of time both to registration and \nuser of the latter.  \n \n18. \nThis defence obviously, cannot come to the aid of the appellant, \nas the claim of user of the appellant, in respect of the subject trade \nmark, is of 2014, whereas the user claim of Rakesh Jain in respect of \nMark No. 2242763 is of 2005.  Though Mr Grover emphasizes that \nthe mark “JAINSONS” was being used since 1978, that is irrelevant.  \nThe court, while applying Section 34, has to take into account the \n                                                                                                                   \n(a)  \nto the use of the first-mentioned trade mark in relation to those goods or services be the \nproprietor or a predecessor in title of his; or \n(b)  \nto the date of registration of the first-mentioned trade mark in respect of those goods or \nservices in the name of the proprietor of a predecessor in title of his; \nwhichever is the earlier, and the Registrar shall not refuse (on such use being proved) to register the second \nmentioned trade mark by reason only of the registration of the first-mentioned trade mark. \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.02.2023\n15:30:55\nSignature Not Verified",
          "pdf_source": "29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 8",
          "node_id": "0011",
          "start_index": 8,
          "end_index": 8,
          "summary": "According to page 8 of the PDF \"29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf\", the court ruled in favor of the respondent. The appellant, Jainsons Lights Private Limited, claimed user of the subject mark since 1978, but this is only a part of the complete mark. The appellant itself claimed user of the complete mark since 2014, which means it cannot claim prior user over Rakesh Jain to entitle it to the benefit of Section 34 of the Trade Marks Act. The appeal (C.A.(COMM.IPD-TM) 113/2021) was dismissed by Hon'ble Mr. Justice C. Hari Shankar on February 22, 2023. The court found no case for interference with the impugned order dated April 27, 2020. (Source: 29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf)",
          "content": "Neutral Citation Number : 2023/DHC/001284 \nC.A.(COMM.IPD-TM) 113/2021  \nPage 8 of 8    \n \nclaim of user in respect of the subject mark which, in the present case, \nis “\n”.  “Since 1978” is only a part of the \ncomplete \n mark, and user, in respect of the \ncomplete mark, is claimed, by the appellant itself, since 2014. \n \n19. \nInasmuch as the appellant itself has claimed user, while \napplying for subject mark, of 2014, it cannot claim prior user over \nRakesh Jain, so as to entitle it to the benefit of Section 34 of the Trade \nMarks Act.  \n \n20. \nFor the aforesaid reasons, I do not find that a case for \ninterference with impugned order dated 27th April 2020 can be said to \nexist.  \n \n21. \nThe appeal is accordingly dismissed.  \n \n \n \nC. HARI SHANKAR, J. \n \nFEBRUARY 22, 2023 \n \ndsn \n \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.02.2023\n15:30:55\nSignature Not Verified",
          "pdf_source": "29. Jainsons Lights Pvt Ltd v. The Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-15T18:30:13.107922",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}