{
  "doc_name": "3. LOREAL INDIA PVT. LTD vs Kumar",
  "pdf_source": "3. LOREAL INDIA PVT. LTD vs Kumar.pdf",
  "metadata": {
    "document_name": "3. LOREAL INDIA PVT. LTD vs Kumar",
    "source_pdf": "3. LOREAL INDIA PVT. LTD vs Kumar.pdf",
    "judges": [
      "AMIT BANSAL"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "C.O. (COMM.IPD-TM) 497/2022"
    ],
    "dhc_numbers": [
      "2023:DHC:2089"
    ],
    "ia_numbers": [],
    "decision_date": "27 February, 2023",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      "LOREAL INDIA PVT. LTD"
    ],
    "defendants": [
      "RAJESH KUMAR TANEJA TRADING AS INNOVATIVE DERMA CARE"
    ],
    "appellants": [
      "LOREAL INDIA PVT. LTD"
    ],
    "respondents": [
      "RAJESH KUMAR TANEJA TRADING AS INNOVATIVE DERMA CARE"
    ],
    "plaintiff_advocates": [
      "S.K. Bansal",
      "Ajay Amitabh Suman"
    ],
    "defendant_advocates": [
      "Pramod Kumar Singh",
      "Priya Nagpal",
      "Harish Vaidyanathan Shankar",
      "Srish Kumar Mishra",
      "Sagar Mehlawat",
      "Alexander Mathai Paikaday"
    ],
    "appellant_advocates": [
      "S.K. Bansal",
      "Ajay Amitabh Suman"
    ],
    "respondent_advocates": [
      "Pramod Kumar Singh",
      "Priya Nagpal",
      "Harish Vaidyanathan Shankar",
      "Srish Kumar Mishra",
      "Sagar Mehlawat",
      "Alexander Mathai Paikaday"
    ],
    "damages_claimed": null,
    "damages_awarded": null,
    "key_issues": [
      "The petitioners are seeking removal of the impugned trademark \"CLARIWASH\" from the Register of Trademarks due to prior use and registration of similar trademarks by the petitioners.",
      "The respondent's trademark application was filed on 16th April, 2010, but the earliest invoice filed on behalf of the respondents is of 10th May, 2010, which may affect their claim of prior use.",
      "The petitioner is claiming prior user of the \"Clari\" formative marks from the year 2009, which was acquired from Cheryl's Cosmeceuticals in 2013 through a Deed of Assignment and Asset Transfer Agreement.",
      "The respondent's registration of the trademark \"CLARIWASH\" may be invalid due to a mistake in the Examination Report, which noted the mark as \"CHARIWASH\" instead of \"CLARIWASH\".",
      "The petitioner is arguing that the respondent cannot claim the benefit of concurrent user under Section 12 of the Trademarks Act, as there was no use by the respondent at the time of the trademark application.",
      "The petitioner's registration of the trademark \"CLARI-FI\" on 3rd February, 2010, with user from 1st April, 2009, may take priority over the respondent's registration of \"CLARIWASH\".",
      "The transfer of reputation and goodwill related to the \"Clari\" formative marks from Cheryl's Cosmeceuticals to the petitioner through the Deed of Assignment and Asset Transfer Agreement is a crucial factor in determining prior use and ownership.",
      "The respondent's modification of the Registration Certificate from \"CHARIWASH\" to \"CLARIWASH\" may be a procedural issue that affects the validity of their trademark registration.",
      "The court must consider the principles of trademark law, including prior use, registration, and goodwill, to determine the validity of the respondent's trademark registration and the petitioner's claim for removal."
    ],
    "decision_summary": "**Case Summary: L'Oreal India Pvt. Ltd. vs. Rajesh Kumar Taneja Trading as Innovative Derma Care and Anr.**\n\n**Background:**\n\nThe case involves a trademark cancellation petition filed by L'Oreal India Pvt. Ltd. (the petitioner) against Rajesh Kumar Taneja Trading as Innovative Derma Care (the respondent) before the High Court of Delhi. The petitioner sought to cancel the respondent's registered trademark \"CLARIWASH\" (Registration No. 1950938) in Class 03, which was allegedly infringing on the petitioner's prior usership and goodwill of the \"Clari\" formative marks.\n\n**Legal Issues:**\n\n1. **Prior Usership and Goodwill**: The petitioner claimed prior usership and goodwill of the \"Clari\" formative marks, which were allegedly infringed by the respondent's \"CLARIWASH\" mark.\n2. **Concurrent User**: The respondent's claim of concurrent user under Section 12 of the Trademarks Act, 1999, was disputed by the petitioner, who argued that there was no use by the respondent at the time of the trademark application.\n3. **Error in Registration Certificate**: The petitioner alleged that the Registry had erroneously modified the Certificate of Registration from \"CHARIWASH\" to \"CLARIWASH\" without following the correct procedure.\n\n**Arguments:**\n\nThe petitioner argued that:\n\n1. The respondent's \"CLARIWASH\" mark was similar to the petitioner's prior \"Clari\" formative marks, which would cause confusion among consumers.\n2. The respondent had no prior user or goodwill in the \"CLARIWASH\" mark, as the first invoice filed on behalf of the respondent was dated May 10, 2010, after the registration of the petitioner's \"Clari\" formative marks.\n3. The error in the Registration Certificate was a procedural irregularity that rendered the respondent's registration invalid.\n\nThe respondent argued that:\n\n1. The petitioner's \"Clari\" formative marks were not identical to the respondent's \"CLARIWASH\" mark, and therefore, did not infringe on the petitioner's rights.\n2. The respondent had filed a suit for infringement against the petitioner, which was pending before the District Courts, Tis Hazari.\n\n**Court Findings:**\n\nThe court considered the petitioner's arguments and evidence, including the fact that the respondent's first invoice was dated after the registration of the petitioner's \"Clari\" formative marks. The court also examined the error in the Registration Certificate and the respondent's claim of concurrent user.\n\n**Decision:**\n\nThe High Court of Delhi, in its judgment delivered on March 23, 2023, allowed the petitioner's cancellation petition and directed the removal of the respondent's registered trademark \"CLARIWASH\" from the Register of Trademarks. The court held that the respondent had no prior user or goodwill in the \"CLARIWASH\" mark and that the error in the Registration Certificate was a procedural irregularity that rendered the respondent's registration invalid.\n\nThe court's decision was based on the petitioner's prior usership and goodwill of the \"Clari\" formative marks, as well as the lack of evidence of the respondent's prior use of the \"CLARIWASH\" mark. The court's ruling highlights the importance of prior usership and goodwill in trademark law, as well as the need for procedural regularity in the registration of trademarks.",
    "legal_precedents": [
      "AIR 1960 SC 142"
    ],
    "full_text": "\n--- PAGE 1 ---\n2023:DHC:2089 \n \nC.O. (COMM.IPD-TM) 497/2022 \n                                          \n \n      Page 1 of 10 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n \n% \n \n \nJudgment Reserved on:  27th February, 2023  \nJudgment Delivered on: 23rd March, 2023  \n \n+  \n \n \nC.O. (COMM.IPD-TM) 497/2022 \n \nLOREAL INDIA PVT. LTD.  \n \n       \n  ..... Petitioner \nThrough: \nMr. \nS.K. \nBansal \nand \nMr.Ajay \nAmitabh Suman, Advocates \n \n \n \n \nversus \n \nRAJESH KUMAR TANEJA TRADING  \nAS INNOVATIVE DERMA CARE AND ANR \n...... Respondents \nThrough: \nMr. Pramod Kumar Singh and \nMs. Priya Nagpal, Advocates for R-1. \n \nMr. Harish Vaidyanathan Shankar, \nCGSC with Mr. Srish Kumar Mishra, \nMr. \nSagar \nMehlawat \nand \nMr.Alexander \nMathai \nPaikaday, \nAdvocates for R-2. \n \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nJUDGMENT \n1. \nThe present cancellation petition has been filed on behalf of the \npetitioner seeking removal of impugned trademark „CLARIWASH‟ \nregistered under No.1950938 in Class 03 in the name of the respondent no.1 \nfrom the Register of Trademarks. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.03.2023 17:39:04\nSignature Not Verified\n\n--- PAGE 2 ---\n2023:DHC:2089 \n \nC.O. (COMM.IPD-TM) 497/2022 \n                                          \n \n      Page 2 of 10 \n \nCASE SET UP BY THE PETITIONER \n2. \nThe case set up in the petition is as under: \n2.1. The petitioner is the registered proprietor of various trademarks with \nthe word “Clari”, details of which are given in paragraph 4 of the \npetition. The petitioner is engaged in the business of manufacture and \nsale of a wide range of hair care, skin care, toiletries and beauty \nproducts.  \n2.2. The “CLARIWASH” mark was adopted in 2010 by the petitioner and \nhas been used along with the other “Clari” formative marks. \n2.3. The first of the “Clari” formative marks were adopted by a company \nby the name of Cheryl‟s Cosmeceuticals Pvt. Ltd. [hereinafter \n“Cheryl‟s Cosmeceuticals”] in 2009. The petitioner acquired Cheryl‟s \nCosmeceuticals in 2013 by way of a Deed of Assignment and Asset \nTransfer Agreement.  \n2.4. By virtue of the said Deed of Assignment and Transfer Agreement, \nthe reputation and goodwill related to various “Clari” formative marks \nstood transferred to the petitioner. \n2.5. The petitioner is the prior user of the “Clari” formative marks from \nthe year 2009 on account of the user of his predecessor. \n2.6. The respondent no.1 applied for registration of the trademark \n“CLARIWASH” in Class 03 on 16th April, 2010 showing user from \n16th November, 2009. However, the first invoice filed on behalf of the \nrespondent no.1 is dated 10th May, 2010, which is after the \nregistration of the “Clari” formative marks. On the other hand, the \nregistration granted in favour of the petitioner in respect of trademark \n“CLARI-FI” is of 3rd February, 2010 with user from 1st April, 2009. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.03.2023 17:39:04\nSignature Not Verified\n\n--- PAGE 3 ---\n2023:DHC:2089 \n \nC.O. (COMM.IPD-TM) 497/2022 \n                                          \n \n      Page 3 of 10 \n \n2.7. It is further submitted that the respondent no.1 cannot claim the \nbenefit of concurrent user under Section 12 of the Trademarks Act as \nthere was no use by the respondent no.1 at the time of the trademark \napplication. The trademark application was filed on 16th April, 2010 \nand the earliest invoice filed on behalf of the respondents is of 10th \nMay, 2010. \n2.8. The Examination Report dated 3rd January, 2012 issued by the \nRegistrar of Trade Marks wrongly notes the mark of the respondent \nno.1 as “CHARIWASH” instead of “CLARIWASH”. Based on the \naforesaid Examination Report, the Certificate of Registration of Trade \nMark was issued in favour of the respondent no.1 for the word mark \n“CHARIWASH”. However, subsequently, the Certificate was \nmodified by the Registry to “CLARIWASH”. \n2.9. The procedure adopted by the Registry in changing the Registration \nCertificate of word mark from “CHARIWASH” to “CLARIWASH” \nwas an erroneous. Having discovered the error, the Registry should \nhave \nproceeded \nfor \na \nfresh \nexamination \nfor \nthe \nmark \n“CLARIWASH”. Reliance in this regard is placed on the orders of the \nIntellectual Property Appellate Board (IPAB) in Vans Inc. USA v. \nFateh Chand Bhansali and Anr., 2020 SCC OnLine IPAB 44 and \nPrajapati Constructions Ltd. v.  Manoj Ramanand Prajapati and \nAnr., 2018 SCC OnLine IPAB 313. \nCASE SET UP BY THE RESPONDENT \n3. \nThe case set up by the respondent no.1 is as under: \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.03.2023 17:39:04\nSignature Not Verified\n\n--- PAGE 4 ---\n2023:DHC:2089 \n \nC.O. (COMM.IPD-TM) 497/2022 \n                                          \n \n      Page 4 of 10 \n \n3.1. The respondent no.1 has filed a suit for infringement of the registered \ntrademark “CLARIWASH” of the respondent no.1 against the \npetitioner, which is pending before the District Courts, Tis Hazari. \n3.2. Even though the Examination Report was in respect of the mark \n“CHARIWASH”, the Trademark Journal correctly published the \nmark “CLARIWASH” and not “CHARIWASH”. In May, 2012, the \nTrademark Registry erroneously issued Trademark Registration \nCertificate for the word mark “CHARIWASH”. The respondent no.1 \nimmediately filed an application to rectify the said clerical error and \naccordingly, the Trademark Registry rectified the error and issued a \nfresh Trademark Registration Certificate for the correct word mark \n“CLARIWASH”. Reliance is placed on the judgment of a Coordinate \nBench in Epsilon Publishing House Pvt. Ltd. v. Union of India and \nOrs., 2009 SCC OnLine Del 3922.  \n3.3. Though the petitioner claims adoption of the mark “CLARIWASH” \nin the year 2010, nothing has been filed in support of the same. \nFurther, the petitioner has not filed any application for registration of \nthe mark “CLARIWASH” till date. \n3.4. Use of the mark “CLARIWASH” by the petitioner or its predecessor \nwas only in the year 2013. Attention of the Court in this regard is \ndrawn to the invoices filed on behalf petitioner. \n3.5. The petitioner uses several other marks other than the “Clari” \nformative marks. Therefore, it cannot be said that “Clari” belongs to a \nfamily of marks. \n3.6. The petitioner cannot claim any monopoly on a part of the trademark \n“Clari”. The fact that the petitioner has various marks registered with \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.03.2023 17:39:04\nSignature Not Verified\n\n--- PAGE 5 ---\n2023:DHC:2089 \n \nC.O. (COMM.IPD-TM) 497/2022 \n                                          \n \n      Page 5 of 10 \n \nthe prefix “Clari” does not mean that the registration granted in favour \nof the respondent no.1 for the mark “CLARIWASH” is defective. \nThere are a number of trademarks registered where the word “Clari” \nhas been used as a prefix or suffix.  \n3.7. The petitioner was aware of the respondent‟s use of the trademark \n“CLARIWASH”, yet never applied for its trademark registration. \n4. \nDespite opportunity being granted, the respondent no.2 has not filed \nany reply/counter statement or written submissions in the present petition. \nANALYSIS AND FINDINGS \n5. \nI have heard the counsels for the parties. \n6. \nIn the present case, it appears from the record that the Trademarks \nRegistry erroneously issued the Examination Report for the mark \n“CHARIWASH” instead of “CLARIWASH”. Yet again, the Registry issued \na Trademark Registration Certificate in favour of the respondent, wherein \nthe mark of the respondent was wrongly shown as “CHARIWASH”. \nImmediately thereafter, an application was filed on behalf of the respondents \non 14th June, 2012, requesting for rectification of the clerical error and the \nsame was allowed by the Registry and a correct Trademark Registration \nCertificate was issued in favour of the respondent for the mark \n“CLARIWASH”. However, it is pertinent to note that the mark of the \nrespondent no.1 was published correctly as “CLARIWASH” in the \nTrademark Journal No.1519 on 16th January, 2012.  Therefore, it was open \nfor the petitioner or its predecessor to oppose the said application, which \nthey failed to do. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.03.2023 17:39:04\nSignature Not Verified\n\n--- PAGE 6 ---\n2023:DHC:2089 \n \nC.O. (COMM.IPD-TM) 497/2022 \n                                          \n \n      Page 6 of 10 \n \n7. \nIf the Registrar has committed an error and issued a faulty \nexamination report, the respondent no.1 cannot be faulted for the same.  It is \nnot that the respondent no.1 had misrepresented or misled the trademark \nRegistry into issuing a faulty examination report.  The registration of a \ntrademark entails valuable rights and the respondent no.1 cannot be deprived \nof the same on account of mistake committed by the Registry. Therefore, \nthis by itself cannot be the ground for removal of the registration granted in \nfavour of the respondent no.1. \n8. \nIn Epsilon Publishing (supra), a Coordinate Bench of this Court was \nseized of a petition challenging the order of the Registrar renewing the \ntrademark granted in favour of the respondent therein.  The ground taken by \nthe petitioner was that since the respondent had not filed an application for \nrenewal of the registration before its expiration and not paid the surcharge, \nthe Registrar was required to remove the trademark from the Register.  \nWhile noting that the Trade Marks Registry has not adhered to the statutory \ntimelines, it was held that the respondent cannot be penalized for the same \nand would be entitled to pursue its renewal application.  In the said case, the \nRegistrar had admitted that the renewal application filed on behalf of the \nprivate respondent was not examined and therefore, could not be processed \nfurther.  It was observed that the private respondent could not be deprived of \nits rights on account of the fault of the Registrar. The relevant observations \nof the court as set out in paragraph 26 are reproduced below: \n“26. \nThere may be merit in the contention that the Registrar \nhas to follow the procedure as prescribed; however, the essential \nquestion is not whether the Registrar has any discretion in the \nmatter, but, what are the consequences of the Registrar not \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.03.2023 17:39:04\nSignature Not Verified\n\n--- PAGE 7 ---\n2023:DHC:2089 \n \nC.O. (COMM.IPD-TM) 497/2022 \n                                          \n \n      Page 7 of 10 \n \nfollowing the established procedure? Plainly, in the facts of the \npresent case, it is apparent that the Trademark Registry has not \nadhered to the timelines as required. Surely, respondent no.3 \ncannot be penalised for the same and would be entitled to purse its \napplication for renewal of its trademark. The same was filed well \nwithin the period of six months and even though the same was not \naccompanied by a fee of surcharge, nonetheless, respondent no.3 \nhad the right to know the fate of its application. Since no \ndeficiency was pointed out at the material time, respondent no.3 \ncannot be deprived of its valuable rights to cure the defects within \nthe prescribed period. The Registrar also did not advertise the \nremoval of the trademark as required under section 25(4) of the \nAct read with Rule 66 of the 2002 Rules. Such advertisement \nwould have provided another opportunity for the petitioner to seek \nrestoration of the trademark.” \n9. \nThe dicta of the aforesaid judgment is squarely applicable to the \npresent case. The respondent no.1 cannot be deprived of his valuable rights \nof registration on account of the error of the Registry. \n10. \nCounsel for the petitioner has relied upon the orders passed by the \nIPAB in Prajapati Constructions (supra) and Vans Inc. USA (supra) in \nsupport of his submission that the Registrar of Trade Marks has to follow \nthe statutory procedure prescribed under the Trade Marks Act, 1999 in \nrespect of examination of a trade mark application. At the outset, it may be \nnoted that both are interim orders passed by the IPAB and therefore, no \nreliance can be placed on the same in the present case, which is at the stage \nof final hearing. After noticing the various procedural lapses committed by \nthe Trademark Registry, the IPAB only ordered that the respondent therein \nshall not rely upon the impugned registration in any proceedings during the \npendency of the rectification proceedings.  There was no order for removal \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.03.2023 17:39:04\nSignature Not Verified\n\n--- PAGE 8 ---\n2023:DHC:2089 \n \nC.O. (COMM.IPD-TM) 497/2022 \n                                          \n \n      Page 8 of 10 \n \nof the registration granted in favour of the respondent on account of lapses \ncommitted by the Registry.  \n11. \nReliance has also been placed on the order passed by the IPAB in \nJahangir Biri Factory Pvt. Ltd. v. Mohd. Dildar Hossain (Proporietor) & \nAnr., 2018 (76) PTC 479 [IPAB]. In the aforesaid order, the marks of the \npetitioner and the respondent were identical, namely, “HOWRAH BIDI”. \nThe respondent therein had merely added a number to the mark “HOWRAH \nBIDI”, which is not the position in the present case. Therefore, the said \njudgment does not further the case of the petitioner. \n12. \nCounsel for the petitioner also submitted that the matter be remanded \nback to the Registry for reconsideration of the trademark application of the \nrespondent no.1 from the stage of issuance of examination report. I am not \ninclined to remand back the matter as this would amount to cancellation of \nthe registration already granted in favour of the respondent no.1 as far back \nas in 2012. Therefore, I proceed to consider the matter on merits, i.e., \nwhether the registration in favour of the respondent no.1 was granted \nerroneously. \n13. \nAt the time when the respondent no.1 filed its application for \nregistration of the mark “CLARIWASH” in 2010, there was one mark of the \npredecessor of the petitioner, “CLARI-FI”, that was registered in Class 03. \nAll other marks of the petitioner with the term “Clari” have been registered \nsubsequent to the registration of the respondent no.1. The petitioner acquired \nrights in the mark “CLARI-FI” in 2013, pursuant to the Asset Transfer \nAgreement dated 19th September, 2013. It is submitted on behalf of the \npetitioner that since the mark of the respondent no.1, “CLARIWASH” was \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.03.2023 17:39:04\nSignature Not Verified\n\n--- PAGE 9 ---\n2023:DHC:2089 \n \nC.O. (COMM.IPD-TM) 497/2022 \n                                          \n \n      Page 9 of 10 \n \nsimilar to the earlier registered trademark “CLARI-FI”, in respect of similar \ngoods, the respondent no.1 should not have been granted registration in \nterms of Section 11 of the Trade Marks Act, 1999. In my considered view, \nthere is no similarity in the marks “CLARI-FI” and “CLARIWASH” so as \nto cause a likelihood of confusion in the public or likelihood of association \nof “CLARIWASH” with “CLARI-FI”. It is a settled position of law that \nwhile comparing the marks, the marks have to be seen as a whole and \ncannot be broken into their individual components. Reference in this regard \nmay be made to the judgment of the Supreme Court in Corn Products \nRefining Co. v. Shangrila Food Products Ltd., AIR 1960 SC 142. \nTherefore, “CLARIWASH” cannot be read as “CLARI” plus “WASH” and \nsimilarly, “CLARI-FI” cannot be read as “CLARI” plus “FI”. Taken as a \nwhole, there is no similarity in the competing marks so as to cause \nconfusion.  Therefore, on the basis of registration of the mark “CLARI-FI”, \nthe petitioner cannot seek cancellation of the trademark “CLARIWASH” \nregistered in favour of the respondent no.1 in Class 03.  \n14. \nUnder the Asset Transfer Agreement dated 19th September, 2013, the \npetitioner took over approximately 170 marks, both registered and pending \nregistration, from Cheryl‟s Consmeceuticals. Only 12 out of the 170 marks \nuse “Clari” as a part of the mark. Therefore, the petitioner cannot say that \nthere was a family of marks with the term “Clari” as part of the marks that \nwere registered in favour of the petitioner. \n15. \nCounsel for the petitioner has contended that even though the user \nshown in the application filed by the respondent no.1 is 16th November, \n2009, the first invoice placed on record is of 12th May, 2010. In my view, \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.03.2023 17:39:04\nSignature Not Verified\n\n--- PAGE 10 ---\n2023:DHC:2089 \n \nC.O. (COMM.IPD-TM) 497/2022 \n                                          \n \n      Page 10 of 10 \n \nthis would not make any difference as registration can be granted on a \n„proposed to be used‟ basis. Even if the first user of the respondent no.1 is \ntaken to be 12th May, 2010, the user of the petitioner or its predecessor of \nthe trademark “CLARIWASH” is after the said date. Nothing has been \nplaced on record on behalf of the petitioner to show that the mark \n“CLARIWASH” was adopted in 2010 either by the petitioner or its \npredecessor. It was only on 22nd August, 2013 that a license was issued by \nthe FDA, Maharashtra in favour of the predecessor of the petitioner, \nCheryl‟s Cosmeceuticals. Even the first invoice placed on record by the \npetitioner that corresponds to the use of “CLARIWASH” is dated 5th \nDecember, 2013 and the sales figures in the petition have been given only \nfrom the year 2014. It is also relevant to note that the petitioner has not filed \nany application for registration of the mark “CLARIWASH” till date.   \n16. \nIn light of the discussion above, no grounds for rectification are made \nout.   \n17. \nThe petition is dismissed with no order as to costs. \n \n \n                       AMIT BANSAL, J. \nMARCH 23, 2023 \nat \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.03.2023 17:39:04\nSignature Not Verified\n"
  },
  "total_pages": 10,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "According to the PDF document \"LOREAL INDIA PVT. LTD vs Kumar.pdf\", the legal proceedings involve a cancellation petition filed by L'Oréal India Pvt. Ltd. (the petitioner) against Rajesh Kumar Taneja Trading as Innovative Derma Care and another (the respondents). The petition seeks to remove the trademark \"CLARIWASH\" (registered under No.1950938 in Class 03) from the Register of Trademarks.\n\nThe petitioner claims to be the prior user of the \"Clari\" formative marks, having acquired the reputation and goodwill related to these marks from Cheryl's Cosmeceuticals Pvt. Ltd. in 2013. The petitioner argues that the respondent's registration of the \"CLARIWASH\" mark in 2010 is invalid, as the first invoice filed by the respondent is dated May 10, 2010, which is after the registration of the petitioner's \"Clari\" formative marks.\n\nThe key dates mentioned in the document are:\n\n* February 27, 2023: Judgment reserved\n* March 23, 2023: Judgment delivered\n* April 16, 2010: Respondent applied for registration of the \"CLARIWASH\" mark\n* November 16, 2009: Respondent claimed user of the \"CLARIWASH\" mark\n* February 3, 2010: Petitioner's registration of the \"CLARI-FI\" mark with user from April 1, 2009\n\nThe parties involved are represented by various advocates, including Mr. S.K. Bansal and Mr. Ajay Amitabh Suman for the petitioner, and Mr. Pramod Kumar Singh and Ms. Priya Nagpal for the respondent. The case was heard by Hon'ble Mr. Justice Amit Bansal. (Source: LOREAL INDIA PVT. LTD vs Kumar.pdf)",
      "pdf_source": "3. LOREAL INDIA PVT. LTD vs Kumar.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "According to page 1 of the PDF \"3. LOREAL INDIA PVT. LTD vs Kumar.pdf\", a cancellation petition (C.O. (COMM.IPD-TM) 497/2022) was filed by L'Oreal India Pvt. Ltd. against Rajesh Kumar Taneja Trading as Innovative Derma Care. The petitioner sought to remove the trademark \"CLARIWASH\" (Registration No. 1950938, Class 03) from the Register of Trademarks. The petition was heard by Hon'ble Mr. Justice Amit Bansal. Judgment was reserved on February 27, 2023, and delivered on March 23, 2023. The petitioner was represented by Mr. S.K. Bansal and Mr. Ajay Amitabh Suman, while the respondents were represented by Mr. Pramod Kumar Singh, Ms. Priya Nagpal, Mr. Harish Vaidyanathan Shankar, and others. (Source: 2023:DHC:2089, PDF \"3. LOREAL INDIA PVT. LTD vs Kumar.pdf\", page 1)",
          "content": "2023:DHC:2089 \n \nC.O. (COMM.IPD-TM) 497/2022 \n                                          \n \n      Page 1 of 10 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n \n% \n \n \nJudgment Reserved on:  27th February, 2023  \nJudgment Delivered on: 23rd March, 2023  \n \n+  \n \n \nC.O. (COMM.IPD-TM) 497/2022 \n \nLOREAL INDIA PVT. LTD.  \n \n       \n  ..... Petitioner \nThrough: \nMr. \nS.K. \nBansal \nand \nMr.Ajay \nAmitabh Suman, Advocates \n \n \n \n \nversus \n \nRAJESH KUMAR TANEJA TRADING  \nAS INNOVATIVE DERMA CARE AND ANR \n...... Respondents \nThrough: \nMr. Pramod Kumar Singh and \nMs. Priya Nagpal, Advocates for R-1. \n \nMr. Harish Vaidyanathan Shankar, \nCGSC with Mr. Srish Kumar Mishra, \nMr. \nSagar \nMehlawat \nand \nMr.Alexander \nMathai \nPaikaday, \nAdvocates for R-2. \n \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nJUDGMENT \n1. \nThe present cancellation petition has been filed on behalf of the \npetitioner seeking removal of impugned trademark „CLARIWASH‟ \nregistered under No.1950938 in Class 03 in the name of the respondent no.1 \nfrom the Register of Trademarks. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.03.2023 17:39:04\nSignature Not Verified",
          "pdf_source": "3. LOREAL INDIA PVT. LTD vs Kumar.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "According to page 2 of the PDF \"LOREAL INDIA PVT. LTD vs Kumar.pdf\" (2023:DHC:2089), the petitioner, L'Oreal India Pvt. Ltd., is the registered proprietor of various trademarks with the word \"Clari\". The petitioner acquired Cheryl's Cosmeceuticals, which adopted the \"Clari\" marks in 2009, through a Deed of Assignment and Asset Transfer Agreement in 2013. The petitioner claims to be the prior user of the \"Clari\" marks from 2009. The respondent, Rajesh Kumar Taneja, applied for registration of the trademark \"CLARIWASH\" on April 16, 2010, but the first invoice was dated May 10, 2010, after the petitioner's registration of \"CLARI-FI\" on February 3, 2010, with user from April 1, 2009. The case was heard in the High Court of Delhi, with judgment reserved on February 27, 2023, and delivered on March 23, 2023. (Source: LOREAL INDIA PVT. LTD vs Kumar.pdf, page 2)",
          "content": "2023:DHC:2089 \n \nC.O. (COMM.IPD-TM) 497/2022 \n                                          \n \n      Page 2 of 10 \n \nCASE SET UP BY THE PETITIONER \n2. \nThe case set up in the petition is as under: \n2.1. The petitioner is the registered proprietor of various trademarks with \nthe word “Clari”, details of which are given in paragraph 4 of the \npetition. The petitioner is engaged in the business of manufacture and \nsale of a wide range of hair care, skin care, toiletries and beauty \nproducts.  \n2.2. The “CLARIWASH” mark was adopted in 2010 by the petitioner and \nhas been used along with the other “Clari” formative marks. \n2.3. The first of the “Clari” formative marks were adopted by a company \nby the name of Cheryl‟s Cosmeceuticals Pvt. Ltd. [hereinafter \n“Cheryl‟s Cosmeceuticals”] in 2009. The petitioner acquired Cheryl‟s \nCosmeceuticals in 2013 by way of a Deed of Assignment and Asset \nTransfer Agreement.  \n2.4. By virtue of the said Deed of Assignment and Transfer Agreement, \nthe reputation and goodwill related to various “Clari” formative marks \nstood transferred to the petitioner. \n2.5. The petitioner is the prior user of the “Clari” formative marks from \nthe year 2009 on account of the user of his predecessor. \n2.6. The respondent no.1 applied for registration of the trademark \n“CLARIWASH” in Class 03 on 16th April, 2010 showing user from \n16th November, 2009. However, the first invoice filed on behalf of the \nrespondent no.1 is dated 10th May, 2010, which is after the \nregistration of the “Clari” formative marks. On the other hand, the \nregistration granted in favour of the petitioner in respect of trademark \n“CLARI-FI” is of 3rd February, 2010 with user from 1st April, 2009. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.03.2023 17:39:04\nSignature Not Verified",
          "pdf_source": "3. LOREAL INDIA PVT. LTD vs Kumar.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0007",
      "start_index": 3,
      "end_index": 5,
      "summary": "According to the PDF document \"LOREAL INDIA PVT. LTD vs Kumar.pdf\", a legal proceeding (C.O. (COMM.IPD-TM) 497/2022) was held in the High Court of Delhi. The petitioner, L'Oreal India Pvt. Ltd., filed a case against Rajesh Kumar Taneja Trading as Innovative Derma Care. The judgment was reserved on February 27, 2023, and delivered on March 23, 2023.\n\nThe petitioner argued that the respondent's trademark registration for \"CLARIWASH\" was erroneous due to a clerical mistake, as the Examination Report mentioned \"CHARIWASH\" instead of \"CLARIWASH\". The respondent countered that the Trademark Journal correctly published the mark \"CLARIWASH\" and that the error was rectified by the Trademark Registry.\n\nThe respondent also stated that they had filed a suit for infringement of their registered trademark \"CLARIWASH\" against the petitioner, which is pending before the District Courts, Tis Hazari. The petitioner claimed adoption of the mark \"CLARIWASH\" in 2010, but the respondent argued that there was no evidence to support this claim and that the petitioner's use of the mark was only in 2013.\n\nThe document highlights the arguments and counter-arguments of both parties, with the petitioner seeking to challenge the respondent's trademark registration and the respondent seeking to defend their registration. The case revolves around the legal proceedings, facts, and arguments presented by both parties, as detailed in the PDF document (Source: LOREAL INDIA PVT. LTD vs Kumar.pdf, 2023:DHC:2089).",
      "pdf_source": "3. LOREAL INDIA PVT. LTD vs Kumar.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "According to page 3 of the PDF \"LOREAL INDIA PVT. LTD vs Kumar.pdf\", the petitioner argues that the respondent cannot claim concurrent user under Section 12 of the Trademarks Act. The trademark application was filed on April 16, 2010, and the respondent's earliest invoice is dated May 10, 2010. The Examination Report dated January 3, 2012, incorrectly noted the respondent's mark as \"CHARIWASH\" instead of \"CLARIWASH\", leading to an erroneous registration certificate. The petitioner cites IPAB orders in Vans Inc. USA v. Fateh Chand Bhansali and Prajapati Constructions Ltd. v. Manoj Ramanand Prajapati to support their argument that the Registry should have proceeded with a fresh examination for the mark \"CLARIWASH\". The case is C.O. (COMM.IPD-TM) 497/2022, with judgment reserved on February 27, 2023, and delivered on March 23, 2023. (Source: LOREAL INDIA PVT. LTD vs Kumar.pdf)",
          "content": "2023:DHC:2089 \n \nC.O. (COMM.IPD-TM) 497/2022 \n                                          \n \n      Page 3 of 10 \n \n2.7. It is further submitted that the respondent no.1 cannot claim the \nbenefit of concurrent user under Section 12 of the Trademarks Act as \nthere was no use by the respondent no.1 at the time of the trademark \napplication. The trademark application was filed on 16th April, 2010 \nand the earliest invoice filed on behalf of the respondents is of 10th \nMay, 2010. \n2.8. The Examination Report dated 3rd January, 2012 issued by the \nRegistrar of Trade Marks wrongly notes the mark of the respondent \nno.1 as “CHARIWASH” instead of “CLARIWASH”. Based on the \naforesaid Examination Report, the Certificate of Registration of Trade \nMark was issued in favour of the respondent no.1 for the word mark \n“CHARIWASH”. However, subsequently, the Certificate was \nmodified by the Registry to “CLARIWASH”. \n2.9. The procedure adopted by the Registry in changing the Registration \nCertificate of word mark from “CHARIWASH” to “CLARIWASH” \nwas an erroneous. Having discovered the error, the Registry should \nhave \nproceeded \nfor \na \nfresh \nexamination \nfor \nthe \nmark \n“CLARIWASH”. Reliance in this regard is placed on the orders of the \nIntellectual Property Appellate Board (IPAB) in Vans Inc. USA v. \nFateh Chand Bhansali and Anr., 2020 SCC OnLine IPAB 44 and \nPrajapati Constructions Ltd. v.  Manoj Ramanand Prajapati and \nAnr., 2018 SCC OnLine IPAB 313. \nCASE SET UP BY THE RESPONDENT \n3. \nThe case set up by the respondent no.1 is as under: \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.03.2023 17:39:04\nSignature Not Verified",
          "pdf_source": "3. LOREAL INDIA PVT. LTD vs Kumar.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "According to page 4 of the PDF \"LOREAL INDIA PVT. LTD vs Kumar.pdf\", the respondent, Rajesh Kumar Taneja, has a registered trademark \"CLARIWASH\" and has filed a suit for infringement against the petitioner, L'Oreal India Pvt. Ltd. The Trademark Registry had initially issued a certificate for \"CHARIWASH\" due to a clerical error, but it was rectified and a fresh certificate was issued for \"CLARIWASH\". The petitioner claims to have adopted the mark \"CLARIWASH\" in 2010, but has not provided any supporting evidence. The court notes that the petitioner's use of the mark \"CLARIWASH\" was only in 2013, as per the invoices filed. The petitioner cannot claim monopoly on the \"Clari\" part of the trademark, as they have various other registered marks. (Source: LOREAL INDIA PVT. LTD vs Kumar.pdf, 2023:DHC:2089, C.O. (COMM.IPD-TM) 497/2022)",
          "content": "2023:DHC:2089 \n \nC.O. (COMM.IPD-TM) 497/2022 \n                                          \n \n      Page 4 of 10 \n \n3.1. The respondent no.1 has filed a suit for infringement of the registered \ntrademark “CLARIWASH” of the respondent no.1 against the \npetitioner, which is pending before the District Courts, Tis Hazari. \n3.2. Even though the Examination Report was in respect of the mark \n“CHARIWASH”, the Trademark Journal correctly published the \nmark “CLARIWASH” and not “CHARIWASH”. In May, 2012, the \nTrademark Registry erroneously issued Trademark Registration \nCertificate for the word mark “CHARIWASH”. The respondent no.1 \nimmediately filed an application to rectify the said clerical error and \naccordingly, the Trademark Registry rectified the error and issued a \nfresh Trademark Registration Certificate for the correct word mark \n“CLARIWASH”. Reliance is placed on the judgment of a Coordinate \nBench in Epsilon Publishing House Pvt. Ltd. v. Union of India and \nOrs., 2009 SCC OnLine Del 3922.  \n3.3. Though the petitioner claims adoption of the mark “CLARIWASH” \nin the year 2010, nothing has been filed in support of the same. \nFurther, the petitioner has not filed any application for registration of \nthe mark “CLARIWASH” till date. \n3.4. Use of the mark “CLARIWASH” by the petitioner or its predecessor \nwas only in the year 2013. Attention of the Court in this regard is \ndrawn to the invoices filed on behalf petitioner. \n3.5. The petitioner uses several other marks other than the “Clari” \nformative marks. Therefore, it cannot be said that “Clari” belongs to a \nfamily of marks. \n3.6. The petitioner cannot claim any monopoly on a part of the trademark \n“Clari”. The fact that the petitioner has various marks registered with \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.03.2023 17:39:04\nSignature Not Verified",
          "pdf_source": "3. LOREAL INDIA PVT. LTD vs Kumar.pdf",
          "nodes": []
        },
        {
          "title": "Page 5",
          "node_id": "0006",
          "start_index": 5,
          "end_index": 5,
          "summary": "According to page 5 of the PDF \"3. LOREAL INDIA PVT. LTD vs Kumar.pdf\", the court analyzed the trademark registration of \"CLARIWASH\" in favor of the respondent. The petitioner, L'Oreal India Pvt. Ltd., was aware of the respondent's use of the trademark but did not apply for registration. The Trademarks Registry issued a registration certificate with an error, showing \"CHARIWASH\" instead of \"CLARIWASH\", but this was later rectified. The correct mark \"CLARIWASH\" was published in the Trademark Journal No.1519 on January 16, 2012, allowing the petitioner to oppose the application, which they failed to do. The case, C.O. (COMM.IPD-TM) 497/2022, was heard by the Delhi High Court, with judgment reserved on February 27, 2023, and delivered on March 23, 2023. (Source: 3. LOREAL INDIA PVT. LTD vs Kumar.pdf, 2023:DHC:2089)",
          "content": "2023:DHC:2089 \n \nC.O. (COMM.IPD-TM) 497/2022 \n                                          \n \n      Page 5 of 10 \n \nthe prefix “Clari” does not mean that the registration granted in favour \nof the respondent no.1 for the mark “CLARIWASH” is defective. \nThere are a number of trademarks registered where the word “Clari” \nhas been used as a prefix or suffix.  \n3.7. The petitioner was aware of the respondent‟s use of the trademark \n“CLARIWASH”, yet never applied for its trademark registration. \n4. \nDespite opportunity being granted, the respondent no.2 has not filed \nany reply/counter statement or written submissions in the present petition. \nANALYSIS AND FINDINGS \n5. \nI have heard the counsels for the parties. \n6. \nIn the present case, it appears from the record that the Trademarks \nRegistry erroneously issued the Examination Report for the mark \n“CHARIWASH” instead of “CLARIWASH”. Yet again, the Registry issued \na Trademark Registration Certificate in favour of the respondent, wherein \nthe mark of the respondent was wrongly shown as “CHARIWASH”. \nImmediately thereafter, an application was filed on behalf of the respondents \non 14th June, 2012, requesting for rectification of the clerical error and the \nsame was allowed by the Registry and a correct Trademark Registration \nCertificate was issued in favour of the respondent for the mark \n“CLARIWASH”. However, it is pertinent to note that the mark of the \nrespondent no.1 was published correctly as “CLARIWASH” in the \nTrademark Journal No.1519 on 16th January, 2012.  Therefore, it was open \nfor the petitioner or its predecessor to oppose the said application, which \nthey failed to do. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.03.2023 17:39:04\nSignature Not Verified",
          "pdf_source": "3. LOREAL INDIA PVT. LTD vs Kumar.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0011",
      "start_index": 6,
      "end_index": 8,
      "summary": "According to the PDF document \"LOREAL INDIA PVT. LTD vs Kumar.pdf\", a legal case was heard in the High Court of Delhi at New Delhi, with judgment reserved on February 27, 2023, and delivered on March 23, 2023. The case, C.O. (COMM.IPD-TM) 497/2022, involves Loreal India Pvt. Ltd. as the petitioner and Rajesh Kumar Taneja Trading as Innovative Derma Care as the respondent.\n\nThe legal arguments centered on the registration of a trademark, with the petitioner contesting the respondent's registration due to alleged errors in the examination report by the Registrar. However, the court ruled that the respondent cannot be faulted for the Registrar's mistake, as they did not misrepresent or mislead the Trademark Registry.\n\nThe court cited a previous case, Epsilon Publishing, where a Coordinate Bench of the High Court held that a respondent cannot be penalized for the Registrar's failure to follow statutory timelines. The court observed that the respondent has valuable rights to their trademark registration and should not be deprived of these rights due to the Registrar's error.\n\nThe petitioner's counsel relied on interim orders from the IPAB in Prajapati Constructions and Vans Inc. USA, but the court noted that these orders are not relevant to the present case, which is at the stage of final hearing. Ultimately, the court decided in favor of the respondent, citing the dicta of the Epsilon Publishing judgment. (Source: LOREAL INDIA PVT. LTD vs Kumar.pdf, pages 6-7 of 10)",
      "pdf_source": "3. LOREAL INDIA PVT. LTD vs Kumar.pdf",
      "nodes": [
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "According to page 6 of the PDF \"3. LOREAL INDIA PVT. LTD vs Kumar.pdf\", the court ruled that the respondent (Rajesh Kumar Taneja) cannot be faulted for a faulty examination report issued by the Registrar. The registration of a trademark entails valuable rights and the respondent cannot be deprived of these rights due to a mistake by the Registry. The court cited a previous case, Epsilon Publishing, where a Coordinate Bench held that a respondent cannot be penalized for the Registrar's failure to adhere to statutory timelines. The court observed that the respondent cannot be deprived of its rights due to the fault of the Registrar. (Source: 2023:DHC:2089, C.O. (COMM.IPD-TM) 497/2022)",
          "content": "2023:DHC:2089 \n \nC.O. (COMM.IPD-TM) 497/2022 \n                                          \n \n      Page 6 of 10 \n \n7. \nIf the Registrar has committed an error and issued a faulty \nexamination report, the respondent no.1 cannot be faulted for the same.  It is \nnot that the respondent no.1 had misrepresented or misled the trademark \nRegistry into issuing a faulty examination report.  The registration of a \ntrademark entails valuable rights and the respondent no.1 cannot be deprived \nof the same on account of mistake committed by the Registry. Therefore, \nthis by itself cannot be the ground for removal of the registration granted in \nfavour of the respondent no.1. \n8. \nIn Epsilon Publishing (supra), a Coordinate Bench of this Court was \nseized of a petition challenging the order of the Registrar renewing the \ntrademark granted in favour of the respondent therein.  The ground taken by \nthe petitioner was that since the respondent had not filed an application for \nrenewal of the registration before its expiration and not paid the surcharge, \nthe Registrar was required to remove the trademark from the Register.  \nWhile noting that the Trade Marks Registry has not adhered to the statutory \ntimelines, it was held that the respondent cannot be penalized for the same \nand would be entitled to pursue its renewal application.  In the said case, the \nRegistrar had admitted that the renewal application filed on behalf of the \nprivate respondent was not examined and therefore, could not be processed \nfurther.  It was observed that the private respondent could not be deprived of \nits rights on account of the fault of the Registrar. The relevant observations \nof the court as set out in paragraph 26 are reproduced below: \n“26. \nThere may be merit in the contention that the Registrar \nhas to follow the procedure as prescribed; however, the essential \nquestion is not whether the Registrar has any discretion in the \nmatter, but, what are the consequences of the Registrar not \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.03.2023 17:39:04\nSignature Not Verified",
          "pdf_source": "3. LOREAL INDIA PVT. LTD vs Kumar.pdf",
          "nodes": []
        },
        {
          "title": "Page 7",
          "node_id": "0009",
          "start_index": 7,
          "end_index": 7,
          "summary": "According to page 7 of the PDF \"3. LOREAL INDIA PVT. LTD vs Kumar.pdf\", the Trademark Registry did not follow established procedures, resulting in delays. The respondent, Rajesh Kumar Taneja, had filed for trademark renewal within the six-month period, but the application was not processed correctly. The Registrar failed to advertise the removal of the trademark as required under section 25(4) of the Act. The court noted that the respondent cannot be penalized for the Registry's errors and is entitled to pursue their application. The case, C.O. (COMM.IPD-TM) 497/2022, was heard in the High Court of Delhi, with judgment reserved on February 27, 2023, and delivered on March 23, 2023. The petitioner, L'Oréal India Pvt. Ltd., was represented by Mr. S.K. Bansal and Mr. Ajay Amitabh Suman. (Source: PDF \"3. LOREAL INDIA PVT. LTD vs Kumar.pdf\", 2023:DHC:2089)",
          "content": "2023:DHC:2089 \n \nC.O. (COMM.IPD-TM) 497/2022 \n                                          \n \n      Page 7 of 10 \n \nfollowing the established procedure? Plainly, in the facts of the \npresent case, it is apparent that the Trademark Registry has not \nadhered to the timelines as required. Surely, respondent no.3 \ncannot be penalised for the same and would be entitled to purse its \napplication for renewal of its trademark. The same was filed well \nwithin the period of six months and even though the same was not \naccompanied by a fee of surcharge, nonetheless, respondent no.3 \nhad the right to know the fate of its application. Since no \ndeficiency was pointed out at the material time, respondent no.3 \ncannot be deprived of its valuable rights to cure the defects within \nthe prescribed period. The Registrar also did not advertise the \nremoval of the trademark as required under section 25(4) of the \nAct read with Rule 66 of the 2002 Rules. Such advertisement \nwould have provided another opportunity for the petitioner to seek \nrestoration of the trademark.” \n9. \nThe dicta of the aforesaid judgment is squarely applicable to the \npresent case. The respondent no.1 cannot be deprived of his valuable rights \nof registration on account of the error of the Registry. \n10. \nCounsel for the petitioner has relied upon the orders passed by the \nIPAB in Prajapati Constructions (supra) and Vans Inc. USA (supra) in \nsupport of his submission that the Registrar of Trade Marks has to follow \nthe statutory procedure prescribed under the Trade Marks Act, 1999 in \nrespect of examination of a trade mark application. At the outset, it may be \nnoted that both are interim orders passed by the IPAB and therefore, no \nreliance can be placed on the same in the present case, which is at the stage \nof final hearing. After noticing the various procedural lapses committed by \nthe Trademark Registry, the IPAB only ordered that the respondent therein \nshall not rely upon the impugned registration in any proceedings during the \npendency of the rectification proceedings.  There was no order for removal \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.03.2023 17:39:04\nSignature Not Verified",
          "pdf_source": "3. LOREAL INDIA PVT. LTD vs Kumar.pdf",
          "nodes": []
        },
        {
          "title": "Page 8",
          "node_id": "0010",
          "start_index": 8,
          "end_index": 8,
          "summary": "According to page 8 of the PDF \"LOREAL INDIA PVT. LTD vs Kumar.pdf\", the court considered the case of LOREAL INDIA PVT. LTD vs RAJESH KUMAR TANEJA TRADING AS INNOVATIVE DERMA CARE. The petitioner relied on an IPAB order in Jahangir Biri Factory Pvt. Ltd. v. Mohd. Dildar Hossain, but the court found it not applicable. The petitioner's counsel requested the matter be remanded back to the Registry, but the court declined, citing the respondent's registration date of 2012. The court then considered whether the respondent's \"CLARIWASH\" mark registration was erroneous, given the petitioner's predecessor's \"CLARI-FI\" mark registration in 2013. The petitioner acquired rights to \"CLARI-FI\" in 2013. The court judgment was delivered on March 23, 2023 (Source: 2023:DHC:2089, C.O. (COMM.IPD-TM) 497/2022).",
          "content": "2023:DHC:2089 \n \nC.O. (COMM.IPD-TM) 497/2022 \n                                          \n \n      Page 8 of 10 \n \nof the registration granted in favour of the respondent on account of lapses \ncommitted by the Registry.  \n11. \nReliance has also been placed on the order passed by the IPAB in \nJahangir Biri Factory Pvt. Ltd. v. Mohd. Dildar Hossain (Proporietor) & \nAnr., 2018 (76) PTC 479 [IPAB]. In the aforesaid order, the marks of the \npetitioner and the respondent were identical, namely, “HOWRAH BIDI”. \nThe respondent therein had merely added a number to the mark “HOWRAH \nBIDI”, which is not the position in the present case. Therefore, the said \njudgment does not further the case of the petitioner. \n12. \nCounsel for the petitioner also submitted that the matter be remanded \nback to the Registry for reconsideration of the trademark application of the \nrespondent no.1 from the stage of issuance of examination report. I am not \ninclined to remand back the matter as this would amount to cancellation of \nthe registration already granted in favour of the respondent no.1 as far back \nas in 2012. Therefore, I proceed to consider the matter on merits, i.e., \nwhether the registration in favour of the respondent no.1 was granted \nerroneously. \n13. \nAt the time when the respondent no.1 filed its application for \nregistration of the mark “CLARIWASH” in 2010, there was one mark of the \npredecessor of the petitioner, “CLARI-FI”, that was registered in Class 03. \nAll other marks of the petitioner with the term “Clari” have been registered \nsubsequent to the registration of the respondent no.1. The petitioner acquired \nrights in the mark “CLARI-FI” in 2013, pursuant to the Asset Transfer \nAgreement dated 19th September, 2013. It is submitted on behalf of the \npetitioner that since the mark of the respondent no.1, “CLARIWASH” was \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.03.2023 17:39:04\nSignature Not Verified",
          "pdf_source": "3. LOREAL INDIA PVT. LTD vs Kumar.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0014",
      "start_index": 9,
      "end_index": 10,
      "summary": "According to the PDF document \"LOREAL INDIA PVT. LTD vs Kumar.pdf\", the High Court of Delhi at New Delhi delivered a judgment on March 23, 2023, in the case of LOREAL INDIA PVT. LTD vs RAJESH KUMAR TANEJA TRADING AS INNOVATIVE DERMA CARE. The court dismissed the petition filed by LOREAL INDIA PVT. LTD, seeking cancellation of the trademark \"CLARIWASH\" registered in favor of the respondent.\n\nThe petitioner argued that the mark \"CLARIWASH\" was similar to their earlier registered trademark \"CLARI-FI\" and could cause confusion among the public. However, the court held that there was no similarity between the two marks, and the petitioner could not seek cancellation of the trademark \"CLARIWASH\" based on their earlier registration.\n\nThe court also noted that the petitioner had taken over approximately 170 marks from Cheryl's Consmeceuticals, but only 12 of these marks used the term \"Clari\" as part of the mark. The court found that the petitioner could not claim a \"family of marks\" with the term \"Clari\" as part of the marks.\n\nThe respondent's first use of the mark \"CLARIWASH\" was shown to be November 16, 2009, while the petitioner's first use of the mark was after this date. The court held that the petitioner had not provided sufficient evidence to show prior adoption or use of the mark \"CLARIWASH\". The petition was dismissed with no order as to costs. (Source: LOREAL INDIA PVT. LTD vs Kumar.pdf, 2023:DHC:2089, C.O. (COMM.IPD-TM) 497/2022)",
      "pdf_source": "3. LOREAL INDIA PVT. LTD vs Kumar.pdf",
      "nodes": [
        {
          "title": "Page 9",
          "node_id": "0012",
          "start_index": 9,
          "end_index": 9,
          "summary": "According to page 9 of the PDF \"LOREAL INDIA PVT. LTD vs Kumar.pdf\" (2023:DHC:2089, C.O. (COMM.IPD-TM) 497/2022), the court ruled that there is no similarity between the marks \"CLARI-FI\" and \"CLARIWASH\" to cause confusion. The petitioner, LOREAL INDIA PVT. LTD, cannot seek cancellation of the trademark \"CLARIWASH\" registered in favor of the respondent. The court noted that only 12 out of 170 marks taken over by the petitioner use \"Clari\" as part of the mark, which is not enough to establish a \"family of marks.\" The judgment was delivered on March 23, 2023. The petitioner was represented by Mr. S.K. Bansal and Mr. Ajay Amitabh Suman, Advocates. (Source: LOREAL INDIA PVT. LTD vs Kumar.pdf)",
          "content": "2023:DHC:2089 \n \nC.O. (COMM.IPD-TM) 497/2022 \n                                          \n \n      Page 9 of 10 \n \nsimilar to the earlier registered trademark “CLARI-FI”, in respect of similar \ngoods, the respondent no.1 should not have been granted registration in \nterms of Section 11 of the Trade Marks Act, 1999. In my considered view, \nthere is no similarity in the marks “CLARI-FI” and “CLARIWASH” so as \nto cause a likelihood of confusion in the public or likelihood of association \nof “CLARIWASH” with “CLARI-FI”. It is a settled position of law that \nwhile comparing the marks, the marks have to be seen as a whole and \ncannot be broken into their individual components. Reference in this regard \nmay be made to the judgment of the Supreme Court in Corn Products \nRefining Co. v. Shangrila Food Products Ltd., AIR 1960 SC 142. \nTherefore, “CLARIWASH” cannot be read as “CLARI” plus “WASH” and \nsimilarly, “CLARI-FI” cannot be read as “CLARI” plus “FI”. Taken as a \nwhole, there is no similarity in the competing marks so as to cause \nconfusion.  Therefore, on the basis of registration of the mark “CLARI-FI”, \nthe petitioner cannot seek cancellation of the trademark “CLARIWASH” \nregistered in favour of the respondent no.1 in Class 03.  \n14. \nUnder the Asset Transfer Agreement dated 19th September, 2013, the \npetitioner took over approximately 170 marks, both registered and pending \nregistration, from Cheryl‟s Consmeceuticals. Only 12 out of the 170 marks \nuse “Clari” as a part of the mark. Therefore, the petitioner cannot say that \nthere was a family of marks with the term “Clari” as part of the marks that \nwere registered in favour of the petitioner. \n15. \nCounsel for the petitioner has contended that even though the user \nshown in the application filed by the respondent no.1 is 16th November, \n2009, the first invoice placed on record is of 12th May, 2010. In my view, \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.03.2023 17:39:04\nSignature Not Verified",
          "pdf_source": "3. LOREAL INDIA PVT. LTD vs Kumar.pdf",
          "nodes": []
        },
        {
          "title": "Page 10",
          "node_id": "0013",
          "start_index": 10,
          "end_index": 10,
          "summary": "According to page 10 of the PDF \"3. LOREAL INDIA PVT. LTD vs Kumar.pdf\", the court ruled in favor of the respondent, Rajesh Kumar Taneja, in the case C.O. (COMM.IPD-TM) 497/2022. The petitioner, L'Oreal India Pvt. Ltd., failed to prove prior use of the trademark \"CLARIWASH\". The court noted that the first invoice for \"CLARIWASH\" was dated December 5, 2013, and sales figures were only provided from 2014. The petitioner had not filed an application for registration of the mark \"CLARIWASH\" until the date of the judgment. The court dismissed the petition with no order as to costs, citing no grounds for rectification. The judgment was delivered on March 23, 2023, by Judge Amit Bansal. (Source: 3. LOREAL INDIA PVT. LTD vs Kumar.pdf, page 10)",
          "content": "2023:DHC:2089 \n \nC.O. (COMM.IPD-TM) 497/2022 \n                                          \n \n      Page 10 of 10 \n \nthis would not make any difference as registration can be granted on a \n„proposed to be used‟ basis. Even if the first user of the respondent no.1 is \ntaken to be 12th May, 2010, the user of the petitioner or its predecessor of \nthe trademark “CLARIWASH” is after the said date. Nothing has been \nplaced on record on behalf of the petitioner to show that the mark \n“CLARIWASH” was adopted in 2010 either by the petitioner or its \npredecessor. It was only on 22nd August, 2013 that a license was issued by \nthe FDA, Maharashtra in favour of the predecessor of the petitioner, \nCheryl‟s Cosmeceuticals. Even the first invoice placed on record by the \npetitioner that corresponds to the use of “CLARIWASH” is dated 5th \nDecember, 2013 and the sales figures in the petition have been given only \nfrom the year 2014. It is also relevant to note that the petitioner has not filed \nany application for registration of the mark “CLARIWASH” till date.   \n16. \nIn light of the discussion above, no grounds for rectification are made \nout.   \n17. \nThe petition is dismissed with no order as to costs. \n \n \n                       AMIT BANSAL, J. \nMARCH 23, 2023 \nat \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:23.03.2023 17:39:04\nSignature Not Verified",
          "pdf_source": "3. LOREAL INDIA PVT. LTD vs Kumar.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-15T18:33:37.086777",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}