{
  "doc_name": "30. Laboratories Expanscience v. Seagull Phamaceuticals Ltd.",
  "pdf_source": "30. Laboratories Expanscience v. Seagull Phamaceuticals Ltd..pdf",
  "metadata": {
    "document_name": "30. Laboratories Expanscience v. Seagull Phamaceuticals Ltd.",
    "source_pdf": "30. Laboratories Expanscience v. Seagull Phamaceuticals Ltd..pdf",
    "judges": [
      "C.HARI SHANKAR O R D E R (O R A L) % 17.02.2023 C.O. (COMM.IPD-TM) 793/2022 1."
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "21088/2022"
    ],
    "dhc_numbers": [
      "2023/DHC/001175",
      "2023/DHC/001175",
      "2023/DHC/001175"
    ],
    "ia_numbers": [],
    "decision_date": "23 August, 1971",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      "Laboratoires Expanscience"
    ],
    "defendants": [
      "Seagull Pharmaceuticals Pvt Ltd"
    ],
    "appellants": [],
    "respondents": [
      "Seagull Pharmaceuticals Pvt Ltd"
    ],
    "plaintiff_advocates": [
      "Mr. Rahul Beruar"
    ],
    "defendant_advocates": [
      "Mr. Manish Singhal"
    ],
    "appellant_advocates": [],
    "respondent_advocates": [
      "Mr. Manish Singhal"
    ],
    "damages_claimed": null,
    "damages_awarded": null,
    "key_issues": [
      "Registration of a trademark under the Trade Marks Act, 1999, and its potential infringement by a similar mark in a different class.",
      "Validity of a trademark registration and its potential cancellation due to non-use or other grounds under Section 57 of the Trade Marks Act, 1999.",
      "Rectification of the register of trademarks to remove an allegedly infringing mark, as sought by the plaintiff in this case.",
      "Opposition to a trademark registration and the process for withdrawing such opposition, as seen in Opposition No. 917190.",
      "Deletion of a trademark from the Register of Trademarks and the binding effect of a court order in this regard.",
      "Classes of goods and services under the Trade Marks Act, 1999, and the potential for confusion between similar marks in different classes.",
      "Proprietary rights of a trademark owner and the remedies available to them in case of infringement or passing off.",
      "The role of the Registrar of Trade Marks in maintaining the register of trademarks and deciding on applications for registration, opposition, and rectification.",
      "The binding effect of a court order on parties to a trademark dispute, including the obligation to withdraw opposition and not press certain claims.",
      "Procedure for disposing of a petition under Section 57 of the Trade Marks Act, 1999, and the court's power to allow or dismiss such a petition."
    ],
    "decision_summary": "**Case Summary: Laboratoires Expanscience vs. Seagull Pharmaceuticals Pvt Ltd & Anr.**\n\n**Background:**\nThe case involves a petition under Section 57 of the Trade Marks Act, 1999, filed by Laboratoires Expanscience (the plaintiff) against Seagull Pharmaceuticals Pvt Ltd & Anr. (the defendants) in the High Court of Delhi at New Delhi. The plaintiff is the proprietor of the registered word mark \"MUSTELA\" in Class 3, which covers non-medicated lotion and cream for skin care, and has been registered since August 23, 1971, with a validity period up to August 23, 2026.\n\n**Legal Issues:**\nThe plaintiff is aggrieved by the registration of the word mark \"MUSTELA\" in favor of the defendant in Class 5, which covers medicinal and pharmaceutical preparations, with effect from October 1, 2007. The plaintiff seeks rectification of the register of trademarks by removing the defendant's registration (No. 1607095) and deletion of the mark from the Registrar of Trade Marks.\n\n**Arguments:**\nThe defendant's counsel, Mr. Manish Singhal, submitted that his client is willing to give up the word mark \"MUSTELA\" and agrees to its deletion from the Registrar of Trade Marks. Additionally, the defendant had instituted Opposition No. 917190 on January 18, 2018, before the Registrar of Trade Marks, opposing the plaintiff's registered word mark \"MUSTELA\". The defendant's counsel assured that his client would apply for withdrawal of the opposition and would not press it further.\n\n**Court Findings:**\nThe court recorded the submissions of the defendant's counsel and directed the respondent to move an application before the Registrar for withdrawal of Opposition No. 917190 within three weeks. The Registrar was directed to take a decision on the application within one week.\n\n**Decision:**\nThe court allowed the petition in the aforementioned terms, directing that the impugned word mark \"MUSTELA\", as registered in favor of the defendant in Class 5 (vide Registration No. 1607095), shall stand deleted and removed from the Register of Trademarks. The Register of Trademarks shall be rectified accordingly. The petition was disposed of, and the order was directed to be uploaded on the court's website within 24 hours.\n\n**Key Takeaways:**\n\n1. The plaintiff's registered word mark \"MUSTELA\" in Class 3 remains valid.\n2. The defendant's registration of the word mark \"MUSTELA\" in Class 5 is deleted.\n3. The defendant withdraws its opposition to the plaintiff's registered word mark \"MUSTELA\".\n4. The Register of Trademarks is rectified to reflect the deletion of the defendant's registration.\n\nThe case highlights the importance of trademark protection and the court's role in resolving disputes related to trademark registration and opposition.",
    "legal_precedents": [],
    "full_text": "\n--- PAGE 1 ---\nNeutral Citation Number : 2023/DHC/001175 \n C.O. (COMM.IPD-TM) 793/2022                                                                            Page 1 of 3  \n \n   \n$~5(Original) \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.O. (COMM.IPD-TM) 793/2022 & I.A. 21088/2022 \n \nLABORATOIRES EXPANSCIENCE \n \n ..... Plaintiff \n \n \n \n \nThrough: \nMr. Rahul Beruar, Adv. \n \n \n \n \n \nversus \n \n \nSEAGULL PHARMACEUTICALS PVT LTD & ANR. \n..... Defendants \nThrough: \nMr. Manish Singhal,  Adv. for R-1 \n \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C.HARI SHANKAR \n \n \n \n \nO R D E R (O R A L) \n% \n \n \n \n \n17.02.2023 \n \n \nC.O. (COMM.IPD-TM) 793/2022 \n \n1. \nThis is a petition under Section 57 of the Trade Marks Act, 1999.  \n \n2. \nThe plaintiff is the proprietor of the registered word mark \n“MUSTELA” in Class 3, in respect of “non-medicated lotion and cream \nfor the care of the skin”. The said word mark “MUSTELA” stands \nregistered in favour of the plaintiff with effect from 23rd August 1971 and \nis valid up to 23rd August 2026. \n \n3. \nThe plaintiff is aggrieved by the registration of the word mark \n“MUSTELA” in favour of the defendant in Class 5, for medicinal and \npharmaceutical preparations. Registration of the impugned mark was \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:20.02.2023\n12:59:57\nSignature Not Verified\n\n--- PAGE 2 ---\nNeutral Citation Number : 2023/DHC/001175 \n C.O. (COMM.IPD-TM) 793/2022                                                                            Page 2 of 3  \n \n   \ngranted to the defendant on 31st March 2009 with effect from 1st October \n2007. \n \n4. \nThe petition, therefore, seeks rectification of the register of the \ntrademarks by removal, therefrom, of the Registration No. 1607095 \nwhereby the word mark “MUSTELA” has been registered in favour of \nthe defendant. \n \n5. \nMr. Manish Singhal, learned Counsel for the respondent submits, \non instructions, that his client is willing to give up the word mark \n“MUSTELA” and is agreeable to deletion of the mark from Registrar of \nTrade Marks and rectification of the Register, accordingly. \n \n6. \nMr. Rahul, learned Counsel for the petitioner submits that the \nrespondent has also instituted Opposition No. 917190 on 18th January \n2018 before the Registrar of Trade Marks, opposing the plaintiff’s \nregistered word mark “MUSTELA”. Mr. Manish Singhal, learned \nCounsel for the respondent submits, on instructions, that his client would \nbe applying for withdrawal of the said Opposition No. 917190 and would \nnot be pressing the opposition. The submission is recorded.  \n \n7. \nThe respondent is directed to move an application before the \nlearned Registrar for withdrawal of Opposition No. 917190 positively \nwithin a period of three weeks from today.  The learned Registrar is \ndirected to take a decision on the application within one week thereof. \n \n8. \nIn view thereof, nothing survives for adjudication in the present \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:20.02.2023\n12:59:57\nSignature Not Verified\n\n--- PAGE 3 ---\nNeutral Citation Number : 2023/DHC/001175 \n C.O. (COMM.IPD-TM) 793/2022                                                                            Page 3 of 3  \n \n   \npetition. It stands disposed of by recording the submissions of Mr. \nManish Singhal by which the defendant shall remain bound. \n \n9. \nAccordingly, the impugned word mark “MUSTELA”, as \nregistered in favour of the defendant in Class 5 vide Registration No. \n1607095 shall stand deleted and removed from the Register of \nTrademarks. The Register of Trademarks shall stand rectified \naccordingly. \n \n10. \nThe petition is allowed in the aforesaid terms. \n \n11. \nOrder to be uploaded on the website of this Court within 24 hours. \n \n \nC.HARI SHANKAR, J \n \nFEBRUARY 17, 2023 \n \nar \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:20.02.2023\n12:59:57\nSignature Not Verified\n"
  },
  "total_pages": 3,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0002",
      "start_index": 1,
      "end_index": 1,
      "summary": "According to the PDF document \"Laboratories Expanscience v. Seagull Pharmaceuticals Ltd.,\" a legal case is ongoing in the High Court of Delhi at New Delhi. The case involves a petition under Section 57 of the Trade Marks Act, 1999, filed by Laboratories Expanscience (the plaintiff) against Seagull Pharmaceuticals Pvt Ltd & Anr. (the defendants).\n\nThe plaintiff is the proprietor of the registered word mark \"MUSTELA\" in Class 3, which covers non-medicated lotion and cream for skin care, with a registration date of August 23, 1971, and validity up to August 23, 2026. The plaintiff is challenging the registration of the same word mark \"MUSTELA\" in favor of the defendant in Class 5, which covers medicinal and pharmaceutical preparations.\n\nThe case is being heard by Hon'ble Mr. Justice C. Hari Shankar, with the plaintiff represented by Mr. Rahul Beruar, Adv., and the defendant represented by Mr. Manish Singhal, Adv. The court order was issued on February 17, 2023. The document also mentions an application (I.A. 21088/2022) related to the case.\n\nThe key facts and dates in the case are:\n\n* Case number: C.O. (COMM.IPD-TM) 793/2022\n* Neutral Citation Number: 2023/DHC/001175\n* Registration date of the plaintiff's mark: August 23, 1971\n* Validity of the plaintiff's mark: up to August 23, 2026\n* Court order date: February 17, 2023\n\nSource: Laboratories Expanscience v. Seagull Pharmaceuticals Ltd. PDF document.",
      "pdf_source": "30. Laboratories Expanscience v. Seagull Phamaceuticals Ltd..pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "According to page 1 of the PDF \"30. Laboratories Expanscience v. Seagull Phamaceuticals Ltd.\", the case is being heard in the High Court of Delhi at New Delhi. The plaintiff, Laboratoires Expanscience, is the proprietor of the registered word mark \"MUSTELA\" in Class 3, for non-medicated lotion and cream for skin care, registered since August 23, 1971, and valid until August 23, 2026. The plaintiff is challenging the registration of the same mark \"MUSTELA\" in favor of the defendant, Seagull Pharmaceuticals Pvt Ltd, in Class 5, for medicinal and pharmaceutical preparations. The case is being heard by Hon'ble Mr. Justice C. Hari Shankar, with the plaintiff represented by Mr. Rahul Beruar, Adv., and the defendant represented by Mr. Manish Singhal, Adv. The petition is under Section 57 of the Trade Marks Act, 1999, with the case number C.O. (COMM.IPD-TM) 793/2022 & I.A. 21088/2022. The order was given on February 17, 2023. (Source: 30. Laboratories Expanscience v. Seagull Phamaceuticals Ltd..pdf)",
          "content": "Neutral Citation Number : 2023/DHC/001175 \n C.O. (COMM.IPD-TM) 793/2022                                                                            Page 1 of 3  \n \n   \n$~5(Original) \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.O. (COMM.IPD-TM) 793/2022 & I.A. 21088/2022 \n \nLABORATOIRES EXPANSCIENCE \n \n ..... Plaintiff \n \n \n \n \nThrough: \nMr. Rahul Beruar, Adv. \n \n \n \n \n \nversus \n \n \nSEAGULL PHARMACEUTICALS PVT LTD & ANR. \n..... Defendants \nThrough: \nMr. Manish Singhal,  Adv. for R-1 \n \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C.HARI SHANKAR \n \n \n \n \nO R D E R (O R A L) \n% \n \n \n \n \n17.02.2023 \n \n \nC.O. (COMM.IPD-TM) 793/2022 \n \n1. \nThis is a petition under Section 57 of the Trade Marks Act, 1999.  \n \n2. \nThe plaintiff is the proprietor of the registered word mark \n“MUSTELA” in Class 3, in respect of “non-medicated lotion and cream \nfor the care of the skin”. The said word mark “MUSTELA” stands \nregistered in favour of the plaintiff with effect from 23rd August 1971 and \nis valid up to 23rd August 2026. \n \n3. \nThe plaintiff is aggrieved by the registration of the word mark \n“MUSTELA” in favour of the defendant in Class 5, for medicinal and \npharmaceutical preparations. Registration of the impugned mark was \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:20.02.2023\n12:59:57\nSignature Not Verified",
          "pdf_source": "30. Laboratories Expanscience v. Seagull Phamaceuticals Ltd..pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Facts and Arguments",
      "node_id": "0004",
      "start_index": 2,
      "end_index": 2,
      "summary": "According to the PDF document \"Laboratories Expanscience v. Seagull Pharmaceuticals Ltd.,\" a legal proceeding was initiated in the High Court of Delhi at New Delhi (C.O. (COMM.IPD-TM) 793/2022 & I.A. 21088/2022). The plaintiff, Laboratoires Expanscience, was represented by Mr. Rahul Beruar, while the defendants, Seagull Pharmaceuticals Pvt Ltd & ANR, were represented by Mr. Manish Singhal.\n\nThe case involved a trademark dispute over the word mark \"MUSTELA,\" which was registered in favor of the defendant on March 31, 2009, with effect from October 1, 2007. The plaintiff sought rectification of the register of trademarks by removing the defendant's registration.\n\nDuring the proceedings, the defendant agreed to give up the word mark \"MUSTELA\" and to delete it from the Registrar of Trade Marks. The defendant also agreed to withdraw an opposition (No. 917190) filed on January 18, 2018, against the plaintiff's registered word mark \"MUSTELA.\"\n\nThe court directed the respondent to apply for withdrawal of the opposition within three weeks, and the Registrar was directed to make a decision within one week thereafter. As a result, the case was resolved, and nothing remained for adjudication. The decision was digitally signed by Sunil Singh Negi on February 20, 2023. (Source: Laboratories Expanscience v. Seagull Pharmaceuticals Ltd..pdf, Page 1-3)",
      "pdf_source": "30. Laboratories Expanscience v. Seagull Phamaceuticals Ltd..pdf",
      "nodes": [
        {
          "title": "Page 2",
          "node_id": "0003",
          "start_index": 2,
          "end_index": 2,
          "summary": "According to page 2 of the PDF \"30. Laboratories Expanscience v. Seagull Phamaceuticals Ltd.\", the defendant, Seagull Pharmaceuticals, was granted a trademark registration on March 31, 2009. The plaintiff, Laboratoires Expanscience, seeks to rectify the trademark register by removing the defendant's registration. The defendant's counsel, Mr. Manish Singhal, agrees to give up the trademark \"MUSTELA\" and delete it from the register. The plaintiff's counsel, Mr. Rahul Beruar, notes that the defendant has an ongoing opposition (No. 917190) against the plaintiff's registered word mark \"MUSTELA\", which the defendant agrees to withdraw within three weeks. The court directs the Registrar to decide on the withdrawal application within one week. (Source: 30. Laboratories Expanscience v. Seagull Phamaceuticals Ltd..pdf, Page 2)",
          "content": "Neutral Citation Number : 2023/DHC/001175 \n C.O. (COMM.IPD-TM) 793/2022                                                                            Page 2 of 3  \n \n   \ngranted to the defendant on 31st March 2009 with effect from 1st October \n2007. \n \n4. \nThe petition, therefore, seeks rectification of the register of the \ntrademarks by removal, therefrom, of the Registration No. 1607095 \nwhereby the word mark “MUSTELA” has been registered in favour of \nthe defendant. \n \n5. \nMr. Manish Singhal, learned Counsel for the respondent submits, \non instructions, that his client is willing to give up the word mark \n“MUSTELA” and is agreeable to deletion of the mark from Registrar of \nTrade Marks and rectification of the Register, accordingly. \n \n6. \nMr. Rahul, learned Counsel for the petitioner submits that the \nrespondent has also instituted Opposition No. 917190 on 18th January \n2018 before the Registrar of Trade Marks, opposing the plaintiff’s \nregistered word mark “MUSTELA”. Mr. Manish Singhal, learned \nCounsel for the respondent submits, on instructions, that his client would \nbe applying for withdrawal of the said Opposition No. 917190 and would \nnot be pressing the opposition. The submission is recorded.  \n \n7. \nThe respondent is directed to move an application before the \nlearned Registrar for withdrawal of Opposition No. 917190 positively \nwithin a period of three weeks from today.  The learned Registrar is \ndirected to take a decision on the application within one week thereof. \n \n8. \nIn view thereof, nothing survives for adjudication in the present \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:20.02.2023\n12:59:57\nSignature Not Verified",
          "pdf_source": "30. Laboratories Expanscience v. Seagull Phamaceuticals Ltd..pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Decision and Orders",
      "node_id": "0006",
      "start_index": 3,
      "end_index": 3,
      "summary": "According to the PDF document \"Laboratories Expanscience v. Seagull Pharmaceuticals Ltd.,\" a legal proceeding was held in the High Court of Delhi at New Delhi, with case number C.O. (COMM.IPD-TM) 793/2022. The plaintiff, Laboratoires Expanscience, was represented by Mr. Rahul Beruar, while the defendant, Seagull Pharmaceuticals Pvt Ltd, was represented by Mr. Manish Singhal.\n\nThe court decision, dated February 17, 2023, stated that the defendant's registered word mark \"MUSTELA\" in Class 5, with Registration No. 1607095, shall be deleted and removed from the Register of Trademarks. The Register of Trademarks will be rectified accordingly. The petition was allowed in these terms.\n\nThe document does not mention any specific arguments or facts presented during the proceedings. However, it notes that the defendant's submissions, as recorded by Mr. Manish Singhal, will be binding. The order was to be uploaded on the court's website within 24 hours. The decision was made by Judge C. Hari Shankar.\n\nThe PDF document, \"Laboratories Expanscience v. Seagull Pharmaceuticals Ltd.,\" provides the details of the court proceedings, including the parties involved, their representatives, and the outcome of the case. The Neutral Citation Number for this case is 2023/DHC/001175. The digitally signed document was signed by Sunil Singh Negi on February 20, 2023.",
      "pdf_source": "30. Laboratories Expanscience v. Seagull Phamaceuticals Ltd..pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0005",
          "start_index": 3,
          "end_index": 3,
          "summary": "According to page 3 of the PDF \"30. Laboratories Expanscience v. Seagull Phamaceuticals Ltd.\", the court ruled in favor of the plaintiff, Laboratories Expanscience. The defendant, Seagull Pharmaceuticals Pvt Ltd, had registered the word mark \"MUSTELA\" in Class 5 with Registration No. 1607095. The court ordered that this registration be deleted and removed from the Register of Trademarks. The petition was allowed, and the order was to be uploaded on the court's website within 24 hours. The judgment was given by C. Hari Shankar, J on February 17, 2023. The case details are: C.O. (COMM.IPD-TM) 793/2022 and I.A. 21088/2022, with Neutral Citation Number: 2023/DHC/001175. (Source: PDF \"30. Laboratories Expanscience v. Seagull Phamaceuticals Ltd.\")",
          "content": "Neutral Citation Number : 2023/DHC/001175 \n C.O. (COMM.IPD-TM) 793/2022                                                                            Page 3 of 3  \n \n   \npetition. It stands disposed of by recording the submissions of Mr. \nManish Singhal by which the defendant shall remain bound. \n \n9. \nAccordingly, the impugned word mark “MUSTELA”, as \nregistered in favour of the defendant in Class 5 vide Registration No. \n1607095 shall stand deleted and removed from the Register of \nTrademarks. The Register of Trademarks shall stand rectified \naccordingly. \n \n10. \nThe petition is allowed in the aforesaid terms. \n \n11. \nOrder to be uploaded on the website of this Court within 24 hours. \n \n \nC.HARI SHANKAR, J \n \nFEBRUARY 17, 2023 \n \nar \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:20.02.2023\n12:59:57\nSignature Not Verified",
          "pdf_source": "30. Laboratories Expanscience v. Seagull Phamaceuticals Ltd..pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-15T18:37:54.213923",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}