{
  "doc_name": "31. Lite Bite Travel Foods Pvt Ltd. v. The Registrar of Trade Marks",
  "pdf_source": "31. Lite Bite Travel Foods Pvt Ltd. v. The Registrar of Trade Marks.pdf",
  "metadata": {
    "document_name": "31. Lite Bite Travel Foods Pvt Ltd. v. The Registrar of Trade Marks",
    "source_pdf": "31. Lite Bite Travel Foods Pvt Ltd. v. The Registrar of Trade Marks.pdf",
    "judges": [
      "C.HARI SHANKAR O R D E R (ORAL) % 18.01.2023 1."
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "4/2021",
      "4/2021",
      "4/2021",
      "4/2021",
      "4/2021",
      "4/2021",
      "4/2021",
      "4/2021",
      "4/2021",
      "4/2021"
    ],
    "dhc_numbers": [
      "2023/DHC/000482",
      "2023/DHC/000482",
      "2023/DHC/000482",
      "2023/DHC/000482",
      "2023/DHC/000482",
      "2023/DHC/000482",
      "2023/DHC/000482",
      "2023/DHC/000482",
      "2023/DHC/000482"
    ],
    "ia_numbers": [],
    "decision_date": "7 January, 2021",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [],
    "defendants": [],
    "appellants": [
      "Lite Bite Travel Foods Private Limited"
    ],
    "respondents": [
      "The Registrar of Trade Marks"
    ],
    "plaintiff_advocates": [],
    "defendant_advocates": [],
    "appellant_advocates": [
      "Mr. Manish Dhir"
    ],
    "respondent_advocates": [
      "Mr. Srish Kumar Mishra",
      "Mr. Sagar Mehlawat",
      "Mr. Alexander Mathai Paikaday"
    ],
    "damages_claimed": null,
    "damages_awarded": null,
    "key_issues": [
      "The appellant's application for registration of the device mark was rejected by the Deputy Registrar of Trade Marks under Section 11(1) of the Trade Marks Act.",
      "The rejection was based on the ground that the applied mark is similar to existing trade marks, specifically TM Nos 2045465 and 3131397, and that the services provided are also similar.",
      "The appellant argued that the mark as a whole is different, but this argument was not found satisfactory by the Deputy Registrar.",
      "The Deputy Registrar sustained the objection under Section 11(1) and refused the application, citing the likelihood of confusion between the applied mark and the cited conflicting marks.",
      "The appellant's evidence of use of the mark subsequent to the date of application was not considered, as the mark was filed as \"proposed to be used\".",
      "The Trade Marks Act's provision on relative grounds of refusal under Section 11 was applied in this case, highlighting the importance of considering similar trade marks and services when evaluating an application for registration.",
      "The concept of \"likelihood of confusion\" is a key factor in determining whether a trade mark can be registered, and in this case, the Deputy Registrar found that there was a likelihood of confusion between the applied mark and existing marks.",
      "The appellant's failure to provide a satisfactory explanation for the adoption of the mark was also a factor in the rejection of the application.",
      "The registration of a trade mark on a \"proposed to be used\" basis is subject to certain conditions and requirements, and in this case, the appellant's application did not meet these requirements."
    ],
    "decision_summary": "**Case Summary: Lite Bite Travel Foods Private Limited vs. The Registrar of Trademarks**\n\n**Background:**\nThe case involves an appeal by Lite Bite Travel Foods Private Limited (the appellant) against the decision of the Deputy Registrar of Trade Marks (the respondent) to reject the appellant's application for registration of the device mark \"Oasis Lounge By Lite Bite Travel Foods\" under the Trade Marks Act.\n\n**Legal Issues:**\nThe main issue in this case is whether the appellant's device mark is registrable, given that there are existing trademarks (TM Nos. 2045465 and 3131397) that are similar to the appellant's mark and provide similar services. The respondent had rejected the appellant's application on the grounds of relative refusal under Section 11(1) of the Trade Marks Act, citing the likelihood of confusion between the applied mark and the existing marks.\n\n**Arguments:**\nThe appellant's counsel, Mr. Manish Dhir, argued that the mark as a whole is different and that the appellant has been using the mark. The respondent, however, contended that the leading/dominant feature of the applied mark is \"Oasis,\" which is similar to the existing marks, and that there is no explanation regarding the adoption of the mark. The respondent also noted that the evidence of use submitted by the appellant is subsequent to the date of application and cannot be considered.\n\n**Court Findings:**\nThe High Court of Delhi (Hon'ble Mr. Justice C. Hari Shankar) considered the submissions of both parties and perused the records. The court noted that the applied mark is not registrable due to the likelihood of confusion with the existing marks, as the leading feature of the applied mark is \"Oasis,\" which is similar to the existing marks. The court also observed that the services provided by the appellant are similar to those provided by the proprietors of the existing marks.\n\n**Decision:**\nThe court upheld the respondent's decision to reject the appellant's application for registration of the device mark. The court concluded that the applied mark is not registrable due to the likelihood of confusion with the existing marks and that the appellant's application was properly refused under Section 11(1) of the Trade Marks Act.\n\n**Key Points:**\n\n* The appellant's device mark \"Oasis Lounge By Lite Bite Travel Foods\" is not registrable due to the likelihood of confusion with existing marks (TM Nos. 2045465 and 3131397).\n* The leading feature of the applied mark is \"Oasis,\" which is similar to the existing marks.\n* The services provided by the appellant are similar to those provided by the proprietors of the existing marks.\n* The evidence of use submitted by the appellant is subsequent to the date of application and cannot be considered.\n* The court upheld the respondent's decision to reject the appellant's application under Section 11(1) of the Trade Marks Act.",
    "legal_precedents": [
      "Narasimha Rao State"
    ],
    "full_text": "\n--- PAGE 1 ---\nNeutral Citation Number : 2023/DHC/000482 \nC.A.(COMM.IPD-TM) 4/2021 \n \nPage 1 of 9 \n \n$~78 (Original) \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.A.(COMM.IPD-TM) 4/2021 \n \nLITE BITE TRAVEL FOODS PRIVATE LIMITED \n..... Appellant \n \n \n \n \nThrough: \nMr. Manish Dhir, Adv.  \n \n \n \n \n \nversus \n \n \nTHE REGISTRAR OF TRADEMARKS \n    ..... Respondent \nThrough: \nMr. Srish Kumar Mishra, Mr. \nSagar Mehlawat and Mr. Alexander Mathai \nPaikaday, Advs. \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C.HARI SHANKAR \n \n \n \n     O R D E R (ORAL) \n% \n \n \n \n18.01.2023 \n \n1. \nThe appellant is aggrieved by the order dated 7th January 2021, \npassed by the learned Deputy Registrar of Trade Marks (“the learned \nDeputy Registrar”) whereby the application of the appellant for \nregistration of the device mark \n  has been rejected.  \n \n2. \nThe impugned order reads thus: \n“IN THE MATTER OF Application No 3928838 \nfor registration of a trade mark Oasis Lounge By Lite Bite Travel \nFoods filed by LITE BITE TRAVEL FOODS PRIVATE \nLIMITED.. \n \nआदेश/O R D E R \n \nAbove application has been filed for registration of the \ntrademark Oasis Lounge By Lite Bite Travel Foods on 28/08/2018 \nwhich was examined on 29/09/2018 and examination report was \ncommunicated to the applicant at his address for service. A reply to \nthe office objection(s) had been filed on behalf of the applicant but \nthe same was not found satisfactory and the application was set \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.01.2023\n17:07:48\nSignature Not Verified\n\n--- PAGE 2 ---\nNeutral Citation Number : 2023/DHC/000482 \nC.A.(COMM.IPD-TM) 4/2021 \n \nPage 2 of 9 \n \ndown for hearing and eventually hearing took place before me on \n09/11/2020.  \n \nAdv. Manish Dhir Attorney appeared before me and made \nhis/her submissions. I have heard arguments and gone through the \nrecords. \n \nOffice objection u/sec. 11 (1) raised against the applied \nmark. \n \nLd. Counsel submits mark as a whole different. Applicant is \nusing the mark.  \n \nHeard the Ld. Counsel and perused the record. \n \nLeading/Dominant feature of the applied mark is OASIS \nfound common and similar to TM Nos. 2045465 and 3131397. \nServices also similar. No explanation regarding adoption. Mark \nfiled as proposed to be used. Evidence of use subsequent to date of \napplication. Can't be considered. Given, marks are remembered by \nbroad expression, to my mind there is likelihood of confusion \nbetween applied mark and the said cited conflicting marks. \nObjection sustained. Application refused. \n \nAfter perusal of all the documents on record and \nsubmission made by the applicant / authorised agent it is concluded \nthat applied mark is not registrable because of the reason stated as \nabove. Hence application no 3928838 cannot be accepted and \nrefused accordingly.  \n \nदद न ां क/Dated: 07 January 2021. \n(SACHIN SHARMA) \nवररष्ठ परीक्षक, व्य प र दिह्न/DEPUTY REGISTRAR \nOF TRADE MARKS \n(अदिदनयम के 3 (2) के तहत प्र दिकृत)/(/Authorized \nunder 3(2) of the Act)” \n \n3. \nThe applicant applied for registration of the  \n \ndevice mark on 28th August 2018. The applicant sought registration of \nthe said mark in respect of services provided in restaurants, self-\nservice restaurants, services for providing food and drink, bar services, \nsnakc-bars and cafes.  Registration was sought on a  “proposed to be \nused” basis, as a Service Provider.  \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.01.2023\n17:07:48\nSignature Not Verified\n\n--- PAGE 3 ---\nNeutral Citation Number : 2023/DHC/000482 \nC.A.(COMM.IPD-TM) 4/2021 \n \nPage 3 of 9 \n \n4. \nConsequent on examination, the Examiner in the office of the \nRegsitrar of Trade Marks, vide his First Examination Report (FER), \ndated 29th September 2018, opined that the application of the appellant \nwas “open to objection on relative grounds of refusal under Section 11 \nof the Trade Marks Act”, as “same/similar trade mark(s) is/are already \non record of the register for the same or similar goods/services”.   \n \n5. \nThe report purported to enclose details of the earlier existing \ntrademarks, on the basis of which the Examiner had opined that the \napplication of the appellant merited rejection.  \n \n6. \nThe details of the earlier registered marks, constituting the basis \nof the objections raised by the Examiner, as enclosed with the FER, \nmay be reproduced thus: \n \nGOVERNMENT OF INDIA \nTRADE MARKS REGISTRY \n \nLOCATION: \nSECTION: EXM \nREPORT: EXM007 \nWORD MARK SEARCH REPORT \nAPPLICATION NUMBER: 3928838 \nClass: --- \nTRADEMARK: 'Oasis Lounge By Lite Bite Travel Foods \nUSER: STK \nPAGE:1 \n \nDATE: 17/09/2018 \n \nAPPL \nNO \nCLASS \nCONFLICTING \nMARK \nJOURNAL \nNo \nPROPRIETOR \nNAME \nPROPRIETOR \nADDRESS \nSTATUS \nTM \nIMAGE \n2045465 \n43 \nOASIS \n1660 \nCAPSULATION \nSERVICES \nPVT. LTD. \nCAPSULATION \nPREMISES, \nDEONAR, \nSION-\nTROMBAY \nROAD, \nOPP. TATA \nSOCIAL \nINSTITUTE, \nMUMBAI- \n400088 \nRegistered \n \n \n \n \n \nAPPLICATION DATE 27/10/2010 \nGOODS/SERVICE CATERING SERVICES, PROVIDING OF FOODS AND DRINKS AND \nRESTAURANT SERVICES \n \n \n \n \n \n \n \n \n3131397 \n43 \nOASIS \n \nGOYAL \nFASHIONS \nPVT. \nLTD.. \nGOYAL \nHOUSE 24, \nAJMER ROAD, \nJAIPUR, \nRAJASTHAN, \nINDIA \nObjected  \n \n \n \n \nAPPLICATION DATE 19/12/2015 \n15:40:31 \n \nGOODS/SERVICE SERVICES FOR PROVIDING FOOD AND DRINK; \nRESTAURANTS, \nBAR, \nLOUNGE, \nTEMPORARY \nACCOMMODATION, BANQUET, HOSPITALITY, HOTEL AND \nRESORT SERVICES. \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.01.2023\n17:07:48\nSignature Not Verified\n\n--- PAGE 4 ---\nNeutral Citation Number : 2023/DHC/000482 \nC.A.(COMM.IPD-TM) 4/2021 \n \nPage 4 of 9 \n \n3600149 \n43 \n \n \nNIKESH \nKISHOR GALA \n3/468 A, Kalyan \nBhuvan, \nMaheshwari \nUdhyaan, \nMatunga \nEast, \nMumbai - \n400019. \nMaharashtra. \nObjected \nAPPLICATION DATE 27/07/2017 \n11:34:06 \n \nGOODS/SERVICE Hotel; Motel; Restaurants; Self-Service Restaurant; Quick Service \nRestaurant; Bar Services; Cafe; Cafeteria; Canteen; Snack Bar; Food Court; Lounge; Take \nAway; Dine In; Food cart; Food Truck; Services for Providing Food, Drink, Beverage and \nTemporary Accommodation; Food, Drink and Beverage Catering; Rental of Furniture, Linens, \nUtensils, Table, Cooking apparatus, Lighting apparatus and other apparatus. \n \n7. \nThe appellant submitted a reply, dated 11th February 2020, to \nthe FER of the Examiner, in which it was contended, inter alia, thus: \n \n(i) \nThe appellant had been continuously using the \n mark for its services and was well known in the \nindustry.  A user affidavit of Mr. Sukhpreet Singh, an authorised \nrepresentative of the appellant, was also filed with the said reply, \nto vouchsage this contention. The affidavit annexed documents \nshowing use of the \n trade mark, under which \nmark, the appellant was running an outlet at the Mumbai \nInternational \nAirport. \nPlacards, \nsignboards \nand \nother \nrepresentations available at the airport, as well as the illuminated \nsignage outside the appellant’s premises at the airport, were also \nannexed.  \n \n(ii) \nAs such, the general public was well aware of the \nappelalnt’s \noutlet \nand \ninvaribly \nassociated \nthe \nmark with the serivces provided by the appellant. \n \n(iii) \nThe \n mark relatable to Application No. 3131397 \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.01.2023\n17:07:48\nSignature Not Verified\n\n--- PAGE 5 ---\nNeutral Citation Number : 2023/DHC/000482 \nC.A.(COMM.IPD-TM) 4/2021 \n \nPage 5 of 9 \n \nof M/s Goel Fashions Pvt. Ltd. was not registered, as it was \nunder objections.  This, therefore, could not constitute an “earlier \ntrade mark”  for the purposes of Section 11 (1)(d) of the Trade \nMarks Act.  \n(iv) \nInsofar as the \n mark of M/s Capsulation Services \nPvt. Ltd. (“Capsulation Services”) was concerned, the appellant \nclaimed to be a bona fide adopter and user of the \n \ntrade mark, who, by virtue of the extensive usage of the said \nmark, had earned its own reputation and goodwill and made a \nplace for itself in the hospitality market.  \n \n(v) \nThe services provided by the appellant, under the \nmark were different from the services provided \nby capsulation services under the \n mark. \n \n(vi) \nThere was, therefore, no likelihood of confusion, if any, \nbetween \n mark of the appellant and the \n \nmark of Capsulation Services, resulting in any confusion in the \nmind of the public, with respect to the entity with which the mark \nwas associated or the services provided thereunder. \n \n(vii) \nThe marks, seen as a whole, were clearly distinguishable. \nThe appellant’s mark was \n whereas the mark of  \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.01.2023\n17:07:48\nSignature Not Verified\n\n--- PAGE 6 ---\nNeutral Citation Number : 2023/DHC/000482 \nC.A.(COMM.IPD-TM) 4/2021 \n \nPage 6 of 9 \n \nCapsulation Services,  was \n. Besides, the marks were \nvisually completely distintinct and constituted disntinct artistic \nrepresentations.  \n \n(viii) \nThe appellant had never been communicated any \nobjection or any other communication by anyone who claimed to \nhave been confused as result of the adoption, by the appellant, of \nthe  \n mark, for the registration of which the \napplication had been filed.  \n \n \n8. \nI have heard Mr. Manish Dhir, learned Counsel for the appellant \nand Mr. Srish Kumar Mishra, learned Counsel for the respondent at \nsome length. \n \n9. \nPlainly, the impugned order does not consider the various \ngrounds urged by the appellant in its reply dated 11th February 2020 to \nthe FER dated 29th September 2018. There is, equally, no reflection of \nany consideration of the affidavit of Mr. Sukhpreet Singh or the \nmaterial that was filed therewith.  \n \n10. \nIn fact, the learned Deputy Registrar has, it appears, proceeded \non a complete misreading of Section 11(1)(b) of the Trade Marks Act.  \nThe impugned order reflects the view that mere similarity of the \nmarks, of which registration is sought, is, by itself, sufficient as a \nground to reject the application seeking registration. That, however, is \nnot the position as it obtains in law. Even statutorily, Section 11(1)((b) \nis subject to two other provisions/caveats.  \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.01.2023\n17:07:48\nSignature Not Verified\n\n--- PAGE 7 ---\nNeutral Citation Number : 2023/DHC/000482 \nC.A.(COMM.IPD-TM) 4/2021 \n \nPage 7 of 9 \n \n11. \nSection 11(1) starts with the words “save as provided in Section \n12”. Section 12, therefore, operates as an exception to Section 11(1).  \nSection 12 deals with entitlement to registration where, despite \nsimilarity of the marks, the applicant pleads honest and concurrent \nuser. In the present case, the appellant has specifically pleaded honest \nand concurrent user. There is no reflection of any application of mind \nby the learned Registrar of Trademarks to the said contention. \n \n12. \nAdditionally, similarity of the mark, of which registration is \nsought, coupled with identity or similarity of the goods or services \ncovered by the said mark can constitute a basis for rejection of an \napplication seeking registration of the mark, under Section 11(1)(b) \nonly where, because of such similarity between the marks and identity \nand similarity of goods or services covered by the marks, there exists \na likelihood of confusion on the part of the public or of the public \nassociating the mark, of which registration is sought, with the earlier \ntrade mark. \n \n13. \nThe existence, or otherwise, of likelihood of confusion is an \nissue of fact. Until and unless, on facts, it is established that, owing to \nidentity/similarity of the mark of which registration is sought, and of \nthe goods/services covered thereby, with an earlier mark, there is \nlikelihood of confusion/association in the mind of the public, \nregistration cannot be refused on that ground.  \n \n14. \nIn the event that Section 11(1)(b) is stated as a ground for \nrejection of an application seeking registration of a mark, therefore, \nthe impugned order must additionally contain a finding that, owing to \nsimilarity of the mark of which registration is sought with an earlier \ntrade mark and identity/similarity of the goods and services covered \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.01.2023\n17:07:48\nSignature Not Verified\n\n--- PAGE 8 ---\nNeutral Citation Number : 2023/DHC/000482 \nC.A.(COMM.IPD-TM) 4/2021 \n \nPage 8 of 9 \n \nby \nthe \nsaid \nmark, \nthere \nis \na \npositive \nlikelihood \nof \nconfusion/association, on the part of the public, as envisaged by the \nprovision.  Such a finding can be returned only after examining the \nfacts and the material on record.  It cannot merely be chanted as a \nmantra. \n \n15. \nThe appellant has raised several contentions in its reply dated \n11th February 2020 to the FER dated 29th September 2018. \nAdditionally, an affidavit of Mr. Sukhpreet Singh, along with material \nsubstantiating the contentions raised in the reply, was also filed, and \nthe impugned order does not reflect any examination or consideration \nof the submissions contained in the reply dated 11th February 2020, \nthe affidavit of Mr. Sukhpreet Singh or the documents filed with the \naffidavit, I deem it appropriate that the matter be remanded to the \nlearned Registrar of Trademarks for re-consideration.  \n \nConclusion \n \n16. \nResultantly, the impugned order dated 7th January 2021 is \nquashed and set aside. The Application no. 3928838 dated 28th August \n2018 filed by the appellant for registration of the \nmark \nis remanded for re-consideration, from the stage of submission, by the \nappellant, of its reply dated 11th February 2020 to the FER dated 29th \nSeptember 2018 of the Examiner. \n \n17. \nThe appellant would be entitled to an opportunity of personal \nhearing before a decision is taken. In order to expedite matters, the \nappellant is directed to present itself before the concerned officer on \n30th January 2023.  The officer concerned is directed to consider the \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.01.2023\n17:07:48\nSignature Not Verified\n\n--- PAGE 9 ---\nNeutral Citation Number : 2023/DHC/000482 \nC.A.(COMM.IPD-TM) 4/2021 \n \nPage 9 of 9 \n \napplication as expeditiously as possible and take a fresh decision \nthereon, uninfluenced by impugned order dated 7th January 2021, \nwithin a period of four weeks therefrom, and to communicate the said \ndecision to the appellant immediately thereupon. \n \n18. \nWithout casting any aspersion on the learned Deputy Registrar, \nwho passed the impugned order dated 7th January 2021, and keeping \nin mind the principle that justice should not only be done but must be \nseen to be done, as enunciated by the Supreme Court in P.V. \nNarasimha Rao v. State (CBI/SPE)1, the learned Registrar is \nrequested to assign the task of adjudication to an officer other than the \nofficer who has passed the impugned order dated 7th January 2021.  \n \n19. \nIt is made clear that this direction is not intended to cast any \naspersion on the learned Deputy Registrar who passed the impugned \norder and is only intended to assuage any apprehension, in the minds \nof the appellant, that the officer has already pre-determined the issue. \n \n20. \nThe appeal stands allowed accordingly, with no order as to \ncosts. \n \nC. HARI SHANKAR, J. \n \nJANUARY 18, 2023 \n \ndsn/AR \n                                          \n1 MANU/SC/2319/1996 \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.01.2023\n17:07:48\nSignature Not Verified\n"
  },
  "total_pages": 9,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "According to the PDF document \"Lite Bite Travel Foods Pvt Ltd. v. The Registrar of Trade Marks.pdf\", the High Court of Delhi at New Delhi heard the case C.A.(COMM.IPD-TM) 4/2021. The appellant, Lite Bite Travel Foods Private Limited, was represented by Mr. Manish Dhir, while the respondent, The Registrar of Trade Marks, was represented by Mr. Srish Kumar Mishra, Mr. Sagar Mehlawat, and Mr. Alexander Mathai Paikaday.\n\nThe case involved the rejection of the appellant's application for registration of the device mark \"Oasis Lounge By Lite Bite Travel Foods\" by the Deputy Registrar of Trade Marks on January 7, 2021. The application was filed on August 28, 2018, for services provided in restaurants, self-service restaurants, and food and drink services. The Deputy Registrar rejected the application due to a likelihood of confusion with existing trademarks (TM Nos. 2045465 and 3131397) and the dominant feature of the applied mark being \"OASIS\".\n\nThe appellant argued that the mark as a whole was different, but the Deputy Registrar sustained the objection and refused the application. The High Court, presided over by Hon'ble Mr. Justice C. Hari Shankar, heard the oral order on January 18, 2023. The document provides details of the legal proceedings, including dates, parties, and arguments presented. (Source: Lite Bite Travel Foods Pvt Ltd. v. The Registrar of Trade Marks.pdf)",
      "pdf_source": "31. Lite Bite Travel Foods Pvt Ltd. v. The Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "According to page 1 of the PDF \"31. Lite Bite Travel Foods Pvt Ltd. v. The Registrar of Trade Marks.pdf\", the High Court of Delhi is hearing an appeal by Lite Bite Travel Foods Private Limited against the Registrar of Trade Marks. The appellant is challenging the order dated January 7, 2021, which rejected their application for registration of the device mark \"Oasis Lounge By Lite Bite Travel Foods\" (Application No 3928838). The application was filed on August 28, 2018, and examined on September 29, 2018. The applicant's reply to the office objections was found unsatisfactory, leading to the rejection. The appeal is being heard by Hon'ble Mr. Justice C. Hari Shankar, with Mr. Manish Dhir representing the appellant and Mr. Srish Kumar Mishra, Mr. Sagar Mehlawat, and Mr. Alexander Mathai Paikaday representing the respondent. The court proceedings are recorded with a Neutral Citation Number: 2023/DHC/000482 and C.A.(COMM.IPD-TM) 4/2021.",
          "content": "Neutral Citation Number : 2023/DHC/000482 \nC.A.(COMM.IPD-TM) 4/2021 \n \nPage 1 of 9 \n \n$~78 (Original) \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.A.(COMM.IPD-TM) 4/2021 \n \nLITE BITE TRAVEL FOODS PRIVATE LIMITED \n..... Appellant \n \n \n \n \nThrough: \nMr. Manish Dhir, Adv.  \n \n \n \n \n \nversus \n \n \nTHE REGISTRAR OF TRADEMARKS \n    ..... Respondent \nThrough: \nMr. Srish Kumar Mishra, Mr. \nSagar Mehlawat and Mr. Alexander Mathai \nPaikaday, Advs. \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C.HARI SHANKAR \n \n \n \n     O R D E R (ORAL) \n% \n \n \n \n18.01.2023 \n \n1. \nThe appellant is aggrieved by the order dated 7th January 2021, \npassed by the learned Deputy Registrar of Trade Marks (“the learned \nDeputy Registrar”) whereby the application of the appellant for \nregistration of the device mark \n  has been rejected.  \n \n2. \nThe impugned order reads thus: \n“IN THE MATTER OF Application No 3928838 \nfor registration of a trade mark Oasis Lounge By Lite Bite Travel \nFoods filed by LITE BITE TRAVEL FOODS PRIVATE \nLIMITED.. \n \nआदेश/O R D E R \n \nAbove application has been filed for registration of the \ntrademark Oasis Lounge By Lite Bite Travel Foods on 28/08/2018 \nwhich was examined on 29/09/2018 and examination report was \ncommunicated to the applicant at his address for service. A reply to \nthe office objection(s) had been filed on behalf of the applicant but \nthe same was not found satisfactory and the application was set \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.01.2023\n17:07:48\nSignature Not Verified",
          "pdf_source": "31. Lite Bite Travel Foods Pvt Ltd. v. The Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "According to page 2 of the PDF \"31. Lite Bite Travel Foods Pvt Ltd. v. The Registrar of Trade Marks.pdf\", the court heard the case C.A.(COMM.IPD-TM) 4/2021 on November 9, 2020. Advocate Manish Dhir represented the appellant, Lite Bite Travel Foods Private Limited. The registrar of trademarks raised an objection under Section 11(1) due to the similarity of the applied mark with existing trademarks (TM Nos. 2045465 and 3131397). The leading feature of the applied mark, \"OASIS\", was found to be common and similar to the cited marks, and the services provided were also similar. The court sustained the objection and refused the application for registration, noting that the applied mark is not registrable due to the likelihood of confusion with the existing marks. The decision was made on January 7, 2021, by Deputy Registrar of Trade Marks, Sachin Sharma.",
          "content": "Neutral Citation Number : 2023/DHC/000482 \nC.A.(COMM.IPD-TM) 4/2021 \n \nPage 2 of 9 \n \ndown for hearing and eventually hearing took place before me on \n09/11/2020.  \n \nAdv. Manish Dhir Attorney appeared before me and made \nhis/her submissions. I have heard arguments and gone through the \nrecords. \n \nOffice objection u/sec. 11 (1) raised against the applied \nmark. \n \nLd. Counsel submits mark as a whole different. Applicant is \nusing the mark.  \n \nHeard the Ld. Counsel and perused the record. \n \nLeading/Dominant feature of the applied mark is OASIS \nfound common and similar to TM Nos. 2045465 and 3131397. \nServices also similar. No explanation regarding adoption. Mark \nfiled as proposed to be used. Evidence of use subsequent to date of \napplication. Can't be considered. Given, marks are remembered by \nbroad expression, to my mind there is likelihood of confusion \nbetween applied mark and the said cited conflicting marks. \nObjection sustained. Application refused. \n \nAfter perusal of all the documents on record and \nsubmission made by the applicant / authorised agent it is concluded \nthat applied mark is not registrable because of the reason stated as \nabove. Hence application no 3928838 cannot be accepted and \nrefused accordingly.  \n \nदद न ां क/Dated: 07 January 2021. \n(SACHIN SHARMA) \nवररष्ठ परीक्षक, व्य प र दिह्न/DEPUTY REGISTRAR \nOF TRADE MARKS \n(अदिदनयम के 3 (2) के तहत प्र दिकृत)/(/Authorized \nunder 3(2) of the Act)” \n \n3. \nThe applicant applied for registration of the  \n \ndevice mark on 28th August 2018. The applicant sought registration of \nthe said mark in respect of services provided in restaurants, self-\nservice restaurants, services for providing food and drink, bar services, \nsnakc-bars and cafes.  Registration was sought on a  “proposed to be \nused” basis, as a Service Provider.  \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.01.2023\n17:07:48\nSignature Not Verified",
          "pdf_source": "31. Lite Bite Travel Foods Pvt Ltd. v. The Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0006",
      "start_index": 3,
      "end_index": 4,
      "summary": "According to the PDF document \"Lite Bite Travel Foods Pvt Ltd. v. The Registrar of Trade Marks.pdf\", the High Court of Delhi at New Delhi heard the case C.A.(COMM.IPD-TM) 4/2021. The appellant, Lite Bite Travel Foods Private Limited, was represented by Mr. Manish Dhir, while the respondent, The Registrar of Trade Marks, was represented by Mr. Srish Kumar Mishra, Mr. Sagar Mehlawat, and Mr. Alexander Mathai Paikaday.\n\nThe case revolved around the registration of a trademark. The Examiner in the office of the Registrar of Trade Marks had raised objections to the appellant's application under Section 11 of the Trade Marks Act, citing existing similar trademarks. The Examiner's First Examination Report, dated September 29, 2018, listed three earlier registered marks, including \"OASIS\" (Application No. 2045465) and \"OASIS\" (Application No. 3131397), which were considered similar to the appellant's mark.\n\nThe appellant responded to the Examiner's report on February 11, 2020, arguing that they had been continuously using their mark and were well-known in the industry. They submitted a user affidavit and documents showing use of the trademark at the Mumbai International Airport.\n\nThe case highlights the importance of trademark registration and the potential for conflicts with existing marks. As reported in the PDF document, the court considered the objections raised by the Examiner and the appellant's response in determining the outcome of the case. (Source: \"Lite Bite Travel Foods Pvt Ltd. v. The Registrar of Trade Marks.pdf\", Neutral Citation Number: 2023/DHC/000482)",
      "pdf_source": "31. Lite Bite Travel Foods Pvt Ltd. v. The Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "According to page 3 of the PDF \"31. Lite Bite Travel Foods Pvt Ltd. v. The Registrar of Trade Marks.pdf\", the Examiner of the Trade Marks Registry issued a First Examination Report (FER) on September 29, 2018, stating that the application of Lite Bite Travel Foods Private Limited was \"open to objection on relative grounds of refusal under Section 11 of the Trade Marks Act\". The Examiner found that similar trademarks were already registered for the same or similar goods/services. The report cited two existing trademarks: \"OASIS\" registered by Capsulation Services Pvt. Ltd. (Application No. 2045465) and \"OASIS\" applied by Goyal Fashions Pvt. Ltd. (Application No. 3131397). The PDF source provides details of the legal proceedings, including the application dates and goods/services related to the trademarks. (Source: 31. Lite Bite Travel Foods Pvt Ltd. v. The Registrar of Trade Marks.pdf)",
          "content": "Neutral Citation Number : 2023/DHC/000482 \nC.A.(COMM.IPD-TM) 4/2021 \n \nPage 3 of 9 \n \n4. \nConsequent on examination, the Examiner in the office of the \nRegsitrar of Trade Marks, vide his First Examination Report (FER), \ndated 29th September 2018, opined that the application of the appellant \nwas “open to objection on relative grounds of refusal under Section 11 \nof the Trade Marks Act”, as “same/similar trade mark(s) is/are already \non record of the register for the same or similar goods/services”.   \n \n5. \nThe report purported to enclose details of the earlier existing \ntrademarks, on the basis of which the Examiner had opined that the \napplication of the appellant merited rejection.  \n \n6. \nThe details of the earlier registered marks, constituting the basis \nof the objections raised by the Examiner, as enclosed with the FER, \nmay be reproduced thus: \n \nGOVERNMENT OF INDIA \nTRADE MARKS REGISTRY \n \nLOCATION: \nSECTION: EXM \nREPORT: EXM007 \nWORD MARK SEARCH REPORT \nAPPLICATION NUMBER: 3928838 \nClass: --- \nTRADEMARK: 'Oasis Lounge By Lite Bite Travel Foods \nUSER: STK \nPAGE:1 \n \nDATE: 17/09/2018 \n \nAPPL \nNO \nCLASS \nCONFLICTING \nMARK \nJOURNAL \nNo \nPROPRIETOR \nNAME \nPROPRIETOR \nADDRESS \nSTATUS \nTM \nIMAGE \n2045465 \n43 \nOASIS \n1660 \nCAPSULATION \nSERVICES \nPVT. LTD. \nCAPSULATION \nPREMISES, \nDEONAR, \nSION-\nTROMBAY \nROAD, \nOPP. TATA \nSOCIAL \nINSTITUTE, \nMUMBAI- \n400088 \nRegistered \n \n \n \n \n \nAPPLICATION DATE 27/10/2010 \nGOODS/SERVICE CATERING SERVICES, PROVIDING OF FOODS AND DRINKS AND \nRESTAURANT SERVICES \n \n \n \n \n \n \n \n \n3131397 \n43 \nOASIS \n \nGOYAL \nFASHIONS \nPVT. \nLTD.. \nGOYAL \nHOUSE 24, \nAJMER ROAD, \nJAIPUR, \nRAJASTHAN, \nINDIA \nObjected  \n \n \n \n \nAPPLICATION DATE 19/12/2015 \n15:40:31 \n \nGOODS/SERVICE SERVICES FOR PROVIDING FOOD AND DRINK; \nRESTAURANTS, \nBAR, \nLOUNGE, \nTEMPORARY \nACCOMMODATION, BANQUET, HOSPITALITY, HOTEL AND \nRESORT SERVICES. \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.01.2023\n17:07:48\nSignature Not Verified",
          "pdf_source": "31. Lite Bite Travel Foods Pvt Ltd. v. The Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "According to page 4 of the PDF \"31. Lite Bite Travel Foods Pvt Ltd. v. The Registrar of Trade Marks.pdf\", the appellant, Lite Bite Travel Foods Private Limited, submitted a reply to the Examiner's First Examination Report (FER) on February 11, 2020. The reply contended that the appellant had been continuously using the trade mark for its services and was well-known in the industry. A user affidavit from Sukhpreet Singh, an authorized representative, was filed to support this claim, along with documents showing use of the trade mark at the Mumbai International Airport. The appellant argued that the general public was aware of its outlet and associated the mark with its services. The application date for the trade mark was July 27, 2017. (Source: PDF \"31. Lite Bite Travel Foods Pvt Ltd. v. The Registrar of Trade Marks.pdf\", page 4)",
          "content": "Neutral Citation Number : 2023/DHC/000482 \nC.A.(COMM.IPD-TM) 4/2021 \n \nPage 4 of 9 \n \n3600149 \n43 \n \n \nNIKESH \nKISHOR GALA \n3/468 A, Kalyan \nBhuvan, \nMaheshwari \nUdhyaan, \nMatunga \nEast, \nMumbai - \n400019. \nMaharashtra. \nObjected \nAPPLICATION DATE 27/07/2017 \n11:34:06 \n \nGOODS/SERVICE Hotel; Motel; Restaurants; Self-Service Restaurant; Quick Service \nRestaurant; Bar Services; Cafe; Cafeteria; Canteen; Snack Bar; Food Court; Lounge; Take \nAway; Dine In; Food cart; Food Truck; Services for Providing Food, Drink, Beverage and \nTemporary Accommodation; Food, Drink and Beverage Catering; Rental of Furniture, Linens, \nUtensils, Table, Cooking apparatus, Lighting apparatus and other apparatus. \n \n7. \nThe appellant submitted a reply, dated 11th February 2020, to \nthe FER of the Examiner, in which it was contended, inter alia, thus: \n \n(i) \nThe appellant had been continuously using the \n mark for its services and was well known in the \nindustry.  A user affidavit of Mr. Sukhpreet Singh, an authorised \nrepresentative of the appellant, was also filed with the said reply, \nto vouchsage this contention. The affidavit annexed documents \nshowing use of the \n trade mark, under which \nmark, the appellant was running an outlet at the Mumbai \nInternational \nAirport. \nPlacards, \nsignboards \nand \nother \nrepresentations available at the airport, as well as the illuminated \nsignage outside the appellant’s premises at the airport, were also \nannexed.  \n \n(ii) \nAs such, the general public was well aware of the \nappelalnt’s \noutlet \nand \ninvaribly \nassociated \nthe \nmark with the serivces provided by the appellant. \n \n(iii) \nThe \n mark relatable to Application No. 3131397 \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.01.2023\n17:07:48\nSignature Not Verified",
          "pdf_source": "31. Lite Bite Travel Foods Pvt Ltd. v. The Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0010",
      "start_index": 5,
      "end_index": 7,
      "summary": "According to the PDF document \"Lite Bite Travel Foods Pvt Ltd. v. The Registrar of Trade Marks.pdf\", the High Court of Delhi at New Delhi heard the case C.A.(COMM.IPD-TM) 4/2021. The appellant, Lite Bite Travel Foods Private Limited, was represented by Mr. Manish Dhir, while the respondent, The Registrar of Trade Marks, was represented by Mr. Srish Kumar Mishra, Mr. Sagar Mehlawat, and Mr. Alexander Mathai Paikaday.\n\nThe appellant argued that their trade mark was not similar to existing marks, including those of M/s Goel Fashions Pvt. Ltd. and M/s Capsulation Services Pvt. Ltd. They claimed to be a bona fide adopter and user of the trade mark, with extensive usage and reputation in the hospitality market. The appellant also stated that their services were different from those of Capsulation Services, and there was no likelihood of confusion between the two marks.\n\nThe court noted that the impugned order did not consider the various grounds urged by the appellant and that the learned Deputy Registrar had misread Section 11(1)(b) of the Trade Marks Act. The court also mentioned that Section 12, which deals with entitlement to registration where there is honest and concurrent user, was not applied in this case. The appellant had pleaded honest and concurrent user, but there was no reflection of this in the decision. (Source: Lite Bite Travel Foods Pvt Ltd. v. The Registrar of Trade Marks.pdf, Neutral Citation Number: 2023/DHC/000482)",
      "pdf_source": "31. Lite Bite Travel Foods Pvt Ltd. v. The Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 5",
          "node_id": "0007",
          "start_index": 5,
          "end_index": 5,
          "summary": "According to page 5 of the PDF \"31. Lite Bite Travel Foods Pvt Ltd. v. The Registrar of Trade Marks.pdf\", the appellant, Lite Bite Travel Foods Private Limited, argued that they are a bona fide adopter and user of their trade mark, having earned their own reputation and goodwill in the hospitality market. They claimed that their services are different from those provided by Capsulation Services Pvt. Ltd. and that there is no likelihood of confusion between their marks. The appellant's mark is distinguishable from Capsulation Services' mark. The case, C.A.(COMM.IPD-TM) 4/2021, is being heard in the High Court of Delhi, with Mr. Manish Dhir representing the appellant and Mr. Srish Kumar Mishra, Mr. Sagar Mehlawat, and Mr. Alexander Mathai Paikaday representing the respondent, the Registrar of Trade Marks. (Source: PDF \"31. Lite Bite Travel Foods Pvt Ltd. v. The Registrar of Trade Marks.pdf\", page 5)",
          "content": "Neutral Citation Number : 2023/DHC/000482 \nC.A.(COMM.IPD-TM) 4/2021 \n \nPage 5 of 9 \n \nof M/s Goel Fashions Pvt. Ltd. was not registered, as it was \nunder objections.  This, therefore, could not constitute an “earlier \ntrade mark”  for the purposes of Section 11 (1)(d) of the Trade \nMarks Act.  \n(iv) \nInsofar as the \n mark of M/s Capsulation Services \nPvt. Ltd. (“Capsulation Services”) was concerned, the appellant \nclaimed to be a bona fide adopter and user of the \n \ntrade mark, who, by virtue of the extensive usage of the said \nmark, had earned its own reputation and goodwill and made a \nplace for itself in the hospitality market.  \n \n(v) \nThe services provided by the appellant, under the \nmark were different from the services provided \nby capsulation services under the \n mark. \n \n(vi) \nThere was, therefore, no likelihood of confusion, if any, \nbetween \n mark of the appellant and the \n \nmark of Capsulation Services, resulting in any confusion in the \nmind of the public, with respect to the entity with which the mark \nwas associated or the services provided thereunder. \n \n(vii) \nThe marks, seen as a whole, were clearly distinguishable. \nThe appellant’s mark was \n whereas the mark of  \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.01.2023\n17:07:48\nSignature Not Verified",
          "pdf_source": "31. Lite Bite Travel Foods Pvt Ltd. v. The Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "According to page 6 of the PDF \"31. Lite Bite Travel Foods Pvt Ltd. v. The Registrar of Trade Marks.pdf\", the appellant, Lite Bite Travel Foods Private Limited, argued that their mark is visually distinct and constitutes a distinct artistic representation. The appellant also stated that they had never received any communication from anyone claiming to be confused by their mark. \n\nThe court heard arguments from Mr. Manish Dhir, Counsel for the appellant, and Mr. Srish Kumar Mishra, Counsel for the respondent. The impugned order was found to not consider the appellant's grounds and the affidavit of Mr. Sukhpreet Singh. The Deputy Registrar misread Section 11(1)(b) of the Trade Marks Act, believing that mere similarity of marks is sufficient to reject an application. \n\nThe case is C.A.(COMM.IPD-TM) 4/2021, with a Neutral Citation Number of 2023/DHC/000482, and was digitally signed by Sunil Singh Negi on January 23, 2023.",
          "content": "Neutral Citation Number : 2023/DHC/000482 \nC.A.(COMM.IPD-TM) 4/2021 \n \nPage 6 of 9 \n \nCapsulation Services,  was \n. Besides, the marks were \nvisually completely distintinct and constituted disntinct artistic \nrepresentations.  \n \n(viii) \nThe appellant had never been communicated any \nobjection or any other communication by anyone who claimed to \nhave been confused as result of the adoption, by the appellant, of \nthe  \n mark, for the registration of which the \napplication had been filed.  \n \n \n8. \nI have heard Mr. Manish Dhir, learned Counsel for the appellant \nand Mr. Srish Kumar Mishra, learned Counsel for the respondent at \nsome length. \n \n9. \nPlainly, the impugned order does not consider the various \ngrounds urged by the appellant in its reply dated 11th February 2020 to \nthe FER dated 29th September 2018. There is, equally, no reflection of \nany consideration of the affidavit of Mr. Sukhpreet Singh or the \nmaterial that was filed therewith.  \n \n10. \nIn fact, the learned Deputy Registrar has, it appears, proceeded \non a complete misreading of Section 11(1)(b) of the Trade Marks Act.  \nThe impugned order reflects the view that mere similarity of the \nmarks, of which registration is sought, is, by itself, sufficient as a \nground to reject the application seeking registration. That, however, is \nnot the position as it obtains in law. Even statutorily, Section 11(1)((b) \nis subject to two other provisions/caveats.  \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.01.2023\n17:07:48\nSignature Not Verified",
          "pdf_source": "31. Lite Bite Travel Foods Pvt Ltd. v. The Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 7",
          "node_id": "0009",
          "start_index": 7,
          "end_index": 7,
          "summary": "According to page 7 of the PDF \"31. Lite Bite Travel Foods Pvt Ltd. v. The Registrar of Trade Marks.pdf\", the court discusses Section 11(1) and Section 12 of the Trade Marks Act. The appellant, Lite Bite Travel Foods Private Limited, has pleaded honest and concurrent user, but the Registrar of Trade Marks has not considered this contention. The court notes that similarity of marks and goods/services can only be a basis for rejection under Section 11(1)(b) if there is a likelihood of confusion on the part of the public. The existence of likelihood of confusion is an issue of fact that must be established. The case is C.A.(COMM.IPD-TM) 4/2021, with Neutral Citation Number 2023/DHC/000482. The court is considering the appeal against the Registrar's decision, with the appellant represented by Mr. Manish Dhir and the respondent represented by Mr. Srish Kumar Mishra, Mr. Sagar Mehlawat, and Mr. Alexander Mathai Paikaday.",
          "content": "Neutral Citation Number : 2023/DHC/000482 \nC.A.(COMM.IPD-TM) 4/2021 \n \nPage 7 of 9 \n \n11. \nSection 11(1) starts with the words “save as provided in Section \n12”. Section 12, therefore, operates as an exception to Section 11(1).  \nSection 12 deals with entitlement to registration where, despite \nsimilarity of the marks, the applicant pleads honest and concurrent \nuser. In the present case, the appellant has specifically pleaded honest \nand concurrent user. There is no reflection of any application of mind \nby the learned Registrar of Trademarks to the said contention. \n \n12. \nAdditionally, similarity of the mark, of which registration is \nsought, coupled with identity or similarity of the goods or services \ncovered by the said mark can constitute a basis for rejection of an \napplication seeking registration of the mark, under Section 11(1)(b) \nonly where, because of such similarity between the marks and identity \nand similarity of goods or services covered by the marks, there exists \na likelihood of confusion on the part of the public or of the public \nassociating the mark, of which registration is sought, with the earlier \ntrade mark. \n \n13. \nThe existence, or otherwise, of likelihood of confusion is an \nissue of fact. Until and unless, on facts, it is established that, owing to \nidentity/similarity of the mark of which registration is sought, and of \nthe goods/services covered thereby, with an earlier mark, there is \nlikelihood of confusion/association in the mind of the public, \nregistration cannot be refused on that ground.  \n \n14. \nIn the event that Section 11(1)(b) is stated as a ground for \nrejection of an application seeking registration of a mark, therefore, \nthe impugned order must additionally contain a finding that, owing to \nsimilarity of the mark of which registration is sought with an earlier \ntrade mark and identity/similarity of the goods and services covered \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.01.2023\n17:07:48\nSignature Not Verified",
          "pdf_source": "31. Lite Bite Travel Foods Pvt Ltd. v. The Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0013",
      "start_index": 8,
      "end_index": 9,
      "summary": "The court decision in the case of Lite Bite Travel Foods Pvt Ltd. v. The Registrar of Trade Marks (PDF source: 2023/DHC/000482, C.A.(COMM.IPD-TM) 4/2021) revolves around the appeal filed by Lite Bite Travel Foods Private Limited against the decision of the Registrar of Trade Marks. The appellant had applied for registration of a trademark, which was opposed by the Registrar. \n\nThe court, Hon'ble Mr. Justice C. Hari Shankar, allowed the appeal, quashing and setting aside the impugned order dated January 7, 2021. The application for registration of the trademark was remanded for re-consideration from the stage of submission of the appellant's reply dated February 11, 2020, to the First Examination Report (FER) dated September 29, 2018.\n\nThe court directed the appellant to present itself before the concerned officer on January 30, 2023, and the officer was instructed to consider the application expeditiously and take a fresh decision within four weeks, uninfluenced by the impugned order. The Registrar was also requested to assign the task of adjudication to an officer other than the one who passed the impugned order to ensure fairness and transparency.\n\nThe appeal was allowed with no order as to costs. The decision was made on January 18, 2023, and digitally signed by Sunil Singh Negi on January 23, 2023. The PDF source provides detailed information about the court proceedings, including the dates, parties, and arguments presented.",
      "pdf_source": "31. Lite Bite Travel Foods Pvt Ltd. v. The Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 8",
          "node_id": "0011",
          "start_index": 8,
          "end_index": 8,
          "summary": "According to page 8 of the PDF \"31. Lite Bite Travel Foods Pvt Ltd. v. The Registrar of Trade Marks.pdf\", the court found that the Registrar of Trademarks did not consider the appellant's reply dated 11th February 2020 and the affidavit of Mr. Sukhpreet Singh. The court quashed and set aside the impugned order dated 7th January 2021 and remanded the application for re-consideration from the stage of submission of the appellant's reply. The appellant is entitled to a personal hearing, which was scheduled for 30th January 2023. The court directed the concerned officer to consider the submissions and make a decision. The case is C.A.(COMM.IPD-TM) 4/2021, with Neutral Citation Number 2023/DHC/000482. The judges and advocates involved include HON'BLE MR. JUSTICE C.HARI SHA, Mr. Manish Dhir, Mr. Srish Kumar Mishra, Mr. Sagar Mehlawat, and Mr. Alexander Mathai Paikaday. (Source: PDF \"31. Lite Bite Travel Foods Pvt Ltd. v. The Registrar of Trade Marks.pdf\", page 8)",
          "content": "Neutral Citation Number : 2023/DHC/000482 \nC.A.(COMM.IPD-TM) 4/2021 \n \nPage 8 of 9 \n \nby \nthe \nsaid \nmark, \nthere \nis \na \npositive \nlikelihood \nof \nconfusion/association, on the part of the public, as envisaged by the \nprovision.  Such a finding can be returned only after examining the \nfacts and the material on record.  It cannot merely be chanted as a \nmantra. \n \n15. \nThe appellant has raised several contentions in its reply dated \n11th February 2020 to the FER dated 29th September 2018. \nAdditionally, an affidavit of Mr. Sukhpreet Singh, along with material \nsubstantiating the contentions raised in the reply, was also filed, and \nthe impugned order does not reflect any examination or consideration \nof the submissions contained in the reply dated 11th February 2020, \nthe affidavit of Mr. Sukhpreet Singh or the documents filed with the \naffidavit, I deem it appropriate that the matter be remanded to the \nlearned Registrar of Trademarks for re-consideration.  \n \nConclusion \n \n16. \nResultantly, the impugned order dated 7th January 2021 is \nquashed and set aside. The Application no. 3928838 dated 28th August \n2018 filed by the appellant for registration of the \nmark \nis remanded for re-consideration, from the stage of submission, by the \nappellant, of its reply dated 11th February 2020 to the FER dated 29th \nSeptember 2018 of the Examiner. \n \n17. \nThe appellant would be entitled to an opportunity of personal \nhearing before a decision is taken. In order to expedite matters, the \nappellant is directed to present itself before the concerned officer on \n30th January 2023.  The officer concerned is directed to consider the \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.01.2023\n17:07:48\nSignature Not Verified",
          "pdf_source": "31. Lite Bite Travel Foods Pvt Ltd. v. The Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 9",
          "node_id": "0012",
          "start_index": 9,
          "end_index": 9,
          "summary": "According to page 9 of the PDF \"31. Lite Bite Travel Foods Pvt Ltd. v. The Registrar of Trade Marks.pdf\", the court has directed the Registrar of Trade Marks to reconsider the application and make a fresh decision within four weeks. The court has also requested that the task of adjudication be assigned to an officer other than the one who passed the impugned order dated January 7, 2021, to avoid any apprehension of pre-determination. The appeal has been allowed with no order as to costs. The decision was made by Hon'ble Mr. Justice C. Hari Shankar on January 18, 2023. The case is C.A.(COMM.IPD-TM) 4/2021, with Lite Bite Travel Foods Private Limited as the appellant and the Registrar of Trade Marks as the respondent. (Source: PDF \"31. Lite Bite Travel Foods Pvt Ltd. v. The Registrar of Trade Marks.pdf\", page 9)",
          "content": "Neutral Citation Number : 2023/DHC/000482 \nC.A.(COMM.IPD-TM) 4/2021 \n \nPage 9 of 9 \n \napplication as expeditiously as possible and take a fresh decision \nthereon, uninfluenced by impugned order dated 7th January 2021, \nwithin a period of four weeks therefrom, and to communicate the said \ndecision to the appellant immediately thereupon. \n \n18. \nWithout casting any aspersion on the learned Deputy Registrar, \nwho passed the impugned order dated 7th January 2021, and keeping \nin mind the principle that justice should not only be done but must be \nseen to be done, as enunciated by the Supreme Court in P.V. \nNarasimha Rao v. State (CBI/SPE)1, the learned Registrar is \nrequested to assign the task of adjudication to an officer other than the \nofficer who has passed the impugned order dated 7th January 2021.  \n \n19. \nIt is made clear that this direction is not intended to cast any \naspersion on the learned Deputy Registrar who passed the impugned \norder and is only intended to assuage any apprehension, in the minds \nof the appellant, that the officer has already pre-determined the issue. \n \n20. \nThe appeal stands allowed accordingly, with no order as to \ncosts. \n \nC. HARI SHANKAR, J. \n \nJANUARY 18, 2023 \n \ndsn/AR \n                                          \n1 MANU/SC/2319/1996 \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:23.01.2023\n17:07:48\nSignature Not Verified",
          "pdf_source": "31. Lite Bite Travel Foods Pvt Ltd. v. The Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-15T18:31:55.406549",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}