{
  "doc_name": "32. Mahesh Gupta v. Registrar of Trade Marks",
  "pdf_source": "32. Mahesh Gupta v. Registrar of Trade Marks.pdf",
  "metadata": {
    "document_name": "32. Mahesh Gupta v. Registrar of Trade Marks",
    "source_pdf": "32. Mahesh Gupta v. Registrar of Trade Marks.pdf",
    "judges": [
      "C. HARI SHANKAR J U D G M E N T (ORAL) % 02.03.2023 1."
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "143/2022",
      "143/2022",
      "143/2022",
      "143/2022",
      "143/2022",
      "143/2022",
      "143/2022",
      "143/2022",
      "143/2022",
      "143/2022",
      "4245/2023"
    ],
    "dhc_numbers": [
      "2023/DHC/001627",
      "2023/DHC/001627",
      "2023/DHC/001627",
      "2023/DHC/001627",
      "2023/DHC/001627",
      "2023/DHC/001627",
      "2023/DHC/001627",
      "2023/DHC/001627",
      "2023/DHC/001627"
    ],
    "ia_numbers": [],
    "decision_date": "28 April, 1998",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [],
    "defendants": [],
    "appellants": [
      "Mahesh Gupta"
    ],
    "respondents": [
      "Registrar of Trade Marks",
      "ANR"
    ],
    "plaintiff_advocates": [],
    "defendant_advocates": [],
    "appellant_advocates": [
      "Ms. Rajeshwari H.",
      "Ms. Swapnil Gaur"
    ],
    "respondent_advocates": [
      "Ms. Swathi Sukumar",
      "Mr. Naveen Nagarjuna",
      "Mr. Pratyush Rao",
      "Mr. Ritik Raghuvanshi"
    ],
    "damages_claimed": null,
    "damages_awarded": null,
    "key_issues": [
      "Abandonment of opposition under Rule 45(2) of the Trade Marks Rule 2017 due to failure to take action within the specified time.",
      "Registration of a device mark under class 32 in respect of non-alcoholic drinks and beverages, aerated water, beer, and porter, syrups for making beverages, and essences.",
      "Opposition to registration of a trademark under Section 21 of the Trade Marks Act 1999.",
      "Filing of evidence in support of opposition under Rule 50(1) of the Trade Marks Rules 2002.",
      "Extension of time for filing evidence in support of opposition and the applicability of Rule 50(1) of the Trade Marks Rules 2002.",
      "Deemed abandonment of opposition under Rule 45(2) of the Trade Marks Rule 2017 and its implications on the registration process.",
      "Appeal under Section 91 of the Trade Marks Act 1999 to the Intellectual Property Appellate Board (IPAB) and subsequent transfer to the High Court due to abolition of IPAB.",
      "Application of the Trade Marks Rules 2002 and the Trade Marks Rule 2017 in the context of opposition and registration proceedings.",
      "Consequences of delay in filing evidence in support of opposition, including the possibility of deemed abandonment.",
      "Interpretation of Rules 45(2) and 50(1) in determining the abandonment of opposition and the filing of evidence, respectively."
    ],
    "decision_summary": "**Background:**\nThe case involves an opposition to the registration of a device mark by Respondent 2, filed by Mahesh Gupta (Appellant) on April 15, 2008, under Section 21 of the Trade Marks Act 1999. The opposition was in response to Respondent 2's application for registration of the device mark under Class 32, filed on April 28, 1998. The application covered \"non-alcoholic drinks and beverages, aerated water, beer and porter, syrups for making beverages, and essences.\"\n\n**Legal Issues:**\nThe primary issue before the court was whether the Deputy Registrar of Trade Marks was correct in treating the Appellant's opposition as abandoned under Rule 45(2) of the Trade Marks Rule 2017. The Appellant had filed evidence in support of the opposition on June 10, 2010, which was after the prescribed time period. The Appellant had also applied for an extension of time to file the evidence, acknowledging a delay of four months.\n\n**Arguments:**\nThe Appellant argued that the Deputy Registrar erred in applying the 2017 Rules, as the proceedings had commenced under the 2002 Rules. The Appellant contended that the evidence was filed within the extended time period allowed under the 2002 Rules.\n\nThe Respondent 2 argued that the Appellant's opposition was indeed abandoned, as the Appellant had failed to file evidence within the prescribed time period.\n\n**Court Findings:**\nThe court observed that the Deputy Registrar had formally erred in law by applying the 2017 Rules to the proceedings, which had commenced under the 2002 Rules. The court noted that the Appellant had filed evidence in support of the opposition on June 10, 2010, and applied for an extension of time, which was a procedural requirement under the 2002 Rules.\n\n**Decision:**\nThe court held that the Deputy Registrar's decision to treat the Appellant's opposition as abandoned was incorrect. The court set aside the order dated August 7, 2019, and remanded the matter to the Deputy Registrar to proceed with the opposition proceedings in accordance with the 2002 Rules. The court directed the Deputy Registrar to consider the Appellant's evidence and the Respondent 2's counterstatement, and to decide the matter on its merits.\n\nIn summary, the court's decision was based on the procedural error committed by the Deputy Registrar in applying the wrong set of rules to the proceedings. The court's decision allowed the Appellant's opposition to proceed, and the matter was remanded to the Deputy Registrar for further consideration.",
    "legal_precedents": [
      "(2007) 143 DLT 148"
    ],
    "full_text": "\n--- PAGE 1 ---\nNeutral Citation Number : 2023/DHC/001627 \nC.A.(COMM.IPD-TM) 143/2022 \n \nPage 1 of 9    \n \n$~1 \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.A.(COMM.IPD-TM) 143/2022 & I.A. 4245/2023 \n \nMAHESH GUPTA \n \n \n \n         ..... Appellant \nThrough: \nMs. \nRajeshwari \nH. \nand  \nMs.Swapnil Gaur, Advs. \n \n \n \n \n \nversus \n \n \nREGISTRAR OF TRADEMARKS AND ANR .... Respondents \nThrough: \nMs. \nSwathi \nSukumar, \nMr. \nNaveen Nagarjuna, Mr. Pratyush Rao and \nMr. Ritik Raghuvanshi, Adv. for R-2 \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C. HARI SHANKAR \n \n \n \n   J U D G M E N T (ORAL) \n% \n \n \n \n  02.03.2023 \n \n1. \nOn 28th April 1998, Respondent 2 filed Application No. 800324 \nfor registration of the device mark \n under class 32 in \nrespect of ―non-alcoholic drinks and beverages aerated water, beer and \nporter, syrups for making beverages essences‖.  \n \n2. \nOn 15th September 2006, the appellant filed an opposition under \nSection 21 of the Trade Marks Act 1999, opposing the request of \nRespondent 2 for registration of the aforesaid device mark. Notice on \nthe opposition was served on the Respondent 2, who filed a counter \nstatement by way of response to the opposition on 15th April 2008.  \nThe date on which the counter statement was served on the appellant \nis not immediately forthcoming. However, it is not in dispute that the \nappellant filed its evidence in support of the opposition under Rule \nDigitally Signed By:SUNIL\nSINGH NEGI\nSigning Date:04.03.2023\n16:11:50\nSignature Not Verified\n\n--- PAGE 2 ---\nNeutral Citation Number : 2023/DHC/001627 \nC.A.(COMM.IPD-TM) 143/2022 \n \nPage 2 of 9    \n \n50(1)1 of the Trade Marks Rules 2002 (hereinafter referred to as ―the \n2002 Rules‖), on 10th June 2010.  On 11th June 2010, the appellant \nfiled an application for extension of time in filing the evidence in \nsupport of the opposition.  In the application, it was acknowledged \nthat the evidence was filed after a delay of four months, for which \nextension was sought in the application.  \n \n3. \nBy the following order dated 7th August 2019, the Deputy \nRegistrar of Trade Marks held the opposition filed by the appellant to \nbe deemed to have been abandoned under Rule 45(2)2 of the Trade \nMarks Rule 2017 (hereinafter referred to as ―the 2017 Rules‖) and \ndirected that the application would proceed further as per rules.  \n \n4. \nAggrieved thereby, the appellant has preferred the present \nappeal under Section 91 of the Trade Marks Act before the learned \nIntellectual Property Appellate Board (―the learned IPAB‖). \nConsequent to abolition of the learned IPAB by The Tribunals \nReforms Act 2021, the appeal stands transferred to this Court.  \n \n5. \nPleadings in the appeal have been completed and I have heard \nMs. Rajeshwari H., learned Counsel for the appellant and Ms. Swathi \nSukumar, learned Counsel for the Respondent 2 at length on the \nappeal. \n \n6. \n Though there are certain averments in the appeal regarding the \n                                          \n1 50. \nEvidence in support of opposition.— (1) Within two months from services on him of a copy of \nthe counterstatement or within such further period not exceeding one month in the aggregate thereafter as the \nRegistrar may on request allow, the opponent shall either leave with the Registrar, such evidence by way of \naffidavit as he may desire to adduce in support of his opposition or shall intimate to the Registrar and to the \napplicant in writing that he does not desire to adduce evidence in support of his opposition but intends to rely \non the facts stated in the notice of opposition. He shall deliver to the applicant copies of any evidence that he \nleaves with the Registrar under this sub-rule and intimate the Registrar in writing of such delivery. \n2 45. \nEvidence in support of opposition.—  (2) If an opponent takes no action under sub-rule (1) within \nthe time mentioned therein, he shall be deemed to have abandoned his opposition. \nDigitally Signed By:SUNIL\nSINGH NEGI\nSigning Date:04.03.2023\n16:11:50\nSignature Not Verified\n\n--- PAGE 3 ---\nNeutral Citation Number : 2023/DHC/001627 \nC.A.(COMM.IPD-TM) 143/2022 \n \nPage 3 of 9    \n \nmerits of the respondent’s application seeking registration of the  \n device mark and on the merits of the appellant’s \nopposition to such registration, I do not deem it necessary to enter into \nthe meits of the matter, as the appellant’s objection was rejected by the \nlearned Deputy Registrar as abandoned. All that this Court has to see,  \ntherefore, is whether the learned Deputy Registrar was correct in her \ndecision to treat the appellant’s opposition to the application of \nRespondent 2 as abandoned.  \n \n7. \nI may observe, at the very outset, that the learend Deputy \nRegistrar has formally erred in law in passing the impugned order \nunder the 2017 Rules.  All proceedings before the learend Deputy \nRegistrar, save and except for the passing of the impugned order, on \n7th August  2019, took place when the 2002 Rules were in force. The \napplciation seeking registration, the oppostion thereto, the counter \nstatement filed by way of response to the oppositin and the filing of \nthe evidence in support of the opposition by the appellant along with \nthe application seeking condonation of delay, were all prior to coming \ninto force the 2017 Rules; in fact, much prior thereto.  \n \n8. \nRule 1583 of the 2017 Rules, even while repealing the 2002 \nRules, clearly holds that such repeal would be ―without prejudice to \nanything done under such rules before the coming into force of these \nrules‖.  In other words, the repeal of the 2002 Rules by the 2017 Rules \nwould, inter alia, be without prejudice to all proceedings which took \nplace in the present case, including the filing of the evidence in \nsupport of the opposition by the appellant which, admittedly, was \n                                          \n3 158. \nRepeal.— \nThe Trade Marks Rules, 2002, are hereby repealed without prejudice to \nanything done under such rules before the coming into force of these rules. \n \nDigitally Signed By:SUNIL\nSINGH NEGI\nSigning Date:04.03.2023\n16:11:50\nSignature Not Verified\n\n--- PAGE 4 ---\nNeutral Citation Number : 2023/DHC/001627 \nC.A.(COMM.IPD-TM) 143/2022 \n \nPage 4 of 9    \n \nunder Rule 50(1) of the 2002 Rules.  The repeal of the 2002 Rules by \nthe 2017 Rules cannot, therefore, prejudice the applicability of the \n2002 Rules, insofar as the issue of whether the evidence filed by the \nappellant under Rule 50(1) of the 2002 Rules could be taken on \nrecord, is concerned. \n \n9. \nThe dispute has, therefore, to be examined in the light of Rule \n50(1) of the 2002 Rules. What has to be seen, therefore, is whether the \nopposition of the appellant could be treated as having deemed to have \nbeen abandoned by applying Rule 50(1) of the 2002 Rules.    \n \n10. \nA coordinate Single Bench of this Court of Hon’ble Mr. Justice \nBudar Durrez Ahmed, as he then was, has examined this aspect in \ndetail in Sunrider Corporation, U.S.A. v. Hindustan Lever Ltd4. The \nrelevant passages from the said decision may be reproduced thus: \n \n―8. \nReading Rule 50, it is clear that the evidence by way of \naffidavit in support of an opposition to the registration of a trade \nmark has to be filed within two months of the service of a copy of \nthe counter-statement on the opponent. This period of two months \nis further extendable by a period of one month in the aggregate \nthereafter as the Registrar may on request allow. Clearly, in the \nfirst instance, the evidence affidavit has to be filed within two \nmonths of the receipt of a copy of the counter-statement. The \nRegistrar may extend this period by a further one month in the \naggregate if a request for the same is made in time. Sub-rule (2) of \nRule 50 makes it clear that if an opponent takes no action under \nSub-rule (1) within the time mentioned therein, he shall be deemed \nto have abandoned his opposition. It is also interesting to note that \nSub-rule (3) refers to the application for extension of the period of \none month mentioned in Sub-rule (1). It is also stipulated that such \nan application has to be made in Form TM-56 accompanied by the \nprescribed fee before the expiry of the period of two months \nmentioned therein. So, it is clear that a strict regimen has been \nprescribed for the filing of evidence by way of affidavit in support \nof an opposition. A plain reading of the provisions makes it \nabundantly clear that the evidence has to be filed within two \n                                          \n4 (2007) 143 DLT 148 \nDigitally Signed By:SUNIL\nSINGH NEGI\nSigning Date:04.03.2023\n16:11:50\nSignature Not Verified\n\n--- PAGE 5 ---\nNeutral Citation Number : 2023/DHC/001627 \nC.A.(COMM.IPD-TM) 143/2022 \n \nPage 5 of 9    \n \nmonths in the first instance and, if an appropriate application for \nextension of time is made before the expiry of the period of two \nmonths and if such application is allowed by the Registrar, then \nlatest by a further month. In other words, under no circumstances \ncan the evidence affidavit be filed beyond the maximum three \nmonths prescribed under the said rule. In case the opponent has \nnot taken steps within the prescribed time, then there is no option \nleft with the Registrar but to deem that the opponent has \nabandoned his opposition.‖ \n(Emphasis Supplied) \n \n11. \nMs. Rajeshwari seeks, however, to distinguish the decision in \nSunrider4 essentially on two grounds.   She relies, in the first instance, \non the judgment of a learned Single Judge of the High Court of \nGujarat in Wyeth Holdings Corpn. v. Controller General of Patents, \nDesigns and Trade Marks5 , which holds, in paras 58 to 60 thus: \n―58.  \nIn view of the nature of the prayer sought for, there is no \nquestion of any alternative remedy being available to the \npetitioners. Having found the submissions made by the learned \nsenior counsel appearing for the petitioners with substance, the \nsame are accepted. There is no question of the petition being  \ndismissed on the ground of alternative remedy being available. \n59.  \nIn view of the aforesaid discussion, in view of the settled \nlegal position that subordinate legislation cannot travel beyond the \nscope of main legislation and having regard to the provisions \nof Section 131 which provides for extension of time, this Court has \nonly two options, either to declare Sub-rule (2) of Rule 50 as ultra \nvirus the Act or by employing principle of 'harmonious \nconstruction', to read Sub-rule (2) of Rule 50 to be a 'directory' one. \n60. \nIn the considered opinion of this Court, there is no reason \nmuch less a compelling reason for which the first option should be \nexercised and the 'Rule' be struck down by holding it to be \n'mandatory'. As against that, it is a well settled position of law that \nprinciple of 'harmonious construction' should be pressed into \nservice and Sub-rule (2) of Rule 50 be read as 'directory'. This \nCourt is of the opinion that by declaring Sub-rule (2) of Rule 50, \n'directory', no injustice or prejudice is going to be caused to any \nparty. On the contrary, it will be serving the interest of justice. \nHence, second option is exercised. Sub-rule (2) of Rule 50 is held \nto be 'directory' in nature.‖ \n \n                                          \n5 2006 SCC OnLine Guj 620 \nDigitally Signed By:SUNIL\nSINGH NEGI\nSigning Date:04.03.2023\n16:11:50\nSignature Not Verified\n\n--- PAGE 6 ---\nNeutral Citation Number : 2023/DHC/001627 \nC.A.(COMM.IPD-TM) 143/2022 \n \nPage 6 of 9    \n \n12. \nWyeth5, she submits, was not noticed in Sunrider4.  \n \n13. \nWith greatest respect, I am unable to subscribe to the view \nexpressed by the High Court of Gujarat in Wyeth5. \n \n14. \nTo my mind, the view espoused in para 60 of the decision in \nWyeth5, if accepted, would amount to no less than re-writing of the \napplicable statutory provisions. Rule 50(1) of the 2002 Rules is even \nmore peremptory, in its application, than Rule 48 of the succeeding \n2017 Rules. While providing a period of two months to an opponent \nopposing an application seeking registration of a trade mark file its \nevidence after receipt of the counter-statement of the applicant, Rule \n50(1) empowers the Registrar to extend the said period only upto one \nmonth, specifically using the words ―not exceeding one month‖. The \nwords ―not exceeding one month‖ are mandatory in their import.  The \nlearned Registrar could not, therefore, grant extension of more than \none month beyond the period of two months from the date of service, \non the opponent opposing the registration of a mark, of a copy of the \ncounter statement.  Grant of any further extension would clearly be in \nthe teeth of Rule 50(1). \n \n15. \nRule 50(2) is even clearer in its import.  It states, in \nunambiguous terms, that, if the opponent took no action under Rule \n50(1) within the time period mentioned therein – meaning two months \nextendable by a maximum period of one month – he shall be deemed \nto have abandoned his opposition.  \n \n16. \nDeemed abandonment of the opposition, therefore, follows as \nan inexorable statutory sequitur to the failure, on the part of the \nDigitally Signed By:SUNIL\nSINGH NEGI\nSigning Date:04.03.2023\n16:11:50\nSignature Not Verified\n\n--- PAGE 7 ---\nNeutral Citation Number : 2023/DHC/001627 \nC.A.(COMM.IPD-TM) 143/2022 \n \nPage 7 of 9    \n \nopponent, in filing the evidence in support of the opposition within the \nperiod envisaged in Rule 50(1).  Deemed abandonment, therefore, \noccurs by operation of the statute. Even sans any judicial or quasi-\njudicial order, therefore, if the opponent opposing the application \nseeking grant of the trade mark fails to file its evidence in support of \nthe opposition within a maximum of three months from the receipt, by \nit, of the counter-statement of the trade mark applicant, the opposition \nwould ipso facto be deemed to be abandoned irrespective of whether \nany order to that effect is, or is not, passed by any judicial or quasi-\njudicial forum. \n \n17. \nThe view expressed in Wyeth5, if accepted, would amount to \nrendering largely otiose Rule 50(2) of the 2002 Rules. With respect, \ntherefore, it is not possible to accept the said view.  \n \n18. \nMs. Rajeshwari also sought to place reliance on Rule 1056 of \nthe 2002 Rules read with Section 1317 of the 1999 Act. \n \n19. \nThough these provisions have been considered by the \ncoordinate Bench in Sunrider4, Ms. Rajeshwari advances a \nsubmission which, according to her, was not advanced in Sunrider4 \nand was not, therefore, considered.  She draws attention to the \n                                          \n6 105. \nExtension of time.— \n(1) An application for extension of time under Section 131 (not being \na time expressly provided in the Act or prescribed by Rule 79 or by sub-rule (4) of Rule 80 or a time for the \nextension of which provision is made in the rules) shall be made in Form TM-56. \n(2) Upon an application made under sub-rule (1) the Registrar, if satisfied that the circumstances are such as \nto justify the extension of the time applied for, may, subject to the provisions of the rules where a maximum \ntime limit is prescribed and subject to such conditions as he may think fit to impose, extend the time and \nnotify the parties accordingly and the extension may be granted though the time for doing the act or taking the \nproceeding for which it is applied for has already expired. \n7131.  \nExtension of time.— \n(1) If the Registrar is satisfied, on application made to him in the \nprescribed manner and accompanied by the prescribed fee, that there is sufficient cause for extending the time \nfor doing any act (not being a time expressly provided in this Act), whether the time so specified has expired \nor not, he may, subject to such conditions as he may think fit to impose, extend the time and inform the \nparties accordingly. \n(2) Nothing in sub-section (1) shall be deemed to require the Registrar to hear the parties before disposing of \nan application for extension of time, and no appeal shall lie from any order of the Registrar under this section. \n \nDigitally Signed By:SUNIL\nSINGH NEGI\nSigning Date:04.03.2023\n16:11:50\nSignature Not Verified\n\n--- PAGE 8 ---\nNeutral Citation Number : 2023/DHC/001627 \nC.A.(COMM.IPD-TM) 143/2022 \n \nPage 8 of 9    \n \nparenthesized words in Rule 105(1) reading ―not being a time \nexpressly provided in the Act or prescribed by rule 79 or by sub-rule \n(4) of rule 80 or a time for the extension of which provision is made in \nthe rules‖. According to Ms. Rajeshwari, the import of the afore-\nextracted parenthesized words in Rule 105(1) was to restrict the \ninflexibility of the provision only to cases where the time was \nprovided in the Act or prescribed by Rule 79 or Rule 80(4).   \n \n20. \nThe submission is obviously unacceptable, as the parentheses \nalso include the words ―or a time for the extension of which provision \nis made in the rules‖. As already noted, Rule 50(1) provides for \nextension of time and curtails the maximum period by which such \nextension could be granted to one month.  The provision for extension \nof time as contained in Rule 50(1), therefore, rules out the \napplicability of Rule 105 to the facts of the present case.  \n \n21. \nOn all other aspects, the coordinate Bench in Sunrider4, having \nexamined the issue in law in detail, this Bench does not deem it \nnecessary to reinvent the wheel. I express my respectful concurrence \nwith the views expressed in the passages from Sunrider4 extracted \nhereinabove which, unfortunately for the appellant, cover the case \nagainst it on all fours.  \n \n22. \nI see no reason, therefore, to differ with the ultimate decision, of \nthe Deputy Registrar, to deem the opposition of the appellant as \nhaving been abandoned.  The deemed abandonment would, however, \nbe under Rule 50(1) of the 2002 Rules, and not Rule 45(1) of the 2017 \nRules.  \n \nDigitally Signed By:SUNIL\nSINGH NEGI\nSigning Date:04.03.2023\n16:11:50\nSignature Not Verified\n\n--- PAGE 9 ---\nNeutral Citation Number : 2023/DHC/001627 \nC.A.(COMM.IPD-TM) 143/2022 \n \nPage 9 of 9    \n \n23. \nSubject to that modification, the impugned order dated 7th \nAugust 2019 is, therefore, upheld.  \n \n24. \nThe appeal is dismissed. \n \n \n \nC. HARI SHANKAR, J. \n \nMARCH 2, 2023 \n \ndsn \n \nDigitally Signed By:SUNIL\nSINGH NEGI\nSigning Date:04.03.2023\n16:11:50\nSignature Not Verified\n"
  },
  "total_pages": 9,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "According to the PDF document \"Mahesh Gupta v. Registrar of Trade Marks.pdf\", the case involves an appeal filed by Mahesh Gupta against the Registrar of Trade Marks and another respondent. The appeal is related to the registration of a device mark under class 32 for non-alcoholic drinks and beverages. The respondent 2 filed the application for registration on April 28, 1998, and the appellant filed an opposition on September 15, 2006.\n\nThe appellant filed evidence in support of the opposition on June 10, 2010, and applied for an extension of time on June 11, 2010. However, the Deputy Registrar of Trade Marks held the opposition to be deemed abandoned under Rule 45(2) of the Trade Marks Rule 2017 on August 7, 2019.\n\nThe appellant preferred an appeal under Section 91 of the Trade Marks Act before the Intellectual Property Appellate Board, which was later transferred to the High Court of Delhi due to the abolition of the IPAB by the Tribunals Reforms Act 2021. The appeal was heard by Hon'ble Mr. Justice C. Hari Shankar on March 2, 2023. The parties were represented by their respective counsels, Ms. Rajeshwari H. and Ms. Swathi Sukumar.\n\nKey dates mentioned in the document include April 28, 1998, September 15, 2006, June 10, 2010, June 11, 2010, August 7, 2019, and March 2, 2023. The document does not mention any specific amounts. The case is related to trade mark registration and opposition proceedings. (Source: Mahesh Gupta v. Registrar of Trade Marks.pdf)",
      "pdf_source": "32. Mahesh Gupta v. Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "According to page 1 of the PDF \"32. Mahesh Gupta v. Registrar of Trade Marks.pdf\", the High Court of Delhi at New Delhi heard the case C.A.(COMM.IPD-TM) 143/2022 & I.A. 4245/2023. The appellant, Mahesh Gupta, opposed the registration of a device mark by Respondent 2 under class 32 for non-alcoholic drinks and beverages. The key dates mentioned are: \n\n- April 28, 1998: Respondent 2 filed Application No. 800324 for registration.\n- September 15, 2006: The appellant filed an opposition under Section 21 of the Trade Marks Act 1999.\n- April 15, 2008: Respondent 2 filed a counter statement.\n\nThe case was heard by Hon'ble Mr. Justice C. Hari Shankar, with the judgment delivered on March 2, 2023. The PDF provides details of the legal proceedings and arguments presented by the appellant and respondents. (Source: 32. Mahesh Gupta v. Registrar of Trade Marks.pdf, page 1)",
          "content": "Neutral Citation Number : 2023/DHC/001627 \nC.A.(COMM.IPD-TM) 143/2022 \n \nPage 1 of 9    \n \n$~1 \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.A.(COMM.IPD-TM) 143/2022 & I.A. 4245/2023 \n \nMAHESH GUPTA \n \n \n \n         ..... Appellant \nThrough: \nMs. \nRajeshwari \nH. \nand  \nMs.Swapnil Gaur, Advs. \n \n \n \n \n \nversus \n \n \nREGISTRAR OF TRADEMARKS AND ANR .... Respondents \nThrough: \nMs. \nSwathi \nSukumar, \nMr. \nNaveen Nagarjuna, Mr. Pratyush Rao and \nMr. Ritik Raghuvanshi, Adv. for R-2 \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C. HARI SHANKAR \n \n \n \n   J U D G M E N T (ORAL) \n% \n \n \n \n  02.03.2023 \n \n1. \nOn 28th April 1998, Respondent 2 filed Application No. 800324 \nfor registration of the device mark \n under class 32 in \nrespect of ―non-alcoholic drinks and beverages aerated water, beer and \nporter, syrups for making beverages essences‖.  \n \n2. \nOn 15th September 2006, the appellant filed an opposition under \nSection 21 of the Trade Marks Act 1999, opposing the request of \nRespondent 2 for registration of the aforesaid device mark. Notice on \nthe opposition was served on the Respondent 2, who filed a counter \nstatement by way of response to the opposition on 15th April 2008.  \nThe date on which the counter statement was served on the appellant \nis not immediately forthcoming. However, it is not in dispute that the \nappellant filed its evidence in support of the opposition under Rule \nDigitally Signed By:SUNIL\nSINGH NEGI\nSigning Date:04.03.2023\n16:11:50\nSignature Not Verified",
          "pdf_source": "32. Mahesh Gupta v. Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "According to page 2 of the PDF \"32. Mahesh Gupta v. Registrar of Trade Marks.pdf\", the appellant, Mahesh Gupta, filed an opposition under Rule 50(1) of the Trade Marks Rules 2002 on June 10, 2010. An application for extension of time to file evidence in support of the opposition was filed on June 11, 2010, acknowledging a delay of four months. The Deputy Registrar of Trade Marks held the opposition to be deemed abandoned under Rule 45(2) of the Trade Marks Rule 2017 on August 7, 2019. The appellant appealed to the Intellectual Property Appellate Board (IPAB) under Section 91 of the Trade Marks Act, which was later transferred to the High Court of Delhi due to the abolition of IPAB by The Tribunals Reforms Act 2021. The appeal was heard by the court with pleadings completed and arguments presented by counsel for both parties. (Source: 32. Mahesh Gupta v. Registrar of Trade Marks.pdf)",
          "content": "Neutral Citation Number : 2023/DHC/001627 \nC.A.(COMM.IPD-TM) 143/2022 \n \nPage 2 of 9    \n \n50(1)1 of the Trade Marks Rules 2002 (hereinafter referred to as ―the \n2002 Rules‖), on 10th June 2010.  On 11th June 2010, the appellant \nfiled an application for extension of time in filing the evidence in \nsupport of the opposition.  In the application, it was acknowledged \nthat the evidence was filed after a delay of four months, for which \nextension was sought in the application.  \n \n3. \nBy the following order dated 7th August 2019, the Deputy \nRegistrar of Trade Marks held the opposition filed by the appellant to \nbe deemed to have been abandoned under Rule 45(2)2 of the Trade \nMarks Rule 2017 (hereinafter referred to as ―the 2017 Rules‖) and \ndirected that the application would proceed further as per rules.  \n \n4. \nAggrieved thereby, the appellant has preferred the present \nappeal under Section 91 of the Trade Marks Act before the learned \nIntellectual Property Appellate Board (―the learned IPAB‖). \nConsequent to abolition of the learned IPAB by The Tribunals \nReforms Act 2021, the appeal stands transferred to this Court.  \n \n5. \nPleadings in the appeal have been completed and I have heard \nMs. Rajeshwari H., learned Counsel for the appellant and Ms. Swathi \nSukumar, learned Counsel for the Respondent 2 at length on the \nappeal. \n \n6. \n Though there are certain averments in the appeal regarding the \n                                          \n1 50. \nEvidence in support of opposition.— (1) Within two months from services on him of a copy of \nthe counterstatement or within such further period not exceeding one month in the aggregate thereafter as the \nRegistrar may on request allow, the opponent shall either leave with the Registrar, such evidence by way of \naffidavit as he may desire to adduce in support of his opposition or shall intimate to the Registrar and to the \napplicant in writing that he does not desire to adduce evidence in support of his opposition but intends to rely \non the facts stated in the notice of opposition. He shall deliver to the applicant copies of any evidence that he \nleaves with the Registrar under this sub-rule and intimate the Registrar in writing of such delivery. \n2 45. \nEvidence in support of opposition.—  (2) If an opponent takes no action under sub-rule (1) within \nthe time mentioned therein, he shall be deemed to have abandoned his opposition. \nDigitally Signed By:SUNIL\nSINGH NEGI\nSigning Date:04.03.2023\n16:11:50\nSignature Not Verified",
          "pdf_source": "32. Mahesh Gupta v. Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0006",
      "start_index": 3,
      "end_index": 4,
      "summary": "According to the PDF document \"Mahesh Gupta v. Registrar of Trade Marks.pdf\", the case involves an appeal by Mahesh Gupta against the decision of the Registrar of Trade Marks to treat his opposition to a trademark registration as abandoned. The dispute is examined under the Trade Marks Rules, 2002, which were in force at the time of the initial proceedings. \n\nThe court notes that the learned Deputy Registrar erred in law by passing the impugned order under the 2017 Rules, which repealed the 2002 Rules. The repeal does not prejudice the applicability of the 2002 Rules in this case, particularly with regards to the filing of evidence under Rule 50(1) of the 2002 Rules.\n\nThe court relies on a previous decision by Hon'ble Mr. Justice Budar Durrez Ahmed in Sunrider Corporation, U.S.A. v. Hindustan Lever Ltd, which examined the provisions of Rule 50 of the 2002 Rules. The rule states that evidence in support of an opposition must be filed within two months of the service of a copy of the counter-statement, with a possible extension of one month.\n\nThe key issue is whether the appellant's opposition can be deemed abandoned under Rule 50(1) of the 2002 Rules. The court must determine whether the learned Deputy Registrar was correct in treating the appellant's opposition as abandoned. The case is currently before the High Court of Delhi, with the appellant represented by Ms. Rajeshwari H. and Ms. Swapnil Gaur, and the respondents represented by Ms. Swathi Sukumar, Mr. Naveen Nagarjuna, Mr. Pratyush Rao, and Mr. Ritik Raghuvanshi. (Source: Mahesh Gupta v. Registrar of Trade Marks.pdf)",
      "pdf_source": "32. Mahesh Gupta v. Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "According to page 3 of the PDF \"32. Mahesh Gupta v. Registrar of Trade Marks.pdf\", the court is examining whether the Deputy Registrar was correct in treating the appellant's opposition to Respondent 2's application as abandoned. The proceedings began under the 2002 Rules, but the impugned order was passed on August 7, 2019, under the 2017 Rules. The court notes that Rule 158 of the 2017 Rules states that the repeal of the 2002 Rules is \"without prejudice to anything done under such rules before the coming into force of these rules\". This implies that the proceedings, including the filing of evidence, should still be governed by the 2002 Rules. The court is reviewing the decision of the Deputy Registrar in this context. (Source: 32. Mahesh Gupta v. Registrar of Trade Marks.pdf, page 3)",
          "content": "Neutral Citation Number : 2023/DHC/001627 \nC.A.(COMM.IPD-TM) 143/2022 \n \nPage 3 of 9    \n \nmerits of the respondent’s application seeking registration of the  \n device mark and on the merits of the appellant’s \nopposition to such registration, I do not deem it necessary to enter into \nthe meits of the matter, as the appellant’s objection was rejected by the \nlearned Deputy Registrar as abandoned. All that this Court has to see,  \ntherefore, is whether the learned Deputy Registrar was correct in her \ndecision to treat the appellant’s opposition to the application of \nRespondent 2 as abandoned.  \n \n7. \nI may observe, at the very outset, that the learend Deputy \nRegistrar has formally erred in law in passing the impugned order \nunder the 2017 Rules.  All proceedings before the learend Deputy \nRegistrar, save and except for the passing of the impugned order, on \n7th August  2019, took place when the 2002 Rules were in force. The \napplciation seeking registration, the oppostion thereto, the counter \nstatement filed by way of response to the oppositin and the filing of \nthe evidence in support of the opposition by the appellant along with \nthe application seeking condonation of delay, were all prior to coming \ninto force the 2017 Rules; in fact, much prior thereto.  \n \n8. \nRule 1583 of the 2017 Rules, even while repealing the 2002 \nRules, clearly holds that such repeal would be ―without prejudice to \nanything done under such rules before the coming into force of these \nrules‖.  In other words, the repeal of the 2002 Rules by the 2017 Rules \nwould, inter alia, be without prejudice to all proceedings which took \nplace in the present case, including the filing of the evidence in \nsupport of the opposition by the appellant which, admittedly, was \n                                          \n3 158. \nRepeal.— \nThe Trade Marks Rules, 2002, are hereby repealed without prejudice to \nanything done under such rules before the coming into force of these rules. \n \nDigitally Signed By:SUNIL\nSINGH NEGI\nSigning Date:04.03.2023\n16:11:50\nSignature Not Verified",
          "pdf_source": "32. Mahesh Gupta v. Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "According to page 4 of the PDF \"32. Mahesh Gupta v. Registrar of Trade Marks.pdf\", the court examines the applicability of Rule 50(1) of the 2002 Rules in the case of Mahesh Gupta v. Registrar of Trade Marks. The court refers to a previous decision by Hon'ble Mr. Justice Budar Durrez Ahmed in Sunrider Corporation, U.S.A. v. Hindustan Lever Ltd (2007) 143 DLT 148, which clarifies that evidence in support of an opposition to trade mark registration must be filed within two months of receiving the counter-statement, with a possible one-month extension. Failure to do so may result in the opposition being deemed abandoned. The court aims to determine whether the appellant's opposition can be treated as abandoned under Rule 50(1) of the 2002 Rules. (Source: PDF \"32. Mahesh Gupta v. Registrar of Trade Marks.pdf\", page 4)",
          "content": "Neutral Citation Number : 2023/DHC/001627 \nC.A.(COMM.IPD-TM) 143/2022 \n \nPage 4 of 9    \n \nunder Rule 50(1) of the 2002 Rules.  The repeal of the 2002 Rules by \nthe 2017 Rules cannot, therefore, prejudice the applicability of the \n2002 Rules, insofar as the issue of whether the evidence filed by the \nappellant under Rule 50(1) of the 2002 Rules could be taken on \nrecord, is concerned. \n \n9. \nThe dispute has, therefore, to be examined in the light of Rule \n50(1) of the 2002 Rules. What has to be seen, therefore, is whether the \nopposition of the appellant could be treated as having deemed to have \nbeen abandoned by applying Rule 50(1) of the 2002 Rules.    \n \n10. \nA coordinate Single Bench of this Court of Hon’ble Mr. Justice \nBudar Durrez Ahmed, as he then was, has examined this aspect in \ndetail in Sunrider Corporation, U.S.A. v. Hindustan Lever Ltd4. The \nrelevant passages from the said decision may be reproduced thus: \n \n―8. \nReading Rule 50, it is clear that the evidence by way of \naffidavit in support of an opposition to the registration of a trade \nmark has to be filed within two months of the service of a copy of \nthe counter-statement on the opponent. This period of two months \nis further extendable by a period of one month in the aggregate \nthereafter as the Registrar may on request allow. Clearly, in the \nfirst instance, the evidence affidavit has to be filed within two \nmonths of the receipt of a copy of the counter-statement. The \nRegistrar may extend this period by a further one month in the \naggregate if a request for the same is made in time. Sub-rule (2) of \nRule 50 makes it clear that if an opponent takes no action under \nSub-rule (1) within the time mentioned therein, he shall be deemed \nto have abandoned his opposition. It is also interesting to note that \nSub-rule (3) refers to the application for extension of the period of \none month mentioned in Sub-rule (1). It is also stipulated that such \nan application has to be made in Form TM-56 accompanied by the \nprescribed fee before the expiry of the period of two months \nmentioned therein. So, it is clear that a strict regimen has been \nprescribed for the filing of evidence by way of affidavit in support \nof an opposition. A plain reading of the provisions makes it \nabundantly clear that the evidence has to be filed within two \n                                          \n4 (2007) 143 DLT 148 \nDigitally Signed By:SUNIL\nSINGH NEGI\nSigning Date:04.03.2023\n16:11:50\nSignature Not Verified",
          "pdf_source": "32. Mahesh Gupta v. Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0010",
      "start_index": 5,
      "end_index": 7,
      "summary": "The legal document section from the PDF \"Mahesh Gupta v. Registrar of Trade Marks.pdf\" discusses the case C.A.(COMM.IPD-TM) 143/2022 in the High Court of Delhi. The appellant, Mahesh Gupta, is represented by Ms. Rajeshwari H. and Ms. Swapnil Gaur, while the respondents, Registrar of Trade Marks and another, are represented by Ms. Swathi Sukumar, Mr. Naveen Nagarjuna, Mr. Pratyush Rao, and Mr. Ritik Raghuvanshi.\n\nThe legal argument revolves around the interpretation of Rule 50(1) of the 2002 Rules, which prescribes a time limit for filing evidence in opposition to a trade mark registration application. The rule states that the evidence affidavit can be filed within two months, extendable by one month, making it a maximum of three months.\n\nMs. Rajeshwari H. attempts to distinguish the decision in Sunrider, relying on the judgment of the High Court of Gujarat in Wyeth Holdings Corpn. v. Controller General of Patents, Designs and Trade Marks, which held that Sub-rule (2) of Rule 50 is \"directory\" in nature. However, the court rejects this view, stating that accepting it would amount to re-writing the applicable statutory provisions. The court affirms that the words \"not exceeding one month\" in Rule 50(1) are mandatory, and any further extension would be in contravention of the rule.\n\nThe PDF document, \"Mahesh Gupta v. Registrar of Trade Marks.pdf\", provides the context for this legal proceeding, which includes the Neutral Citation Number: 2023/DHC/001627, and the date of signing, 04.03.2023. The case highlights the importance of adhering to statutory time limits in legal proceedings.",
      "pdf_source": "32. Mahesh Gupta v. Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 5",
          "node_id": "0007",
          "start_index": 5,
          "end_index": 5,
          "summary": "According to page 5 of the PDF \"32. Mahesh Gupta v. Registrar of Trade Marks.pdf\", the court discusses the timeline for filing evidence affidavits in trademark opposition cases. The rule prescribes a maximum of three months for filing, with an initial two-month period and a possible one-month extension. \n\nMs. Rajeshwari, the appellant's counsel, cites a Gujarat High Court judgment (Wyeth Holdings Corpn. v. Controller General of Patents, Designs and Trade Marks) to argue that Sub-rule (2) of Rule 50 should be considered \"directory\" rather than \"mandatory\". This means that the rule should be interpreted flexibly to serve the interest of justice, rather than being strictly adhered to. The Gujarat High Court judgment supports this interpretation, stating that declaring the rule as \"directory\" would not cause injustice or prejudice to any party. (Source: PDF page 5)",
          "content": "Neutral Citation Number : 2023/DHC/001627 \nC.A.(COMM.IPD-TM) 143/2022 \n \nPage 5 of 9    \n \nmonths in the first instance and, if an appropriate application for \nextension of time is made before the expiry of the period of two \nmonths and if such application is allowed by the Registrar, then \nlatest by a further month. In other words, under no circumstances \ncan the evidence affidavit be filed beyond the maximum three \nmonths prescribed under the said rule. In case the opponent has \nnot taken steps within the prescribed time, then there is no option \nleft with the Registrar but to deem that the opponent has \nabandoned his opposition.‖ \n(Emphasis Supplied) \n \n11. \nMs. Rajeshwari seeks, however, to distinguish the decision in \nSunrider4 essentially on two grounds.   She relies, in the first instance, \non the judgment of a learned Single Judge of the High Court of \nGujarat in Wyeth Holdings Corpn. v. Controller General of Patents, \nDesigns and Trade Marks5 , which holds, in paras 58 to 60 thus: \n―58.  \nIn view of the nature of the prayer sought for, there is no \nquestion of any alternative remedy being available to the \npetitioners. Having found the submissions made by the learned \nsenior counsel appearing for the petitioners with substance, the \nsame are accepted. There is no question of the petition being  \ndismissed on the ground of alternative remedy being available. \n59.  \nIn view of the aforesaid discussion, in view of the settled \nlegal position that subordinate legislation cannot travel beyond the \nscope of main legislation and having regard to the provisions \nof Section 131 which provides for extension of time, this Court has \nonly two options, either to declare Sub-rule (2) of Rule 50 as ultra \nvirus the Act or by employing principle of 'harmonious \nconstruction', to read Sub-rule (2) of Rule 50 to be a 'directory' one. \n60. \nIn the considered opinion of this Court, there is no reason \nmuch less a compelling reason for which the first option should be \nexercised and the 'Rule' be struck down by holding it to be \n'mandatory'. As against that, it is a well settled position of law that \nprinciple of 'harmonious construction' should be pressed into \nservice and Sub-rule (2) of Rule 50 be read as 'directory'. This \nCourt is of the opinion that by declaring Sub-rule (2) of Rule 50, \n'directory', no injustice or prejudice is going to be caused to any \nparty. On the contrary, it will be serving the interest of justice. \nHence, second option is exercised. Sub-rule (2) of Rule 50 is held \nto be 'directory' in nature.‖ \n \n                                          \n5 2006 SCC OnLine Guj 620 \nDigitally Signed By:SUNIL\nSINGH NEGI\nSigning Date:04.03.2023\n16:11:50\nSignature Not Verified",
          "pdf_source": "32. Mahesh Gupta v. Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "According to page 6 of the PDF \"32. Mahesh Gupta v. Registrar of Trade Marks.pdf\", the court discusses the interpretation of Rule 50(1) of the 2002 Rules. The judge disagrees with the view expressed in Wyeth, stating that the rule is peremptory and only allows for a one-month extension. The judge argues that granting an extension beyond this period would be against the rule. Rule 50(2) is cited, which states that if the opponent takes no action within the specified time period, they shall be deemed to have abandoned their opposition. The court emphasizes that this abandonment is a statutory consequence of failing to act within the given time frame. The case is C.A.(COMM.IPD-TM) 143/2022, with Mahesh Gupta as the appellant and the Registrar of Trade Marks as the respondent. The decision was signed by Sunil Singh Negi on March 4, 2023.",
          "content": "Neutral Citation Number : 2023/DHC/001627 \nC.A.(COMM.IPD-TM) 143/2022 \n \nPage 6 of 9    \n \n12. \nWyeth5, she submits, was not noticed in Sunrider4.  \n \n13. \nWith greatest respect, I am unable to subscribe to the view \nexpressed by the High Court of Gujarat in Wyeth5. \n \n14. \nTo my mind, the view espoused in para 60 of the decision in \nWyeth5, if accepted, would amount to no less than re-writing of the \napplicable statutory provisions. Rule 50(1) of the 2002 Rules is even \nmore peremptory, in its application, than Rule 48 of the succeeding \n2017 Rules. While providing a period of two months to an opponent \nopposing an application seeking registration of a trade mark file its \nevidence after receipt of the counter-statement of the applicant, Rule \n50(1) empowers the Registrar to extend the said period only upto one \nmonth, specifically using the words ―not exceeding one month‖. The \nwords ―not exceeding one month‖ are mandatory in their import.  The \nlearned Registrar could not, therefore, grant extension of more than \none month beyond the period of two months from the date of service, \non the opponent opposing the registration of a mark, of a copy of the \ncounter statement.  Grant of any further extension would clearly be in \nthe teeth of Rule 50(1). \n \n15. \nRule 50(2) is even clearer in its import.  It states, in \nunambiguous terms, that, if the opponent took no action under Rule \n50(1) within the time period mentioned therein – meaning two months \nextendable by a maximum period of one month – he shall be deemed \nto have abandoned his opposition.  \n \n16. \nDeemed abandonment of the opposition, therefore, follows as \nan inexorable statutory sequitur to the failure, on the part of the \nDigitally Signed By:SUNIL\nSINGH NEGI\nSigning Date:04.03.2023\n16:11:50\nSignature Not Verified",
          "pdf_source": "32. Mahesh Gupta v. Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 7",
          "node_id": "0009",
          "start_index": 7,
          "end_index": 7,
          "summary": "According to page 7 of the PDF \"32. Mahesh Gupta v. Registrar of Trade Marks.pdf\", the court discusses the deemed abandonment of a trade mark opposition. If the opponent fails to file evidence in support of the opposition within three months from the receipt of the counter-statement, the opposition is deemed abandoned by operation of the statute. The court rejects the view that an order is required for deemed abandonment, citing Rule 50(1) of the 2002 Rules. The court also considers Rule 105 and Section 131 of the 1999 Act, which allow for the extension of time, but notes that this does not support the opponent's argument. The case is Mahesh Gupta v. Registrar of Trade Marks, with Neutral Citation Number 2023/DHC/001627.",
          "content": "Neutral Citation Number : 2023/DHC/001627 \nC.A.(COMM.IPD-TM) 143/2022 \n \nPage 7 of 9    \n \nopponent, in filing the evidence in support of the opposition within the \nperiod envisaged in Rule 50(1).  Deemed abandonment, therefore, \noccurs by operation of the statute. Even sans any judicial or quasi-\njudicial order, therefore, if the opponent opposing the application \nseeking grant of the trade mark fails to file its evidence in support of \nthe opposition within a maximum of three months from the receipt, by \nit, of the counter-statement of the trade mark applicant, the opposition \nwould ipso facto be deemed to be abandoned irrespective of whether \nany order to that effect is, or is not, passed by any judicial or quasi-\njudicial forum. \n \n17. \nThe view expressed in Wyeth5, if accepted, would amount to \nrendering largely otiose Rule 50(2) of the 2002 Rules. With respect, \ntherefore, it is not possible to accept the said view.  \n \n18. \nMs. Rajeshwari also sought to place reliance on Rule 1056 of \nthe 2002 Rules read with Section 1317 of the 1999 Act. \n \n19. \nThough these provisions have been considered by the \ncoordinate Bench in Sunrider4, Ms. Rajeshwari advances a \nsubmission which, according to her, was not advanced in Sunrider4 \nand was not, therefore, considered.  She draws attention to the \n                                          \n6 105. \nExtension of time.— \n(1) An application for extension of time under Section 131 (not being \na time expressly provided in the Act or prescribed by Rule 79 or by sub-rule (4) of Rule 80 or a time for the \nextension of which provision is made in the rules) shall be made in Form TM-56. \n(2) Upon an application made under sub-rule (1) the Registrar, if satisfied that the circumstances are such as \nto justify the extension of the time applied for, may, subject to the provisions of the rules where a maximum \ntime limit is prescribed and subject to such conditions as he may think fit to impose, extend the time and \nnotify the parties accordingly and the extension may be granted though the time for doing the act or taking the \nproceeding for which it is applied for has already expired. \n7131.  \nExtension of time.— \n(1) If the Registrar is satisfied, on application made to him in the \nprescribed manner and accompanied by the prescribed fee, that there is sufficient cause for extending the time \nfor doing any act (not being a time expressly provided in this Act), whether the time so specified has expired \nor not, he may, subject to such conditions as he may think fit to impose, extend the time and inform the \nparties accordingly. \n(2) Nothing in sub-section (1) shall be deemed to require the Registrar to hear the parties before disposing of \nan application for extension of time, and no appeal shall lie from any order of the Registrar under this section. \n \nDigitally Signed By:SUNIL\nSINGH NEGI\nSigning Date:04.03.2023\n16:11:50\nSignature Not Verified",
          "pdf_source": "32. Mahesh Gupta v. Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0013",
      "start_index": 8,
      "end_index": 9,
      "summary": "According to the PDF document \"Mahesh Gupta v. Registrar of Trade Marks.pdf\", a legal proceeding took place in the High Court of Delhi at New Delhi (Case No. C.A.(COMM.IPD-TM) 143/2022 & I.A. 4245/2023). The appellant, Mahesh Gupta, was represented by Ms. Rajeshwari H. and Ms. Swapnil Gaur, while the respondents, Registrar of Trade Marks and another, were represented by Ms. Swathi Sukumar, Mr. Naveen Nagarjuna, Mr. Pratyush Rao, and Mr. Ritik Raghuvanshi.\n\nThe court decision, dated March 2, 2023, and digitally signed on March 4, 2023, upheld the impugned order dated August 7, 2019. The appeal was dismissed, and the opposition of the appellant was deemed abandoned under Rule 50(1) of the 2002 Rules, not Rule 45(1) of the 2017 Rules.\n\nThe court rejected the appellant's submission that Rule 105(1) allowed for flexibility in the time provision, citing that the rule's parenthesized words restrict its applicability. The judge concurred with the views expressed in a previous case, Sunrider, which covered the issue in detail. The decision was made by C. Hari Shankar, J., with a neutral citation number of 2023/DHC/001627. The PDF document provides the full text of the court decision, including the arguments, facts, and decisions. (Source: Mahesh Gupta v. Registrar of Trade Marks.pdf)",
      "pdf_source": "32. Mahesh Gupta v. Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 8",
          "node_id": "0011",
          "start_index": 8,
          "end_index": 8,
          "summary": "According to page 8 of the PDF \"32. Mahesh Gupta v. Registrar of Trade Marks.pdf\", the court discusses the applicability of Rule 105 to the case. The appellant's counsel, Ms. Rajeshwari, argues that the rule only restricts inflexibility to cases where time is provided in the Act or prescribed by Rule 79 or Rule 80(4). However, the court rejects this argument, citing the inclusion of \"or a time for the extension of which provision is made in the rules\" in the parenthesized words. The court references Rule 50(1), which provides for extension of time, and rules out the applicability of Rule 105. The court ultimately upholds the Deputy Registrar's decision to deem the opposition abandoned under Rule 50(1) of the 2002 Rules. The judgment was signed by Sunil Singh Negi on March 4, 2023. (Source: \"32. Mahesh Gupta v. Registrar of Trade Marks.pdf\")",
          "content": "Neutral Citation Number : 2023/DHC/001627 \nC.A.(COMM.IPD-TM) 143/2022 \n \nPage 8 of 9    \n \nparenthesized words in Rule 105(1) reading ―not being a time \nexpressly provided in the Act or prescribed by rule 79 or by sub-rule \n(4) of rule 80 or a time for the extension of which provision is made in \nthe rules‖. According to Ms. Rajeshwari, the import of the afore-\nextracted parenthesized words in Rule 105(1) was to restrict the \ninflexibility of the provision only to cases where the time was \nprovided in the Act or prescribed by Rule 79 or Rule 80(4).   \n \n20. \nThe submission is obviously unacceptable, as the parentheses \nalso include the words ―or a time for the extension of which provision \nis made in the rules‖. As already noted, Rule 50(1) provides for \nextension of time and curtails the maximum period by which such \nextension could be granted to one month.  The provision for extension \nof time as contained in Rule 50(1), therefore, rules out the \napplicability of Rule 105 to the facts of the present case.  \n \n21. \nOn all other aspects, the coordinate Bench in Sunrider4, having \nexamined the issue in law in detail, this Bench does not deem it \nnecessary to reinvent the wheel. I express my respectful concurrence \nwith the views expressed in the passages from Sunrider4 extracted \nhereinabove which, unfortunately for the appellant, cover the case \nagainst it on all fours.  \n \n22. \nI see no reason, therefore, to differ with the ultimate decision, of \nthe Deputy Registrar, to deem the opposition of the appellant as \nhaving been abandoned.  The deemed abandonment would, however, \nbe under Rule 50(1) of the 2002 Rules, and not Rule 45(1) of the 2017 \nRules.  \n \nDigitally Signed By:SUNIL\nSINGH NEGI\nSigning Date:04.03.2023\n16:11:50\nSignature Not Verified",
          "pdf_source": "32. Mahesh Gupta v. Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 9",
          "node_id": "0012",
          "start_index": 9,
          "end_index": 9,
          "summary": "According to page 9 of the PDF \"32. Mahesh Gupta v. Registrar of Trade Marks.pdf\", the court's decision is as follows: \nThe impugned order dated 7th August 2019 is upheld with a modification. The appeal, C.A.(COMM.IPD-TM) 143/2022, is dismissed. \nThe judgment was delivered by C. Hari Shankar, J. on March 2, 2023. \nThe case involved Mahesh Gupta (Appellant) and Registrar of Trade Marks and another (Respondents). \nThe PDF source provides the Neutral Citation Number: 2023/DHC/001627. \nThe legal proceedings were represented by various advocates, including Ms. Rajeshwari H. and Ms. Swapnil Gaur for the Appellant, and Ms. Swathi Sukumar, Mr. Naveen Nagarjuna, Mr. Pratyush Rao, and Mr. Ritik Raghuvanshi for the Respondents.",
          "content": "Neutral Citation Number : 2023/DHC/001627 \nC.A.(COMM.IPD-TM) 143/2022 \n \nPage 9 of 9    \n \n23. \nSubject to that modification, the impugned order dated 7th \nAugust 2019 is, therefore, upheld.  \n \n24. \nThe appeal is dismissed. \n \n \n \nC. HARI SHANKAR, J. \n \nMARCH 2, 2023 \n \ndsn \n \nDigitally Signed By:SUNIL\nSINGH NEGI\nSigning Date:04.03.2023\n16:11:50\nSignature Not Verified",
          "pdf_source": "32. Mahesh Gupta v. Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-15T18:33:52.250291",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}