{
  "doc_name": "33. Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks",
  "pdf_source": "33. Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf",
  "metadata": {
    "document_name": "33. Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks",
    "source_pdf": "33. Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf",
    "judges": [
      "C.HARI SHANKAR JUDGMENT(ORAL) % 01.02.2023 1."
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "143/2021",
      "143/2021",
      "143/2021",
      "143/2021",
      "143/2021",
      "143/2021",
      "143/2021",
      "143/2021",
      "143/2021",
      "143/2021",
      "143/2021",
      "143/2021",
      "143/2021",
      "143/2021"
    ],
    "dhc_numbers": [
      "2023/DHC/000729",
      "2023/DHC/000729",
      "2023/DHC/000729",
      "2023/DHC/000729",
      "2023/DHC/000729",
      "2023/DHC/000729",
      "2023/DHC/000729",
      "2023/DHC/000729",
      "2023/DHC/000729",
      "2023/DHC/000729",
      "2023/DHC/000729",
      "2023/DHC/000729",
      "2023/DHC/000729"
    ],
    "ia_numbers": [],
    "decision_date": "4 February, 2021",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [],
    "defendants": [],
    "appellants": [
      "Manu Garg",
      "Ratan Behari Agarwal"
    ],
    "respondents": [
      "Registrar of Trade Marks"
    ],
    "plaintiff_advocates": [],
    "defendant_advocates": [],
    "appellant_advocates": [
      "Mr. M.K. Miglani"
    ],
    "respondent_advocates": [
      "Mr. Harish Vaidyanathan Shankar",
      "Mr. Srish Kumar Mishra",
      "Mr. Sagar Mehlawat",
      "Mr. Alexander Mathai Paikaday"
    ],
    "damages_claimed": null,
    "damages_awarded": null,
    "key_issues": [
      "The appellant's application for registration of the word mark \"COCK\" under Class 28 of the NICE classification was rejected by the learned Senior Examiner of Trademarks.",
      "The rejection was based on the existence of two identical marks registered for similar or allied goods, belonging to Mr. A.S. Chinna Nadar and Mr. Lokesh Kataria.",
      "The appellant argued that the goods for which the \"COCK\" mark was sought to be registered were distinct from the goods for which the existing marks were registered.",
      "The existence of a prior registered device mark \"COCK\" for \"amorces or paper caps for toy pistols\" was cited as a ground for rejecting the appellant's application.",
      "The appellant contended that the water and colour pistols, guns, and sprayers made by them were toys and had no connection with fireworks or guns, despite their similar shape.",
      "The learned Senior Examiner's objection was based on the similarity between the goods, despite the appellant's argument that the goods were different in substance.",
      "The rejection of the appellant's application was appealed, with the appellant submitting written submissions and arguing that the learned Senior Examiner's objection was misconceived.",
      "The respondent, the Registrar of Trademarks, filed written submissions in response to the appeal, and the matter was heard by the High Court of Delhi.",
      "The court considered the distinction between the goods for which the \"COCK\" mark was sought to be registered and the goods for which the existing marks were registered, in determining whether to allow the appeal."
    ],
    "decision_summary": "**Case Summary: Manu Garg and Ratan Behari Agrawal vs. Registrar of Trade Marks**\n\n**Background:**\n\nThe appellants, Manu Garg and Ratan Behari Agrawal, filed an application (No. 3757855) to register the word mark \"COCK\" under Class 28 of the NICE classification for \"water and colour pistols, water and colour guns, water and colour sprayers, being toys included in Class 28\". The application was rejected by the Senior Examiner of Trade Marks, citing two existing marks that were identical and used for similar or allied goods. The rejection was based on the marks registered in favor of Mr. A.S. Chinna Nadar (Chinna Nadar) and Mr. Lokesh Kataria.\n\n**Legal Issues:**\n\n1. Whether the mark \"COCK\" can be registered for water and color pistols, guns, and sprayers under Class 28, given the existing registrations of identical marks for similar or allied goods.\n2. Whether the goods for which the appellant seeks registration (water and color pistols, guns, and sprayers) are similar or allied to the goods for which the existing marks are registered (amorces or paper caps for toy pistols).\n\n**Arguments:**\n\nThe appellant argued that:\n\n1. The existing mark registered in favor of Chinna Nadar is a device mark, which clearly indicates that the registration is for amorces and not for water and color pistols, guns, and sprayers.\n2. The goods for which the appellant seeks registration (water and color pistols, guns, and sprayers) have nothing in common with amorces, which are used in toy pistols to produce a firing sound.\n3. The appellant's goods are used to spray colors during festivals like Holi, whereas amorces are used in toy pistols to produce a firing sound.\n\nThe respondent (Registrar of Trade Marks) argued that:\n\n1. The existing mark registered in favor of Chinna Nadar is identical to the mark applied for by the appellant.\n2. The goods for which the appellant seeks registration are similar or allied to the goods for which the existing mark is registered.\n\n**Court Findings:**\n\nThe court noted that the objection raised by the Senior Examiner was based on the existing registration of the mark \"COCK\" in favor of Chinna Nadar for \"amorces or paper caps for toy pistols\". The court observed that the appellant's goods (water and color pistols, guns, and sprayers) are distinct from amorces, which are used in toy pistols to produce a firing sound.\n\n**Decision:**\n\nThe court allowed the appeal, setting aside the order of the Senior Examiner rejecting the appellant's application for registration of the mark \"COCK\" under Class 28. The court held that the appellant's goods (water and color pistols, guns, and sprayers) are not similar or allied to the goods for which the existing mark is registered (amorces or paper caps for toy pistols). The court directed the Registrar of Trade Marks to reconsider the appellant's application for registration of the mark \"COCK\" under Class 28.\n\nThe decision suggests that the court recognized the distinctiveness of the appellant's goods and the lack of similarity between the appellant's goods and the goods for which the existing mark is registered. The court's decision allows the appellant to proceed with the registration of the mark \"COCK\" under Class 28, subject to further consideration by the Registrar of Trade Marks.",
    "legal_precedents": [
      "AIR 2001 SC 1952"
    ],
    "full_text": "\n--- PAGE 1 ---\nNeutral Citation Number : 2023/DHC/000729 \nC.A.(COMM.IPD-TM) 143/2021  \nPage 1 of 13 \n \n$~3(Original) \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.A.(COMM.IPD-TM) 143/2021 \n \nMANU GARG AND  \nRATAN BEHARI AGRAWAL \n \n  ..... Appellant \n \n \n \n \nThrough: \nMr. M.K. Miglani, Adv.  \n \n \n \n \n \nVersus \n \n \nREGISTRAR OF TRADE MARKS  \n      ..... Respondent \nThrough: \nMr. \nHarish \nVaidyanathan \nShankar, CGSC with Mr. Srish Kumar \nMishra, Mr. Sagar Mehlawat and Mr. \nAlexander Mathai Paikaday, Advs. \n \nCORAM: \n \nHON'BLE MR. JUSTICE C.HARI SHANKAR \n \n \n \n \n    JUDGMENT(ORAL) \n% \n \n \n           01.02.2023 \n \n1. \nThe appellant is aggrieved by order dated 4th February 2021, \npassed by the learned Senior Examiner of Trademarks in the office of \nthe Registrar of Trademarks, whereby Application No. 3757855 of the \nappellant has been rejected by the learned Senior Examiner. \n \n2. \nWritten submissions by way of response to the appeal have \nbeen filed by the respondent. I have heard Mr. Miglani, learned \nCounsel for the appellant and Mr. Harish Vaidyanathan Shankar, \nlearned Counsel for the respondent. \n \nFacts \n \n3. \nApplication No. 3757855 was submitted by the appellant for \nregistration of the word mark “COCK” under Class 28 of the NICE \nclassification as adopted by Rule 20 of the Trademarks Rules 2017, \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:02.02.2023\n17:45:24\nSignature Not Verified\n\n--- PAGE 2 ---\nNeutral Citation Number : 2023/DHC/000729 \nC.A.(COMM.IPD-TM) 143/2021  \nPage 2 of 13 \n \nfor “water and colour pistols, water and colour guns, water and colour \nsprayers, being toys included in Class 28”. Mr. Miglani points out that \nthe goods in respect of which the impugned mark was sought to be \nregistered were pistols in the nature of “pichkaris” (water guns), used \nin festivals such as Holi for spraying colours. He submits that, even if \nakin in shape to guns, the water and colour pistols made by the \nappellant have nothing in common with fireworks, with which, \ntraditionally, guns are associated.  They, therefore, are guns merely in \nform, not in substance.   \n \n4. \nConsequent to filing of the aforesaid application by the \nappellant, the learned Senior Examiner in the office of the Registrar of \nTrademarks, vide First Examination Report (FER) dated 13th March \n2018, objected to the grant of registration for the appellants COCK \nmark, citing two marks which, according to him, were identical and \nused for goods which were similar or allied to the goods in respect of \nwhich registration was sought by the appellant.  The proprietors, in \nwhose favour the said marks were registered, were Mr. A.S. Chinna \nNadar (“Chinna Nadar”, hereinafter), Sivakasi and Mr. Lokesh \nKataria, Gurgaon. \n \n5. \nOf these, at the time when the FER was issued, the COCK mark \nof Mr. Lokesh Kataria was under objections. Subsequently, the \napplication of Mr. Kataria stands rejected by the learned Registrar.  As \nsuch, the objection of the learned Senior Examiner, predicated on the \nCOCK registration granted to Chinna Nadar alone survives for \nconsideration.  This position has already stands noted in the order \ndated 23rd May 2022 passed in the present proceedings. \n \n6. \nOn receiving the aforesaid FER, the appellant, vide reply dated \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:02.02.2023\n17:45:24\nSignature Not Verified\n\n--- PAGE 3 ---\nNeutral Citation Number : 2023/DHC/000729 \nC.A.(COMM.IPD-TM) 143/2021  \nPage 3 of 13 \n \n2nd April 2018, submitted that the objection of the learned Senior \nExaminer was misconceived, as the COCK brand registered in favour \nof Chinna Nadar was for “amorces or paper caps for toy pistols”, \nwhereas the appellant was seeking registration of the COCK mark for \nwater and colour pistols, guns and sprayers used to spray colours \nduring festivals such as Holi.  It was also pointed out that the mark \nwhich stood registered in favour of Chinna Nadar was the device mark \n which clearly indicated that the registration was for amorces \nand for no other goods. The registration sought by the appellant was, \non the other hand, for toy pistols used to spray colours, which had \nnothing in common with amorces.  An “amorce”, as Mr. Miglani \npoints out from the dictionary, is a percussion cap for a toy pistol. \nElsewhere, the expression “amorce” is defined as “a firework which is \na percussion cap designed for use in toys, which comprises of paper \nenvelope containing a dot of impact sensitive pyrotechnic composition \nand which forms part of a roll”. \n \n7. \nI may note, here, that, in India, such rolls, which are fitted in toy \npistols, are often used by children on the occasion of festivals such as \nDiwali. These rolls are often mounted on pistols between the striking \nsurface and the body of the pistol so that, when the pistol is cocked \nand fired, due to the impact of the strike, a small spark is emitted with \na noise imitative of a bullet being fired.  Amorces are available in rolls \nor in individual pieces.   \n \n8. \nThe appellant’s objection was not accepted by the learned \nSenior Examiner who has, by the impugned order dated 4th February \n2021, rejected the appellant’s application.  The impugned order reads \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:02.02.2023\n17:45:24\nSignature Not Verified\n\n--- PAGE 4 ---\nNeutral Citation Number : 2023/DHC/000729 \nC.A.(COMM.IPD-TM) 143/2021  \nPage 4 of 13 \n \nthus: \n“Instant mark is phonetically and visually identical to the \nconflicting marks which is mentioned in the search report and also \nthey are well in prior use in respect of the similar nature of goods \nwhich sought by the applicant. The applicant is the well subsequent \nuser among the conflicting mark user period. In view of these \ngrounds, the Tribunal has opined that the applicant has deliberately \nchosen the subject mark in an effort to ride upon the goodwill and \nreputation of the conflicting marks. Applicant has no bona fide \nadoption of the subject mark in respect of the applied goods. \nFurther, the allowance of the subject mark is patently mala fide \nsince the mark has been dishonestly adopted by the applicant hence \nthe applicant cannot claim to be the proprietor of the subject mark \nunder Section 18(1) of the Act. Allowance of the subject mark is \nadversely affecting the interest of the public; it would lead to \nconfusion as it is more than likely, due to imperfect recollection \nthat the average buyer may confuse the applicant’s mark “COCK” \nas the conflicting owner’s product sold under “COCK”. In view of \nsuch similarities between the nature of the marks and their goods, \nthe applicant’s trade channel and counters, there exists a strong \nlikelihood of confusions on the part of the consuming public, \nincluding an association, as they are likely to assume and confuse \nthat the applicant’s goods are connected or otherwise associated \nwith the conflicting marks goods, when no such connection exists. \nConsequently, the members of the trade would no doubt, be under \nthe mistaken belief that the applicant’s goods originate from the \nconflicting mark or that they have some trade connection or \naffiliation thereby causing irreparable loss and damage not only to \nthe conflicting mark trade and business but also suiting erosion of \ndistinctiveness hard earned by the conflicting marks. \n \nIn addition to the facts of the subject application, I want to \ndiscuss the land mark case of Cadila Health Care Ltd. v. Cadila \nPharmaceuticals1 wherein the Supreme Court has stated that in an \naction for passing off on the basis of unregistered trade mark \ngenerally the following factors have to be considered for deciding \nthe question of deceptive similarity of marks: \n \n(a) \nThe nature of the marks i.e. whether the marks \nare word marks or label marks or composite marks i.e. \nboth words and label marks \n \n(b) \nThe degree of resemblances between the marks, \nphonetically similar and hence similar in idea. \n \n(c) \nThe nature of the goods in respect or which \nthey are used as trade marks. \n \n(d) \nThe similarity in the nature, character and \n                                          \n1 AIR 2001 SC 1952 \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:02.02.2023\n17:45:24\nSignature Not Verified\n\n--- PAGE 5 ---\nNeutral Citation Number : 2023/DHC/000729 \nC.A.(COMM.IPD-TM) 143/2021  \nPage 5 of 13 \n \nperformance of the goods or the rival traders. \n \n(e) \nThe class of purchasers who are likely to buy \nthe goods bearing the marks they require, on their \neducation and intelligence and a degree of care they are \nlikely to exercise in purchasing and or using the goods. \n \n(f) \nThe mode of purchasing the goods or placing \norders for the goods, and \n \n(g) \nAny other surrounding circumstances which \nmay be relevant in the extent of dissimilarity between \nthe competing marks. \n \nWeightage to be given to each of the aforesaid factors \ndepends upon facts of each case and the same weightage cannot be \ngiven to each factor in every case. \n \nBased upon the Supreme Court guidelines, the above \nmentioned seven factors are obviously applicable to this case. In \norder to avoid the opposition to the registration as well as passing \noff actions against the subject mark, the Tribunal is not ready to \naccept the subject mark for journal publication. \n \nIn this position, I would like to enlighten the object of the \nTrade Marks Act, 1999. The said object is to provide for \nregistration and better protection of trade marks for goods and \nservices and for the prevention of the use of fraudulent marks. If \nthe subject mark is allowed for registration, the object of the Trade \nMarks Act, 1999 would be jeopardized and the purity of the \nRegister will be affected. \n \nIn view of the above said reasons, the Trade Mark \nApplication is refused under sections 11(1)(a) and (b) of the Trade \nMarks Act, 1999.” \n \nRival Contentions \n \n9. \nMr. Miglani submits that the impugned order is misconceived. \nThe finding of the learned Senior Examiner that the use, of the COCK \nmark registered in favour of Chinna Nadar was for goods which were \nsimilar to those in respect of which registration was being sought by \nthe appellant is, he submits, erroneous on facts.  The goods in respect \nof which the appellant was seeking registration, and the goods in \nrespect of which the COCK brand stood registered in favour of  \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:02.02.2023\n17:45:24\nSignature Not Verified\n\n--- PAGE 6 ---\nNeutral Citation Number : 2023/DHC/000729 \nC.A.(COMM.IPD-TM) 143/2021  \nPage 6 of 13 \n \nChinna Nadar, he submits, are completely different.  \n \n10. \nIn fact, submits Mr. Miglani, the appellant stands registered for \nuse of the COCK brand for colours since 1992.  The appellant had \nearlier been issued a legal notice dated 19th February 2018 by Sri \nKaliswari Fireworks, of which Chinna Nadar was admittedly the \nDirector, objecting to the use, by the appellant, of its COCK label.  \nThe appellant had replied to the said legal notice on 17th March 2018, \nsubmitting that, whereas the appellant’s COCK mark was used for \nHoli colours, gulal and like goods, Chinna Nadar’s mark was used for \nfireworks, sparklers, crackers, ground wheels, rockets, colour matches \netc. Mr. Miglani points out that, on the said reply being submitted by \nhis client, Sri Kaliswari Fireworks had, by its communication dated \n30th January 2019, expressed satisfaction with the reply of the \nappellant. \n \n11. \nThe goods in respect of which the appellant was now seeking \nregistration of the COCK brand are, submits Mr. Miglani, goods \nwhich are used for spraying the very colours in respect of which the \nCOCK brand already stands registered in the appellant’s favour since \n1992.  Chinna Nadar has already expressed his satisfaction with the \nuse of the said mark by the appellant for colours.  As such, he submits, \nthe learned Senior Examiner acted unreasonably in refusing \nregistration to the appellant, for the mark “COCK” in respect of water \nand colour pistols, guns and sprayers, under Class 28. \n \n12. \nMr. Vaidyanathan, learned Counsel for the respondent, on the \nother hand, supports the impugned order.  He submits that the COCK \nmark registered in favour of Mr. A.S. Chinna Nadar is also used for \ntoy pistols.  The mere fact that toy pistols in which the said amorces \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:02.02.2023\n17:45:24\nSignature Not Verified\n\n--- PAGE 7 ---\nNeutral Citation Number : 2023/DHC/000729 \nC.A.(COMM.IPD-TM) 143/2021  \nPage 7 of 13 \n \nwere used, were normally used in Diwali, whereas the toy pistols for \nwhich the appellant was seeking registration are used in Holi and like \nfestivals, he submits, cannot make a substantial difference or justify \ninterference with the impugned order which is well-reasoned.  He \nsubmits that the goods in respect of which registration was being \nsought by the appellant, and the goods in respect of which the COCK \nbrand was registered in favour of Chinna Nadar were both used in \nfestival celebrations.  As such, he submits that both the items would \nbe available from similar small shops and that it was a matter of \ncommon knowledge that festivals such as Durga Pooja, spraying of \ncolours and fireworks both took place.  As such, Mr. Vaidyanathan \nsubmits that the learned Senior Examiner cannot be faulted in refusing \nregistration to the appellant’s mark. \n \nAnalysis \n \n13. \nI have heard learned Counsel and perused the material on \nrecord. \n \n14. \nSection 11 of the Trade Marks Act provides “relative grounds \nfor refusal of registration”, as against “absolute grounds for refusal” \nenvisaged by Section 9.  The grounds for refusal, contained in Section \n11, essentially relate to earlier marks registered in favour of someone \nelse, or for which an application is pending with the office of the \nRegistrar of Trademarks.  We are concerned with Section 11(1)2. \n                                          \n2 11.  \nRelative grounds for refusal of registration. –  \n(1)  \nSave as provided in Section 12, a trade mark shall not be registered if, because of –  \n(a)  \nits identity with an earlier trade mark and similarity of goods or services \ncovered by the trade mark; or \n(b)  \nits similarity to an earlier trade mark and the identity or similarity of the goods \nor services covered by the trade mark, \nthere exists a likelihood of confusion on the part of the public, which includes the likelihood of \nassociation with the earlier trade mark. \n \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:02.02.2023\n17:45:24\nSignature Not Verified\n\n--- PAGE 8 ---\nNeutral Citation Number : 2023/DHC/000729 \nC.A.(COMM.IPD-TM) 143/2021  \nPage 8 of 13 \n \n15. \nSection 11(1)(a) prohibits registration of a trademark which is \nidentical to an earlier trademark and used in respect of similar goods \nor services, whereas Section 11(1)(b) prohibits registration of a \ntrademark which is similar to an earlier trademark and used in respect \nof identical or similar goods or services.  In either case, there must, \nadditionally, exist a likelihood of confusion on the part of the public, \nfor registration to be refused under Section 11(1). The provision also \nclarifies that “confusion” would include likelihood of association with \nthe earlier trademark. \n \n16. \nHaving heard learned Counsel for both sides and applied my \nmind thereto, I am unable to subscribe to the view of the learned \nSenior Examiner that the goods, in respect of which registration of the \nCOCK word mark was being sought by the appellant, were similar to \nthe goods in respect of which the COCK device mark stood registered \nin favour of Chinna Nadar.  Mr Vaidyanathan’s submission that toy \npistols are toy pistols, I feel, oversimplifies the issue.  The “guns”, or \n“pistols”, for which the appellant sought registration of the COCK \nmark, are guns or pistols merely in form, not in substance.  They emit \nneither heat nor light.  They are not, therefore, fireworks in any sense \nof the expression.  They emit – if one may use the expression – not \nfire, but its antithesis; water.  A gun which sprays water and a gun \nwhich emits a spark and, therefore, releases heat and light are about as \nalike as chalk and cheese.  The fact that they may both be used on \nsimilar occasions does not make them like, similar, or allied, even in \nordinary parlance.   \n \n17. \nThe appellant seeks registration of the COCK word mark.  \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:02.02.2023\n17:45:24\nSignature Not Verified\n\n--- PAGE 9 ---\nNeutral Citation Number : 2023/DHC/000729 \nC.A.(COMM.IPD-TM) 143/2021  \nPage 9 of 13 \n \nChinna Nadar holds a registration for the \n device mark.  \nChinna Nadar’s mark is a composite device mark which includes, \napart from the words “COCK BRAND”, the word “AMORCES”.   \n \n18. \nBesides, Chinna Nadar’s registration was specifically for \n“amorces or paper caps for toy pistols”.  As such, the mark was not \neven registered for toy pistols per se, but only for amerces used in toy \npistols.  The appellant’s request for registration could not, therefore, \nhave been refused on the ground that the COCK brand stood \nregistered in favour of Chinna Nadar for toy pistols.  The “toy pistols \nare toy pistols” plea of Mr Vaidyanathan is really, therefore, \nirrelevant.  Chinna Nadar’s registration was for amorces.  Toy pistols \nwhich spray water cannot, howsoever much the imagination were to \nbe strained, be likened to amorces.  Indeed, one would extinguish the \nother.   \n \n19. \nThis is not an infringement suit.  We are concerned, therefore, \nnot with Section 29, but with Section 11 of the Trade Marks Act.  \nRefusal of an application for registration is justified only if the \ngrounds are relatable either to Section 9 or to Section 11.  Section \n11(1), as already noted, envisages refusal of registration only if, either \n(i) \n(a) \nthe applicant’s mark and the earlier mark are \nidentical and the marks are used for similar goods or \nservices, or \n \n(b) \nthe applicant’s mark and the earlier mark are \nsimilar, and the marks are used for identical or similar \ngoods or services, and \n(ii) \nregistration of the applicant’s mark would result in a a \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:02.02.2023\n17:45:24\nSignature Not Verified\n\n--- PAGE 10 ---\nNeutral Citation Number : 2023/DHC/000729 \nC.A.(COMM.IPD-TM) 143/2021  \nPage 10 of 13 \n \nlikelihood of confusion, or association with the earlier mark, on \nthe part of the public. \n“Likelihood of confusion” is not to be easily presumed.  The nature of \nthe goods and the class of their purchasers has to be borne in mind.   \n \n20. \nThe appellant’s COCK word mark and Chinna Nadar’s COCK \ndevice mark cannot, strictly speaking, be said to be identical.  That \napart, mere identity or similarity of the marks is not sufficient to \ndisentitle an applicant for registration under Section 11(1).  It has, \nadditionally, to be shown that \n(i) \nthe goods or services in respect of which the earlier mark \nstood registered or applied for, were identical or similar to the \ngoods or services in respect of which registration was being \nsought, and \n(ii) \nregistration of the mark in favour of the applicant would \nresult in a likelihood of confusion on the part of the public. \n \n21. \nRegistration of an “eligible” mark is a valuable commercial \nright.  Registration brings, in its fold, several inalienable entitlements; \nmost importantly the entitlement to protection against infringement.  \nRegistration, where the mark is eligible therefor cannot, therefore, be \nrefused.  An application for registration of a trade mark, therefore, can \nbe rejected only if it falls strictly within the peripheries of the criteria \nenvisaged by Sections 9 and 11 of the Trademarks Act. \n \n22. \nViewed thus, for the following reasons, I am of the opinion that \nthe appellant’s mark would be entitled to registration: \n \n(i) \nThe appellant’s mark cannot be treated as identical or \nsimilar to the mark which already stood registered in favour of \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:02.02.2023\n17:45:24\nSignature Not Verified\n\n--- PAGE 11 ---\nNeutral Citation Number : 2023/DHC/000729 \nC.A.(COMM.IPD-TM) 143/2021  \nPage 11 of 13 \n \nChinna Nadar.  The appellant sought registration of the word \nmark COCK.  The mark registered in favour of Mr. A.S. Chinna \nNadar was the \n device mark, which contained, \nprominently, the words “COCK BRAND” above the figure of a \nstrutting cock and, below that, the word “AMORCES”.  A \nperson viewing the mark would, therefore, be made clearly \naware of the fact that the mark was used only in respect of \namorces and nothing else.  There could not, therefore, be said \nthat there existed any likelihood of confusion, much less a \npossibility of Chinna Nadar’s goods being passed off as a goods \nof the appellant by reason of the registration of the appellant’s \nmark. \n \n(ii) \nThat apart, amorces and toy spray guns used for spraying \nwater and colours are neither identical or similar.  Chinna \nNadar’s COCK brand was registered only for amorces; not even \nfor toy guns.  Amorces are not used with spray guns which \nspray water or colour; indeed, water would extinguish the \namorce and render it unusable.  Amorces are fireworks.  The \nappellant’s guns spray coloured water.  Fire cannot be likened \nto water.  The appellant sought registration of the word mark \nCOCK for toy pistols or guns used for spraying coloured water \nduring festivals.  They have nothing in common with toy pistols \nused in fireworks; much less with amorces used with such \npistols.  The mere fact that, in some festivals, both may be used, \nis irrelevant.  Similarity, for the purposes of Section 11(1), has \nto be of the goods or services, not of the occasion of their user.    \nThe impugned order of the learned Senior Examiner has not \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:02.02.2023\n17:45:24\nSignature Not Verified\n\n--- PAGE 12 ---\nNeutral Citation Number : 2023/DHC/000729 \nC.A.(COMM.IPD-TM) 143/2021  \nPage 12 of 13 \n \nconsidered this aspect or the difference in the nature of the \ngoods for which the appellant sought registration, vis-à-vis the \ngoods for which the COCK mark was registered in favour of \nChinna Nadar.   \n \n(iii) Further, there is little chance of any likelihood of \nconfusion in the minds of public between the two marks, or \nlikelihood of any association, by registration of the COCK word \nmark in favour of the appellant, with the rgistratioon of the \n device mark in favour of Chinna Nadar.  As already \nnoted, the appellant’s mark was being used in toy pistols which \nsprayed coloured water during festivals.  The \n device \nmark registered in favour of Chinna Nadar was, on the other \nhand, used for amorces, which are in the nature of small \nfireworks.  It cannot, therefore, be said, in the absence of any \nmaterial to indicate to the contrary, that the registration of the \nCOCK word mark in favour of the appellant, as sought, would \nresult in any likelihood of confusion in the minds of the public. \n \n23. \nNone of the three criteria, which require cumulative satisfaction \nin order for an application for registration of a mark to be rejected \nunder Section 11(1) of the Trademarks Act can, therefore, be said to \nbe satisfied in the present case. \n \n24. \nIn that view of the matter, it is not necessary for this Court to \nenter into the allegations of mala fide etc. which find place in the \nimpugned order and which, in my opinion, ought not to have been \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:02.02.2023\n17:45:24\nSignature Not Verified\n\n--- PAGE 13 ---\nNeutral Citation Number : 2023/DHC/000729 \nC.A.(COMM.IPD-TM) 143/2021  \nPage 13 of 13 \n \nreturned without adequate evidence. \n \nConclusion \n \n25. \nFor the aforesaid reasons, I am unable to sustain the impugned \norder, which is accordingly quashed and set aside.  Application No. \n3757855 of the appellant would accordingly stand allowed in terms \nthereof.    \n \n26. \nThe appeal is, accordingly, allowed with no order as to costs.   \n \n27. \nConsequential steps be taken by the learned Registrar in \naccordance with law.   \n \n \nC.HARI SHANKAR, J \nFEBRUARY 1, 2023 \nrb \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:02.02.2023\n17:45:24\nSignature Not Verified\n"
  },
  "total_pages": 13,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "According to the PDF document \"Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf\", a legal proceeding was held in the High Court of Delhi at New Delhi. The case, C.A.(COMM.IPD-TM) 143/2021, involved an appeal by Manu Garg and Ratan Behari Agarwal against the Registrar of Trade Marks. The appellants were represented by Mr. M.K. Miglani, while the respondent was represented by Mr. Harish Vaidyanathan Shankar and others.\n\nThe dispute centered on the rejection of the appellants' Application No. 3757855 for registration of the word mark \"COCK\" under Class 28 of the NICE classification. The application was rejected by the Senior Examiner of Trademarks, citing identical marks registered by other parties, including Mr. A.S. Chinna Nadar and Mr. Lokesh Kataria.\n\nThe appellants argued that their goods, water and color pistols, also known as \"pichkaris\", were distinct from the goods associated with the other registered marks. However, the learned Senior Examiner's objection, based on the COCK registration granted to Chinna Nadar, remained for consideration.\n\nThe court heard oral submissions from both parties and considered written responses. The judgment, delivered on February 1, 2023, addressed the appeal and the objections raised by the respondent. The details of the decision are not provided in the given section, but the court's consideration of the case is outlined in the PDF document, which serves as the source for this summary.",
      "pdf_source": "33. Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "According to page 1 of the PDF \"Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf\", the High Court of Delhi at New Delhi heard an appeal (C.A.(COMM.IPD-TM) 143/2021) filed by Manu Garg and Ratan Behari Agarwal against the Registrar of Trade Marks. The appellants were represented by Mr. M.K. Miglani, while the respondent was represented by Mr. Harish Vaidyanathan Shankar and others. The appeal was against an order dated February 4, 2021, rejecting the appellants' Application No. 3757855 for registration of the word mark \"COCK\" under Class 28. The court, presided over by Hon'ble Mr. Justice C. Hari Shankar, heard oral arguments on February 1, 2023. (Source: PDF page 1)",
          "content": "Neutral Citation Number : 2023/DHC/000729 \nC.A.(COMM.IPD-TM) 143/2021  \nPage 1 of 13 \n \n$~3(Original) \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.A.(COMM.IPD-TM) 143/2021 \n \nMANU GARG AND  \nRATAN BEHARI AGRAWAL \n \n  ..... Appellant \n \n \n \n \nThrough: \nMr. M.K. Miglani, Adv.  \n \n \n \n \n \nVersus \n \n \nREGISTRAR OF TRADE MARKS  \n      ..... Respondent \nThrough: \nMr. \nHarish \nVaidyanathan \nShankar, CGSC with Mr. Srish Kumar \nMishra, Mr. Sagar Mehlawat and Mr. \nAlexander Mathai Paikaday, Advs. \n \nCORAM: \n \nHON'BLE MR. JUSTICE C.HARI SHANKAR \n \n \n \n \n    JUDGMENT(ORAL) \n% \n \n \n           01.02.2023 \n \n1. \nThe appellant is aggrieved by order dated 4th February 2021, \npassed by the learned Senior Examiner of Trademarks in the office of \nthe Registrar of Trademarks, whereby Application No. 3757855 of the \nappellant has been rejected by the learned Senior Examiner. \n \n2. \nWritten submissions by way of response to the appeal have \nbeen filed by the respondent. I have heard Mr. Miglani, learned \nCounsel for the appellant and Mr. Harish Vaidyanathan Shankar, \nlearned Counsel for the respondent. \n \nFacts \n \n3. \nApplication No. 3757855 was submitted by the appellant for \nregistration of the word mark “COCK” under Class 28 of the NICE \nclassification as adopted by Rule 20 of the Trademarks Rules 2017, \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:02.02.2023\n17:45:24\nSignature Not Verified",
          "pdf_source": "33. Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "According to page 2 of the PDF \"Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf\", the appellants, Manu Garg and Ratan Behari Agarwal, applied to register their \"COCK\" mark for \"water and colour pistols, water and colour guns, water and colour sprayers\" (Class 28). The Senior Examiner objected to the registration, citing two identical marks registered by Mr. A.S. Chinna Nadar and Mr. Lokesh Kataria. However, Mr. Kataria's application was later rejected. The objection based on Mr. Chinna Nadar's registration remains. The appellants argued that their water guns are not similar to fireworks-associated guns, but rather \"pichkaris\" used in festivals like Holi. The case is C.A.(COMM.IPD-TM) 143/2021, with a Neutral Citation Number: 2023/DHC/000729. Key dates include March 13, 2018 (First Examination Report) and May 23, 2022 (order passed in the present proceedings).",
          "content": "Neutral Citation Number : 2023/DHC/000729 \nC.A.(COMM.IPD-TM) 143/2021  \nPage 2 of 13 \n \nfor “water and colour pistols, water and colour guns, water and colour \nsprayers, being toys included in Class 28”. Mr. Miglani points out that \nthe goods in respect of which the impugned mark was sought to be \nregistered were pistols in the nature of “pichkaris” (water guns), used \nin festivals such as Holi for spraying colours. He submits that, even if \nakin in shape to guns, the water and colour pistols made by the \nappellant have nothing in common with fireworks, with which, \ntraditionally, guns are associated.  They, therefore, are guns merely in \nform, not in substance.   \n \n4. \nConsequent to filing of the aforesaid application by the \nappellant, the learned Senior Examiner in the office of the Registrar of \nTrademarks, vide First Examination Report (FER) dated 13th March \n2018, objected to the grant of registration for the appellants COCK \nmark, citing two marks which, according to him, were identical and \nused for goods which were similar or allied to the goods in respect of \nwhich registration was sought by the appellant.  The proprietors, in \nwhose favour the said marks were registered, were Mr. A.S. Chinna \nNadar (“Chinna Nadar”, hereinafter), Sivakasi and Mr. Lokesh \nKataria, Gurgaon. \n \n5. \nOf these, at the time when the FER was issued, the COCK mark \nof Mr. Lokesh Kataria was under objections. Subsequently, the \napplication of Mr. Kataria stands rejected by the learned Registrar.  As \nsuch, the objection of the learned Senior Examiner, predicated on the \nCOCK registration granted to Chinna Nadar alone survives for \nconsideration.  This position has already stands noted in the order \ndated 23rd May 2022 passed in the present proceedings. \n \n6. \nOn receiving the aforesaid FER, the appellant, vide reply dated \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:02.02.2023\n17:45:24\nSignature Not Verified",
          "pdf_source": "33. Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0007",
      "start_index": 3,
      "end_index": 5,
      "summary": "According to the PDF document \"Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf\", a legal proceeding (C.A.(COMM.IPD-TM) 143/2021) is underway in the High Court of Delhi. The appellants, Manu Garg and Ratan Behari Agarwal, are seeking registration of the \"COCK\" mark for water and color pistols, guns, and sprayers used to spray colors during festivals like Holi.\n\nThe Registrar of Trade Marks rejected their application, citing a conflicting mark registered in favor of Chinna Nadar for \"amorces or paper caps for toy pistols\". The appellants argued that their mark is distinct, as it is for toy pistols used to spray colors, which is different from amorces. However, the Senior Examiner rejected this argument, stating that the marks are phonetically and visually identical, and the applicant is a subsequent user trying to ride on the goodwill of the conflicting mark.\n\nThe impugned order dated February 4, 2021, states that the allowance of the subject mark would lead to confusion among the public and cause irreparable loss to the conflicting mark's trade and business. The court is considering the facts of the subject application, including the potential for confusion and the distinctiveness of the marks. The PDF document provides a detailed account of the legal proceedings, including the arguments presented by both parties and the decisions made by the court. (Source: Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf, pages 1-4 of 13)",
      "pdf_source": "33. Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "According to page 3 of the PDF \"Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf\", on April 2, 2018, the appellant's representative, Mr. M.K. Miglani, argued that the objection by the Senior Examiner was misconceived. The COCK brand was registered for \"amorces or paper caps for toy pistols\", whereas the appellant sought registration for water and color pistols, guns, and sprayers. The appellant claimed that the registered mark was for a device, clearly indicating it was for amorces, and not related to the goods they sought to register. The Senior Examiner rejected the appellant's application on February 4, 2021. The case is C.A.(COMM.IPD-TM) 143/2021, with the Neutral Citation Number: 2023/DHC/000729. (Source: PDF \"Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf\", page 3)",
          "content": "Neutral Citation Number : 2023/DHC/000729 \nC.A.(COMM.IPD-TM) 143/2021  \nPage 3 of 13 \n \n2nd April 2018, submitted that the objection of the learned Senior \nExaminer was misconceived, as the COCK brand registered in favour \nof Chinna Nadar was for “amorces or paper caps for toy pistols”, \nwhereas the appellant was seeking registration of the COCK mark for \nwater and colour pistols, guns and sprayers used to spray colours \nduring festivals such as Holi.  It was also pointed out that the mark \nwhich stood registered in favour of Chinna Nadar was the device mark \n which clearly indicated that the registration was for amorces \nand for no other goods. The registration sought by the appellant was, \non the other hand, for toy pistols used to spray colours, which had \nnothing in common with amorces.  An “amorce”, as Mr. Miglani \npoints out from the dictionary, is a percussion cap for a toy pistol. \nElsewhere, the expression “amorce” is defined as “a firework which is \na percussion cap designed for use in toys, which comprises of paper \nenvelope containing a dot of impact sensitive pyrotechnic composition \nand which forms part of a roll”. \n \n7. \nI may note, here, that, in India, such rolls, which are fitted in toy \npistols, are often used by children on the occasion of festivals such as \nDiwali. These rolls are often mounted on pistols between the striking \nsurface and the body of the pistol so that, when the pistol is cocked \nand fired, due to the impact of the strike, a small spark is emitted with \na noise imitative of a bullet being fired.  Amorces are available in rolls \nor in individual pieces.   \n \n8. \nThe appellant’s objection was not accepted by the learned \nSenior Examiner who has, by the impugned order dated 4th February \n2021, rejected the appellant’s application.  The impugned order reads \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:02.02.2023\n17:45:24\nSignature Not Verified",
          "pdf_source": "33. Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "According to page 4 of the PDF \"Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf\", the Tribunal found that the applicant's mark \"COCK\" is phonetically and visually identical to existing marks, and its allowance would lead to confusion among consumers. The Tribunal cited the landmark case of Cadila Health Care Ltd. v. Cadila Pharmaceuticals, which outlined factors to consider for deceptive similarity of marks, including the nature of the marks, degree of resemblance, nature of goods, and similarity in nature and character. The Tribunal concluded that the applicant's adoption of the mark was not bona fide and was an attempt to ride on the goodwill and reputation of existing marks. The case is C.A.(COMM.IPD-TM) 143/2021, with Neutral Citation Number 2023/DHC/000729. (Source: PDF page 4)",
          "content": "Neutral Citation Number : 2023/DHC/000729 \nC.A.(COMM.IPD-TM) 143/2021  \nPage 4 of 13 \n \nthus: \n“Instant mark is phonetically and visually identical to the \nconflicting marks which is mentioned in the search report and also \nthey are well in prior use in respect of the similar nature of goods \nwhich sought by the applicant. The applicant is the well subsequent \nuser among the conflicting mark user period. In view of these \ngrounds, the Tribunal has opined that the applicant has deliberately \nchosen the subject mark in an effort to ride upon the goodwill and \nreputation of the conflicting marks. Applicant has no bona fide \nadoption of the subject mark in respect of the applied goods. \nFurther, the allowance of the subject mark is patently mala fide \nsince the mark has been dishonestly adopted by the applicant hence \nthe applicant cannot claim to be the proprietor of the subject mark \nunder Section 18(1) of the Act. Allowance of the subject mark is \nadversely affecting the interest of the public; it would lead to \nconfusion as it is more than likely, due to imperfect recollection \nthat the average buyer may confuse the applicant’s mark “COCK” \nas the conflicting owner’s product sold under “COCK”. In view of \nsuch similarities between the nature of the marks and their goods, \nthe applicant’s trade channel and counters, there exists a strong \nlikelihood of confusions on the part of the consuming public, \nincluding an association, as they are likely to assume and confuse \nthat the applicant’s goods are connected or otherwise associated \nwith the conflicting marks goods, when no such connection exists. \nConsequently, the members of the trade would no doubt, be under \nthe mistaken belief that the applicant’s goods originate from the \nconflicting mark or that they have some trade connection or \naffiliation thereby causing irreparable loss and damage not only to \nthe conflicting mark trade and business but also suiting erosion of \ndistinctiveness hard earned by the conflicting marks. \n \nIn addition to the facts of the subject application, I want to \ndiscuss the land mark case of Cadila Health Care Ltd. v. Cadila \nPharmaceuticals1 wherein the Supreme Court has stated that in an \naction for passing off on the basis of unregistered trade mark \ngenerally the following factors have to be considered for deciding \nthe question of deceptive similarity of marks: \n \n(a) \nThe nature of the marks i.e. whether the marks \nare word marks or label marks or composite marks i.e. \nboth words and label marks \n \n(b) \nThe degree of resemblances between the marks, \nphonetically similar and hence similar in idea. \n \n(c) \nThe nature of the goods in respect or which \nthey are used as trade marks. \n \n(d) \nThe similarity in the nature, character and \n                                          \n1 AIR 2001 SC 1952 \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:02.02.2023\n17:45:24\nSignature Not Verified",
          "pdf_source": "33. Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 5",
          "node_id": "0006",
          "start_index": 5,
          "end_index": 5,
          "summary": "According to page 5 of the PDF \"Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf\", the court considered seven factors to determine the extent of dissimilarity between competing marks, including the nature of the goods, class of purchasers, and mode of purchasing. The Tribunal refused the subject mark for journal publication to avoid opposition and passing off actions. The Trade Mark Application was refused under sections 11(1)(a) and (b) of the Trade Marks Act, 1999, to protect the object of the Act and the purity of the Register. The appellant's counsel, Mr. Miglani, submitted that the impugned order was misconceived, and the finding that the goods were similar was erroneous. (Source: PDF, Case No. C.A.(COMM.IPD-TM) 143/2021, Neutral Citation Number: 2023/DHC/000729)",
          "content": "Neutral Citation Number : 2023/DHC/000729 \nC.A.(COMM.IPD-TM) 143/2021  \nPage 5 of 13 \n \nperformance of the goods or the rival traders. \n \n(e) \nThe class of purchasers who are likely to buy \nthe goods bearing the marks they require, on their \neducation and intelligence and a degree of care they are \nlikely to exercise in purchasing and or using the goods. \n \n(f) \nThe mode of purchasing the goods or placing \norders for the goods, and \n \n(g) \nAny other surrounding circumstances which \nmay be relevant in the extent of dissimilarity between \nthe competing marks. \n \nWeightage to be given to each of the aforesaid factors \ndepends upon facts of each case and the same weightage cannot be \ngiven to each factor in every case. \n \nBased upon the Supreme Court guidelines, the above \nmentioned seven factors are obviously applicable to this case. In \norder to avoid the opposition to the registration as well as passing \noff actions against the subject mark, the Tribunal is not ready to \naccept the subject mark for journal publication. \n \nIn this position, I would like to enlighten the object of the \nTrade Marks Act, 1999. The said object is to provide for \nregistration and better protection of trade marks for goods and \nservices and for the prevention of the use of fraudulent marks. If \nthe subject mark is allowed for registration, the object of the Trade \nMarks Act, 1999 would be jeopardized and the purity of the \nRegister will be affected. \n \nIn view of the above said reasons, the Trade Mark \nApplication is refused under sections 11(1)(a) and (b) of the Trade \nMarks Act, 1999.” \n \nRival Contentions \n \n9. \nMr. Miglani submits that the impugned order is misconceived. \nThe finding of the learned Senior Examiner that the use, of the COCK \nmark registered in favour of Chinna Nadar was for goods which were \nsimilar to those in respect of which registration was being sought by \nthe appellant is, he submits, erroneous on facts.  The goods in respect \nof which the appellant was seeking registration, and the goods in \nrespect of which the COCK brand stood registered in favour of  \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:02.02.2023\n17:45:24\nSignature Not Verified",
          "pdf_source": "33. Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0014",
      "start_index": 6,
      "end_index": 11,
      "summary": "According to the PDF document \"Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf\", a legal proceeding (C.A.(COMM.IPD-TM) 143/2021) is underway in the High Court of Delhi. The appellants, Manu Garg and Ratan Behari Agarwal, are seeking registration of the \"COCK\" brand for water and color pistols, guns, and sprayers under Class 28. \n\nThe appellants' counsel, Mr. M.K. Miglani, argues that the \"COCK\" mark is already registered in their favor since 1992 for use with colors, and that the goods for which they are seeking registration are used for spraying colors. He also mentions that the respondent, Sri Kaliswari Fireworks, had earlier objected to the use of the \"COCK\" label but later expressed satisfaction with the appellants' reply.\n\nThe respondent's counsel, Mr. Harish Vaidyanathan, supports the impugned order, stating that the \"COCK\" mark registered in favor of Mr. A.S. Chinna Nadar is also used for toy pistols, and that the goods in question are used in festival celebrations, which could lead to confusion.\n\nThe court is considering Section 11 of the Trade Marks Act, which provides relative grounds for refusal of registration. The decision will depend on whether there exists a likelihood of confusion on the part of the public due to the similarity of the marks and the goods or services covered. (Source: \"Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf\", Neutral Citation Number: 2023/DHC/000729)",
      "pdf_source": "33. Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "According to page 6 of the PDF \"33. Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf\", the appellant's counsel, Mr. M.K. Miglani, argues that the appellant has been registered for the \"COCK\" brand for colours since 1992. The appellant had previously received a legal notice from Sri Kaliswari Fireworks, which was satisfied with the appellant's reply that their \"COCK\" mark was used for Holi colours, whereas Chinna Nadar's mark was used for fireworks. The appellant is now seeking registration for the \"COCK\" brand for water and colour pistols, guns, and sprayers under Class 28. The respondent's counsel, Mr. Harish Vaidyanathan, supports the impugned order, stating that the \"COCK\" mark registered in favor of Chinna Nadar is also used for toy pistols. The case is C.A.(COMM.IPD-TM) 143/2021 in the High Court of Delhi. Key dates mentioned include February 19, 2018, and January 30, 2019.",
          "content": "Neutral Citation Number : 2023/DHC/000729 \nC.A.(COMM.IPD-TM) 143/2021  \nPage 6 of 13 \n \nChinna Nadar, he submits, are completely different.  \n \n10. \nIn fact, submits Mr. Miglani, the appellant stands registered for \nuse of the COCK brand for colours since 1992.  The appellant had \nearlier been issued a legal notice dated 19th February 2018 by Sri \nKaliswari Fireworks, of which Chinna Nadar was admittedly the \nDirector, objecting to the use, by the appellant, of its COCK label.  \nThe appellant had replied to the said legal notice on 17th March 2018, \nsubmitting that, whereas the appellant’s COCK mark was used for \nHoli colours, gulal and like goods, Chinna Nadar’s mark was used for \nfireworks, sparklers, crackers, ground wheels, rockets, colour matches \netc. Mr. Miglani points out that, on the said reply being submitted by \nhis client, Sri Kaliswari Fireworks had, by its communication dated \n30th January 2019, expressed satisfaction with the reply of the \nappellant. \n \n11. \nThe goods in respect of which the appellant was now seeking \nregistration of the COCK brand are, submits Mr. Miglani, goods \nwhich are used for spraying the very colours in respect of which the \nCOCK brand already stands registered in the appellant’s favour since \n1992.  Chinna Nadar has already expressed his satisfaction with the \nuse of the said mark by the appellant for colours.  As such, he submits, \nthe learned Senior Examiner acted unreasonably in refusing \nregistration to the appellant, for the mark “COCK” in respect of water \nand colour pistols, guns and sprayers, under Class 28. \n \n12. \nMr. Vaidyanathan, learned Counsel for the respondent, on the \nother hand, supports the impugned order.  He submits that the COCK \nmark registered in favour of Mr. A.S. Chinna Nadar is also used for \ntoy pistols.  The mere fact that toy pistols in which the said amorces \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:02.02.2023\n17:45:24\nSignature Not Verified",
          "pdf_source": "33. Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 7",
          "node_id": "0009",
          "start_index": 7,
          "end_index": 7,
          "summary": "According to page 7 of the PDF \"Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf\", the respondent's counsel, Mr. Harish Vaidyanathan Shankar, argues that the goods in question, toy pistols, are used in festival celebrations like Holi, similar to the COCK brand registered in favor of Chinna Nadar, which is used in Diwali. He submits that both items are available in similar small shops and that the learned Senior Examiner's decision to refuse registration to the appellant's mark is justified.\n\nThe court analysis refers to Section 11 of the Trade Marks Act, which provides relative grounds for refusal of registration, including likelihood of confusion with an earlier mark. The case is C.A.(COMM.IPD-TM) 143/2021, with a neutral citation number of 2023/DHC/000729. The proceedings involve appellants Manu Garg and Ratan Behari Agarwal, and the respondent is the Registrar of Trade Marks. (Source: PDF \"Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf\")",
          "content": "Neutral Citation Number : 2023/DHC/000729 \nC.A.(COMM.IPD-TM) 143/2021  \nPage 7 of 13 \n \nwere used, were normally used in Diwali, whereas the toy pistols for \nwhich the appellant was seeking registration are used in Holi and like \nfestivals, he submits, cannot make a substantial difference or justify \ninterference with the impugned order which is well-reasoned.  He \nsubmits that the goods in respect of which registration was being \nsought by the appellant, and the goods in respect of which the COCK \nbrand was registered in favour of Chinna Nadar were both used in \nfestival celebrations.  As such, he submits that both the items would \nbe available from similar small shops and that it was a matter of \ncommon knowledge that festivals such as Durga Pooja, spraying of \ncolours and fireworks both took place.  As such, Mr. Vaidyanathan \nsubmits that the learned Senior Examiner cannot be faulted in refusing \nregistration to the appellant’s mark. \n \nAnalysis \n \n13. \nI have heard learned Counsel and perused the material on \nrecord. \n \n14. \nSection 11 of the Trade Marks Act provides “relative grounds \nfor refusal of registration”, as against “absolute grounds for refusal” \nenvisaged by Section 9.  The grounds for refusal, contained in Section \n11, essentially relate to earlier marks registered in favour of someone \nelse, or for which an application is pending with the office of the \nRegistrar of Trademarks.  We are concerned with Section 11(1)2. \n                                          \n2 11.  \nRelative grounds for refusal of registration. –  \n(1)  \nSave as provided in Section 12, a trade mark shall not be registered if, because of –  \n(a)  \nits identity with an earlier trade mark and similarity of goods or services \ncovered by the trade mark; or \n(b)  \nits similarity to an earlier trade mark and the identity or similarity of the goods \nor services covered by the trade mark, \nthere exists a likelihood of confusion on the part of the public, which includes the likelihood of \nassociation with the earlier trade mark. \n \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:02.02.2023\n17:45:24\nSignature Not Verified",
          "pdf_source": "33. Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 8",
          "node_id": "0010",
          "start_index": 8,
          "end_index": 8,
          "summary": "According to page 8 of the PDF \"Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf\", the court discusses Section 11(1) of the trademark law, which prohibits registration of a trademark that is identical or similar to an earlier trademark, causing likelihood of confusion. The case involves the registration of the \"COCK\" word mark for water guns, which was opposed due to an existing \"COCK\" device mark for fireworks. The court disagrees with the Senior Examiner's view that the goods are similar, stating that water guns and fireworks are fundamentally different. The appellant, Manu Garg, seeks registration of the \"COCK\" word mark, represented by Mr. M.K. Miglani. The respondent, Registrar of Trade Marks, is represented by Mr. Harish Vaidyanathan Shankar. The case number is C.A.(COMM.IPD-TM) 143/2021, with a neutral citation number of 2023/DHC/000729.",
          "content": "Neutral Citation Number : 2023/DHC/000729 \nC.A.(COMM.IPD-TM) 143/2021  \nPage 8 of 13 \n \n15. \nSection 11(1)(a) prohibits registration of a trademark which is \nidentical to an earlier trademark and used in respect of similar goods \nor services, whereas Section 11(1)(b) prohibits registration of a \ntrademark which is similar to an earlier trademark and used in respect \nof identical or similar goods or services.  In either case, there must, \nadditionally, exist a likelihood of confusion on the part of the public, \nfor registration to be refused under Section 11(1). The provision also \nclarifies that “confusion” would include likelihood of association with \nthe earlier trademark. \n \n16. \nHaving heard learned Counsel for both sides and applied my \nmind thereto, I am unable to subscribe to the view of the learned \nSenior Examiner that the goods, in respect of which registration of the \nCOCK word mark was being sought by the appellant, were similar to \nthe goods in respect of which the COCK device mark stood registered \nin favour of Chinna Nadar.  Mr Vaidyanathan’s submission that toy \npistols are toy pistols, I feel, oversimplifies the issue.  The “guns”, or \n“pistols”, for which the appellant sought registration of the COCK \nmark, are guns or pistols merely in form, not in substance.  They emit \nneither heat nor light.  They are not, therefore, fireworks in any sense \nof the expression.  They emit – if one may use the expression – not \nfire, but its antithesis; water.  A gun which sprays water and a gun \nwhich emits a spark and, therefore, releases heat and light are about as \nalike as chalk and cheese.  The fact that they may both be used on \nsimilar occasions does not make them like, similar, or allied, even in \nordinary parlance.   \n \n17. \nThe appellant seeks registration of the COCK word mark.  \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:02.02.2023\n17:45:24\nSignature Not Verified",
          "pdf_source": "33. Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 9",
          "node_id": "0011",
          "start_index": 9,
          "end_index": 9,
          "summary": "According to page 9 of the PDF \"Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf\", the court discusses the case of Chinna Nadar's registered device mark \"COCK BRAND\" with the word \"AMORCES\", which is specifically for \"amorces or paper caps for toy pistols\". The appellant's request for registration was refused due to this existing registration. However, the court argues that Chinna Nadar's registration was for amorces, not toy pistols, and that toy pistols that spray water cannot be likened to amorces. The court is concerned with Section 11 of the Trade Marks Act, which envisages refusal of registration only if the applicant's mark is identical or similar to an earlier mark for similar goods or services. (Source: \"Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf\", page 9)",
          "content": "Neutral Citation Number : 2023/DHC/000729 \nC.A.(COMM.IPD-TM) 143/2021  \nPage 9 of 13 \n \nChinna Nadar holds a registration for the \n device mark.  \nChinna Nadar’s mark is a composite device mark which includes, \napart from the words “COCK BRAND”, the word “AMORCES”.   \n \n18. \nBesides, Chinna Nadar’s registration was specifically for \n“amorces or paper caps for toy pistols”.  As such, the mark was not \neven registered for toy pistols per se, but only for amerces used in toy \npistols.  The appellant’s request for registration could not, therefore, \nhave been refused on the ground that the COCK brand stood \nregistered in favour of Chinna Nadar for toy pistols.  The “toy pistols \nare toy pistols” plea of Mr Vaidyanathan is really, therefore, \nirrelevant.  Chinna Nadar’s registration was for amorces.  Toy pistols \nwhich spray water cannot, howsoever much the imagination were to \nbe strained, be likened to amorces.  Indeed, one would extinguish the \nother.   \n \n19. \nThis is not an infringement suit.  We are concerned, therefore, \nnot with Section 29, but with Section 11 of the Trade Marks Act.  \nRefusal of an application for registration is justified only if the \ngrounds are relatable either to Section 9 or to Section 11.  Section \n11(1), as already noted, envisages refusal of registration only if, either \n(i) \n(a) \nthe applicant’s mark and the earlier mark are \nidentical and the marks are used for similar goods or \nservices, or \n \n(b) \nthe applicant’s mark and the earlier mark are \nsimilar, and the marks are used for identical or similar \ngoods or services, and \n(ii) \nregistration of the applicant’s mark would result in a a \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:02.02.2023\n17:45:24\nSignature Not Verified",
          "pdf_source": "33. Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 10",
          "node_id": "0012",
          "start_index": 10,
          "end_index": 10,
          "summary": "According to page 10 of the PDF \"Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf\", the court discusses the likelihood of confusion between the appellant's COCK word mark and Chinna Nadar's COCK device mark. The court states that mere identity or similarity of marks is not sufficient to disentitle an applicant for registration under Section 11(1). Registration of a mark can only be refused if it falls within the criteria envisaged by Sections 9 and 11 of the Trademarks Act. The court is of the opinion that the appellant's mark is entitled to registration, as it cannot be treated as identical or similar to the already registered mark. This opinion is based on the case C.A.(COMM.IPD-TM) 143/2021, with a Neutral Citation Number: 2023/DHC/000729.",
          "content": "Neutral Citation Number : 2023/DHC/000729 \nC.A.(COMM.IPD-TM) 143/2021  \nPage 10 of 13 \n \nlikelihood of confusion, or association with the earlier mark, on \nthe part of the public. \n“Likelihood of confusion” is not to be easily presumed.  The nature of \nthe goods and the class of their purchasers has to be borne in mind.   \n \n20. \nThe appellant’s COCK word mark and Chinna Nadar’s COCK \ndevice mark cannot, strictly speaking, be said to be identical.  That \napart, mere identity or similarity of the marks is not sufficient to \ndisentitle an applicant for registration under Section 11(1).  It has, \nadditionally, to be shown that \n(i) \nthe goods or services in respect of which the earlier mark \nstood registered or applied for, were identical or similar to the \ngoods or services in respect of which registration was being \nsought, and \n(ii) \nregistration of the mark in favour of the applicant would \nresult in a likelihood of confusion on the part of the public. \n \n21. \nRegistration of an “eligible” mark is a valuable commercial \nright.  Registration brings, in its fold, several inalienable entitlements; \nmost importantly the entitlement to protection against infringement.  \nRegistration, where the mark is eligible therefor cannot, therefore, be \nrefused.  An application for registration of a trade mark, therefore, can \nbe rejected only if it falls strictly within the peripheries of the criteria \nenvisaged by Sections 9 and 11 of the Trademarks Act. \n \n22. \nViewed thus, for the following reasons, I am of the opinion that \nthe appellant’s mark would be entitled to registration: \n \n(i) \nThe appellant’s mark cannot be treated as identical or \nsimilar to the mark which already stood registered in favour of \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:02.02.2023\n17:45:24\nSignature Not Verified",
          "pdf_source": "33. Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 11",
          "node_id": "0013",
          "start_index": 11,
          "end_index": 11,
          "summary": "According to page 11 of the PDF \"Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf\", the appellant sought registration of the word mark \"COCK\" for toy pistols or guns used for spraying colored water. The respondent, Registrar of Trade Marks, opposed the registration citing a similar mark \"COCK BRAND\" registered by A.S. Chinna Nadar for amorces (fireworks). The court argued that there is no likelihood of confusion between the two marks as they are used for different products (amorces and toy spray guns) and serve distinct purposes. The court also stated that similarity in goods or services is required for Section 11(1), not the occasion of their use. The case is C.A.(COMM.IPD-TM) 143/2021, with a neutral citation number of 2023/DHC/000729. The signing date of the document is 02.02.2023.",
          "content": "Neutral Citation Number : 2023/DHC/000729 \nC.A.(COMM.IPD-TM) 143/2021  \nPage 11 of 13 \n \nChinna Nadar.  The appellant sought registration of the word \nmark COCK.  The mark registered in favour of Mr. A.S. Chinna \nNadar was the \n device mark, which contained, \nprominently, the words “COCK BRAND” above the figure of a \nstrutting cock and, below that, the word “AMORCES”.  A \nperson viewing the mark would, therefore, be made clearly \naware of the fact that the mark was used only in respect of \namorces and nothing else.  There could not, therefore, be said \nthat there existed any likelihood of confusion, much less a \npossibility of Chinna Nadar’s goods being passed off as a goods \nof the appellant by reason of the registration of the appellant’s \nmark. \n \n(ii) \nThat apart, amorces and toy spray guns used for spraying \nwater and colours are neither identical or similar.  Chinna \nNadar’s COCK brand was registered only for amorces; not even \nfor toy guns.  Amorces are not used with spray guns which \nspray water or colour; indeed, water would extinguish the \namorce and render it unusable.  Amorces are fireworks.  The \nappellant’s guns spray coloured water.  Fire cannot be likened \nto water.  The appellant sought registration of the word mark \nCOCK for toy pistols or guns used for spraying coloured water \nduring festivals.  They have nothing in common with toy pistols \nused in fireworks; much less with amorces used with such \npistols.  The mere fact that, in some festivals, both may be used, \nis irrelevant.  Similarity, for the purposes of Section 11(1), has \nto be of the goods or services, not of the occasion of their user.    \nThe impugned order of the learned Senior Examiner has not \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:02.02.2023\n17:45:24\nSignature Not Verified",
          "pdf_source": "33. Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0017",
      "start_index": 12,
      "end_index": 13,
      "summary": "According to the PDF document \"Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf\", the High Court of Delhi at New Delhi heard an appeal filed by Manu Garg and Ratan Behari Agarwal (Appellants) against the Registrar of Trade Marks (Respondent). The appeal (C.A.(COMM.IPD-TM) 143/2021) challenged the impugned order rejecting the Appellants' application for registration of the \"COCK\" word mark.\n\nThe Court considered the differences in the nature of goods for which the Appellants sought registration, compared to the goods for which the \"COCK\" mark was registered in favor of Chinna Nadar. The Court noted that there was little chance of confusion between the two marks, as the Appellants' mark was used for toy pistols, while the device mark registered in favor of Chinna Nadar was used for small fireworks (amorces).\n\nThe Court concluded that none of the criteria under Section 11(1) of the Trademarks Act were satisfied, and therefore, the impugned order was quashed and set aside. The Appellants' application (No. 3757855) was allowed, and the appeal was granted with no order as to costs. The decision was made by Justice C. Hari Shankar on February 1, 2023. The PDF document, available as \"Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf\", provides the detailed court proceedings and decision.",
      "pdf_source": "33. Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 12",
          "node_id": "0015",
          "start_index": 12,
          "end_index": 12,
          "summary": "According to page 12 of the PDF \"Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf\", the court considered the difference in goods for which the appellant sought registration of the COCK word mark, compared to the goods for which the COCK mark was registered in favor of Chinna Nadar. The court noted that there is little chance of confusion between the two marks, as the appellant's mark was used for toy pistols, while the device mark registered in favor of Chinna Nadar was used for amorces (small fireworks). The court concluded that none of the criteria for rejecting an application for registration of a mark under Section 11(1) of the Trademarks Act were satisfied. The case is C.A.(COMM.IPD-TM) 143/2021, with a Neutral Citation Number of 2023/DHC/000729, and was digitally signed by Kamla Rawat on February 2, 2023. (Source: Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf)",
          "content": "Neutral Citation Number : 2023/DHC/000729 \nC.A.(COMM.IPD-TM) 143/2021  \nPage 12 of 13 \n \nconsidered this aspect or the difference in the nature of the \ngoods for which the appellant sought registration, vis-à-vis the \ngoods for which the COCK mark was registered in favour of \nChinna Nadar.   \n \n(iii) Further, there is little chance of any likelihood of \nconfusion in the minds of public between the two marks, or \nlikelihood of any association, by registration of the COCK word \nmark in favour of the appellant, with the rgistratioon of the \n device mark in favour of Chinna Nadar.  As already \nnoted, the appellant’s mark was being used in toy pistols which \nsprayed coloured water during festivals.  The \n device \nmark registered in favour of Chinna Nadar was, on the other \nhand, used for amorces, which are in the nature of small \nfireworks.  It cannot, therefore, be said, in the absence of any \nmaterial to indicate to the contrary, that the registration of the \nCOCK word mark in favour of the appellant, as sought, would \nresult in any likelihood of confusion in the minds of the public. \n \n23. \nNone of the three criteria, which require cumulative satisfaction \nin order for an application for registration of a mark to be rejected \nunder Section 11(1) of the Trademarks Act can, therefore, be said to \nbe satisfied in the present case. \n \n24. \nIn that view of the matter, it is not necessary for this Court to \nenter into the allegations of mala fide etc. which find place in the \nimpugned order and which, in my opinion, ought not to have been \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:02.02.2023\n17:45:24\nSignature Not Verified",
          "pdf_source": "33. Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 13",
          "node_id": "0016",
          "start_index": 13,
          "end_index": 13,
          "summary": "According to page 13 of the PDF \"Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf\", the court concludes that the impugned order is quashed and set aside. The appeal, C.A.(COMM.IPD-TM) 143/2021, is allowed with no order as to costs. The Application No. 3757855 of the appellant is allowed in terms thereof. The decision was made by C.HARI SHANKAR, J on February 1, 2023. The Registrar is directed to take consequential steps in accordance with the law. The PDF source provides the Neutral Citation Number: 2023/DHC/000729, and the case was heard in the High Court of Delhi at New Delhi. The appellants, Manu Garg and Ratan Behari Agarwal, were represented by Mr. M.K. Miglani, Adv., while the respondent, Registrar of Trade Marks, was represented by Mr. Harish Vaidyanathan Shankar, CGSC, and others.",
          "content": "Neutral Citation Number : 2023/DHC/000729 \nC.A.(COMM.IPD-TM) 143/2021  \nPage 13 of 13 \n \nreturned without adequate evidence. \n \nConclusion \n \n25. \nFor the aforesaid reasons, I am unable to sustain the impugned \norder, which is accordingly quashed and set aside.  Application No. \n3757855 of the appellant would accordingly stand allowed in terms \nthereof.    \n \n26. \nThe appeal is, accordingly, allowed with no order as to costs.   \n \n27. \nConsequential steps be taken by the learned Registrar in \naccordance with law.   \n \n \nC.HARI SHANKAR, J \nFEBRUARY 1, 2023 \nrb \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:02.02.2023\n17:45:24\nSignature Not Verified",
          "pdf_source": "33. Manu Garg and Ratan Behari Agarwal v. Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-15T18:36:39.564049",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}