{
  "doc_name": "34. Modern Snack Pvt Ltd. v. The Registrar of Trade Marks",
  "pdf_source": "34. Modern Snack Pvt Ltd. v. The Registrar of Trade Marks.pdf",
  "metadata": {
    "document_name": "34. Modern Snack Pvt Ltd. v. The Registrar of Trade Marks",
    "source_pdf": "34. Modern Snack Pvt Ltd. v. The Registrar of Trade Marks.pdf",
    "judges": [
      "C.HARI SHANKAR JUDGEMENT (ORAL) % 08.12.2022 1."
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "45/2022",
      "45/2022",
      "45/2022",
      "45/2022",
      "45/2022",
      "45/2022"
    ],
    "dhc_numbers": [
      "2022/DHC/005500",
      "2022/DHC/005500",
      "2022/DHC/005500",
      "2022/DHC/005500",
      "2022/DHC/005500"
    ],
    "ia_numbers": [],
    "decision_date": "1 July, 2015",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [],
    "defendants": [],
    "appellants": [
      "Modern Snacks Pvt Ltd"
    ],
    "respondents": [
      "The Registrar of Trade Marks"
    ],
    "plaintiff_advocates": [],
    "defendant_advocates": [],
    "appellant_advocates": [
      "Mr. Shravan Bansal",
      "Mr. Mankaran Singh"
    ],
    "respondent_advocates": [
      "Mr. Harish Vaidyanathan Shankar",
      "Mr. Srish Kumar Mishra",
      "Mr. Sagar Mehlawat",
      "Mr. Alexander Mathai Paikaday"
    ],
    "damages_claimed": null,
    "damages_awarded": null,
    "key_issues": [
      "The appellant's application for registration of the label \"Modern Namkeen Karare Lal\" as a device mark under Section 18 of the Trade Marks Act, 1999 was rejected by the Assistant Registrar of Trademarks.",
      "The rejection was based on the ground that the appellant had withdrawn its trademark application, which the appellant disputes.",
      "The appellant's review application under Section 127(c) of the Trade Marks Act was rejected by the Deputy Registrar of Trade Marks.",
      "The appellant has appealed to the High Court under Section 91 of the Trade Marks Act, but the appeal may be belated.",
      "The respondent argues that the appeal is time-barred and that no application for condonation of delay has been filed.",
      "The appellant must show sufficient cause for the delay in preferring the appeal under the proviso to Section 91(2) of the Trade Marks Act.",
      "The court must consider whether the appellant has made out a sufficient case for condonation of delay and admission of the appeal.",
      "The appeal raises issues of trademark law, including the requirements for registration and the procedures for review and appeal.",
      "The court's decision will depend on its interpretation of the relevant provisions of the Trade Marks Act, 1999, including Sections 18, 91, and 127.",
      "The appellant's failure to appear for hearing or file an application for adjournment led to the application being treated as abandoned."
    ],
    "decision_summary": "**Comprehensive Summary of the Legal Case: Modern Snacks Pvt Ltd vs. The Registrar of Trade Marks**\n\n**Background:**\nThe appellant, Modern Snacks Pvt Ltd, applied for registration of the label \"Modern Namkeen Karare Lal\" as a device mark under Section 18 of the Trade Marks Act, 1999. The application was initially rejected by the Assistant Registrar of Trademarks on July 1, 2015, on the ground that the appellant had withdrawn its trademark application. The appellant then applied for a review of the order under Section 127(c) of the Trade Marks Act.\n\n**Legal Issues:**\nThe review application was rejected by the Deputy Registrar of Trade Marks on July 10, 2018, on the sole ground of default in appearance, as neither the appellant nor its representative appeared for the hearing. The appellant appealed to the High Court of Delhi under Section 91 of the Trade Marks Act, which requires appeals to be filed within three months from the date of communication of the order. However, the appellant claimed that the impugned order had not been communicated to them and that they only came to know of it in December 2020 while searching the Registrar's website.\n\n**Arguments:**\nThe respondent, the Registrar of Trade Marks, argued that the appeal was belated and that no application for condonation of delay had been filed. The appellant, on the other hand, argued that the impugned order had not been communicated to them and that they had only recently discovered it.\n\n**Court Findings:**\nThe court noted that the review application had been rejected solely on the ground of default in appearance. The court also observed that the appellant had claimed that the impugned order had not been communicated to them and that they had only recently discovered it.\n\n**Decision:**\nThe court's decision is not explicitly stated in the provided text. However, based on the information provided, it appears that the court may consider the appellant's claim that the impugned order had not been communicated to them and that they had only recently discovered it. The court may also consider the respondent's argument that the appeal is belated and that no application for condonation of delay has been filed. Ultimately, the court will need to determine whether to admit the appeal and consider the appellant's claim for registration of the label \"Modern Namkeen Karare Lal\" as a device mark.\n\n**Key Points:**\n\n* The appellant applied for registration of the label \"Modern Namkeen Karare Lal\" as a device mark under Section 18 of the Trade Marks Act, 1999.\n* The review application was rejected on the sole ground of default in appearance.\n* The appellant claims that the impugned order had not been communicated to them and that they only recently discovered it.\n* The respondent argues that the appeal is belated and that no application for condonation of delay has been filed.\n* The court will need to determine whether to admit the appeal and consider the appellant's claim for registration of the label.",
    "legal_precedents": [],
    "full_text": "\n--- PAGE 1 ---\n                   Neutral Citation Number : 2022/DHC/005500 \n \nC.A.(COMM.IPD-TM) 45/2022                                                                   Page 1 of 5 \n \n$~32(Original) \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.A.(COMM.IPD-TM) 45/2022 \n \nMODERN SNACKS PVT LTD \n \n        ..... Appellant \nThrough: \nMr. Shravan Bansal and Mr. \nMankaran Singh, Advs. \n \n \n \n \n \nversus \n \n \nTHE REGISTRAR OF TRADE MARK \n      ..... Respondent \nThrough: \nMr. Harish Vaidyanathan Shankar, \nCGSC with Mr. Srish Kumar Mishra, Mr. \nSagar \nMehlawat, \nMr. \nAlexander \nMathai \nPaikaday, Advs. \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C.HARI SHANKAR \n \n \n \n   JUDGEMENT (ORAL) \n% \n \n \n \n08.12.2022 \n \n \n1. \nThe appellant applied for registration of the label “Modern \nNamkeen Karare Lal” as a device mark under Section 18 of the Trade \nMarks Act, 1999. \n \n2. \nVide order dated 1st July 2015, the application was rejected by the \nAssistant Registrar of Trademarks on the ground that the appellant had \nwithdrawn its trademark application by letter dated 26/30th June 2015. \nThe appellant applied for review of the aforesaid order under Section \n127(c) of the Trade Marks Act. \n \n3. \nThe said review application stands rejected by the following order \ndated 10th July 2018: \n \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n11:47:59\nSignature Not Verified\n\n--- PAGE 2 ---\n                   Neutral Citation Number : 2022/DHC/005500 \n \nC.A.(COMM.IPD-TM) 45/2022                                                                   Page 2 of 5 \n \n \n \n“IN THE MATTER OF Application No. 1937329 filed in the name(s) \nof \nM/s. MODERN SNACKS (P) LIMITED \nD - 44, PANKI SITE II, KANPUR, U.P \nAnd \nIN THE MATTER OF TM-M dated 29/07/2015 filed by \nM/s. S. SINGH & ASSOCIATES \n213, 3RD FLOOR PARMANAND COLONY, DR. MUKHERJEE \nNAGAR DELHI-9 \n \nPresent None present Advocate of M/s. S. SINGH & ASSOCIATES \nfor the petitioner \n \nORDER \n \nAn application for registration of trade mark consisting of word \n\"MODERN NAMKEEN KARARE LAL (LABEL)\" was filed by the \naforesaid Applicant under application No 1937329 in respect of all \ngoods included in Class - 30. The application was examined and \nexamination report containing the objections to the acceptance of \napplication for registration of trade mark was communicated to the \nApplicant. On the request of the Applicant, a hearing was fixed in this \nmatter. Eventually on 20 April 2015, the application came up before \nme for hearing. Neither anybody appeared for hearing, nor was any \napplication for adjournment filed on behalf of the applicant. \nAccordingly the application was treated as abandoned and the order \nwas passed accordingly. \n \nThe present petition on form TM-M has been filed for review of the \norder dated 20 April 2015.  \n \nNone present \n \nThe request on form TM-M is accordingly Refused. \n \nSealed and signed at the Trade Marks Registry, Branch Delhi \non dated: 10 July 2018. \n \n(Dr. PRITHPAL KAUR) \nDEPUTY REGISTRAR OF TRADE MARKS” \n \n4. \nAggrieved thereby, the appellant has appealed to this Court under \nSection 91 of the Trade Marks Act. \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n11:47:59\nSignature Not Verified\n\n--- PAGE 3 ---\n                   Neutral Citation Number : 2022/DHC/005500 \n \nC.A.(COMM.IPD-TM) 45/2022                                                                   Page 3 of 5 \n \n \n5. \nSection 91(1)1 requires the appeal to be filed within a period of \nthree months from the date on which the order under appeal is \ncommunicated to the appellant. The proviso to Section 91(2)2, however, \nallows an appeal to be admitted even after the expiry of the period of \nthree months provided sufficient cause is shown by the appellant for the \ndelay in preferring the appeal. \n \n6. \nMr. Vaidyanathan, learned Counsel for the respondent submits that \nthe present appeal is belated and that no application for condonation of \ndelay has been filed with it. \n \n7. \nPara 3 of the present appeal deals with the aspect of limitation. It is \naverred that the impugned order dated 10th July 2018 has yet to be \ncommunicated to the appellant and that the appellant came to know of \nthe said order only in the second week of December 2020 while making a \nrandom search on the website of the Registrar of Trademarks to ascertain \nthe status of its application. \n \n8. \nIn any event, a reading of the impugned order dated 10th July 2018 \npassed by the learned Registrar of Trademarks on the Review \nApplication filed by the appellant reveals that the application effectively \nbeen rejected on the sole ground of default in appearance. \n \n9. \nThough Mr. Vaidyanathan is agreeable to the Review Application \n                                          \n91.  \nAppeals to Appellate Board.— (1) Any person aggrieved by an order or decision of the Registrar \nunder this Act, or the rules made thereunder may prefer an appeal to the Appellate Board within three months \nfrom the date on which the order or decision sought to be appealed against is communicated to such person \npreferring the appeal. \n \n2  \nProvided that an appeal may be admitted after the expiry of the period specified therefor, if the appellant \nsatisfies the Appellate Board that he had sufficient cause for not preferring the appeal within the specified period. \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n11:47:59\nSignature Not Verified\n\n--- PAGE 4 ---\n                   Neutral Citation Number : 2022/DHC/005500 \n \nC.A.(COMM.IPD-TM) 45/2022                                                                   Page 4 of 5 \n \nbeing remanded for a re-consideration, keeping all contentions of both \nparties alive, he submits that he should not be deprived of his right to \nurge that the present appeal is belated. \n \n10. \nI do not deem it necessary to keep this matter pending only \navailing a resolution of that issue. \n \n11. \nAs such, the present petition is disposed of by remanding the \nmatter to the learned Registrar of Trademarks for a re-consideration of \nthe Review Application filed by the appellant against the order dated 1st \nJuly 2015. \n \n12. \nHowever, keeping in mind the preliminary objection raised by Mr. \nVaidyanathan to the present appeal, the appellant would first be required \nto satisfy the learned Registrar that, in fact, the earlier order dated 10th \nJuly 2018 was not communicated to the appellant.  The necessity of a de \nnovo adjudication would, therefore, be subject to the learned Registrar \nbeing satisfied in that regard. \n \n13. \nIn case, the learned Registrar is satisfied that the earlier order dated \n10th July 2018 was not communicated to the appellant, the order dated \n10th July 2018 would stand set aside. The learned Registrar would, in that \nevent, re-consider the appellant’s Review Application and pass fresh \norders thereon, after hearing both parties in accordance with law. \n \n14. \nNeedless to say, all rights and contentions of the parties remain \nopen to be urged before the learned Registrar. \n \n15. \nThis petition stands disposed of in the aforesaid terms with no \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n11:47:59\nSignature Not Verified\n\n--- PAGE 5 ---\n                   Neutral Citation Number : 2022/DHC/005500 \n \nC.A.(COMM.IPD-TM) 45/2022                                                                   Page 5 of 5 \n \norder as to costs. \n \n16. \nFor the said purpose, let both parties appear before the learned \nRegistrar of Trademarks on 22nd December 2022. \n \n \nC.HARI SHANKAR, J \n \nDECEMBER 8, 2022/AR \n \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n11:47:59\nSignature Not Verified\n"
  },
  "total_pages": 5,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0002",
      "start_index": 1,
      "end_index": 1,
      "summary": "According to the PDF document \"Modern Snack Pvt Ltd. v. The Registrar of Trade Marks.pdf\", the case involves a legal dispute between Modern Snacks Pvt Ltd. (Appellant) and The Registrar of Trade Marks (Respondent). The case, C.A.(COMM.IPD-TM) 45/2022, was heard in the High Court of Delhi at New Delhi. The Appellant was represented by Mr. Shravan Bansal and Mr. Mankaran Singh, while the Respondent was represented by Mr. Harish Vaidyanathan Shankar and others.\n\nThe Appellant had applied for registration of the label \"Modern Namkeen Karare Lal\" as a device mark under Section 18 of the Trade Marks Act, 1999. However, the application was rejected by the Assistant Registrar of Trademarks on July 1, 2015, citing that the Appellant had withdrawn its trademark application. The Appellant then applied for a review of the order under Section 127(c) of the Trade Marks Act, but this was also rejected on July 10, 2018.\n\nThe case was heard by Hon'ble Mr. Justice C. Hari Shankar on December 8, 2022. The PDF document provides the case header, parties, and proceedings, but the final judgment is not specified in the provided section. The document is signed digitally by Kamla Rawat on December 13, 2022. The case highlights the legal proceedings and disputes related to trademark registration in India, as per the Trade Marks Act, 1999, and is documented in the PDF source \"Modern Snack Pvt Ltd. v. The Registrar of Trade Marks.pdf\".",
      "pdf_source": "34. Modern Snack Pvt Ltd. v. The Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "According to page 1 of the PDF \"34. Modern Snack Pvt Ltd. v. The Registrar of Trade Marks.pdf\", the High Court of Delhi at New Delhi heard the case C.A.(COMM.IPD-TM) 45/2022. The appellant, Modern Snacks Pvt Ltd, applied for registration of the label \"Modern Namkeen Karare Lal\" under Section 18 of the Trade Marks Act, 1999. The application was rejected on July 1, 2015, by the Assistant Registrar of Trademarks, citing the appellant's withdrawal of the application. The appellant applied for a review, which was rejected on July 10, 2018. The case was heard by Hon'ble Mr. Justice C. Hari Shankar on December 8, 2022. The appellant was represented by Mr. Shravan Bansal and Mr. Mankaran Singh, while the respondent, The Registrar of Trade Marks, was represented by Mr. Harish Vaidyanathan Shankar and others. (Source: PDF \"34. Modern Snack Pvt Ltd. v. The Registrar of Trade Marks.pdf\", page 1)",
          "content": "Neutral Citation Number : 2022/DHC/005500 \n \nC.A.(COMM.IPD-TM) 45/2022                                                                   Page 1 of 5 \n \n$~32(Original) \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.A.(COMM.IPD-TM) 45/2022 \n \nMODERN SNACKS PVT LTD \n \n        ..... Appellant \nThrough: \nMr. Shravan Bansal and Mr. \nMankaran Singh, Advs. \n \n \n \n \n \nversus \n \n \nTHE REGISTRAR OF TRADE MARK \n      ..... Respondent \nThrough: \nMr. Harish Vaidyanathan Shankar, \nCGSC with Mr. Srish Kumar Mishra, Mr. \nSagar \nMehlawat, \nMr. \nAlexander \nMathai \nPaikaday, Advs. \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C.HARI SHANKAR \n \n \n \n   JUDGEMENT (ORAL) \n% \n \n \n \n08.12.2022 \n \n \n1. \nThe appellant applied for registration of the label “Modern \nNamkeen Karare Lal” as a device mark under Section 18 of the Trade \nMarks Act, 1999. \n \n2. \nVide order dated 1st July 2015, the application was rejected by the \nAssistant Registrar of Trademarks on the ground that the appellant had \nwithdrawn its trademark application by letter dated 26/30th June 2015. \nThe appellant applied for review of the aforesaid order under Section \n127(c) of the Trade Marks Act. \n \n3. \nThe said review application stands rejected by the following order \ndated 10th July 2018: \n \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n11:47:59\nSignature Not Verified",
          "pdf_source": "34. Modern Snack Pvt Ltd. v. The Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Facts and Arguments",
      "node_id": "0006",
      "start_index": 2,
      "end_index": 4,
      "summary": "According to the PDF document \"Modern Snack Pvt Ltd. v. The Registrar of Trade Marks.pdf\", the High Court of Delhi at New Delhi heard an appeal (C.A.(COMM.IPD-TM) 45/2022) filed by Modern Snacks Pvt Ltd. (Appellant) against the Registrar of Trade Marks (Respondent). \n\nThe Appellant had filed a trade mark application (No. 1937329) for the mark \"MODERN NAMKEEN KARARE LAL (LABEL)\" in Class 30, which was initially examined and an examination report was sent to the Appellant. A hearing was scheduled, but no one appeared on behalf of the Appellant, and the application was treated as abandoned.\n\nThe Appellant then filed a review petition (TM-M) which was rejected by the Deputy Registrar of Trade Marks on July 10, 2018. The Appellant appealed to the High Court under Section 91 of the Trade Marks Act, but the appeal was filed after a delay. The Respondent's counsel argued that the appeal was belated and no application for condonation of delay had been filed.\n\nThe Appellant claimed that they only became aware of the rejection order in December 2020 while searching the Registrar's website. The Court considered the appeal, focusing on the issue of limitation and the Appellant's claim of not being communicated the order. The case highlights the importance of adhering to timelines and procedures in legal proceedings, as outlined in the Trade Marks Act. (Source: Modern Snack Pvt Ltd. v. The Registrar of Trade Marks.pdf)",
      "pdf_source": "34. Modern Snack Pvt Ltd. v. The Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 2",
          "node_id": "0003",
          "start_index": 2,
          "end_index": 2,
          "summary": "According to page 2 of the PDF \"34. Modern Snack Pvt Ltd. v. The Registrar of Trade Marks.pdf\", an application for registration of the trade mark \"MODERN NAMKEEN KARARE LAL (LABEL)\" was filed by Modern Snacks Pvt Ltd under application No. 1937329 in Class 30. The application was examined, and an examination report was communicated to the applicant. A hearing was fixed, but no one appeared, and the application was treated as abandoned on April 20, 2015. A review petition on form TM-M was filed, but it was refused on July 10, 2018, by Deputy Registrar of Trade Marks, Dr. Prithpal Kaur. The appellant appealed to the High Court of Delhi under Section 91 of the Trade Marks Act, as stated on page 2 of the PDF.",
          "content": "Neutral Citation Number : 2022/DHC/005500 \n \nC.A.(COMM.IPD-TM) 45/2022                                                                   Page 2 of 5 \n \n \n \n“IN THE MATTER OF Application No. 1937329 filed in the name(s) \nof \nM/s. MODERN SNACKS (P) LIMITED \nD - 44, PANKI SITE II, KANPUR, U.P \nAnd \nIN THE MATTER OF TM-M dated 29/07/2015 filed by \nM/s. S. SINGH & ASSOCIATES \n213, 3RD FLOOR PARMANAND COLONY, DR. MUKHERJEE \nNAGAR DELHI-9 \n \nPresent None present Advocate of M/s. S. SINGH & ASSOCIATES \nfor the petitioner \n \nORDER \n \nAn application for registration of trade mark consisting of word \n\"MODERN NAMKEEN KARARE LAL (LABEL)\" was filed by the \naforesaid Applicant under application No 1937329 in respect of all \ngoods included in Class - 30. The application was examined and \nexamination report containing the objections to the acceptance of \napplication for registration of trade mark was communicated to the \nApplicant. On the request of the Applicant, a hearing was fixed in this \nmatter. Eventually on 20 April 2015, the application came up before \nme for hearing. Neither anybody appeared for hearing, nor was any \napplication for adjournment filed on behalf of the applicant. \nAccordingly the application was treated as abandoned and the order \nwas passed accordingly. \n \nThe present petition on form TM-M has been filed for review of the \norder dated 20 April 2015.  \n \nNone present \n \nThe request on form TM-M is accordingly Refused. \n \nSealed and signed at the Trade Marks Registry, Branch Delhi \non dated: 10 July 2018. \n \n(Dr. PRITHPAL KAUR) \nDEPUTY REGISTRAR OF TRADE MARKS” \n \n4. \nAggrieved thereby, the appellant has appealed to this Court under \nSection 91 of the Trade Marks Act. \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n11:47:59\nSignature Not Verified",
          "pdf_source": "34. Modern Snack Pvt Ltd. v. The Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "According to page 3 of the PDF \"34. Modern Snack Pvt Ltd. v. The Registrar of Trade Marks.pdf\", the appeal filed by Modern Snacks Pvt Ltd is belated, with no application for condonation of delay. The respondent's counsel, Mr. Harish Vaidyanathan Shankar, submits that the appeal is late. The appellant claims the impugned order dated July 10, 2018, was not communicated to them and was only discovered in December 2020. The order was rejected due to default in appearance. The appeal is governed by Section 91(1) of the Act, which requires filing within three months, with a proviso allowing admission after the expiry period if sufficient cause is shown. The appellant's counsel, Mr. Shravan Bansal and Mr. Mankaran Singh, will need to address the issue of delay. (Source: PDF \"34. Modern Snack Pvt Ltd. v. The Registrar of Trade Marks.pdf\", page 3)",
          "content": "Neutral Citation Number : 2022/DHC/005500 \n \nC.A.(COMM.IPD-TM) 45/2022                                                                   Page 3 of 5 \n \n \n5. \nSection 91(1)1 requires the appeal to be filed within a period of \nthree months from the date on which the order under appeal is \ncommunicated to the appellant. The proviso to Section 91(2)2, however, \nallows an appeal to be admitted even after the expiry of the period of \nthree months provided sufficient cause is shown by the appellant for the \ndelay in preferring the appeal. \n \n6. \nMr. Vaidyanathan, learned Counsel for the respondent submits that \nthe present appeal is belated and that no application for condonation of \ndelay has been filed with it. \n \n7. \nPara 3 of the present appeal deals with the aspect of limitation. It is \naverred that the impugned order dated 10th July 2018 has yet to be \ncommunicated to the appellant and that the appellant came to know of \nthe said order only in the second week of December 2020 while making a \nrandom search on the website of the Registrar of Trademarks to ascertain \nthe status of its application. \n \n8. \nIn any event, a reading of the impugned order dated 10th July 2018 \npassed by the learned Registrar of Trademarks on the Review \nApplication filed by the appellant reveals that the application effectively \nbeen rejected on the sole ground of default in appearance. \n \n9. \nThough Mr. Vaidyanathan is agreeable to the Review Application \n                                          \n91.  \nAppeals to Appellate Board.— (1) Any person aggrieved by an order or decision of the Registrar \nunder this Act, or the rules made thereunder may prefer an appeal to the Appellate Board within three months \nfrom the date on which the order or decision sought to be appealed against is communicated to such person \npreferring the appeal. \n \n2  \nProvided that an appeal may be admitted after the expiry of the period specified therefor, if the appellant \nsatisfies the Appellate Board that he had sufficient cause for not preferring the appeal within the specified period. \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n11:47:59\nSignature Not Verified",
          "pdf_source": "34. Modern Snack Pvt Ltd. v. The Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "According to page 4 of the PDF \"34. Modern Snack Pvt Ltd. v. The Registrar of Trade Marks.pdf\", the court has decided to remand the matter to the Registrar of Trademarks for a re-consideration of the Review Application filed by Modern Snack Pvt Ltd. The appellant must first satisfy the Registrar that the earlier order dated 10th July 2018 was not communicated to them. If satisfied, the order dated 10th July 2018 will be set aside, and the Registrar will re-consider the Review Application and pass fresh orders after hearing both parties. All rights and contentions of the parties remain open to be urged before the Registrar. The petition has been disposed of in these terms, with no orders as to costs. The decision was signed by Kamla Rawat on 13th December 2022. (Source: PDF \"34. Modern Snack Pvt Ltd. v. The Registrar of Trade Marks.pdf\", page 4)",
          "content": "Neutral Citation Number : 2022/DHC/005500 \n \nC.A.(COMM.IPD-TM) 45/2022                                                                   Page 4 of 5 \n \nbeing remanded for a re-consideration, keeping all contentions of both \nparties alive, he submits that he should not be deprived of his right to \nurge that the present appeal is belated. \n \n10. \nI do not deem it necessary to keep this matter pending only \navailing a resolution of that issue. \n \n11. \nAs such, the present petition is disposed of by remanding the \nmatter to the learned Registrar of Trademarks for a re-consideration of \nthe Review Application filed by the appellant against the order dated 1st \nJuly 2015. \n \n12. \nHowever, keeping in mind the preliminary objection raised by Mr. \nVaidyanathan to the present appeal, the appellant would first be required \nto satisfy the learned Registrar that, in fact, the earlier order dated 10th \nJuly 2018 was not communicated to the appellant.  The necessity of a de \nnovo adjudication would, therefore, be subject to the learned Registrar \nbeing satisfied in that regard. \n \n13. \nIn case, the learned Registrar is satisfied that the earlier order dated \n10th July 2018 was not communicated to the appellant, the order dated \n10th July 2018 would stand set aside. The learned Registrar would, in that \nevent, re-consider the appellant’s Review Application and pass fresh \norders thereon, after hearing both parties in accordance with law. \n \n14. \nNeedless to say, all rights and contentions of the parties remain \nopen to be urged before the learned Registrar. \n \n15. \nThis petition stands disposed of in the aforesaid terms with no \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n11:47:59\nSignature Not Verified",
          "pdf_source": "34. Modern Snack Pvt Ltd. v. The Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Decision and Orders",
      "node_id": "0008",
      "start_index": 5,
      "end_index": 5,
      "summary": "According to the PDF document \"Modern Snack Pvt Ltd. v. The Registrar of Trade Marks.pdf\", the High Court of Delhi at New Delhi heard the case C.A.(COMM.IPD-TM) 45/2022. The appellant, Modern Snacks Pvt Ltd, was represented by Mr. Shravan Bansal and Mr. Mankaran Singh, while the respondent, The Registrar of Trade Marks, was represented by Mr. Harish Vaidyanathan Shankar.\n\nThe court, presided over by Justice C. Hari Shankar, issued an order on December 8, 2022. The order stated that both parties were to appear before the learned Registrar of Trademarks on December 22, 2022, for a specific purpose. The order also mentioned that the court would decide on the costs associated with the case.\n\nThe key details of the case are:\n- Case number: C.A.(COMM.IPD-TM) 45/2022\n- Neutral Citation Number: 2022/DHC/005500\n- Date of order: December 8, 2022\n- Date of appearance before Registrar of Trademarks: December 22, 2022\n- Parties: Modern Snacks Pvt Ltd (appellant) and The Registrar of Trade Marks (respondent)\n- Representatives: Mr. Shravan Bansal and Mr. Mankaran Singh (appellant), Mr. Harish Vaidyanathan Shankar (respondent)\n- Judge: Justice C. Hari Shankar\n\nSource: Modern Snack Pvt Ltd. v. The Registrar of Trade Marks.pdf",
      "pdf_source": "34. Modern Snack Pvt Ltd. v. The Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 5",
          "node_id": "0007",
          "start_index": 5,
          "end_index": 5,
          "summary": "According to page 5 of the PDF \"34. Modern Snack Pvt Ltd. v. The Registrar of Trade Marks.pdf\", the court orders both parties to appear before the Registrar of Trademarks on December 22, 2022. The order is made by Justice C. Hari Shankar on December 8, 2022. The case is C.A.(COMM.IPD-TM) 45/2022, with Modern Snacks Pvt Ltd as the appellant and the Registrar of Trade Marks as the respondent. The appellant is represented by Mr. Shravan Bansal and Mr. Mankaran Singh, while the respondent is represented by Mr. Harish Vaidyanathan Shankar. The court also mentions the order as to costs, but does not specify any amounts. The document is digitally signed by Kamla Rawat on December 13, 2022. (Source: 34. Modern Snack Pvt Ltd. v. The Registrar of Trade Marks.pdf)",
          "content": "Neutral Citation Number : 2022/DHC/005500 \n \nC.A.(COMM.IPD-TM) 45/2022                                                                   Page 5 of 5 \n \norder as to costs. \n \n16. \nFor the said purpose, let both parties appear before the learned \nRegistrar of Trademarks on 22nd December 2022. \n \n \nC.HARI SHANKAR, J \n \nDECEMBER 8, 2022/AR \n \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n11:47:59\nSignature Not Verified",
          "pdf_source": "34. Modern Snack Pvt Ltd. v. The Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-15T18:29:58.371977",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}