{
  "doc_name": "35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd.",
  "pdf_source": "35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd..pdf",
  "metadata": {
    "document_name": "35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd.",
    "source_pdf": "35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd..pdf",
    "judges": [
      "C. HARI SHANKAR 1."
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "80/2021",
      "80/2021",
      "80/2021",
      "80/2021",
      "80/2021",
      "80/2021",
      "80/2021",
      "80/2021",
      "80/2021",
      "80/2021",
      "178/2023"
    ],
    "dhc_numbers": [
      "2023/DHC/000136",
      "2023/DHC/000136",
      "2023/DHC/000136",
      "2023/DHC/000136",
      "2023/DHC/000136",
      "2023/DHC/000136",
      "2023/DHC/000136",
      "2023/DHC/000136",
      "2023/DHC/000136"
    ],
    "ia_numbers": [],
    "decision_date": "11 July, 2014",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [],
    "defendants": [],
    "appellants": [
      "M/S V-GUARD INDUSTRIES LTD."
    ],
    "respondents": [
      "M/S LIVGUARD ENERGY TECHNOLOGIES PVT LTD AND ANR"
    ],
    "plaintiff_advocates": [],
    "defendant_advocates": [],
    "appellant_advocates": [
      "Ms. Bhabna Das",
      "Mr. Mukul Kumar",
      "Mr. Vizzy George"
    ],
    "respondent_advocates": [
      "Mr. Jithin M. George",
      "Mr. Udit Tewari",
      "Mr. Harish Vaidyanathan Shankar",
      "Mr. Srish Kumar Mishra",
      "Mr. Gagar Mehlawat",
      "Mr. Alexander Mathai Paikaday"
    ],
    "damages_claimed": null,
    "damages_awarded": null,
    "key_issues": [
      "The interpretation of Rule 45 of the Trade Marks Rules 2017 regarding the abandonment of opposition to a trademark registration application is a key issue.",
      "The applicability of Rule 45(2) when the opponent fails to submit evidence or a statement of intention to rely on the notice of opposition is a crucial point of contention.",
      "The requirement for the opponent to leave evidence with the Registrar or intimate their intention to rely on the facts stated in the notice of opposition within the prescribed time is a vital consideration.",
      "The issue of deemed abandonment of opposition under Rule 45(2) and its implications on the trademark registration process is a significant concern.",
      "The role of the Registrar in determining whether the opposition has been abandoned and allowing the application to proceed further is an important issue.",
      "The potential consequences of abandonment of opposition on the rights of the opponent and the applicant in the trademark registration process need to be considered.",
      "The interplay between the Trade Marks Act 1999 and the Trade Marks Rules 2017 in relation to opposition proceedings and the abandonment of opposition is a key aspect.",
      "The burden of proof on the opponent to submit evidence or a statement of intention to rely on the notice of opposition within the prescribed time is a significant issue.",
      "The potential for the applicant to proceed with the registration of their trademark if the opposition is deemed abandoned is a critical consideration."
    ],
    "decision_summary": "**Case Summary: M/s V-Guard Industries Ltd. vs. M/s Livguard Energy Technologies Pvt Ltd. & Anr.**\n\n**Background:**\nThe case revolves around a trademark opposition proceeding initiated by M/s V-Guard Industries Ltd. (Appellant) against M/s Livguard Energy Technologies Pvt Ltd. (Respondent 1) under Section 21 of the Trade Mark Act, 1999. Respondent 1 had applied for the registration of its trademark \"LIVGUARD ZING\" in respect of batteries, invertors, and similar goods. The Appellant opposed this application, and the Respondent 1 filed a counter-statement in response to the notice of opposition.\n\n**Legal Issues:**\nThe primary issue in this case is the interpretation of Rule 45 of the Trade Marks Rules, 2017, which deals with the Evidence in Support of Opposition. Specifically, the court had to decide whether the Appellant's failure to file evidence in support of its opposition within the prescribed time limit, as stipulated in Rule 45, resulted in the abandonment of its opposition.\n\n**Arguments:**\nThe Appellant argued that the language of Rule 45 was ambiguous and that the phrase \"leave with the Registrar\" was unclear. The Appellant contended that it had not abandoned its opposition and that the Respondent 1's application for registration should not be allowed to proceed.\n\nThe Respondent 1, on the other hand, argued that the Appellant's failure to file evidence in support of its opposition within the prescribed time limit, as required by Rule 45, resulted in the deemed abandonment of its opposition.\n\n**Court Findings:**\nThe court observed that Rule 45 is \"very unhappily worded\" and that the expression \"leave with the Registrar\" is unclear. The court noted that Rule 8 of the Trade Mark Rules, which deals with \"leaving of documents,\" provides some guidance on this issue. However, the court ultimately held that the Appellant's failure to file evidence in support of its opposition within the prescribed time limit resulted in the deemed abandonment of its opposition, as stipulated in Rule 45(2) of the Trade Marks Rules, 2017.\n\n**Decision:**\nThe court dismissed the Appellant's appeal and upheld the order of the Deputy Registrar of Trademarks, which had allowed the Respondent 1's application for registration to proceed due to the Appellant's deemed abandonment of its opposition. The court ordered that there shall be no order as to the costs of the proceedings.\n\nIn summary, the court's decision in this case emphasizes the importance of adhering to the procedural requirements of the Trade Marks Rules, 2017, and provides guidance on the interpretation of Rule 45 in cases where an opponent fails to file evidence in support of its opposition within the prescribed time limit.",
    "legal_precedents": [],
    "full_text": "\n--- PAGE 1 ---\nNeutral Citation Number : 2023/DHC/000136 \n C.A.(COMM.IPD-TM) 80/2021                                                                       Page 1 of 9  \n \n   \n$~1 \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.A.(COMM.IPD-TM) 80/2021 & I.A. 178/2023 \n \nM/S V-GUARD INDUSTRIES LTD.  \n         ..... Appellant \nThrough: \nMs. Bhabna Das, Mr. Mukul \nKumar and Mr. Vizzy George, Advs.  \n \n \n \n \n \nversus \n \nM/S LIVGUARD ENERGY TECHNOLOGIES PVT LTD \nAND ANR  \n \n \n \n \n    ..... Respondents \nThrough: \nMr. Jithin M. George and Mr. \nUdit Tewari, Advs. for R-1 \nMr. Harish Vaidyanathan Shankar, CGSC \nwith Mr. Srish Kumar Mishra, Mr. Gagar \nMehlawat, Mr. Alexander Mathai Paikaday, \nAdvs. for R-2 \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C. HARI SHANKAR \n \n \n \n \n    \n1. \nThis appeal assails the following order dated 30\nJ U D G M E N T (ORAL) \n% \n \n \n \n   06.01.2023 \n \nth\n \n“Proceedings were initiated under Section 21 of the Trade \nMark Act, 1999, by the above named opponent to oppose the \nregistration of trade mark applied for by the above named applicant \nand whereas the Counter Statement was filed by the applicant and \nthe same was served to the opponent on and whereas within the \ntime prescribed under the rules, neither any evidence in support of \nopposition was filed nor any statement was submitted on behalf of \nthe opponent to the effect that the opponent does not desire to \nadduce evidence but wants to rely on the facts mentioned in the \nNotice of Opposition. The above mentioned opposition is, \ntherefore, deemed to have been abandoned under Rule 45(2) of the \nTrade Marks Rules 2017.Thc above mentioned application shall \n August 2018, \npassed by the learned Deputy Registrar of Trademarks in Application \nNo. 2772497 filed by Respondent 1 M/s Livguard Energy \nTechnologies \nPvt \nLtd. \nseeking \nregistration \nof \ntheir \nmark \n“LIVGUARD ZING” in respect of batteries, invertors and like goods: \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified\n\n--- PAGE 2 ---\nNeutral Citation Number : 2023/DHC/000136 \n C.A.(COMM.IPD-TM) 80/2021                                                                       Page 2 of 9  \n \n   \nproceed further as per rules.  \n \nIT IS HEREBY FURTHER ORDERED that there shall be \nno order as to cost of these proceedings.” \n \n2. \nGiven the nature of the controversy in the present case, it is not \nnecessary to enter into the specifics of the application seeking \nregistration.  \n \n3. \nSuffice it to state that the application for registration was filed \nby Respondent 1 on 11th July 2014, and was published in the Register \nof Trade Marks on 15th February 2016 inviting opposition and that, on \n2nd June 2016, notice of opposition was filed by the appellant before \nthe learned Registrar.  Counter statement, in response to the notice of \nopposition filed by the appellant was filed by the Respondent 1 on 7th \nMarch 2018.  It is an admitted position that, on the same day i.e., 7th\n \n \nMarch 2018, the notice of counter statement filed by Respondent 1 \nwas served electronically on the appellant.  \n4. \nRule 45 of the Trade Marks Rules reads thus: \n“45. \nEvidence in support of opposition.— (1) Within two \nmonths from  service of a copy of the counterstatement, the \nopponent shall either leave with the Registrar, such evidence by \nway of affidavit as he may desire to adduce in support of his \nopposition or shall intimate to the Registrar and to the applicant in \nwriting that he does not desire to adduce evidence in support of his \nopposition but intends to rely on the facts stated in the notice of \nopposition. He shall deliver to the applicant copies of any evidence \nincluding exhibits, if any, that he leaves with the Registrar under \nthis sub-rule and intimate the Registrar in writing of such delivery. \n \nIf an opponent takes no action under sub-rule (1) within the \ntime mentioned therein, he shall be deemed to have abandoned his \nopposition.” \n \n \n5. \nAt a plain glance, Rule 45 is very unhappily worded. It uses the \nexpression “leave with the Registrar”. This is an expression to which \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified\n\n--- PAGE 3 ---\nNeutral Citation Number : 2023/DHC/000136 \n C.A.(COMM.IPD-TM) 80/2021                                                                       Page 3 of 9  \n \n   \nno legal interpretation can possibly be given.  \n \n6. \nMy attention has been invited to Rule 8 of the Trade Mark \nRules which deals with “leaving of documents” etc. and reads thus: \n“8. \nLeaving of documents, etc.— All applications, notices, \nstatements or other documents or any fees authorised or required \nby the Act or the rules to be made, served, left or sent or paid at or \nto the Trade Marks Registry in relation to a trademark on the \nRegister of trademarks on the notified date or for which an \napplication for registration is pending on, or is made on or after the \nnotified date, shall be made, served, left or sent or paid to the \nappropriate office of the Trade Marks Registry: \n \nProvided that the Registrar may, by notification in the journal, \npermit the filing of certain forms or documents, other than the \napplication for the registration of a trademark in any other office of \nthe Trade Marks Registry.” \n \n7. \nUnfortunately, Rule 8 of the Trade Mark Rules is just as \nnebulous as Rule 45.  It requires the opponent, opposing the \nregistration of a trade mark, to “leave with the Registrar”, evidence by \nway of affidavit.  It is difficult to understand the expression “leave \nwith the Registrar”.  At any rate, it is not an expression which should \nordinarily find place in a legislative document. \n \n8. \nThe case of the appellant, as argued by Ms. Bhabna Das, \nlearned Counsel for the appellant, and as set out in the present appeal, \nis that 7th May 2018 being the last date by which the evidence in \nopposition was required to be filed by the appellant, attempts were \nmade to upload the evidence on the website of the Registrar of Trade \nMarks, but that, as the website was non-functional, this could not be \ndone.  As a result, submits Ms. Bhabna Das, the evidence was sent to \nthe office of the Registrar by courier.  It is an admitted position that \nthe evidence in opposition as sent by the appellant was, in fact, \nreceived by the office of the learned Registrar on 10th May 2018, i.e., \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified\n\n--- PAGE 4 ---\nNeutral Citation Number : 2023/DHC/000136 \n C.A.(COMM.IPD-TM) 80/2021                                                                       Page 4 of 9  \n \n   \nmere three days beyond the last date for “leaving” of the evidence.  \n \n9. \nAs is apparent, the impugned order has proceeded on the \npremise that, as the evidence in terms of Rule 45 of the Trade Mark \nRules had not been filed within two months from the service of the \ncounter statement of Respondent 1 on the appellant, the opposition of \nthe appellant was deemed to have been abandoned by application of \nsub-rule (2) of Rule 45.  \n \n10. \nAt a bare glance, the impugned order is incorrect, as Rule 45(1) \ndoes not use the expression “filed”.  What Rule 45(1) requires is that \nthe evidence must be “left with the Registrar”.  Where the statute is \nambiguous, the benefit of ambiguity has to go to the citizen. This \nwould be especially so where the statute confers a valuable \ncommercial right on the citizen. It cannot be gainsaid that, having \nsubmitted the notice of opposition, opposing the application of \nRespondent 1 for registration of the Trade Mark, the tendering of \nevidence in support of the opposition was a valuable commercial right \nwhich enured in favor of the opponent/appellant. There is no \nconceivable reason as to why, having filed the notice of opposition, \nthe appellant would abandon the opposition.  That the appellant did \nnot, in fact, do so, is manifest by the fact that, on 28th\n \n August 2018, \nthe appellant filed an application for extension of time, purportedly \nunder Section 131 of the Trade Marks Act read with Rule 109 of the \nTrade Mark Rules, in Form TM-M, as required by the said rules.  \n11. \nThe application has not been considered by the learned Deputy \nRegistrar while passing the impugned order. In the application, it was \nspecifically submitted that the website of the learned Registrar of \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified\n\n--- PAGE 5 ---\nNeutral Citation Number : 2023/DHC/000136 \n C.A.(COMM.IPD-TM) 80/2021                                                                       Page 5 of 9  \n \n   \nTrade Marks was non-functional on 7th May 2018, as a result of \nwhich, on 8th\n \n May 2018, the evidence in opposition was sent by the \nappellant by courier.  \n12. \nAs already noticed, it is an admitted position that the evidence \nin opposition was indeed received by the office of the learned \nRegistrar on 10th\n \n May 2018.     \n13. \nThe issue before the court is whether, in these circumstances \nand in the backdrop of the existing statutory scenario as contained in \nthe Trade Marks Act and Trade Marks Rules, this Court should sustain \nthe decision of the learned Deputy Registrar, vide the impugned order \ndated 30th\n \n August 2018, to treat the opposition filed by the appellant, \nto the application of Respondent 1 seeking registration of the \n“LIVGUARD ZING” mark, as having been abandoned.  \n14. \nHaving heard Ms. Bhabna Das, learned Counsel for the \nappellant and Mr. Jithin M George, learned Counsel for Respondent 1, \nin my considered opinion, the answer to this query has necessarily to \nbe in the negative.  \n \n15. \nTwo issues would arise for consideration. The first is whether \nthere was, in fact, delay on the part of the appellant in complying with \nthe requirement of Rule 45 of the Trade Mark Rules. The second is \nwhether, assuming there was any such delay, the learned Registrar \nwas empowered to condone the delay or to extend the time for \ncompliance with Rule 45.  \n \n16. \nAddressing the first issue first, Rule 45 (1) stipulates that, \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified\n\n--- PAGE 6 ---\nNeutral Citation Number : 2023/DHC/000136 \n C.A.(COMM.IPD-TM) 80/2021                                                                       Page 6 of 9  \n \n   \nwithin two months from service of the copy of the counter statement \nfiled by the trade mark applicant, the opponent opposing the \nregistration of the mark is required to leave, with the Registrar, \nevidence by way of affidavit in support of the opposition.  Rule 45(1) \nfurther requires the opponent to the registration of the trade mark to \ndeliver, to the applicant seeking registration, copies of the affidavit \nleft with the Registrar and to intimate the Registrar in that regard.   \n \n17. \nRule 8 of the Trade Mark Rules states that all documents, which \nare required “to be made, served, left or sent or paid at or to the Trade \nMarks Registry”, in respect of a Trade Mark in respect of which an \napplication seeking registration is pending, “shall be made, served, \nleft, or sent or paid to the appropriate office of the Trade Marks \nRegistry”. \n \n18. \nAs already observed, the provision is as nebulous as can be.  \nThe Rule, envelops, in one parenthesis, the expressions “made” \n“served”, “left”, “sent” and “paid” and refers to such making, serving, \nleaving, sending, or paying “to the appropriate office of the Trade \nMarks Registry”. \n \n19. \nGiven the nature of these provisions and the fact that they affect \na valuable right vested in an opponent who seeks to oppose the \nregistration of a trade mark, I am of the considered opinion that, in the \nfacts of the present case, the appellant won’t be entitled to the benefit \nof the ambiguity inherent in this provision.  \n \n20. \nThe appellant, in its application seeking extension of time as \nfiled before the learned Deputy Registrar, as well as in the present \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified\n\n--- PAGE 7 ---\nNeutral Citation Number : 2023/DHC/000136 \n C.A.(COMM.IPD-TM) 80/2021                                                                       Page 7 of 9  \n \n   \nappeal, has stated, on affidavit, that the attempts at e-filing of the \nevidence in support of the appellant’s objections, on 7th\n \n May 2018, \ncould not succeed as the website of the learned Registrar of Trade \nMarks was non-functional.  The impugned order does not seek to \ndiscountenance this assertion.  Notice was issued in the present \nappeal, and there is no affidavit filed by way of response, denying this \nfact.  \n21. \nThere is no reason, therefore, for this Court to disbelieve the \nappellant and presume that, in fact, no attempt was made by the \nappellant to e-file the objections on 7th May 2018, especially as, on the \nvery next day i.e., 8th May 2018, the objections were in fact sent by \ncourier.  This is not, therefore, a case in which the appellant exhibited \nany callous or negligent indolence.   The fact that, on 8th May 2018, \nthe appellant did indeed courier the evidence in support of the \nopposition to the office of the learned Registrar of Trade Marks, \ncompels this Court to believe the assertion, in the present appeal, also \ncontained in the application for extension of time filed before the \nlearned Registrar with the evidence in support of the opposition was in \nfact forwarded to the office of the learned Registrar electronically on \n7th\n \n May 2018, but that the attempt could not succeed as the website \nwas non-functional.  \n22. \nSuch an attempt, in my view, would fall within the broad \nembrace of the expression “made, served, left, sent or paid to the \nappropriate office of the Trade Marks Registry”, as employed in Rule \n8 of the Trade Marks Rules.  \n \n23. \nEven otherwise, it is well-settled that, while procedural \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified\n\n--- PAGE 8 ---\nNeutral Citation Number : 2023/DHC/000136 \n C.A.(COMM.IPD-TM) 80/2021                                                                       Page 8 of 9  \n \n   \nprovisions are required to be accorded their due deference, they cannot \nbe interpreted so rigidly as to result in evisceration of substantive \nrights vested in the citizens. The right to oppose registration of a trade \nmark is just as sacrosanct as the right to seek registration. In the \npeculiar facts of the present case once the application for opposition \nhad actually been filed by the appellant, it would be entirely unfair for \nthis Court to uphold the decision of the learned Deputy Registrar to \ntreat the opposition as having been abandoned only because the \nevidence in support of the opposition was received three days late, \nespecially as, prima facie, the appellant did make efforts to “leave” the \nevidence in support of the opposition with the office of the learned \nRegistrar  within the time stipulated in that regard in Rule 45(1) of the  \nTrade Marks Rules. \n \n24. \nIn that view of the matter, this Court is not required to examine \nthe somewhat more nuanced issue of whether, where the evidence in \nopposition is not “left” with the office of the learned Registrar within \ntwo months as envisaged in Rule 45(1), any discretion vests in the \nlearned Registrar to extend the time therefor.   That would involve a \njuxtaposed interpretation of Section 131 of the Trade Marks Act and \nRules 8, 45 and 109 of the Trade Marks Rules, which may be left for \nanother sunny evening.   \n \n25. \nIn the facts of the present case, therefore, the impugned order \ndated 30th\n \n August 2018 would stand set aside.  \n26. \nResultantly, the learned Deputy Registrar is directed to take into \naccount the evidence in opposition filed by the appellant and take a \nview thereon.  \n \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified\n\n--- PAGE 9 ---\nNeutral Citation Number : 2023/DHC/000136 \n C.A.(COMM.IPD-TM) 80/2021                                                                       Page 9 of 9  \n \n   \n27. \nI am informed that, after the impugned order was passed, the \nmark of Respondent 1 has proceeded to registration.  \n \n28. \nNeedless to say, in view of the decision taken today, the \nregistration of the Trade Mark shall remain subject to the outcome of \nthe view to be taken by the learned Deputy Registrar on the opposition \nfiled by the appellant.  \n \n29. \nIn order that equities are not unnecessarily prejudiced, the  \nlearned Deputy Registrar is directed to take a decision on the \nappellant's notice of opposition, after following due process in that \nregard, within a period of three months from today.  \n \n30. \nFor this purpose, both sides are directed to present themselves \nbefore the office of the learned Deputy Registrar of Trade Marks on \n16th\n \n January 2023 at 11:00 a.m. \n31. \nThe learned Deputy Registrar would proceed with the matter \nwith all due expedition.  \n \n32. \nBoth sides are directed not to seek any adjournment from the \nlearned Deputy Registrar. \n \n33. \nThe appeal stands allowed accordingly with no order as to \ncosts.  \n \n \nC. HARI SHANKAR, J. \n \nJANUARY 6, 2023 \n \ndsn \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified\n"
  },
  "total_pages": 9,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "According to the PDF document \"MS V-Guard Industries Ltd. v. MS Livguard Energy Technologies Pvt Ltd.\" (Neutral Citation Number: 2023/DHC/000136), the High Court of Delhi at New Delhi heard an appeal (C.A.(COMM.IPD-TM) 80/2021) filed by M/S V-Guard Industries Ltd. against an order dated 06.01.2023. The order deemed the opposition to the registration of the trademark \"LIVGUARD ZING\" by M/S Livguard Energy Technologies Pvt Ltd. to be abandoned under Rule 45(2) of the Trade Marks Rules 2017.\n\nThe application for registration was filed on 11th July 2014, and a notice of opposition was filed by the appellant on 2nd June 2016. The respondent filed a counterstatement on 7th March 2018, which was served electronically on the appellant on the same day. However, the appellant failed to submit evidence in support of the opposition or intimate to the Registrar that they did not desire to adduce evidence within the prescribed time.\n\nThe Court noted that Rule 45 of the Trade Marks Rules requires the opponent to submit evidence or intimate their intention to rely on the facts stated in the notice of opposition within two months of the service of the counterstatement. Since the appellant took no action, their opposition was deemed abandoned. The Court ordered that the application for registration proceed further as per the rules, with no order as to costs. (Source: PDF document, pages 1-2)",
      "pdf_source": "35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd..pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "According to page 1 of the PDF \"35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd.\", the case involves an appeal by M/S V-Guard Industries Ltd. against an order dated 06.01.2023. The order was related to the registration of the trademark \"LIVGUARD ZING\" by Respondent 1, M/s Livguard Energy Technologies Pvt Ltd, for goods such as batteries and invertors. The opposition to the registration was deemed abandoned under Rule 45(2) of the Trade Marks Rules 2017, as no evidence was filed by the opponent within the prescribed time. The appeal is being heard by Hon'ble Mr. Justice C. Hari Shankar in the High Court of Delhi at New Delhi, with case number C.A.(COMM.IPD-TM) 80/2021 & I.A. 178/2023. (Source: PDF page 1)",
          "content": "Neutral Citation Number : 2023/DHC/000136 \n C.A.(COMM.IPD-TM) 80/2021                                                                       Page 1 of 9  \n \n   \n$~1 \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.A.(COMM.IPD-TM) 80/2021 & I.A. 178/2023 \n \nM/S V-GUARD INDUSTRIES LTD.  \n         ..... Appellant \nThrough: \nMs. Bhabna Das, Mr. Mukul \nKumar and Mr. Vizzy George, Advs.  \n \n \n \n \n \nversus \n \nM/S LIVGUARD ENERGY TECHNOLOGIES PVT LTD \nAND ANR  \n \n \n \n \n    ..... Respondents \nThrough: \nMr. Jithin M. George and Mr. \nUdit Tewari, Advs. for R-1 \nMr. Harish Vaidyanathan Shankar, CGSC \nwith Mr. Srish Kumar Mishra, Mr. Gagar \nMehlawat, Mr. Alexander Mathai Paikaday, \nAdvs. for R-2 \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C. HARI SHANKAR \n \n \n \n \n    \n1. \nThis appeal assails the following order dated 30\nJ U D G M E N T (ORAL) \n% \n \n \n \n   06.01.2023 \n \nth\n \n“Proceedings were initiated under Section 21 of the Trade \nMark Act, 1999, by the above named opponent to oppose the \nregistration of trade mark applied for by the above named applicant \nand whereas the Counter Statement was filed by the applicant and \nthe same was served to the opponent on and whereas within the \ntime prescribed under the rules, neither any evidence in support of \nopposition was filed nor any statement was submitted on behalf of \nthe opponent to the effect that the opponent does not desire to \nadduce evidence but wants to rely on the facts mentioned in the \nNotice of Opposition. The above mentioned opposition is, \ntherefore, deemed to have been abandoned under Rule 45(2) of the \nTrade Marks Rules 2017.Thc above mentioned application shall \n August 2018, \npassed by the learned Deputy Registrar of Trademarks in Application \nNo. 2772497 filed by Respondent 1 M/s Livguard Energy \nTechnologies \nPvt \nLtd. \nseeking \nregistration \nof \ntheir \nmark \n“LIVGUARD ZING” in respect of batteries, invertors and like goods: \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified",
          "pdf_source": "35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd..pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "According to page 2 of the PDF \"35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd.\", the court case involves M/S V-Guard Industries Ltd. (Appellant) and M/S Livguard Energy Technologies Pvt Ltd (Respondent). The application for registration was filed by Respondent 1 on July 11, 2014, and published on February 15, 2016. The Appellant filed a notice of opposition on June 2, 2016. Respondent 1 filed a counter statement on March 7, 2018, which was served electronically on the Appellant the same day. Rule 45 of the Trade Marks Rules requires the opponent to provide evidence in support of opposition within two months of service of the counterstatement. The court notes that Rule 45 is \"unhappily worded\" and uses the expression \"leave with the Registrar\", which may be unclear. (Source: 35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd..pdf)",
          "content": "Neutral Citation Number : 2023/DHC/000136 \n C.A.(COMM.IPD-TM) 80/2021                                                                       Page 2 of 9  \n \n   \nproceed further as per rules.  \n \nIT IS HEREBY FURTHER ORDERED that there shall be \nno order as to cost of these proceedings.” \n \n2. \nGiven the nature of the controversy in the present case, it is not \nnecessary to enter into the specifics of the application seeking \nregistration.  \n \n3. \nSuffice it to state that the application for registration was filed \nby Respondent 1 on 11th July 2014, and was published in the Register \nof Trade Marks on 15th February 2016 inviting opposition and that, on \n2nd June 2016, notice of opposition was filed by the appellant before \nthe learned Registrar.  Counter statement, in response to the notice of \nopposition filed by the appellant was filed by the Respondent 1 on 7th \nMarch 2018.  It is an admitted position that, on the same day i.e., 7th\n \n \nMarch 2018, the notice of counter statement filed by Respondent 1 \nwas served electronically on the appellant.  \n4. \nRule 45 of the Trade Marks Rules reads thus: \n“45. \nEvidence in support of opposition.— (1) Within two \nmonths from  service of a copy of the counterstatement, the \nopponent shall either leave with the Registrar, such evidence by \nway of affidavit as he may desire to adduce in support of his \nopposition or shall intimate to the Registrar and to the applicant in \nwriting that he does not desire to adduce evidence in support of his \nopposition but intends to rely on the facts stated in the notice of \nopposition. He shall deliver to the applicant copies of any evidence \nincluding exhibits, if any, that he leaves with the Registrar under \nthis sub-rule and intimate the Registrar in writing of such delivery. \n \nIf an opponent takes no action under sub-rule (1) within the \ntime mentioned therein, he shall be deemed to have abandoned his \nopposition.” \n \n \n5. \nAt a plain glance, Rule 45 is very unhappily worded. It uses the \nexpression “leave with the Registrar”. This is an expression to which \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified",
          "pdf_source": "35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd..pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0006",
      "start_index": 3,
      "end_index": 4,
      "summary": "According to the PDF document \"MS V-Guard Industries Ltd. v. MS Livguard Energy Technologies Pvt Ltd.\" (Neutral Citation Number: 2023/DHC/000136), the High Court of Delhi at New Delhi heard the case C.A.(COMM.IPD-TM) 80/2021. The appellant, M/S V-Guard Industries Ltd., was represented by Ms. Bhabna Das, Mr. Mukul Kumar, and Mr. Vizzy George, while the respondents were M/S Livguard Energy Technologies Pvt Ltd and another.\n\nThe case revolves around a trademark opposition. The appellant attempted to upload evidence on the Registrar of Trade Marks' website by May 7, 2018, but due to technical issues, they sent it via courier, which was received by the Registrar's office on May 10, 2018, three days past the deadline. The Registrar deemed the opposition abandoned, citing Rule 45 of the Trade Mark Rules.\n\nThe appellant argued that the expression \"leave with the Registrar\" in Rule 45 is ambiguous and that they had submitted the evidence within a reasonable time frame. The court noted that the impugned order was incorrect, as Rule 45(1) requires evidence to be \"left with the Registrar,\" not \"filed.\" The court also stated that the benefit of ambiguity should go to the citizen, especially when a valuable commercial right is involved.\n\nThe appellant had filed a notice of opposition and later applied for an extension of time to submit evidence. The court's decision is based on the interpretation of the Trade Mark Rules and the rights of the opponent/appellant. (Source: PDF document, pages 1-4 of 9)",
      "pdf_source": "35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd..pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "According to page 3 of the PDF \"35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd.\", the case involves an appeal by M/S V-Guard Industries Ltd. against M/S Livguard Energy Technologies Pvt Ltd. The appellant's counsel, Ms. Bhabna Das, argued that they attempted to upload evidence in opposition on the Registrar of Trade Marks' website on May 7, 2018, but due to technical issues, they sent it via courier. The evidence was received by the Registrar's office on May 10, 2018. The appeal discusses the interpretation of Rule 8 of the Trade Mark Rules, which requires opponents to \"leave with the Registrar\" evidence by way of affidavit. The judge notes that this expression is unclear and should not be used in a legislative document. (Source: 35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd..pdf, page 3)",
          "content": "Neutral Citation Number : 2023/DHC/000136 \n C.A.(COMM.IPD-TM) 80/2021                                                                       Page 3 of 9  \n \n   \nno legal interpretation can possibly be given.  \n \n6. \nMy attention has been invited to Rule 8 of the Trade Mark \nRules which deals with “leaving of documents” etc. and reads thus: \n“8. \nLeaving of documents, etc.— All applications, notices, \nstatements or other documents or any fees authorised or required \nby the Act or the rules to be made, served, left or sent or paid at or \nto the Trade Marks Registry in relation to a trademark on the \nRegister of trademarks on the notified date or for which an \napplication for registration is pending on, or is made on or after the \nnotified date, shall be made, served, left or sent or paid to the \nappropriate office of the Trade Marks Registry: \n \nProvided that the Registrar may, by notification in the journal, \npermit the filing of certain forms or documents, other than the \napplication for the registration of a trademark in any other office of \nthe Trade Marks Registry.” \n \n7. \nUnfortunately, Rule 8 of the Trade Mark Rules is just as \nnebulous as Rule 45.  It requires the opponent, opposing the \nregistration of a trade mark, to “leave with the Registrar”, evidence by \nway of affidavit.  It is difficult to understand the expression “leave \nwith the Registrar”.  At any rate, it is not an expression which should \nordinarily find place in a legislative document. \n \n8. \nThe case of the appellant, as argued by Ms. Bhabna Das, \nlearned Counsel for the appellant, and as set out in the present appeal, \nis that 7th May 2018 being the last date by which the evidence in \nopposition was required to be filed by the appellant, attempts were \nmade to upload the evidence on the website of the Registrar of Trade \nMarks, but that, as the website was non-functional, this could not be \ndone.  As a result, submits Ms. Bhabna Das, the evidence was sent to \nthe office of the Registrar by courier.  It is an admitted position that \nthe evidence in opposition as sent by the appellant was, in fact, \nreceived by the office of the learned Registrar on 10th May 2018, i.e., \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified",
          "pdf_source": "35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd..pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "According to page 4 of the PDF \"35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd.\", the court discusses the impugned order related to the opposition of a trade mark application. The order deemed the opposition abandoned due to non-filing of evidence within two months. However, the court notes that Rule 45(1) of the Trade Mark Rules requires evidence to be \"left with the Registrar\", not \"filed\". The appellant had submitted evidence just three days beyond the deadline. The court also mentions an application for extension of time filed by the appellant on August 28, 2018, which was not considered by the Deputy Registrar. (Source: PDF \"35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd.\")",
          "content": "Neutral Citation Number : 2023/DHC/000136 \n C.A.(COMM.IPD-TM) 80/2021                                                                       Page 4 of 9  \n \n   \nmere three days beyond the last date for “leaving” of the evidence.  \n \n9. \nAs is apparent, the impugned order has proceeded on the \npremise that, as the evidence in terms of Rule 45 of the Trade Mark \nRules had not been filed within two months from the service of the \ncounter statement of Respondent 1 on the appellant, the opposition of \nthe appellant was deemed to have been abandoned by application of \nsub-rule (2) of Rule 45.  \n \n10. \nAt a bare glance, the impugned order is incorrect, as Rule 45(1) \ndoes not use the expression “filed”.  What Rule 45(1) requires is that \nthe evidence must be “left with the Registrar”.  Where the statute is \nambiguous, the benefit of ambiguity has to go to the citizen. This \nwould be especially so where the statute confers a valuable \ncommercial right on the citizen. It cannot be gainsaid that, having \nsubmitted the notice of opposition, opposing the application of \nRespondent 1 for registration of the Trade Mark, the tendering of \nevidence in support of the opposition was a valuable commercial right \nwhich enured in favor of the opponent/appellant. There is no \nconceivable reason as to why, having filed the notice of opposition, \nthe appellant would abandon the opposition.  That the appellant did \nnot, in fact, do so, is manifest by the fact that, on 28th\n \n August 2018, \nthe appellant filed an application for extension of time, purportedly \nunder Section 131 of the Trade Marks Act read with Rule 109 of the \nTrade Mark Rules, in Form TM-M, as required by the said rules.  \n11. \nThe application has not been considered by the learned Deputy \nRegistrar while passing the impugned order. In the application, it was \nspecifically submitted that the website of the learned Registrar of \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified",
          "pdf_source": "35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd..pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0010",
      "start_index": 5,
      "end_index": 7,
      "summary": "According to the PDF document \"MS V-Guard Industries Ltd. v. MS Livguard Energy Technologies Pvt Ltd\" (Neutral Citation Number: 2023/DHC/000136, C.A.(COMM.IPD-TM) 80/2021), the High Court of Delhi at New Delhi heard an appeal by M/S V-Guard Industries Ltd. against the decision of the Deputy Registrar to treat their opposition to the registration of the \"LIVGUARD ZING\" mark as abandoned.\n\nThe appellant had attempted to e-file evidence in support of their opposition on May 7, 2018, but the Trade Marks Registry website was non-functional. The evidence was sent by courier on May 8, 2018, and received by the Registrar's office on May 10, 2018. The respondent, M/S Livguard Energy Technologies Pvt Ltd, argued that the appellant had delayed in complying with Rule 45 of the Trade Mark Rules, which requires evidence to be filed within two months of the service of the counter-statement.\n\nThe court considered two issues: whether there was a delay on the part of the appellant and whether the Registrar was empowered to condone the delay. The court noted that the provisions of the Trade Mark Rules, particularly Rule 8, were ambiguous. However, the court ultimately decided in favor of the appellant, stating that the decision of the Deputy Registrar to treat the opposition as abandoned should not be sustained. (Source: PDF document, pages 1-9)",
      "pdf_source": "35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd..pdf",
      "nodes": [
        {
          "title": "Page 5",
          "node_id": "0007",
          "start_index": 5,
          "end_index": 5,
          "summary": "According to page 5 of the PDF \"35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd.\", the High Court of Delhi is considering a case between M/S V-Guard Industries Ltd. and M/S Livguard Energy Technologies Pvt Ltd. The issue is whether the opposition filed by the appellant to the registration of the \"LIVGUARD ZING\" mark should be treated as abandoned due to delay in submitting evidence. The court heard arguments from Ms. Bhabna Das for the appellant and Mr. Jithin M George for Respondent 1. The court must consider two issues: whether there was delay in complying with Rule 45 of the Trade Mark Rules and whether the Registrar can condone the delay. The case is C.A.(COMM.IPD-TM) 80/2021 and the Neutral Citation Number is 2023/DHC/000136. (Source: PDF)",
          "content": "Neutral Citation Number : 2023/DHC/000136 \n C.A.(COMM.IPD-TM) 80/2021                                                                       Page 5 of 9  \n \n   \nTrade Marks was non-functional on 7th May 2018, as a result of \nwhich, on 8th\n \n May 2018, the evidence in opposition was sent by the \nappellant by courier.  \n12. \nAs already noticed, it is an admitted position that the evidence \nin opposition was indeed received by the office of the learned \nRegistrar on 10th\n \n May 2018.     \n13. \nThe issue before the court is whether, in these circumstances \nand in the backdrop of the existing statutory scenario as contained in \nthe Trade Marks Act and Trade Marks Rules, this Court should sustain \nthe decision of the learned Deputy Registrar, vide the impugned order \ndated 30th\n \n August 2018, to treat the opposition filed by the appellant, \nto the application of Respondent 1 seeking registration of the \n“LIVGUARD ZING” mark, as having been abandoned.  \n14. \nHaving heard Ms. Bhabna Das, learned Counsel for the \nappellant and Mr. Jithin M George, learned Counsel for Respondent 1, \nin my considered opinion, the answer to this query has necessarily to \nbe in the negative.  \n \n15. \nTwo issues would arise for consideration. The first is whether \nthere was, in fact, delay on the part of the appellant in complying with \nthe requirement of Rule 45 of the Trade Mark Rules. The second is \nwhether, assuming there was any such delay, the learned Registrar \nwas empowered to condone the delay or to extend the time for \ncompliance with Rule 45.  \n \n16. \nAddressing the first issue first, Rule 45 (1) stipulates that, \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified",
          "pdf_source": "35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd..pdf",
          "nodes": []
        },
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "According to page 6 of the PDF \"35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd.\", the opponent of a trade mark registration must leave evidence by way of affidavit in support of the opposition within two months from service of the copy of the counter statement (Rule 45(1)). The documents must be made, served, left, or sent to the appropriate office of the Trade Marks Registry (Rule 8). The court notes that the provisions are ambiguous, but the appellant will not benefit from this ambiguity. The appellant sought an extension of time before the Deputy Registrar and in the present case (C.A.(COMM.IPD-TM) 80/2021 & I.A. 178/2023). The case was digitally signed by Kamla Rawat on January 10, 2023. (Source: PDF \"35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Pvt Ltd.\")",
          "content": "Neutral Citation Number : 2023/DHC/000136 \n C.A.(COMM.IPD-TM) 80/2021                                                                       Page 6 of 9  \n \n   \nwithin two months from service of the copy of the counter statement \nfiled by the trade mark applicant, the opponent opposing the \nregistration of the mark is required to leave, with the Registrar, \nevidence by way of affidavit in support of the opposition.  Rule 45(1) \nfurther requires the opponent to the registration of the trade mark to \ndeliver, to the applicant seeking registration, copies of the affidavit \nleft with the Registrar and to intimate the Registrar in that regard.   \n \n17. \nRule 8 of the Trade Mark Rules states that all documents, which \nare required “to be made, served, left or sent or paid at or to the Trade \nMarks Registry”, in respect of a Trade Mark in respect of which an \napplication seeking registration is pending, “shall be made, served, \nleft, or sent or paid to the appropriate office of the Trade Marks \nRegistry”. \n \n18. \nAs already observed, the provision is as nebulous as can be.  \nThe Rule, envelops, in one parenthesis, the expressions “made” \n“served”, “left”, “sent” and “paid” and refers to such making, serving, \nleaving, sending, or paying “to the appropriate office of the Trade \nMarks Registry”. \n \n19. \nGiven the nature of these provisions and the fact that they affect \na valuable right vested in an opponent who seeks to oppose the \nregistration of a trade mark, I am of the considered opinion that, in the \nfacts of the present case, the appellant won’t be entitled to the benefit \nof the ambiguity inherent in this provision.  \n \n20. \nThe appellant, in its application seeking extension of time as \nfiled before the learned Deputy Registrar, as well as in the present \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified",
          "pdf_source": "35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd..pdf",
          "nodes": []
        },
        {
          "title": "Page 7",
          "node_id": "0009",
          "start_index": 7,
          "end_index": 7,
          "summary": "According to page 7 of the PDF \"35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd.\", the appellant attempted to e-file evidence on May 7, 2018, but the website of the Registrar of Trade Marks was non-functional. The appellant then sent the evidence by courier on May 8, 2018. The court believes the appellant's assertion that they attempted to e-file on May 7, 2018, as there is no evidence to contradict this claim. The court considers this attempt to be within the scope of Rule 8 of the Trade Marks Rules, which allows for documents to be \"made, served, left, sent or paid to the appropriate office of the Trade Marks Registry\". (Source: PDF page 7)",
          "content": "Neutral Citation Number : 2023/DHC/000136 \n C.A.(COMM.IPD-TM) 80/2021                                                                       Page 7 of 9  \n \n   \nappeal, has stated, on affidavit, that the attempts at e-filing of the \nevidence in support of the appellant’s objections, on 7th\n \n May 2018, \ncould not succeed as the website of the learned Registrar of Trade \nMarks was non-functional.  The impugned order does not seek to \ndiscountenance this assertion.  Notice was issued in the present \nappeal, and there is no affidavit filed by way of response, denying this \nfact.  \n21. \nThere is no reason, therefore, for this Court to disbelieve the \nappellant and presume that, in fact, no attempt was made by the \nappellant to e-file the objections on 7th May 2018, especially as, on the \nvery next day i.e., 8th May 2018, the objections were in fact sent by \ncourier.  This is not, therefore, a case in which the appellant exhibited \nany callous or negligent indolence.   The fact that, on 8th May 2018, \nthe appellant did indeed courier the evidence in support of the \nopposition to the office of the learned Registrar of Trade Marks, \ncompels this Court to believe the assertion, in the present appeal, also \ncontained in the application for extension of time filed before the \nlearned Registrar with the evidence in support of the opposition was in \nfact forwarded to the office of the learned Registrar electronically on \n7th\n \n May 2018, but that the attempt could not succeed as the website \nwas non-functional.  \n22. \nSuch an attempt, in my view, would fall within the broad \nembrace of the expression “made, served, left, sent or paid to the \nappropriate office of the Trade Marks Registry”, as employed in Rule \n8 of the Trade Marks Rules.  \n \n23. \nEven otherwise, it is well-settled that, while procedural \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified",
          "pdf_source": "35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd..pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0013",
      "start_index": 8,
      "end_index": 9,
      "summary": "According to the court document from the PDF \"MS V-Guard Industries Ltd. v. MS Livguard Energy Technologies Pvt Ltd.\", the High Court of Delhi at New Delhi made a decision on the appeal filed by M/S V-Guard Industries Ltd. against M/S Livguard Energy Technologies Pvt Ltd. The appeal, C.A.(COMM.IPD-TM) 80/2021, was allowed with no order as to costs.\n\nThe court ruled in favor of the appellant, setting aside the impugned order dated August 30, 2018, which had treated the opposition as abandoned due to late submission of evidence. The court directed the Deputy Registrar to consider the evidence in opposition filed by the appellant and take a decision within three months.\n\nThe Respondent's trade mark had proceeded to registration after the impugned order, but the court stated that the registration shall remain subject to the outcome of the view to be taken by the Deputy Registrar on the opposition filed by the appellant.\n\nKey dates mentioned in the document include January 6, 2023, when the judgment was passed, and January 10, 2023, when the document was digitally signed. The parties were directed to present themselves before the Deputy Registrar on January 16, 2023, at 11:00 a.m. The court also instructed both sides not to seek any adjournment from the Deputy Registrar.\n\nSource: MS V-Guard Industries Ltd. v. MS Livguard Energy Technologies Pvt Ltd. (PDF) Neutral Citation Number: 2023/DHC/000136, C.A.(COMM.IPD-TM) 80/2021.",
      "pdf_source": "35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd..pdf",
      "nodes": [
        {
          "title": "Page 8",
          "node_id": "0011",
          "start_index": 8,
          "end_index": 8,
          "summary": "According to page 8 of the PDF \"35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd.\", the High Court of Delhi ruled in favor of the appellant, M/S V-Guard Industries Ltd. The court set aside the impugned order dated August 30, 2018, which treated the opposition as abandoned due to late submission of evidence. The court directed the Deputy Registrar to consider the evidence in opposition filed by the appellant. The decision was made on January 10, 2023, as stated in the digitally signed document by Kamla Rawat. The case number is C.A.(COMM.IPD-TM) 80/2021, and the Neutral Citation Number is 2023/DHC/000136. The court prioritized the appellant's right to oppose registration of a trade mark, considering it sacrosanct. (Source: PDF \"35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd.\")",
          "content": "Neutral Citation Number : 2023/DHC/000136 \n C.A.(COMM.IPD-TM) 80/2021                                                                       Page 8 of 9  \n \n   \nprovisions are required to be accorded their due deference, they cannot \nbe interpreted so rigidly as to result in evisceration of substantive \nrights vested in the citizens. The right to oppose registration of a trade \nmark is just as sacrosanct as the right to seek registration. In the \npeculiar facts of the present case once the application for opposition \nhad actually been filed by the appellant, it would be entirely unfair for \nthis Court to uphold the decision of the learned Deputy Registrar to \ntreat the opposition as having been abandoned only because the \nevidence in support of the opposition was received three days late, \nespecially as, prima facie, the appellant did make efforts to “leave” the \nevidence in support of the opposition with the office of the learned \nRegistrar  within the time stipulated in that regard in Rule 45(1) of the  \nTrade Marks Rules. \n \n24. \nIn that view of the matter, this Court is not required to examine \nthe somewhat more nuanced issue of whether, where the evidence in \nopposition is not “left” with the office of the learned Registrar within \ntwo months as envisaged in Rule 45(1), any discretion vests in the \nlearned Registrar to extend the time therefor.   That would involve a \njuxtaposed interpretation of Section 131 of the Trade Marks Act and \nRules 8, 45 and 109 of the Trade Marks Rules, which may be left for \nanother sunny evening.   \n \n25. \nIn the facts of the present case, therefore, the impugned order \ndated 30th\n \n August 2018 would stand set aside.  \n26. \nResultantly, the learned Deputy Registrar is directed to take into \naccount the evidence in opposition filed by the appellant and take a \nview thereon.  \n \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified",
          "pdf_source": "35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd..pdf",
          "nodes": []
        },
        {
          "title": "Page 9",
          "node_id": "0012",
          "start_index": 9,
          "end_index": 9,
          "summary": "According to page 9 of the PDF \"35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd.\", the court directed the Deputy Registrar to decide on the appellant's notice of opposition within three months. The registration of Respondent 1's trade mark shall remain subject to the outcome of this decision. Both parties are scheduled to appear before the Deputy Registrar on January 16, 2023, at 11:00 a.m. The court ordered that no adjournment should be sought. The appeal was allowed with no order as to costs. The decision was made by C. Hari Shankar, J. on January 6, 2023. (Source: PDF \"35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd.\")",
          "content": "Neutral Citation Number : 2023/DHC/000136 \n C.A.(COMM.IPD-TM) 80/2021                                                                       Page 9 of 9  \n \n   \n27. \nI am informed that, after the impugned order was passed, the \nmark of Respondent 1 has proceeded to registration.  \n \n28. \nNeedless to say, in view of the decision taken today, the \nregistration of the Trade Mark shall remain subject to the outcome of \nthe view to be taken by the learned Deputy Registrar on the opposition \nfiled by the appellant.  \n \n29. \nIn order that equities are not unnecessarily prejudiced, the  \nlearned Deputy Registrar is directed to take a decision on the \nappellant's notice of opposition, after following due process in that \nregard, within a period of three months from today.  \n \n30. \nFor this purpose, both sides are directed to present themselves \nbefore the office of the learned Deputy Registrar of Trade Marks on \n16th\n \n January 2023 at 11:00 a.m. \n31. \nThe learned Deputy Registrar would proceed with the matter \nwith all due expedition.  \n \n32. \nBoth sides are directed not to seek any adjournment from the \nlearned Deputy Registrar. \n \n33. \nThe appeal stands allowed accordingly with no order as to \ncosts.  \n \n \nC. HARI SHANKAR, J. \n \nJANUARY 6, 2023 \n \ndsn \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified",
          "pdf_source": "35. MS V-Guard Industries Ltd.  v. MS Livguard Energy Technologies Pvt Ltd..pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-15T18:29:03.680655",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}