{
  "doc_name": "36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr",
  "pdf_source": "36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf",
  "metadata": {
    "document_name": "36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr",
    "source_pdf": "36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf",
    "judges": [
      "C. HARI SHANKAR 1."
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "39/2022",
      "39/2022",
      "39/2022",
      "39/2022",
      "39/2022",
      "39/2022",
      "39/2022",
      "39/2022",
      "39/2022",
      "39/2022",
      "179/2023"
    ],
    "dhc_numbers": [
      "2023/DHC/000137",
      "2023/DHC/000137",
      "2023/DHC/000137",
      "2023/DHC/000137",
      "2023/DHC/000137",
      "2023/DHC/000137",
      "2023/DHC/000137",
      "2023/DHC/000137",
      "2023/DHC/000137"
    ],
    "ia_numbers": [],
    "decision_date": "11 July, 2014",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [],
    "defendants": [],
    "appellants": [
      "M/S V-GUARD INDUSTRIES LTD"
    ],
    "respondents": [
      "THE REGISTRAR OF TRADEMARKS",
      "M/s Livguard Energy Technologies Pvt Ltd"
    ],
    "plaintiff_advocates": [],
    "defendant_advocates": [],
    "appellant_advocates": [
      "Ms. Babna Das",
      "Mr. Mukul Kumar",
      "Mr. Vizzy George"
    ],
    "respondent_advocates": [
      "Mr. Harish Vaidyanathan Shankar",
      "Mr. Srish Kumar Mishra",
      "Mr. Gagar Mehlawat",
      "Mr. Alexander Mathai Paikaday",
      "Mr. Jithin M. George",
      "Mr. Udit Tewari"
    ],
    "damages_claimed": null,
    "damages_awarded": null,
    "key_issues": [
      "The legality of abandoning an opposition to a trademark registration under Rule 45(2) of the Trade Marks Rules 2017 is a key issue in this case.",
      "The interpretation of Rule 45 of the Trade Marks Rules 2017, particularly the time frame for submitting evidence in support of opposition, is crucial to the outcome of the case.",
      "The requirement for the opponent to either submit evidence or intimate to the Registrar that they do not desire to adduce evidence, as per Rule 45(1), is a critical aspect of the case.",
      "The implications of deeming an opposition to have been abandoned under Rule 45(2) when the opponent fails to take action within the prescribed time frame is a significant issue.",
      "The role of the Registrar of Trademarks in determining whether an opposition has been abandoned and allowing the application for registration to proceed is an important consideration.",
      "The potential impact of the abandonment of an opposition on the applicant's right to register their trademark is a key issue in the case.",
      "The application of the principles of natural justice and fairness in the context of trademark opposition proceedings is a relevant legal issue.",
      "The interplay between the Trade Marks Act 1999 and the Trade Marks Rules 2017 in governing trademark opposition proceedings is an important aspect of the case.",
      "The burden of proof on the opponent to establish their case and the consequences of failing to do so is a significant legal issue in this matter."
    ],
    "decision_summary": "**Case Summary: M/S V-Guard Industries Ltd. vs. The Registrar of Trademarks & Anr.**\n\n**Background:**\nThe case involves a trademark opposition proceeding under the Trade Marks Act, 1999. The respondent, M/s Livguard Energy Technologies Pvt. Ltd. (Respondent 2), filed an application for registration of the trademark \"LIVGUARD ZING\" for batteries, inverters, and similar goods on July 11, 2014. The application was published in the Register of Trade Marks on February 15, 2016, inviting opposition. On June 2, 2016, the appellant, M/S V-Guard Industries Ltd., filed a notice of opposition before the Registrar of Trade Marks. The respondent filed a counterstatement on March 7, 2018, which was served electronically on the appellant on the same day.\n\n**Legal Issues:**\nThe primary issue in this case is the interpretation of Rule 45 of the Trade Marks Rules, 2017, which deals with evidence in support of opposition. The rule requires the opponent to either submit evidence by way of affidavit or intimate to the Registrar and the applicant that they do not desire to adduce evidence, within two months from the service of the counterstatement. The opponent's failure to take action within the specified timeframe results in the opposition being deemed abandoned.\n\n**Arguments:**\nThe appellant argued that they were not required to submit evidence or intimate their intention not to adduce evidence, as the expression \"leave with the Registrar\" in Rule 45 is unclear and does not provide a clear procedure for submission of evidence. The respondent, on the other hand, argued that the appellant's failure to submit evidence or intimate their intention not to adduce evidence within the specified timeframe resulted in the opposition being deemed abandoned under Rule 45(2).\n\n**Court Findings:**\nThe High Court of Delhi at New Delhi, presided by Hon'ble Mr. Justice C. Hari Shankar, observed that Rule 45 is \"very unhappily worded\" and that the expression \"leave with the Registrar\" is unclear. The court noted that Rule 8 of the Trade Marks Rules deals with the \"leaving of documents\" and provides a clear procedure for submission of documents to the Trade Marks Registry.\n\n**Decision:**\nThe court ultimately held that the appellant's opposition was deemed abandoned under Rule 45(2) due to their failure to submit evidence or intimate their intention not to adduce evidence within the specified timeframe. The court ordered that the application for registration of the trademark \"LIVGUARD ZING\" shall proceed further as per the rules, with no order as to costs.\n\n**Conclusion:**\nThe case highlights the importance of clarity in legislative drafting, particularly in procedural rules. The unclear language in Rule 45 led to confusion and disputes between the parties. The court's decision emphasizes the need for parties to adhere to the procedural requirements under the Trade Marks Rules, 2017, to avoid abandonment of their opposition.",
    "legal_precedents": [],
    "full_text": "\n--- PAGE 1 ---\nNeutral Citation Number : 2023/DHC/000137 \n C.A.(COMM.IPD-TM) 39/2022  \n                                                       Page 1 of 9  \n \n   \n$~18 \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.A.(COMM.IPD-TM) 39/2022 & I.A. 179/2023 \n \nM/S V-GUARD INDUSTRIES LTD  \n       ..... Appellant \nThrough: \nMs. Babna Das, Mr. Mukul \nKumar and Mr. Vizzy George, Advs. \n \n \n \n \n \nversus \n \n \nTHE REGISTRAR OF TRADEMARKS & ANR.. Respondents \nThrough: \nMr. \nHarish \nVaidyanathan \nShankar, CGSC with Mr. Srish Kumar \nMishra, \nMr. \nGagar \nMehlawat, \nMr. \nAlexander Mathai Paikaday, Advs. for R-1 \nMr. Jithin M. George and Mr. Udit Tewari, \nAdvs. for R-2 \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C. HARI SHANKAR \n \n \n \n    \n1. \nThis appeal assails the following order dated 30\nJ U D G M E N T (ORAL) \n% \n \n \n \n   06.01.2023 \n \nth\n“ \nProceedings were initiated under Section 21 of the Trade \nMark Act, 1999, by the above named opponent to oppose the \nregistration of trade mark applied for by the above named applicant \nand whereas the Counter Statement was filed by the applicant and \nthe same was served to the opponent on and whereas within the \ntime prescribed under the rules, neither any evidence in support of \nopposition was filed nor any statement was submitted on behalf of \nthe opponent to the effect that the opponent does not desire to \nadduce evidence but wants to rely on the facts mentioned in the \nNotice of Opposition. The above mentioned opposition is, \ntherefore, deemed to have been abandoned under Rule 45(2) of the \nTrade Marks Rules 2017.Thc above mentioned application shall \nproceed further as per rules.  \n \n August 2018, \npassed by the learned Deputy Registrar of Trademarks in Application \nNo. 2772497 filed by Respondent 2 M/s Livguard Energy \nTechnologies \nPvt \nLtd. \nseeking \nregistration \nof \ntheir \nmark \n“LIVGUARD ZING” in respect of batteries, invertors and like goods: \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified\n\n--- PAGE 2 ---\nNeutral Citation Number : 2023/DHC/000137 \n C.A.(COMM.IPD-TM) 39/2022  \n                                                       Page 2 of 9  \n \n   \nIT IS HEREBY FURTHER ORDERED that there shall be \nno order as to cost of these proceedings.” \n \n2. \nGiven the nature of the controversy in the present case, it is not \nnecessary to enter into the specifics of the application seeking \nregistration.  \n \n3. \nSuffice it to state that the application for registration was filed \nby Respondent 2 on 11th July 2014, and was published in the Register \nof Trade Marks on 15th February 2016 inviting opposition and that, on \n2nd June 2016, notice of opposition was filed by the appellant before \nthe learned Registrar.  Counter statement, in response to the notice of \nopposition filed by the appellant was filed by the Respondent 2 on 7th \nMarch 2018.  It is an admitted position that, on the same day i.e., 7th\n \n \nMarch 2018, the notice of counter statement filed by Respondent 2 \nwas served electronically on the appellant.  \n4. \nRule 45 of the Trade Marks Rules reads thus: \n“45. \nEvidence in support of opposition.— (1) Within two \nmonths from  service of a copy of the counterstatement, the \nopponent shall either leave with the Registrar, such evidence by \nway of affidavit as he may desire to adduce in support of his \nopposition or shall intimate to the Registrar and to the applicant in \nwriting that he does not desire to adduce evidence in support of his \nopposition but intends to rely on the facts stated in the notice of \nopposition. He shall deliver to the applicant copies of any evidence \nincluding exhibits, if any, that he leaves with the Registrar under \nthis sub-rule and intimate the Registrar in writing of such delivery. \n \nIf an opponent takes no action under sub-rule (1) within the \ntime mentioned therein, he shall be deemed to have abandoned his \nopposition.” \n \n \n5. \nAt a plain glance, Rule 45 is very unhappily worded. It uses the \nexpression “leave with the Registrar”. This is an expression to which \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified\n\n--- PAGE 3 ---\nNeutral Citation Number : 2023/DHC/000137 \n C.A.(COMM.IPD-TM) 39/2022  \n                                                       Page 3 of 9  \n \n   \nno legal interpretation can possibly be given.  \n \n6. \nMy attention has been invited to Rule 8 of the Trade Mark \nRules which deals with “leaving of documents” etc. and reads thus: \n“8. \nLeaving of documents, etc.— All applications, notices, \nstatements or other documents or any fees authorised or required \nby the Act or the rules to be made, served, left or sent or paid at or \nto the Trade Marks Registry in relation to a trademark on the \nRegister of trademarks on the notified date or for which an \napplication for registration is pending on, or is made on or after the \nnotified date, shall be made, served, left or sent or paid to the \nappropriate office of the Trade Marks Registry: \n \nProvided that the Registrar may, by notification in the journal, \npermit the filing of certain forms or documents, other than the \napplication for the registration of a trademark in any other office of \nthe Trade Marks Registry.” \n \n7. \nUnfortunately, Rule 8 of the Trade Mark Rules is just as \nnebulous as Rule 45.  It requires the opponent, opposing the \nregistration of a trade mark, to “leave with the Registrar”, evidence by \nway of affidavit.  It is difficult to understand the expression “leave \nwith the Registrar”.  At any rate, it is not an expression which should \nordinarily find place in a legislative document. \n \n8. \nThe case of the appellant, as argued by Ms. Bhabna Das, \nlearned Counsel for the appellant, and as set out in the present appeal, \nis that 7th May 2018 being the last date by which the evidence in \nopposition was required to be filed by the appellant, attempts were \nmade to upload the evidence on the website of the Registrar of Trade \nMarks, but that, as the website was non-functional, this could not be \ndone.  As a result, submits Ms. Bhabna Das, the evidence was sent to \nthe office of the Registrar by courier.  It is an admitted position that \nthe evidence in opposition as sent by the appellant was, in fact, \nreceived by the office of the learned Registrar on 10th May 2018, i.e., \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified\n\n--- PAGE 4 ---\nNeutral Citation Number : 2023/DHC/000137 \n C.A.(COMM.IPD-TM) 39/2022  \n                                                       Page 4 of 9  \n \n   \nmere three days beyond the last date for “leaving” of the evidence.  \n \n9. \nAs is apparent, the impugned order has proceeded on the \npremise that, as the evidence in terms of Rule 45 of the Trade Mark \nRules had not been filed within two months from the service of the \ncounter statement of Respondent 2 on the appellant, the opposition of \nthe appellant was deemed to have been abandoned by application of \nsub-rule (2) of Rule 45.  \n \n10. \nAt a bare glance, the impugned order is incorrect, as Rule 45(1) \ndoes not use the expression “filed”.  What Rule 45(1) requires is that \nthe evidence must be “left with the Registrar”.  Where the statute is \nambiguous, the benefit of ambiguity has to go to the citizen. This \nwould be especially so where the statute confers a valuable \ncommercial right on the citizen. It cannot be gainsaid that, having \nsubmitted the notice of opposition, opposing the application of \nRespondent 2 for registration of the Trade Mark, the tendering of \nevidence in support of the opposition was a valuable commercial right \nwhich enured in favor of the opponent/appellant. There is no \nconceivable reason as to why, having filed the notice of opposition, \nthe appellant would abandon the opposition.  That the appellant did \nnot, in fact, do so, is manifest by the fact that, on 28th\n \n August 2018, \nthe appellant filed an application for extension of time, purportedly \nunder Section 131 of the Trade Marks Act read with Rule 109 of the \nTrade Mark Rules, in Form TM-M, as required by the said rules.  \n11. \nThe application has not been considered by the learned Deputy \nRegistrar while passing the impugned order. In the application, it was \nspecifically submitted that the website of the learned Registrar of \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified\n\n--- PAGE 5 ---\nNeutral Citation Number : 2023/DHC/000137 \n C.A.(COMM.IPD-TM) 39/2022  \n                                                       Page 5 of 9  \n \n   \nTrade Marks was non-functional on 7th May 2018, as a result of \nwhich, on 8th\n \n May 2018, the evidence in opposition was sent by the \nappellant by courier.  \n12. \nAs already noticed, it is an admitted position that the evidence \nin opposition was indeed received by the office of the learned \nRegistrar on 10th\n \n May 2018.     \n13. \nThe issue before the court is whether, in these circumstances \nand in the backdrop of the existing statutory scenario as contained in \nthe Trade Marks Act and Trade Marks Rules, this Court should sustain \nthe decision of the learned Deputy Registrar, vide the impugned order \ndated 30th\n \n August 2018, to treat the opposition filed by the appellant, \nto the application of Respondent 2 seeking registration of the \n“LIVGUARD ZING” mark, as having been abandoned.  \n14. \nHaving heard Ms. Bhabna Das, learned Counsel for the \nappellant and Mr. Jithin M George, learned Counsel for Respondent 2, \nin my considered opinion, the answer to this query has necessarily to \nbe in the negative.  \n \n15. \nTwo issues would arise for consideration. The first is whether \nthere was, in fact, delay on the part of the appellant in complying with \nthe requirement of Rule 45 of the Trade Mark Rules. The second is \nwhether, assuming there was any such delay, the learned Registrar \nwas empowered to condone the delay or to extend the time for \ncompliance with Rule 45.  \n \n16. \nAddressing the first issue first, Rule 45 (1) stipulates that, \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified\n\n--- PAGE 6 ---\nNeutral Citation Number : 2023/DHC/000137 \n C.A.(COMM.IPD-TM) 39/2022  \n                                                       Page 6 of 9  \n \n   \nwithin two months from service of the copy of the counter statement \nfiled by the trade mark applicant, the opponent opposing the \nregistration of the mark is required to leave, with the Registrar, \nevidence by way of affidavit in support of the opposition.  Rule 45(1) \nfurther requires the opponent to the registration of the trade mark to \ndeliver, to the applicant seeking registration, copies of the affidavit \nleft with the Registrar and to intimate the Registrar in that regard.   \n \n17. \nRule 8 of the Trade Mark Rules states that all documents, which \nare required “to be made, served, left or sent or paid at or to the Trade \nMarks Registry”, in respect of a Trade Mark in respect of which an \napplication seeking registration is pending, “shall be made, served, \nleft, or sent or paid to the appropriate office of the Trade Marks \nRegistry”. \n \n18. \nAs already observed, the provision is as nebulous as can be.  \nThe Rule, envelops, in one parenthesis, the expressions “made” \n“served”, “left”, “sent” and “paid” and refers to such making, serving, \nleaving, sending, or paying “to the appropriate office of the Trade \nMarks Registry”. \n \n19. \nGiven the nature of these provisions and the fact that they affect \na valuable right vested in an opponent who seeks to oppose the \nregistration of a trade mark, I am of the considered opinion that, in the \nfacts of the present case, the appellant won’t be entitled to the benefit \nof the ambiguity inherent in this provision.  \n \n20. \nThe appellant, in its application seeking extension of time as \nfiled before the learned Deputy Registrar, as well as in the present \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified\n\n--- PAGE 7 ---\nNeutral Citation Number : 2023/DHC/000137 \n C.A.(COMM.IPD-TM) 39/2022  \n                                                       Page 7 of 9  \n \n   \nappeal, has stated, on affidavit, that the attempts at e-filing of the \nevidence in support of the appellant’s objections, on 7th\n \n May 2018, \ncould not succeed as the website of the learned Registrar of Trade \nMarks was non-functional.  The impugned order does not seek to \ndiscountenance this assertion.  Notice was issued in the present \nappeal, and there is no affidavit filed by way of response, denying this \nfact.  \n21. \nThere is no reason, therefore, for this Court to disbelieve the \nappellant and presume that, in fact, no attempt was made by the \nappellant to e-file the objections on 7th May 2018, especially as, on the \nvery next day i.e., 8th May 2018, the objections were in fact sent by \ncourier.  This is not, therefore, a case in which the appellant exhibited \nany callous or negligent indolence.   The fact that, on 8th May 2018, \nthe appellant did indeed courier the evidence in support of the \nopposition to the office of the learned Registrar of Trade Marks, \ncompels this Court to believe the assertion, in the present appeal, also \ncontained in the application for extension of time filed before the \nlearned Registrar with the evidence in support of the opposition was in \nfact forwarded to the office of the learned Registrar electronically on \n7th\n \n May 2018, but that the attempt could not succeed as the website \nwas non-functional.  \n22. \nSuch an attempt, in my view, would fall within the broad \nembrace of the expression “made, served, left, sent or paid to the \nappropriate office of the Trade Marks Registry”, as employed in Rule \n8 of the Trade Marks Rules.  \n \n23. \nEven otherwise, it is well-settled that, while procedural \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified\n\n--- PAGE 8 ---\nNeutral Citation Number : 2023/DHC/000137 \n C.A.(COMM.IPD-TM) 39/2022  \n                                                       Page 8 of 9  \n \n   \nprovisions are required to be accorded their due deference, they cannot \nbe interpreted so rigidly as to result in evisceration of substantive \nrights vested in the citizens. The right to oppose registration of a trade \nmark is just as sacrosanct as the right to seek registration. In the \npeculiar facts of the present case once the application for opposition \nhad actually been filed by the appellant, it would be entirely unfair for \nthis Court to uphold the decision of the learned Deputy Registrar to \ntreat the opposition as having been abandoned only because the \nevidence in support of the opposition was received three days late, \nespecially as, prima facie, the appellant did make efforts to “leave” the \nevidence in support of the opposition with the office of the learned \nRegistrar  within the time stipulated in that regard in Rule 45(1) of the  \nTrade Marks Rules. \n \n24. \nIn that view of the matter, this Court is not required to examine \nthe somewhat more nuanced issue of whether, where the evidence in \nopposition is not “left” with the office of the learned Registrar within \ntwo months as envisaged in Rule 45(1), any discretion vests in the \nlearned Registrar to extend the time therefor.   That would involve a \njuxtaposed interpretation of Section 131 of the Trade Marks Act and \nRules 8, 45 and 109 of the Trade Marks Rules, which may be left for \nanother sunny evening.   \n \n25. \nIn the facts of the present case, therefore, the impugned order \ndated 30th\n \n August 2018 would stand set aside.  \n26. \nResultantly, the learned Deputy Registrar is directed to take into \naccount the evidence in opposition filed by the appellant and take a \nview thereon.  \n \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified\n\n--- PAGE 9 ---\nNeutral Citation Number : 2023/DHC/000137 \n C.A.(COMM.IPD-TM) 39/2022  \n                                                       Page 9 of 9  \n \n   \n27. \nI am informed that, after the impugned order was passed, the \nmark of Respondent 2 has proceeded to registration.  \n \n28. \nNeedless to say, in view of the decision taken today, the \nregistration of the Trade Mark shall remain subject to the outcome of \nthe view to be taken by the learned Deputy Registrar on the opposition \nfiled by the appellant.  \n \n29. \nIn order that equities are not unnecessarily prejudiced, the  \nlearned Deputy Registrar is directed to take a decision on the \nappellant's notice of opposition, after following due process in that \nregard, within a period of three months from today.  \n \n30. \nFor this purpose, both sides are directed to present themselves \nbefore the office of the learned Deputy Registrar of Trade Marks on \n16th\n \n January 2023 at 11:00 a.m. \n31. \nThe learned Deputy Registrar would proceed with the matter \nwith all due expedition.  \n \n32. \nBoth sides are directed not to seek any adjournment from the \nlearned Deputy Registrar. \n \n33. \nThe appeal stands allowed accordingly with no order as to \ncosts.  \n \nC. HARI SHANKAR, J. \n \nJANUARY 6, 2023 \n \ndsn \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified\n"
  },
  "total_pages": 9,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "According to the PDF document \"MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf\", the High Court of Delhi at New Delhi heard an appeal (C.A.(COMM.IPD-TM) 39/2022) filed by M/s V-Guard Industries Ltd. against the Registrar of Trade Marks and M/s Livguard Energy Technologies Pvt. Ltd.\n\nThe appeal was filed against an order dated January 6, 2023, passed by the Deputy Registrar of Trade Marks, which deemed the opposition to the registration of the trademark \"LIVGUARD ZING\" to be abandoned under Rule 45(2) of the Trade Marks Rules 2017. The opposition was initially filed by M/s V-Guard Industries Ltd. on June 2, 2016, in response to the application for registration filed by M/s Livguard Energy Technologies Pvt. Ltd. on July 11, 2014.\n\nThe court noted that the counter statement was filed by M/s Livguard Energy Technologies Pvt. Ltd. on March 7, 2018, and served electronically on M/s V-Guard Industries Ltd. on the same day. However, M/s V-Guard Industries Ltd. did not file any evidence in support of their opposition within the prescribed time, and therefore, their opposition was deemed to be abandoned.\n\nThe court relied on Rule 45 of the Trade Marks Rules, which states that if an opponent takes no action within the prescribed time, they shall be deemed to have abandoned their opposition. The court observed that Rule 45 is \"unhappily worded\" but ultimately held that the opposition was indeed abandoned. (Source: PDF document \"MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf\", page 1-2 of 9)",
      "pdf_source": "36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "According to page 1 of the PDF \"36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf\", the High Court of Delhi at New Delhi is hearing an appeal (C.A.(COMM.IPD-TM) 39/2022) filed by M/S V-Guard Industries Ltd against the Registrar of Trademarks and M/s Livguard Energy Technologies Pvt Ltd. The appeal challenges an order dated January 6, 2023, which deemed an opposition to the registration of the mark \"LIVGUARD ZING\" to be abandoned under Rule 45(2) of the Trade Marks Rules 2017. The opposition was filed by M/S V-Guard Industries Ltd in August 2018. The court is presided over by Hon'ble Mr. Justice C. Hari Shankar. The appeal is represented by various advocates, including Ms. Babna Das, Mr. Mukul Kumar, and Mr. Vizzy George for the appellant, and Mr. Harish Vaidyanathan Shankar for the respondents.",
          "content": "Neutral Citation Number : 2023/DHC/000137 \n C.A.(COMM.IPD-TM) 39/2022  \n                                                       Page 1 of 9  \n \n   \n$~18 \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.A.(COMM.IPD-TM) 39/2022 & I.A. 179/2023 \n \nM/S V-GUARD INDUSTRIES LTD  \n       ..... Appellant \nThrough: \nMs. Babna Das, Mr. Mukul \nKumar and Mr. Vizzy George, Advs. \n \n \n \n \n \nversus \n \n \nTHE REGISTRAR OF TRADEMARKS & ANR.. Respondents \nThrough: \nMr. \nHarish \nVaidyanathan \nShankar, CGSC with Mr. Srish Kumar \nMishra, \nMr. \nGagar \nMehlawat, \nMr. \nAlexander Mathai Paikaday, Advs. for R-1 \nMr. Jithin M. George and Mr. Udit Tewari, \nAdvs. for R-2 \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C. HARI SHANKAR \n \n \n \n    \n1. \nThis appeal assails the following order dated 30\nJ U D G M E N T (ORAL) \n% \n \n \n \n   06.01.2023 \n \nth\n“ \nProceedings were initiated under Section 21 of the Trade \nMark Act, 1999, by the above named opponent to oppose the \nregistration of trade mark applied for by the above named applicant \nand whereas the Counter Statement was filed by the applicant and \nthe same was served to the opponent on and whereas within the \ntime prescribed under the rules, neither any evidence in support of \nopposition was filed nor any statement was submitted on behalf of \nthe opponent to the effect that the opponent does not desire to \nadduce evidence but wants to rely on the facts mentioned in the \nNotice of Opposition. The above mentioned opposition is, \ntherefore, deemed to have been abandoned under Rule 45(2) of the \nTrade Marks Rules 2017.Thc above mentioned application shall \nproceed further as per rules.  \n \n August 2018, \npassed by the learned Deputy Registrar of Trademarks in Application \nNo. 2772497 filed by Respondent 2 M/s Livguard Energy \nTechnologies \nPvt \nLtd. \nseeking \nregistration \nof \ntheir \nmark \n“LIVGUARD ZING” in respect of batteries, invertors and like goods: \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified",
          "pdf_source": "36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "According to page 2 of the PDF \"36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf\", the court case C.A.(COMM.IPD-TM) 39/2022 involves M/S V-Guard Industries Ltd (Appellant) and The Registrar of Trade Marks & Anr. (Respondents). The application for registration was filed by Respondent 2 on July 11, 2014, and published on February 15, 2016. The appellant filed a notice of opposition on June 2, 2016. Respondent 2 filed a counter statement on March 7, 2018, which was served electronically on the appellant the same day. Rule 45 of the Trade Marks Rules is relevant to the case, stating that the opponent must provide evidence in support of opposition within two months of receiving the counter statement. (Source: PDF page 2)",
          "content": "Neutral Citation Number : 2023/DHC/000137 \n C.A.(COMM.IPD-TM) 39/2022  \n                                                       Page 2 of 9  \n \n   \nIT IS HEREBY FURTHER ORDERED that there shall be \nno order as to cost of these proceedings.” \n \n2. \nGiven the nature of the controversy in the present case, it is not \nnecessary to enter into the specifics of the application seeking \nregistration.  \n \n3. \nSuffice it to state that the application for registration was filed \nby Respondent 2 on 11th July 2014, and was published in the Register \nof Trade Marks on 15th February 2016 inviting opposition and that, on \n2nd June 2016, notice of opposition was filed by the appellant before \nthe learned Registrar.  Counter statement, in response to the notice of \nopposition filed by the appellant was filed by the Respondent 2 on 7th \nMarch 2018.  It is an admitted position that, on the same day i.e., 7th\n \n \nMarch 2018, the notice of counter statement filed by Respondent 2 \nwas served electronically on the appellant.  \n4. \nRule 45 of the Trade Marks Rules reads thus: \n“45. \nEvidence in support of opposition.— (1) Within two \nmonths from  service of a copy of the counterstatement, the \nopponent shall either leave with the Registrar, such evidence by \nway of affidavit as he may desire to adduce in support of his \nopposition or shall intimate to the Registrar and to the applicant in \nwriting that he does not desire to adduce evidence in support of his \nopposition but intends to rely on the facts stated in the notice of \nopposition. He shall deliver to the applicant copies of any evidence \nincluding exhibits, if any, that he leaves with the Registrar under \nthis sub-rule and intimate the Registrar in writing of such delivery. \n \nIf an opponent takes no action under sub-rule (1) within the \ntime mentioned therein, he shall be deemed to have abandoned his \nopposition.” \n \n \n5. \nAt a plain glance, Rule 45 is very unhappily worded. It uses the \nexpression “leave with the Registrar”. This is an expression to which \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified",
          "pdf_source": "36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0006",
      "start_index": 3,
      "end_index": 4,
      "summary": "According to the PDF document \"MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf\", the High Court of Delhi at New Delhi heard the case of M/S V-Guard Industries Ltd (Appellant) vs. The Registrar of Trade Marks & Anr. (Respondents) with Neutral Citation Number: 2023/DHC/000137 and C.A.(COMM.IPD-TM) 39/2022. \n\nThe case revolves around the opposition to the registration of a trade mark. The appellant's evidence in opposition was required to be filed by May 7, 2018, but due to the non-functionality of the Registrar's website, it was sent by courier and received by the Registrar's office on May 10, 2018, three days beyond the deadline.\n\nThe Registrar deemed the opposition abandoned as the evidence was not \"left with the Registrar\" within the stipulated time frame, as per Rule 45 of the Trade Mark Rules. However, the appellant argued that the term \"leave with the Registrar\" is ambiguous and that they had not abandoned the opposition, as evident from their subsequent application for an extension of time on August 28, 2018.\n\nThe court noted that the impugned order was incorrect, as Rule 45(1) requires the evidence to be \"left with the Registrar\", not \"filed\". The court also held that the benefit of ambiguity should go to the citizen, especially when a valuable commercial right is involved. The case highlights the importance of clarifying ambiguous language in legislative documents to avoid confusion and ensure fair proceedings. (Source: MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf)",
      "pdf_source": "36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "According to page 3 of the PDF \"36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf\", the court is discussing the interpretation of Rule 8 of the Trade Mark Rules, which deals with \"leaving of documents\". The rule is considered nebulous, and the expression \"leave with the Registrar\" is unclear. The appellant, M/S V-Guard Industries Ltd, attempted to upload evidence on the Registrar's website on May 7, 2018, but due to technical issues, sent it by courier, which was received on May 10, 2018. The appellant's counsel, Ms. Bhabna Das, argued that the evidence was sent on time, but the website's non-functionality prevented timely upload. The court is considering the appellant's case, with the respondents represented by Mr. Harish Vaidyanathan Shankar, CGSC. (Source: PDF \"36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf\", page 3)",
          "content": "Neutral Citation Number : 2023/DHC/000137 \n C.A.(COMM.IPD-TM) 39/2022  \n                                                       Page 3 of 9  \n \n   \nno legal interpretation can possibly be given.  \n \n6. \nMy attention has been invited to Rule 8 of the Trade Mark \nRules which deals with “leaving of documents” etc. and reads thus: \n“8. \nLeaving of documents, etc.— All applications, notices, \nstatements or other documents or any fees authorised or required \nby the Act or the rules to be made, served, left or sent or paid at or \nto the Trade Marks Registry in relation to a trademark on the \nRegister of trademarks on the notified date or for which an \napplication for registration is pending on, or is made on or after the \nnotified date, shall be made, served, left or sent or paid to the \nappropriate office of the Trade Marks Registry: \n \nProvided that the Registrar may, by notification in the journal, \npermit the filing of certain forms or documents, other than the \napplication for the registration of a trademark in any other office of \nthe Trade Marks Registry.” \n \n7. \nUnfortunately, Rule 8 of the Trade Mark Rules is just as \nnebulous as Rule 45.  It requires the opponent, opposing the \nregistration of a trade mark, to “leave with the Registrar”, evidence by \nway of affidavit.  It is difficult to understand the expression “leave \nwith the Registrar”.  At any rate, it is not an expression which should \nordinarily find place in a legislative document. \n \n8. \nThe case of the appellant, as argued by Ms. Bhabna Das, \nlearned Counsel for the appellant, and as set out in the present appeal, \nis that 7th May 2018 being the last date by which the evidence in \nopposition was required to be filed by the appellant, attempts were \nmade to upload the evidence on the website of the Registrar of Trade \nMarks, but that, as the website was non-functional, this could not be \ndone.  As a result, submits Ms. Bhabna Das, the evidence was sent to \nthe office of the Registrar by courier.  It is an admitted position that \nthe evidence in opposition as sent by the appellant was, in fact, \nreceived by the office of the learned Registrar on 10th May 2018, i.e., \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified",
          "pdf_source": "36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "According to page 4 of the PDF \"36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf\", the court case C.A.(COMM.IPD-TM) 39/2022 involves M/S V-Guard Industries Ltd (Appellant) and The Registrar of Trade Marks & Anr. (Respondents). The impugned order deemed the appellant's opposition to be abandoned due to non-filing of evidence within two months. However, the court notes that Rule 45(1) of the Trade Mark Rules requires evidence to be \"left with the Registrar\", not \"filed\". The appellant had submitted evidence just three days beyond the deadline. On August 28, 2018, the appellant filed an application for extension of time, which was not considered by the Deputy Registrar. The court argues that the opposition was a valuable commercial right and the appellant had no reason to abandon it. (Source: PDF page 4)",
          "content": "Neutral Citation Number : 2023/DHC/000137 \n C.A.(COMM.IPD-TM) 39/2022  \n                                                       Page 4 of 9  \n \n   \nmere three days beyond the last date for “leaving” of the evidence.  \n \n9. \nAs is apparent, the impugned order has proceeded on the \npremise that, as the evidence in terms of Rule 45 of the Trade Mark \nRules had not been filed within two months from the service of the \ncounter statement of Respondent 2 on the appellant, the opposition of \nthe appellant was deemed to have been abandoned by application of \nsub-rule (2) of Rule 45.  \n \n10. \nAt a bare glance, the impugned order is incorrect, as Rule 45(1) \ndoes not use the expression “filed”.  What Rule 45(1) requires is that \nthe evidence must be “left with the Registrar”.  Where the statute is \nambiguous, the benefit of ambiguity has to go to the citizen. This \nwould be especially so where the statute confers a valuable \ncommercial right on the citizen. It cannot be gainsaid that, having \nsubmitted the notice of opposition, opposing the application of \nRespondent 2 for registration of the Trade Mark, the tendering of \nevidence in support of the opposition was a valuable commercial right \nwhich enured in favor of the opponent/appellant. There is no \nconceivable reason as to why, having filed the notice of opposition, \nthe appellant would abandon the opposition.  That the appellant did \nnot, in fact, do so, is manifest by the fact that, on 28th\n \n August 2018, \nthe appellant filed an application for extension of time, purportedly \nunder Section 131 of the Trade Marks Act read with Rule 109 of the \nTrade Mark Rules, in Form TM-M, as required by the said rules.  \n11. \nThe application has not been considered by the learned Deputy \nRegistrar while passing the impugned order. In the application, it was \nspecifically submitted that the website of the learned Registrar of \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified",
          "pdf_source": "36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0010",
      "start_index": 5,
      "end_index": 7,
      "summary": "According to the PDF document \"MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf\", the High Court of Delhi at New Delhi heard a case (C.A.(COMM.IPD-TM) 39/2022) between M/S V-Guard Industries Ltd (Appellant) and The Registrar of Trade Marks & Anr. (Respondents). The court considered whether the decision to treat the opposition filed by the appellant as abandoned should be sustained. \n\nThe appellant's evidence in opposition was sent by courier on May 8, 2018, after the Trade Marks website was non-functional on May 7, 2018, and was received by the Registrar's office on May 10, 2018. The issue was whether the appellant's delay in complying with Rule 45 of the Trade Mark Rules was justified. \n\nThe court considered two issues: whether there was a delay in complying with Rule 45 and whether the Registrar could condone the delay. Rule 45(1) requires the opponent to leave evidence with the Registrar within two months of the counter-statement. The court noted that the provisions were ambiguous, but the appellant's attempts to e-file the evidence on May 7, 2018, were unsuccessful due to the website being non-functional.\n\nThe court ultimately decided in favor of the appellant, stating that the decision to treat the opposition as abandoned should not be sustained. The PDF document provides the full details of the case, including the legal arguments and proceedings.",
      "pdf_source": "36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf",
      "nodes": [
        {
          "title": "Page 5",
          "node_id": "0007",
          "start_index": 5,
          "end_index": 5,
          "summary": "According to page 5 of the PDF \"36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf\", the High Court of Delhi is hearing an appeal by M/S V-Guard Industries Ltd against the Registrar of Trade Marks. The issue is whether the opposition filed by the appellant to the application of Respondent 2 seeking registration of the \"LIVGUARD ZING\" mark should be treated as abandoned. The court heard arguments from Ms. Bhabna Das for the appellant and Mr. Jithin M George for Respondent 2. The court is considering two issues: whether there was a delay in complying with Rule 45 of the Trade Mark Rules and whether the Registrar can condone the delay. The evidence in opposition was received by the Registrar's office on May 10, 2018, after being sent by courier on May 8, 2018, due to the Trade Marks website being non-functional on May 7, 2018.",
          "content": "Neutral Citation Number : 2023/DHC/000137 \n C.A.(COMM.IPD-TM) 39/2022  \n                                                       Page 5 of 9  \n \n   \nTrade Marks was non-functional on 7th May 2018, as a result of \nwhich, on 8th\n \n May 2018, the evidence in opposition was sent by the \nappellant by courier.  \n12. \nAs already noticed, it is an admitted position that the evidence \nin opposition was indeed received by the office of the learned \nRegistrar on 10th\n \n May 2018.     \n13. \nThe issue before the court is whether, in these circumstances \nand in the backdrop of the existing statutory scenario as contained in \nthe Trade Marks Act and Trade Marks Rules, this Court should sustain \nthe decision of the learned Deputy Registrar, vide the impugned order \ndated 30th\n \n August 2018, to treat the opposition filed by the appellant, \nto the application of Respondent 2 seeking registration of the \n“LIVGUARD ZING” mark, as having been abandoned.  \n14. \nHaving heard Ms. Bhabna Das, learned Counsel for the \nappellant and Mr. Jithin M George, learned Counsel for Respondent 2, \nin my considered opinion, the answer to this query has necessarily to \nbe in the negative.  \n \n15. \nTwo issues would arise for consideration. The first is whether \nthere was, in fact, delay on the part of the appellant in complying with \nthe requirement of Rule 45 of the Trade Mark Rules. The second is \nwhether, assuming there was any such delay, the learned Registrar \nwas empowered to condone the delay or to extend the time for \ncompliance with Rule 45.  \n \n16. \nAddressing the first issue first, Rule 45 (1) stipulates that, \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified",
          "pdf_source": "36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf",
          "nodes": []
        },
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "According to page 6 of the PDF \"36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf\", the opponent of a trade mark registration must leave evidence in support of the opposition with the Registrar within two months of the counter statement being filed (Rule 45(1)). The opponent must also deliver copies of the affidavit to the applicant and inform the Registrar (Rule 45(1)). Rule 8 of the Trade Mark Rules states that all documents related to a pending trade mark application must be submitted to the appropriate office of the Trade Marks Registry. The court notes that the provisions are ambiguous, but the appellant will not benefit from this ambiguity in this case (C.A.(COMM.IPD-TM) 39/2022). The proceedings involve M/S V-Guard Industries Ltd (appellant) and The Registrar of TradeMarks & Anr. (respondent), with advocates Ms. Babna Das, Mr. Mukul Kumar, and Mr. Vizzy George representing the appellant.",
          "content": "Neutral Citation Number : 2023/DHC/000137 \n C.A.(COMM.IPD-TM) 39/2022  \n                                                       Page 6 of 9  \n \n   \nwithin two months from service of the copy of the counter statement \nfiled by the trade mark applicant, the opponent opposing the \nregistration of the mark is required to leave, with the Registrar, \nevidence by way of affidavit in support of the opposition.  Rule 45(1) \nfurther requires the opponent to the registration of the trade mark to \ndeliver, to the applicant seeking registration, copies of the affidavit \nleft with the Registrar and to intimate the Registrar in that regard.   \n \n17. \nRule 8 of the Trade Mark Rules states that all documents, which \nare required “to be made, served, left or sent or paid at or to the Trade \nMarks Registry”, in respect of a Trade Mark in respect of which an \napplication seeking registration is pending, “shall be made, served, \nleft, or sent or paid to the appropriate office of the Trade Marks \nRegistry”. \n \n18. \nAs already observed, the provision is as nebulous as can be.  \nThe Rule, envelops, in one parenthesis, the expressions “made” \n“served”, “left”, “sent” and “paid” and refers to such making, serving, \nleaving, sending, or paying “to the appropriate office of the Trade \nMarks Registry”. \n \n19. \nGiven the nature of these provisions and the fact that they affect \na valuable right vested in an opponent who seeks to oppose the \nregistration of a trade mark, I am of the considered opinion that, in the \nfacts of the present case, the appellant won’t be entitled to the benefit \nof the ambiguity inherent in this provision.  \n \n20. \nThe appellant, in its application seeking extension of time as \nfiled before the learned Deputy Registrar, as well as in the present \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified",
          "pdf_source": "36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf",
          "nodes": []
        },
        {
          "title": "Page 7",
          "node_id": "0009",
          "start_index": 7,
          "end_index": 7,
          "summary": "According to page 7 of the PDF \"36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf\", the appellant attempted to e-file evidence on May 7, 2018, but the website of the Registrar of Trade Marks was non-functional. The appellant then sent the objections by courier on May 8, 2018. The court believes the appellant's assertion that they attempted to e-file on May 7, 2018, and considers this attempt to be within the scope of Rule 8 of the Trade Marks Rules. The court notes that there is no reason to disbelieve the appellant, especially since there is no affidavit denying this fact. The appeal is C.A.(COMM.IPD-TM) 39/2022, and the case involves M/S V-Guard Industries Ltd as the appellant and The Registrar of Trade Marks & Anr. as the respondents. (Source: PDF page 7)",
          "content": "Neutral Citation Number : 2023/DHC/000137 \n C.A.(COMM.IPD-TM) 39/2022  \n                                                       Page 7 of 9  \n \n   \nappeal, has stated, on affidavit, that the attempts at e-filing of the \nevidence in support of the appellant’s objections, on 7th\n \n May 2018, \ncould not succeed as the website of the learned Registrar of Trade \nMarks was non-functional.  The impugned order does not seek to \ndiscountenance this assertion.  Notice was issued in the present \nappeal, and there is no affidavit filed by way of response, denying this \nfact.  \n21. \nThere is no reason, therefore, for this Court to disbelieve the \nappellant and presume that, in fact, no attempt was made by the \nappellant to e-file the objections on 7th May 2018, especially as, on the \nvery next day i.e., 8th May 2018, the objections were in fact sent by \ncourier.  This is not, therefore, a case in which the appellant exhibited \nany callous or negligent indolence.   The fact that, on 8th May 2018, \nthe appellant did indeed courier the evidence in support of the \nopposition to the office of the learned Registrar of Trade Marks, \ncompels this Court to believe the assertion, in the present appeal, also \ncontained in the application for extension of time filed before the \nlearned Registrar with the evidence in support of the opposition was in \nfact forwarded to the office of the learned Registrar electronically on \n7th\n \n May 2018, but that the attempt could not succeed as the website \nwas non-functional.  \n22. \nSuch an attempt, in my view, would fall within the broad \nembrace of the expression “made, served, left, sent or paid to the \nappropriate office of the Trade Marks Registry”, as employed in Rule \n8 of the Trade Marks Rules.  \n \n23. \nEven otherwise, it is well-settled that, while procedural \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified",
          "pdf_source": "36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0013",
      "start_index": 8,
      "end_index": 9,
      "summary": "According to the PDF document \"MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf\", the High Court of Delhi at New Delhi made a decision in the case C.A.(COMM.IPD-TM) 39/2022. The appellant, M/S V-Guard Industries Ltd, opposed the registration of a trade mark by the respondent, The Registrar of Trade Marks & Anr. The opposition was filed, but the evidence in support was received three days late. \n\nThe court ruled that the decision of the Deputy Registrar to treat the opposition as abandoned was unfair, as the appellant had made efforts to \"leave\" the evidence within the stipulated time. The court set aside the impugned order dated August 30, 2018, and directed the Deputy Registrar to take into account the evidence in opposition filed by the appellant.\n\nThe court also directed the Deputy Registrar to take a decision on the appellant's notice of opposition within three months from January 6, 2023. Both sides were directed to present themselves before the office of the Deputy Registrar on January 16, 2023, and not to seek any adjournment. The appeal was allowed with no order as to costs.\n\nThe court's decision was based on the provisions of the Trade Marks Act and Rules, particularly Rule 45(1) of the Trade Marks Rules. The case highlights the importance of adhering to procedural timelines in trade mark opposition proceedings. (Source: MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf, Neutral Citation Number: 2023/DHC/000137)",
      "pdf_source": "36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf",
      "nodes": [
        {
          "title": "Page 8",
          "node_id": "0011",
          "start_index": 8,
          "end_index": 8,
          "summary": "According to page 8 of the PDF \"36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf\", the High Court of Delhi ruled in favor of the appellant, M/S V-Guard Industries Ltd. The court set aside the impugned order dated August 30, 2018, which treated the opposition as abandoned due to late submission of evidence. The court directed the Deputy Registrar to consider the evidence in opposition filed by the appellant. The decision was made on January 10, 2023, and was digitally signed by Kamla Rawat. The case number is C.A.(COMM.IPD-TM) 39/2022, and the Neutral Citation Number is 2023/DHC/000137. The court emphasized that the right to oppose registration of a trade mark is sacrosanct and should not be rigidly interpreted to result in the evisceration of substantive rights vested in citizens.",
          "content": "Neutral Citation Number : 2023/DHC/000137 \n C.A.(COMM.IPD-TM) 39/2022  \n                                                       Page 8 of 9  \n \n   \nprovisions are required to be accorded their due deference, they cannot \nbe interpreted so rigidly as to result in evisceration of substantive \nrights vested in the citizens. The right to oppose registration of a trade \nmark is just as sacrosanct as the right to seek registration. In the \npeculiar facts of the present case once the application for opposition \nhad actually been filed by the appellant, it would be entirely unfair for \nthis Court to uphold the decision of the learned Deputy Registrar to \ntreat the opposition as having been abandoned only because the \nevidence in support of the opposition was received three days late, \nespecially as, prima facie, the appellant did make efforts to “leave” the \nevidence in support of the opposition with the office of the learned \nRegistrar  within the time stipulated in that regard in Rule 45(1) of the  \nTrade Marks Rules. \n \n24. \nIn that view of the matter, this Court is not required to examine \nthe somewhat more nuanced issue of whether, where the evidence in \nopposition is not “left” with the office of the learned Registrar within \ntwo months as envisaged in Rule 45(1), any discretion vests in the \nlearned Registrar to extend the time therefor.   That would involve a \njuxtaposed interpretation of Section 131 of the Trade Marks Act and \nRules 8, 45 and 109 of the Trade Marks Rules, which may be left for \nanother sunny evening.   \n \n25. \nIn the facts of the present case, therefore, the impugned order \ndated 30th\n \n August 2018 would stand set aside.  \n26. \nResultantly, the learned Deputy Registrar is directed to take into \naccount the evidence in opposition filed by the appellant and take a \nview thereon.  \n \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified",
          "pdf_source": "36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf",
          "nodes": []
        },
        {
          "title": "Page 9",
          "node_id": "0012",
          "start_index": 9,
          "end_index": 9,
          "summary": "According to page 9 of the PDF \"36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf\", the court directed the Deputy Registrar to decide on the appellant's notice of opposition within three months. The registration of Respondent 2's trademark will remain subject to the outcome of this decision. The appeal was allowed with no order as to costs. The Deputy Registrar is scheduled to hear the matter on January 16, 2023, at 11:00 a.m. Both sides are directed not to seek adjournments. The decision was made by Judge C. Hari Shankar on January 6, 2023. The case details are C.A.(COMM.IPD-TM) 39/2022 and I.A. 179/2023, with Neutral Citation Number 2023/DHC/000137.",
          "content": "Neutral Citation Number : 2023/DHC/000137 \n C.A.(COMM.IPD-TM) 39/2022  \n                                                       Page 9 of 9  \n \n   \n27. \nI am informed that, after the impugned order was passed, the \nmark of Respondent 2 has proceeded to registration.  \n \n28. \nNeedless to say, in view of the decision taken today, the \nregistration of the Trade Mark shall remain subject to the outcome of \nthe view to be taken by the learned Deputy Registrar on the opposition \nfiled by the appellant.  \n \n29. \nIn order that equities are not unnecessarily prejudiced, the  \nlearned Deputy Registrar is directed to take a decision on the \nappellant's notice of opposition, after following due process in that \nregard, within a period of three months from today.  \n \n30. \nFor this purpose, both sides are directed to present themselves \nbefore the office of the learned Deputy Registrar of Trade Marks on \n16th\n \n January 2023 at 11:00 a.m. \n31. \nThe learned Deputy Registrar would proceed with the matter \nwith all due expedition.  \n \n32. \nBoth sides are directed not to seek any adjournment from the \nlearned Deputy Registrar. \n \n33. \nThe appeal stands allowed accordingly with no order as to \ncosts.  \n \nC. HARI SHANKAR, J. \n \nJANUARY 6, 2023 \n \ndsn \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:10.01.2023\n11:21:49\nSignature Not Verified",
          "pdf_source": "36. MS V-Guard Industries Ltd. v. The Registrar of Trade Marks & Anr.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-15T18:34:06.841050",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}