{
  "doc_name": "37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks",
  "pdf_source": "37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf",
  "metadata": {
    "document_name": "37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks",
    "source_pdf": "37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf",
    "judges": [
      "C. HARI SHANKAR"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "148/2022",
      "148/2022",
      "148/2022",
      "148/2022",
      "148/2022",
      "148/2022",
      "148/2022",
      "148/2022",
      "148/2022"
    ],
    "dhc_numbers": [
      "2023/DHC/000853",
      "2023/DHC/000853",
      "2023/DHC/000853",
      "2023/DHC/000853",
      "2023/DHC/000853",
      "2023/DHC/000853",
      "2023/DHC/000853",
      "2023/DHC/000853"
    ],
    "ia_numbers": [],
    "decision_date": "13 January, 2020",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [],
    "defendants": [],
    "appellants": [
      "MVS Eduexcellence Pvt Ltd"
    ],
    "respondents": [
      "The Registrar of Trade Marks"
    ],
    "plaintiff_advocates": [],
    "defendant_advocates": [],
    "appellant_advocates": [
      "Mr. Anuj Kumar",
      "Mr. Abhijeet Kumar Pandey"
    ],
    "respondent_advocates": [],
    "damages_claimed": null,
    "damages_awarded": null,
    "key_issues": [
      "The appellant's application for registration of the mark \"Indirapuram Public School\" was rejected due to lack of distinctiveness under Section 9(1)(a) of the Trade Marks Act, 1999.",
      "The mark is considered a common and generic combination of two English words, with \"Indirapuram\" being a geographical place and \"Public School\" indicating the intended purpose of services.",
      "The appellant failed to provide sufficient evidence to prove use of the mark since 15/04/2013, as claimed in the application, and therefore did not comply with Rule 25 of the Trade Marks Rules, 2017.",
      "The mark is incapable of distinguishing the services of one person from another, as it is descriptive of the nature and description of services applied for registration.",
      "The appellant's reply to the examination report and documents filed on record were not sufficient to proceed with the application for registration.",
      "The Trademarks Registry has the authority to reject applications that do not meet the requirements of the Trade Marks Act, 1999, and the Trade Marks Rules, 2017.",
      "The use of a geographical name and a descriptive term in a trademark application can render the mark ineligible for registration due to lack of distinctiveness.",
      "The applicant has the burden of proving use of the mark as claimed in the application, and failure to do so can result in rejection of the application.",
      "The Trade Marks Act, 1999, and the Trade Marks Rules, 2017, provide the framework for determining the registrability of trademarks in India."
    ],
    "decision_summary": "**Case Summary: MVS Eduexcellence Pvt Ltd. vs. The Registrar of Trademarks, Delhi**\n\n**Background:**\nThe appellant, MVS Eduexcellence Pvt Ltd., filed an application (No. 3018041) to register the trademark \"Indirapuram Public School\" in Class 41, which was rejected by the Senior Examiner in the office of the Trade Marks Registry. The appellant challenged this decision before the High Court of Delhi.\n\n**Legal Issues:**\nThe main issue in this case is whether the trademark \"Indirapuram Public School\" is registrable under the Trade Marks Act, 1999. The Senior Examiner rejected the application on the grounds that the mark lacks distinctiveness, is descriptive of the services, and is a common and generic combination of words. The appellant claimed to have used the mark since April 15, 2013, but the Senior Examiner found that the affidavit and documentary evidence filed by the appellant were insufficient to prove this claim.\n\n**Arguments:**\nThe appellant argued that the mark is registrable, while the respondent (The Registrar of Trademarks, Delhi) argued that the mark is not registrable due to its lack of distinctiveness and descriptiveness. The respondent also pointed out that the appellant failed to comply with Rule 25 of the Trade Marks Rules, 2017, which requires an applicant to file an affidavit testifying to the use of the mark along with supporting documents.\n\n**Court Findings:**\nThe High Court of Delhi, after considering the submissions of both parties, found that the mark \"Indirapuram Public School\" is indeed descriptive of the services and lacks distinctiveness. The court noted that the word \"Indirapuram\" is a geographical place, and \"Public School\" indicates the intended purpose of the services, but does not carry any distinctive character. The court also observed that the appellant failed to comply with Rule 25 of the Trade Marks Rules, 2017, which requires an applicant to file an affidavit testifying to the use of the mark along with supporting documents.\n\n**Decision:**\nThe High Court of Delhi upheld the decision of the Senior Examiner and dismissed the appeal. The court held that the mark \"Indirapuram Public School\" is not registrable under the Trade Marks Act, 1999, due to its lack of distinctiveness and descriptiveness. The court also noted that the appellant's failure to comply with Rule 25 of the Trade Marks Rules, 2017, is a significant factor in determining the registrability of the mark.\n\n**Key Points:**\n\n* The mark \"Indirapuram Public School\" is not registrable due to its lack of distinctiveness and descriptiveness.\n* The appellant failed to comply with Rule 25 of the Trade Marks Rules, 2017, which requires an applicant to file an affidavit testifying to the use of the mark along with supporting documents.\n* The court upheld the decision of the Senior Examiner and dismissed the appeal.\n* The case highlights the importance of complying with the requirements of the Trade Marks Act, 1999, and the Trade Marks Rules, 2017, in order to register a trademark.",
    "legal_precedents": [
      "(2003) 11 SCC 92"
    ],
    "full_text": "\n--- PAGE 1 ---\nNeutral Citation Number : 2023/DHC/000853 \nC.A.(COMM.IPD-TM) 148/2022                                              Page 1 of 8 \n \n$~7 \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.A.(COMM.IPD-TM) 148/2022 \n \nMVS EDUEXCELLENCE PVT LTD. \n     ..... Appellant \nThrough: \nMr. Anuj Kumar and Mr. Abhijeet \nKumar Pandey, Advs. \n \n \n \n \n \nversus \n \n \nTHE REGISTRAR OFTRADEMARKS, DELHI \n..... Respondents \n \n \n \n \nThrough: \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C. HARI SHANKAR \n \n \n \n \nJUDGEMENT (ORAL) \n% \n \n \n \n         06.02.2023 \n \n \n1. \nThis appeal challenges order dated 13th January 2020, whereby \nApplication No. 3018041, submitted by the appellant for registration of \nthe mark “Indirapuram Public School” in Class 41 has been rejected by \nthe learned Senior Examiner in the office of the Trade Marks Registry. \nThe reasoning in the impugned order of the learned Senior Examiner \nreads as under: \n \n“In the examination report, mark was clearly lacks distinctiveness and \nfalls within the purview of Absolute ground of refusal so envisaged \nunder Section 9(1)(a) of the Trade Mars Act, 1999 which is \nreproduced as under :- \n \n9(1)(a) of the Trade Marks Act 19999 as the mark is a common \nsurname/personal name/geographical name/ornamental or a non-\ndistinctive geometrical figure and as such it is not capable of \ndistinguishing the goods or services of one person from those of \nothers. \nSubsequently, a hearing was fixed in the matter on 19th March, 2019, \neventually the Counsel for the applicant appeared on the said date for \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:07.02.2023\n15:20:02\nSignature Not Verified\n\n--- PAGE 2 ---\nNeutral Citation Number : 2023/DHC/000853 \nC.A.(COMM.IPD-TM) 148/2022                                              Page 2 of 8 \n \nhearing and made his oral submissions in support the application. I \nhave carefully perused the reply to examination report filed in the \nmatter as well as electronically filed records and material available on \nthe portal. I have also considered the oral submissions made at the \ntime of hearing by the Ld. Counsel for the applicant in support of the \nregistrability of the impugned mark. \n \nSince the trade mark applied for registration is clearly lacks \ndistinctiveness and descriptive to the nature and description of \nservices, as applied for registration and the reply and documents \nplaced on record are not sufficient to proceed the application further, \nhence, the mark cannot be allowed to proceed for registration, while \nconsidering the following. \n \nIncapable of distinguishing the services of one person from the other; \nThe trademark “INDIRAPURAM PUBLIC SCHOOL” is a common \nand generic combination of two English words “INDIRAPURAM and \nPUBLIC SCHOOL”. The word INIDRAPURAM is indicated \ngeographical place and PUBLIC SCHOOL is indicated of intended \npurpose of services and it does not carry any distinctive character; \nNo one can acquire a monopoly or exclusive right; \n \nIt is pertinent and thus noteworthy that the impugned application has \nbeen filed claiming user of the mark since 15/04/2013, thus it was \nincumbent upon the applicant to prove said user through affidavit and \ndocumentary evidence, otherwise the application would be deemed to \nhave been filed on the basis of wrong statement of use. Perusal of \nExamination report reply as well as documents filed on record, I have \nno hesitation to state that affidavit has been filed by the applicant \nwhich prove the user of the impugned mark since 15/04/2013, \ntherefore Applicant has failed to comply with provision of Rule 25 of \nthe Trade Marks Rules 2017 which reads as follows: \n \nRule 25 of Trade Marks Rules, 2017- \n \nStatement of user in applications – (1) An application to register a \ntrademark shall, unless the trademark is proposed to be used, contain a \nstatement of the period during which , and the person by whom it has \nbeen used in respect of all the goods or services mentioned in the \napplication. \n(2) In case, the use of the trademark is claimed prior to the date of \napplication, the applicant shall file an affidavit testifying to such use \nalong with supporting documents. \n \nIn the light of the above said provision and the observations made by \nthe Hon’ble Delhi High Court in the judgments namely Vivek \nKochher & Anr v M/s Kyk Corporation Ltd & Anr. Reported as PTC \n2017 (72) page 556 and Suresh Kumar Jain Vs. Union of India \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:07.02.2023\n15:20:02\nSignature Not Verified\n\n--- PAGE 3 ---\nNeutral Citation Number : 2023/DHC/000853 \nC.A.(COMM.IPD-TM) 148/2022                                              Page 3 of 8 \n \nreported as PTC 2012(49) page 287, whereby it was held by the \nHon’ble High Court that if the a mark is filed/registered on the basis of \nwrong statement of use, then the same cannot be registered or remain \non the Register. Such mark therefore ought not to be put on the \nRegister which is essential for a Hearing Officer for the purposes of \nmaintaining the purity of Register being acting on behalf of Registrar \nof Trade Marks who is custodian of Register of Trade Marks, as has \nbeen held by Hon’ble Supreme Court in Hardie Trading Ltd. and \nanother v. Addisons paint & Chemicals Ltd., (2003) 11 SCC 92. And \nfurther in the matter of Inter lkea Systems BV & Anr versus Sham \nMurari &ors, reported as PTC 2018, the Hon’ble Delhi High Court \nobserved that “While this Court does not wish to encourage any party, \nwhich misleads the trademark authorities”. \n \nIn view of above, I am of the considered view that objections raised in \nthe Examination reports cannot be waived and the Reply to the \nExamination report and documents filed as well as oral submission \nmade are insufficient to grant registration of trade mark applied for \nregistration, therefore not entitled for any benefit under Section 9(1) \nproviso of the Act. Hence objection under Section 9(1)(a) of the Act \ncannot be waived off. Also the mark cannot be allowed to be \nproceeded further while maintaining the purity of the register.” \n \n2. \nConsequent to submission of its application No. 3018041, seeking \nregistration of the “Indirapuram Public School” mark, First Examination \nReport (FER) dated  12th May 2016 was issued from the office of the \nlearned Registrar, raising, as the sole objection under Section 9(1)(a)1 of \nthe Trade Marks Act, 1999, the contention that the mark, of which \nregistration had been sought, was “a common surname/personal \nname/geographical name/ornamental or a non-distinctive geometrical \n                                          \n1 9.  \nAbsolute grounds for refusal of registration. –  \n(1)  \nThe trade marks –  \n(a)  \nwhich are devoid of any distinctive character, that is to say, not capable of \ndistinguishing the goods or services of one person from those of another person; \n(b)  \nwhich consist exclusively of marks or indications which may serve in trade to \ndesignate the kind, quality, quantity, intended purpose, values, geographical origin or the time \nof production of the goods or rendering of the service or other characteristics of the goods or \nservice; \n(c)  \nwhich consist exclusively of marks or indications which have become customary in \nthe current language or in the bona fide and established practices of the trade, \nshall not be registered: \nProvided that a trade mark shall not be refused registration if before the date of application for \nregistration it has acquired a distinctive character as a result of the use made of it or is a well-known \ntrade mark. \n \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:07.02.2023\n15:20:02\nSignature Not Verified\n\n--- PAGE 4 ---\nNeutral Citation Number : 2023/DHC/000853 \nC.A.(COMM.IPD-TM) 148/2022                                              Page 4 of 8 \n \nfigure” which was “not capable of distinguishing the goods or services of \none person from those of others”. \n \n3. \nThe appellant replied to the aforesaid objections on 13th December \n2016. It was asserted, in the reply, that the mark “Indirapuram Public \nSchool” had gained distinctiveness over a period of time by extensive use \nand was a source indicator for residents residing in the area. Following \non the reputation gained by it, the reply asserted that further branches of \nthe school had been opened at Crossing Republic and at Pratap Vihar, \nGhaziabad. It was further asserted that over 2,600 students were enrolled \nin the school, which earned substantial income from the educational \nservices rendered by it. \n \n4. \nIn these circumstances, it was asserted that the objection regarding \nnon-distinctiveness, under Section 9(1)(a) of the Trade Marks Act was \nwithout substance and that, therefore, the mark was entitled to registered. \n \n5. \nThe aforesaid reply was accompanied by an affidavit dated 15th \nDecember 2016. A separate affidavit, by way of evidence, was also filed \nby the appellant, basically reiterating the contents of the aforesaid reply \ndated 13th December 2016. \n \n6. \nSeveral documents were also filed by the appellant along with the \naforesaid affidavit. \n \n7. \nMr. Anuj Kumar, learned Counsel for the appellant submits that \nthe impugned order is patently erroneous, as it proceeds by bifurcating \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:07.02.2023\n15:20:02\nSignature Not Verified\n\n--- PAGE 5 ---\nNeutral Citation Number : 2023/DHC/000853 \nC.A.(COMM.IPD-TM) 148/2022                                              Page 5 of 8 \n \nthe mark of which registration was sought, into “Indirapuram” and \n“Public School” separately, and holds the mark to be lacking in \ndistinctiveness on the ground that Indirapuram was the name of a \ngeographical area and “Public School” merely indicated the nature of \nservices rendered by the institution for which the application for \nregistration had been submitted. \n \n8. \nThe mark “Indirapuram Public School” seen as a whole, submits \nMr. Kumar, is clearly distinctive. He points out that there was no \nobjection on the ground that any other institution had a deceptively \nsimilar name. He also points out that there are several similar marks \nwhich already stand registered such as Delhi Public School, Ghaziabad \nPublic School Senior Secondary School, Mumbai Public School, Indore \nPublic School and Chennai Public School. \n \n9. \nMr. Harish Vaidyanathan Shankar, learned Counsel for the \nrespondent, fairly leaves this aspect to the Court. However, he points out \nthat the impugned order also notes that the appellant had not provided \nevidence of user as required by  Rule 272 of the Trade Marks Rules, 2017 \n(“the 2017 TM Rules”), though there appears to be a typographical error \nin the impugned order in that regard. \n \n10. \nRule 25(2) of the 2017 TM Rules, as it stands now, specifically \nrequires the appellant to file an affidavit testifying to prior user of the \nmark of which registration was sought along with supporting documents. \n                                          \n2 27. Statement of user in applications.- \nAn application to register a trade mark shall, unless the trade \nmark is proposed to be used, contain a statement of the period during which, and the person by whom it has been \nused in respect of the goods or services mentioned in the application. The Registrar may require the applicant to \nfile an affidavit testifying to such user with exhibits showing the mark as used. \" \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:07.02.2023\n15:20:02\nSignature Not Verified\n\n--- PAGE 6 ---\nNeutral Citation Number : 2023/DHC/000853 \nC.A.(COMM.IPD-TM) 148/2022                                              Page 6 of 8 \n \nMr. Anuj Kumar submits that, at the time when the application for \nregistration had been filed by his client, on 28th July 2015, the Rule 25(2) \nof the Trade Marks Rules, 2017 had yet to come into force and that Rule \n273 of the then existing Trade Marks Rules, 2002 (“the 2002 TM Rules”) \nthen in force, did not require, mandatorily, filing of an affidavit of user, \nbut clothed the Registrar with the discretion (as is apparent from the use \nof the word “may”) to require the applicant to file an affidavit of user \nwith supportive exhibits.   \n \n11. \nMr. Vaidyanathan, learned Counsel for the respondent submits \nthat, however, as the evidence in affidavit was filed by the appellant after \n2017, the appellant ought to have placed evidence of prior user on record. \n \n12. \nGiven the fact that the application was filed prior to the \nrequirement of affidavit of user along with supportive evidence being \nplaced on record, where prior user was claimed, I am inclined to agree \nwith Mr. Anuj Kumar that the appellant cannot be faulted for not having \nfiled such an affidavit with evidence of user. It is trite that an application \nor petition would be governed by the procedure, or format, applicable at \nthe time when it is filed, and that subsequent changes in procedure or \nformat introducing during the pendency of the application would not \naffect it. Besides, Rule 1584 of the 2017 TM Rules saves acts done under \nthe 2002 TM Rules before the 2017 TM Rules came into force. This \nitself is a complete answer to Mr. Vaidyanathan’s submission. \n                                          \n3 27.  \nStatement of user in applications. – An application to register a trade mark shall, unless the trade mark \nis proposed to be used, contain a statement of the period during which, and the person by whom it has been used \nin respect of the goods or services mentioned in the application. The Registrar may require the applicant to file an \naffidavit testifying to such user with exhibits showing the mark as used. \n4 158. \nThe Trade Marks Rules, 2002, are hereby repealed without prejudice to anything done under such rules \nbefore the coming into force of these rules. \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:07.02.2023\n15:20:02\nSignature Not Verified\n\n--- PAGE 7 ---\nNeutral Citation Number : 2023/DHC/000853 \nC.A.(COMM.IPD-TM) 148/2022                                              Page 7 of 8 \n \n13. \nBe that as it may, this Court, vide its order dated 9th September \n2022, permitted the appellant to place user documents on record. The \nappellant has thereafter, filed, under index dated 29th October 2022, a list \nof the documents which, according to the appellant, evidence prior user, \nby the appellant, of the “Indirapuram Public School” word mark since \n2014, being the claim of user submitted before the learned Registrar. \n \n14. \nIt would be appropriate that the claim of prior user by the \nappellant, predicated on the aforesaid documents, be considered in the \nfirst instance by the learned Registrar, as it primarily involves \nexamination into facts. \n \n15. \nThe impugned order, insofar as it rejects the appellant’s \napplication under Section 9(1)(a) of the Trade Marks Act, on the ground \nthat the “Indirapuram Public School” mark is lacking indistinctiveness is, \nhowever, not sustainable on facts or in law. \n \n16. \nAs such, the impugned order dated 13th January 2020 is quashed \nand set aside. Application No. 3018041 filed by the appellant shall stand \nremanded for reconsideration by the learned Registrar or by any officer \ndeputed by the learned Registrar for the said purpose, solely on the aspect \nof user as claimed by the appellant since 2014. The appellant would file a \nfresh affidavit of user before the learned Registrar. The learned Registrar \nwould examine the claim of user of the appellant on the basis of the said \naffidavit along with the documents already filed before the learned \nRegistrar as well as the documents filed before this Court under cover of \nindex dated 29th October 2022, which the appellant is permitted to \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:07.02.2023\n15:20:02\nSignature Not Verified\n\n--- PAGE 8 ---\nNeutral Citation Number : 2023/DHC/000853 \nC.A.(COMM.IPD-TM) 148/2022                                              Page 8 of 8 \n \npresent before the learned Registrar for the said purpose. \n \n17. \nThe appellant would also be granted an opportunity of hearing \nbefore any decision is taken. For the said purpose, let the appellant \npresent itself before the learned Registrar on 21st February 2023. \n \n18. \nThe learned Registrar (or other officer deputed by him) is directed \nto decide the appellant’s application as expeditiously as possible, \npreferably within a period of four weeks therefrom. \n \n19. \nThe appeal stands allowed to the aforesaid extent with no order as \nto costs. \n \n20. \nJudgment to be uploaded on the website of this Court within 24 \nhours. \n \n \nC. HARI SHANKAR, J \n \nFEBRUARY 6, 2023 \n \nAR \n \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:07.02.2023\n15:20:02\nSignature Not Verified\n"
  },
  "total_pages": 8,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "According to the PDF document \"MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf\", the case involves an appeal by MVS Eduexcellence Pvt Ltd. (Appellant) against the decision of the Registrar of Trade Marks, Delhi (Respondent) to reject their application for registration of the trademark \"Indirapuram Public School\" in Class 41. The appeal was heard by the High Court of Delhi at New Delhi, with Hon'ble Mr. Justice C. Hari Shankar presiding.\n\nThe Respondent had rejected the application on the grounds that the mark lacked distinctiveness and fell under the absolute ground of refusal under Section 9(1)(a) of the Trade Marks Act, 1999. The Appellant had claimed user of the mark since April 15, 2013, but failed to provide sufficient evidence to support this claim.\n\nThe Court considered the oral submissions made by the Appellant's counsel and the documents filed on record. The Respondent argued that the trademark was a common and generic combination of two English words, \"Indirapuram\" and \"Public School\", which indicated a geographical place and the intended purpose of services, respectively. The Court ultimately upheld the Respondent's decision to reject the application, citing the Appellant's failure to comply with Rule 25 of the Trade Marks Rules, 2017, which requires a statement of user in applications.\n\nThe key dates in the case include January 13, 2020 (the date of the impugned order), March 19, 2019 (the date of the hearing), and February 6, 2023 (the date of the judgment). The PDF document provides further details on the case, including the Court's reasoning and the Appellant's arguments. (Source: MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf)",
      "pdf_source": "37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "According to page 1 of the PDF \"37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf\", the High Court of Delhi at New Delhi heard an appeal (C.A.(COMM.IPD-TM) 148/2022) filed by MVS Eduexcellence Pvt Ltd. against the Registrar of Trade Marks, Delhi. The appeal challenges an order dated January 13, 2020, which rejected the application (No. 3018041) for registration of the mark \"Indirapuram Public School\" in Class 41. The Senior Examiner rejected the application due to lack of distinctiveness under Section 9(1)(a) of the Trade Marks Act, 1999. A hearing was held on March 19, 2019. The appeal was heard by Hon'ble Mr. Justice C. Hari Shankar on February 6, 2023. (Source: PDF page 1)",
          "content": "Neutral Citation Number : 2023/DHC/000853 \nC.A.(COMM.IPD-TM) 148/2022                                              Page 1 of 8 \n \n$~7 \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.A.(COMM.IPD-TM) 148/2022 \n \nMVS EDUEXCELLENCE PVT LTD. \n     ..... Appellant \nThrough: \nMr. Anuj Kumar and Mr. Abhijeet \nKumar Pandey, Advs. \n \n \n \n \n \nversus \n \n \nTHE REGISTRAR OFTRADEMARKS, DELHI \n..... Respondents \n \n \n \n \nThrough: \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C. HARI SHANKAR \n \n \n \n \nJUDGEMENT (ORAL) \n% \n \n \n \n         06.02.2023 \n \n \n1. \nThis appeal challenges order dated 13th January 2020, whereby \nApplication No. 3018041, submitted by the appellant for registration of \nthe mark “Indirapuram Public School” in Class 41 has been rejected by \nthe learned Senior Examiner in the office of the Trade Marks Registry. \nThe reasoning in the impugned order of the learned Senior Examiner \nreads as under: \n \n“In the examination report, mark was clearly lacks distinctiveness and \nfalls within the purview of Absolute ground of refusal so envisaged \nunder Section 9(1)(a) of the Trade Mars Act, 1999 which is \nreproduced as under :- \n \n9(1)(a) of the Trade Marks Act 19999 as the mark is a common \nsurname/personal name/geographical name/ornamental or a non-\ndistinctive geometrical figure and as such it is not capable of \ndistinguishing the goods or services of one person from those of \nothers. \nSubsequently, a hearing was fixed in the matter on 19th March, 2019, \neventually the Counsel for the applicant appeared on the said date for \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:07.02.2023\n15:20:02\nSignature Not Verified",
          "pdf_source": "37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "According to page 2 of the PDF \"37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf\", the court heard the application and considered the reply to the examination report, as well as electronic records. The trademark \"INDIRAPURAM PUBLIC SCHOOL\" was deemed lacking distinctiveness and descriptive of the services. The applicant failed to comply with Rule 25 of the Trade Marks Rules 2017, which requires a statement of use and supporting documents. The court cited judgments Vivek Kochher & Anr v M/s Kyk Corporation Ltd & Anr and Suresh Kumar Jain Vs. Union of India in its decision. The application was filed on April 15, 2013, but the applicant failed to provide sufficient evidence of use. The case number is C.A.(COMM.IPD-TM) 148/2022, and the judgment was signed on February 7, 2023. (Source: PDF \"37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf\")",
          "content": "Neutral Citation Number : 2023/DHC/000853 \nC.A.(COMM.IPD-TM) 148/2022                                              Page 2 of 8 \n \nhearing and made his oral submissions in support the application. I \nhave carefully perused the reply to examination report filed in the \nmatter as well as electronically filed records and material available on \nthe portal. I have also considered the oral submissions made at the \ntime of hearing by the Ld. Counsel for the applicant in support of the \nregistrability of the impugned mark. \n \nSince the trade mark applied for registration is clearly lacks \ndistinctiveness and descriptive to the nature and description of \nservices, as applied for registration and the reply and documents \nplaced on record are not sufficient to proceed the application further, \nhence, the mark cannot be allowed to proceed for registration, while \nconsidering the following. \n \nIncapable of distinguishing the services of one person from the other; \nThe trademark “INDIRAPURAM PUBLIC SCHOOL” is a common \nand generic combination of two English words “INDIRAPURAM and \nPUBLIC SCHOOL”. The word INIDRAPURAM is indicated \ngeographical place and PUBLIC SCHOOL is indicated of intended \npurpose of services and it does not carry any distinctive character; \nNo one can acquire a monopoly or exclusive right; \n \nIt is pertinent and thus noteworthy that the impugned application has \nbeen filed claiming user of the mark since 15/04/2013, thus it was \nincumbent upon the applicant to prove said user through affidavit and \ndocumentary evidence, otherwise the application would be deemed to \nhave been filed on the basis of wrong statement of use. Perusal of \nExamination report reply as well as documents filed on record, I have \nno hesitation to state that affidavit has been filed by the applicant \nwhich prove the user of the impugned mark since 15/04/2013, \ntherefore Applicant has failed to comply with provision of Rule 25 of \nthe Trade Marks Rules 2017 which reads as follows: \n \nRule 25 of Trade Marks Rules, 2017- \n \nStatement of user in applications – (1) An application to register a \ntrademark shall, unless the trademark is proposed to be used, contain a \nstatement of the period during which , and the person by whom it has \nbeen used in respect of all the goods or services mentioned in the \napplication. \n(2) In case, the use of the trademark is claimed prior to the date of \napplication, the applicant shall file an affidavit testifying to such use \nalong with supporting documents. \n \nIn the light of the above said provision and the observations made by \nthe Hon’ble Delhi High Court in the judgments namely Vivek \nKochher & Anr v M/s Kyk Corporation Ltd & Anr. Reported as PTC \n2017 (72) page 556 and Suresh Kumar Jain Vs. Union of India \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:07.02.2023\n15:20:02\nSignature Not Verified",
          "pdf_source": "37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0006",
      "start_index": 3,
      "end_index": 4,
      "summary": "According to the PDF document \"MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks\" (Neutral Citation Number: 2023/DHC/000853, C.A.(COMM.IPD-TM) 148/2022), the High Court of Delhi considered an appeal by MVS Eduexcellence Pvt Ltd. against the Registrar of Trade Marks' decision to refuse registration of the trademark \"Indirapuram Public School\". \n\nThe Registrar's office issued a First Examination Report (FER) on May 12, 2016, objecting to the registration under Section 9(1)(a) of the Trade Marks Act, 1999, citing that the mark was not capable of distinguishing the goods or services of one person from those of others. The appellant replied on December 13, 2016, arguing that the mark had gained distinctiveness through extensive use and was a source indicator for residents in the area.\n\nThe Court considered the appellant's arguments and the respondent's objections, citing previous judgments, including Hardie Trading Ltd. and another v. Addisons paint & Chemicals Ltd. (2003) and Inter ikea Systems BV & Anr versus Sham Murari & ors (PTC 2018). The Court ultimately held that the objections raised in the Examination reports could not be waived, and the appellant's reply and oral submissions were insufficient to grant registration.\n\nThe Court's decision was based on the need to maintain the purity of the register, as the Registrar of Trade Marks is the custodian of the Register of Trade Marks. The PDF document provides further details on the legal proceedings, facts, and arguments presented in the case.",
      "pdf_source": "37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "According to page 3 of the PDF \"37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf\", the Hon'ble High Court of Delhi at New Delhi heard the case C.A.(COMM.IPD-TM) 148/2022. The court cited previous cases, including Hardie Trading Ltd. and Inter lkea Systems BV, to emphasize the importance of maintaining the purity of the Register. The Registrar of Trade Marks raised an objection under Section 9(1)(a) of the Trade Marks Act, 1999, stating that the mark \"Indirapuram Public School\" is devoid of distinctive character. The court held that the objections raised in the Examination reports cannot be waived, and the Reply to the Examination report and documents filed are insufficient to grant registration. The court decided that the mark cannot be allowed to proceed further while maintaining the purity of the register. (Source: 37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf)",
          "content": "Neutral Citation Number : 2023/DHC/000853 \nC.A.(COMM.IPD-TM) 148/2022                                              Page 3 of 8 \n \nreported as PTC 2012(49) page 287, whereby it was held by the \nHon’ble High Court that if the a mark is filed/registered on the basis of \nwrong statement of use, then the same cannot be registered or remain \non the Register. Such mark therefore ought not to be put on the \nRegister which is essential for a Hearing Officer for the purposes of \nmaintaining the purity of Register being acting on behalf of Registrar \nof Trade Marks who is custodian of Register of Trade Marks, as has \nbeen held by Hon’ble Supreme Court in Hardie Trading Ltd. and \nanother v. Addisons paint & Chemicals Ltd., (2003) 11 SCC 92. And \nfurther in the matter of Inter lkea Systems BV & Anr versus Sham \nMurari &ors, reported as PTC 2018, the Hon’ble Delhi High Court \nobserved that “While this Court does not wish to encourage any party, \nwhich misleads the trademark authorities”. \n \nIn view of above, I am of the considered view that objections raised in \nthe Examination reports cannot be waived and the Reply to the \nExamination report and documents filed as well as oral submission \nmade are insufficient to grant registration of trade mark applied for \nregistration, therefore not entitled for any benefit under Section 9(1) \nproviso of the Act. Hence objection under Section 9(1)(a) of the Act \ncannot be waived off. Also the mark cannot be allowed to be \nproceeded further while maintaining the purity of the register.” \n \n2. \nConsequent to submission of its application No. 3018041, seeking \nregistration of the “Indirapuram Public School” mark, First Examination \nReport (FER) dated  12th May 2016 was issued from the office of the \nlearned Registrar, raising, as the sole objection under Section 9(1)(a)1 of \nthe Trade Marks Act, 1999, the contention that the mark, of which \nregistration had been sought, was “a common surname/personal \nname/geographical name/ornamental or a non-distinctive geometrical \n                                          \n1 9.  \nAbsolute grounds for refusal of registration. –  \n(1)  \nThe trade marks –  \n(a)  \nwhich are devoid of any distinctive character, that is to say, not capable of \ndistinguishing the goods or services of one person from those of another person; \n(b)  \nwhich consist exclusively of marks or indications which may serve in trade to \ndesignate the kind, quality, quantity, intended purpose, values, geographical origin or the time \nof production of the goods or rendering of the service or other characteristics of the goods or \nservice; \n(c)  \nwhich consist exclusively of marks or indications which have become customary in \nthe current language or in the bona fide and established practices of the trade, \nshall not be registered: \nProvided that a trade mark shall not be refused registration if before the date of application for \nregistration it has acquired a distinctive character as a result of the use made of it or is a well-known \ntrade mark. \n \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:07.02.2023\n15:20:02\nSignature Not Verified",
          "pdf_source": "37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "According to page 4 of the PDF \"37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf\", the Registrar of Trade Marks objected to the registration of the mark \"Indirapuram Public School\" as it was \"not capable of distinguishing the goods or services of one person from those of others\". The appellant replied on December 13, 2016, stating that the mark had gained distinctiveness over time and had become a source indicator for residents. The appellant also submitted that the school had over 2,600 students, earned substantial income, and had opened additional branches. The reply was accompanied by an affidavit and several documents. The appellant's counsel, Mr. Anuj Kumar, argued that the impugned order was erroneous. The case is C.A.(COMM.IPD-TM) 148/2022, with Neutral Citation Number: 2023/DHC/000853, in the High Court of Delhi.",
          "content": "Neutral Citation Number : 2023/DHC/000853 \nC.A.(COMM.IPD-TM) 148/2022                                              Page 4 of 8 \n \nfigure” which was “not capable of distinguishing the goods or services of \none person from those of others”. \n \n3. \nThe appellant replied to the aforesaid objections on 13th December \n2016. It was asserted, in the reply, that the mark “Indirapuram Public \nSchool” had gained distinctiveness over a period of time by extensive use \nand was a source indicator for residents residing in the area. Following \non the reputation gained by it, the reply asserted that further branches of \nthe school had been opened at Crossing Republic and at Pratap Vihar, \nGhaziabad. It was further asserted that over 2,600 students were enrolled \nin the school, which earned substantial income from the educational \nservices rendered by it. \n \n4. \nIn these circumstances, it was asserted that the objection regarding \nnon-distinctiveness, under Section 9(1)(a) of the Trade Marks Act was \nwithout substance and that, therefore, the mark was entitled to registered. \n \n5. \nThe aforesaid reply was accompanied by an affidavit dated 15th \nDecember 2016. A separate affidavit, by way of evidence, was also filed \nby the appellant, basically reiterating the contents of the aforesaid reply \ndated 13th December 2016. \n \n6. \nSeveral documents were also filed by the appellant along with the \naforesaid affidavit. \n \n7. \nMr. Anuj Kumar, learned Counsel for the appellant submits that \nthe impugned order is patently erroneous, as it proceeds by bifurcating \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:07.02.2023\n15:20:02\nSignature Not Verified",
          "pdf_source": "37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0009",
      "start_index": 5,
      "end_index": 6,
      "summary": "According to the PDF document \"MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf\", the High Court of Delhi at New Delhi heard the case C.A.(COMM.IPD-TM) 148/2022. The appellant, MVS Eduexcellence Pvt Ltd, was represented by Mr. Anuj Kumar and Mr. Abhijeet Kumar Pandey, while the respondent, The Registrar of Trade Marks, Delhi, was represented by Mr. Harish Vaidyanathan Shankar.\n\nThe case revolves around the registration of the trademark \"Indirapuram Public School\". The respondent had rejected the application, citing that the mark lacked distinctiveness as \"Indirapuram\" is a geographical area and \"Public School\" merely indicates the nature of services. The appellant argued that the mark is distinctive when seen as a whole and pointed out that similar marks, such as \"Delhi Public School\" and \"Ghaziabad Public School\", are already registered.\n\nThe respondent also noted that the appellant had not provided evidence of user as required by Rule 272 of the Trade Marks Rules, 2017. However, the appellant argued that the application was filed on July 28, 2015, before the 2017 rules came into force, and that the then-applicable Rule 273 of the Trade Marks Rules, 2002, did not mandatorily require filing an affidavit of user.\n\nThe court agreed with the appellant, stating that the application would be governed by the procedure applicable at the time of filing, and that subsequent changes in procedure would not affect it. The court also noted that Rule 1584 of the 2017 TM Rules saves acts done under the 2002 TM Rules before the 2017 TM Rules came into force. (Source: MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf)",
      "pdf_source": "37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 5",
          "node_id": "0007",
          "start_index": 5,
          "end_index": 5,
          "summary": "According to page 5 of the PDF \"37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf\", the appellant, MVS Eduexcellence Pvt Ltd, is seeking registration of the mark \"Indirapuram Public School\". The Registrar of Trade Marks denied the registration, citing lack of distinctiveness as \"Indirapuram\" is a geographical area and \"Public School\" indicates the nature of services. The appellant's counsel, Mr. Anuj Kumar, argues that the mark is distinctive and points out similar registered marks such as Delhi Public School and Mumbai Public School. The respondent's counsel, Mr. Harish Vaidyanathan Shankar, notes that the appellant failed to provide evidence of user as required by Rule 272 of the Trade Marks Rules, 2017. The court considers Rule 25(2) of the 2017 TM Rules, which requires an affidavit testifying to prior user of the mark. (Source: 2023/DHC/000853, C.A.(COMM.IPD-TM) 148/2022)",
          "content": "Neutral Citation Number : 2023/DHC/000853 \nC.A.(COMM.IPD-TM) 148/2022                                              Page 5 of 8 \n \nthe mark of which registration was sought, into “Indirapuram” and \n“Public School” separately, and holds the mark to be lacking in \ndistinctiveness on the ground that Indirapuram was the name of a \ngeographical area and “Public School” merely indicated the nature of \nservices rendered by the institution for which the application for \nregistration had been submitted. \n \n8. \nThe mark “Indirapuram Public School” seen as a whole, submits \nMr. Kumar, is clearly distinctive. He points out that there was no \nobjection on the ground that any other institution had a deceptively \nsimilar name. He also points out that there are several similar marks \nwhich already stand registered such as Delhi Public School, Ghaziabad \nPublic School Senior Secondary School, Mumbai Public School, Indore \nPublic School and Chennai Public School. \n \n9. \nMr. Harish Vaidyanathan Shankar, learned Counsel for the \nrespondent, fairly leaves this aspect to the Court. However, he points out \nthat the impugned order also notes that the appellant had not provided \nevidence of user as required by  Rule 272 of the Trade Marks Rules, 2017 \n(“the 2017 TM Rules”), though there appears to be a typographical error \nin the impugned order in that regard. \n \n10. \nRule 25(2) of the 2017 TM Rules, as it stands now, specifically \nrequires the appellant to file an affidavit testifying to prior user of the \nmark of which registration was sought along with supporting documents. \n                                          \n2 27. Statement of user in applications.- \nAn application to register a trade mark shall, unless the trade \nmark is proposed to be used, contain a statement of the period during which, and the person by whom it has been \nused in respect of the goods or services mentioned in the application. The Registrar may require the applicant to \nfile an affidavit testifying to such user with exhibits showing the mark as used. \" \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:07.02.2023\n15:20:02\nSignature Not Verified",
          "pdf_source": "37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "According to page 6 of the PDF \"37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf\", the appellant's counsel, Mr. Anuj Kumar, argued that the application for registration was filed on July 28, 2015, before the Trade Marks Rules, 2017 came into force. At that time, Rule 273 of the Trade Marks Rules, 2002 did not mandatorily require filing an affidavit of user. The respondent's counsel, Mr. Vaidyanathan, countered that the appellant should have provided evidence of prior user as it was filed after 2017. However, the court agreed with Mr. Anuj Kumar, citing that the application would be governed by the procedure applicable at the time of filing, and subsequent changes would not affect it. The court also referenced Rule 158 of the 2017 TM Rules, which saves acts done under the 2002 TM Rules before the 2017 TM Rules came into force.",
          "content": "Neutral Citation Number : 2023/DHC/000853 \nC.A.(COMM.IPD-TM) 148/2022                                              Page 6 of 8 \n \nMr. Anuj Kumar submits that, at the time when the application for \nregistration had been filed by his client, on 28th July 2015, the Rule 25(2) \nof the Trade Marks Rules, 2017 had yet to come into force and that Rule \n273 of the then existing Trade Marks Rules, 2002 (“the 2002 TM Rules”) \nthen in force, did not require, mandatorily, filing of an affidavit of user, \nbut clothed the Registrar with the discretion (as is apparent from the use \nof the word “may”) to require the applicant to file an affidavit of user \nwith supportive exhibits.   \n \n11. \nMr. Vaidyanathan, learned Counsel for the respondent submits \nthat, however, as the evidence in affidavit was filed by the appellant after \n2017, the appellant ought to have placed evidence of prior user on record. \n \n12. \nGiven the fact that the application was filed prior to the \nrequirement of affidavit of user along with supportive evidence being \nplaced on record, where prior user was claimed, I am inclined to agree \nwith Mr. Anuj Kumar that the appellant cannot be faulted for not having \nfiled such an affidavit with evidence of user. It is trite that an application \nor petition would be governed by the procedure, or format, applicable at \nthe time when it is filed, and that subsequent changes in procedure or \nformat introducing during the pendency of the application would not \naffect it. Besides, Rule 1584 of the 2017 TM Rules saves acts done under \nthe 2002 TM Rules before the 2017 TM Rules came into force. This \nitself is a complete answer to Mr. Vaidyanathan’s submission. \n                                          \n3 27.  \nStatement of user in applications. – An application to register a trade mark shall, unless the trade mark \nis proposed to be used, contain a statement of the period during which, and the person by whom it has been used \nin respect of the goods or services mentioned in the application. The Registrar may require the applicant to file an \naffidavit testifying to such user with exhibits showing the mark as used. \n4 158. \nThe Trade Marks Rules, 2002, are hereby repealed without prejudice to anything done under such rules \nbefore the coming into force of these rules. \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:07.02.2023\n15:20:02\nSignature Not Verified",
          "pdf_source": "37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0012",
      "start_index": 7,
      "end_index": 8,
      "summary": "According to the PDF document \"MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks\" (Neutral Citation Number: 2023/DHC/000853), the High Court of Delhi at New Delhi made a decision on the appeal filed by MVS Eduexcellence Pvt Ltd. (Appellant) against the Registrar of Trade Marks, Delhi (Respondent). The appeal, C.A.(COMM.IPD-TM) 148/2022, was heard by Hon'ble Mr. Justice C. Hari Shankar.\n\nThe Appellant had filed an application under Section 9(1)(a) of the Trade Marks Act, which was rejected by the Registrar on the ground that the \"Indirapuram Public School\" mark lacked distinctiveness. The Appellant claimed prior user of the mark since 2014 and submitted documents to support this claim.\n\nThe Court quashed and set aside the impugned order dated January 13, 2020, and remanded the application for reconsideration by the Registrar. The Appellant was directed to file a fresh affidavit of user, and the Registrar was instructed to examine the claim of user based on the affidavit and supporting documents. The Appellant was granted an opportunity for hearing, and the Registrar was directed to decide the application within four weeks.\n\nThe appeal was allowed, with no order as to costs. The judgment was uploaded on the Court's website on February 7, 2023. The key dates in the case include September 9, 2022, when the Court permitted the Appellant to place user documents on record, and February 21, 2023, when the Appellant was to present itself before the Registrar. (Source: MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf)",
      "pdf_source": "37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 7",
          "node_id": "0010",
          "start_index": 7,
          "end_index": 7,
          "summary": "According to page 7 of the PDF \"37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf\", the High Court of Delhi allowed the appellant, MVS Eduexcellence Pvt Ltd, to provide user documents as evidence of prior use of the \"Indirapuram Public School\" word mark since 2014. The court quashed and set aside the impugned order dated January 13, 2020, which rejected the appellant's application under Section 9(1)(a) of the Trade Marks Act. The application was remanded for reconsideration by the Registrar, who will examine the claim of user based on a fresh affidavit and documents filed by the appellant. The case, C.A.(COMM.IPD-TM) 148/2022, was heard by Hon'ble Mr. Justice C. Hari Shankar. The decision was made on September 9, 2022, and the order was digitally signed on February 7, 2023. (Source: PDF page 7)",
          "content": "Neutral Citation Number : 2023/DHC/000853 \nC.A.(COMM.IPD-TM) 148/2022                                              Page 7 of 8 \n \n13. \nBe that as it may, this Court, vide its order dated 9th September \n2022, permitted the appellant to place user documents on record. The \nappellant has thereafter, filed, under index dated 29th October 2022, a list \nof the documents which, according to the appellant, evidence prior user, \nby the appellant, of the “Indirapuram Public School” word mark since \n2014, being the claim of user submitted before the learned Registrar. \n \n14. \nIt would be appropriate that the claim of prior user by the \nappellant, predicated on the aforesaid documents, be considered in the \nfirst instance by the learned Registrar, as it primarily involves \nexamination into facts. \n \n15. \nThe impugned order, insofar as it rejects the appellant’s \napplication under Section 9(1)(a) of the Trade Marks Act, on the ground \nthat the “Indirapuram Public School” mark is lacking indistinctiveness is, \nhowever, not sustainable on facts or in law. \n \n16. \nAs such, the impugned order dated 13th January 2020 is quashed \nand set aside. Application No. 3018041 filed by the appellant shall stand \nremanded for reconsideration by the learned Registrar or by any officer \ndeputed by the learned Registrar for the said purpose, solely on the aspect \nof user as claimed by the appellant since 2014. The appellant would file a \nfresh affidavit of user before the learned Registrar. The learned Registrar \nwould examine the claim of user of the appellant on the basis of the said \naffidavit along with the documents already filed before the learned \nRegistrar as well as the documents filed before this Court under cover of \nindex dated 29th October 2022, which the appellant is permitted to \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:07.02.2023\n15:20:02\nSignature Not Verified",
          "pdf_source": "37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 8",
          "node_id": "0011",
          "start_index": 8,
          "end_index": 8,
          "summary": "According to page 8 of the PDF \"37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf\", the High Court of Delhi at New Delhi ruled on the appeal C.A.(COMM.IPD-TM) 148/2022. The appellant, MVS Eduexcellence Pvt Ltd, was granted an opportunity of hearing before the Registrar of Trade Marks. The Registrar was directed to decide the appellant's application within four weeks, preferably by February 21, 2023. The appeal was allowed to this extent, with no order as to costs. The judgment was to be uploaded on the court's website within 24 hours. The decision was made by Hon'ble Mr. Justice C. Hari Shankar on February 6, 2023. (Source: 37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf)",
          "content": "Neutral Citation Number : 2023/DHC/000853 \nC.A.(COMM.IPD-TM) 148/2022                                              Page 8 of 8 \n \npresent before the learned Registrar for the said purpose. \n \n17. \nThe appellant would also be granted an opportunity of hearing \nbefore any decision is taken. For the said purpose, let the appellant \npresent itself before the learned Registrar on 21st February 2023. \n \n18. \nThe learned Registrar (or other officer deputed by him) is directed \nto decide the appellant’s application as expeditiously as possible, \npreferably within a period of four weeks therefrom. \n \n19. \nThe appeal stands allowed to the aforesaid extent with no order as \nto costs. \n \n20. \nJudgment to be uploaded on the website of this Court within 24 \nhours. \n \n \nC. HARI SHANKAR, J \n \nFEBRUARY 6, 2023 \n \nAR \n \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:07.02.2023\n15:20:02\nSignature Not Verified",
          "pdf_source": "37. MVS Eduexcellence Pvt Ltd. v. The Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-15T18:40:53.233413",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}