{
  "doc_name": "38. News Nation Networks Pvt Ltd. v. The Registrar of Trade Marks",
  "pdf_source": "38. News Nation Networks Pvt Ltd. v. The Registrar of Trade Marks.pdf",
  "metadata": {
    "document_name": "38. News Nation Networks Pvt Ltd. v. The Registrar of Trade Marks",
    "source_pdf": "38. News Nation Networks Pvt Ltd. v. The Registrar of Trade Marks.pdf",
    "judges": [
      "C. HARI SHANKAR O R D E R (ORAL) % 17.01.2023 1."
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "8/2021",
      "8/2021",
      "8/2021",
      "8/2021"
    ],
    "dhc_numbers": [
      "2023/DHC/000362",
      "2023/DHC/000362",
      "2023/DHC/000362"
    ],
    "ia_numbers": [],
    "decision_date": "22 June, 2020",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [],
    "defendants": [],
    "appellants": [
      "News Nation Networks Private Limited"
    ],
    "respondents": [
      "The Registrar of Trade Marks"
    ],
    "plaintiff_advocates": [],
    "defendant_advocates": [],
    "appellant_advocates": [
      "Mr. Manish Dhir"
    ],
    "respondent_advocates": [
      "Mr. Harish Vaidyanathan Shankar",
      "Mr. Srish Kumar Mishra",
      "Mr. Sagar Mehlawat",
      "Mr. Alexander Mathai Paikaday"
    ],
    "damages_claimed": null,
    "damages_awarded": null,
    "key_issues": [
      "Consistency in judicial decisions is essential to maintain the integrity of the legal system and prevent discriminatory treatment of litigants.",
      "The principle of consistency in judicial decisions demands that identical cases be treated similarly, and contrary views should not be taken in identical cases.",
      "The rejection of a trademark application on the ground of lack of distinctive character must be consistent with previous decisions on similar marks and services.",
      "Registration of identical marks for similar services in other states can be a relevant factor in determining the registrability of a mark.",
      "The court's decision to set aside the impugned order was based on the principle of consistency and the fact that identical marks were registered for similar services in other states.",
      "The Registrar of Trademarks has a duty to ensure consistency in the registration of trademarks and to avoid passing contradictory orders.",
      "The lack of distinctive character of a mark is a valid ground for rejection of a trademark application, but it must be applied consistently.",
      "Judicial discipline requires that judges keep track of consistency in their decisions and avoid passing inconsistent orders, even if it means correcting previous errors.",
      "The registration of a trademark is a matter of public interest, and consistency in decision-making is essential to maintain public faith in the judicial system.",
      "The court's decision highlights the importance of considering previous decisions on similar marks and services when determining the registrability of a trademark."
    ],
    "decision_summary": "**Background:**\n\nThe case, News Nation Networks Private Limited vs. The Registrar of Trademarks (C.A.(COMM.IPD-TM) 8/2021), involves an appeal against the decision of the Senior Examiner of Trade Marks, which rejected the application (No. 2833066) for registration of the trademark \"\" (News Nation) for broadcasting services, including radio, television, wireless, and telecommunication. The reason for rejection was that the mark lacked distinctive character, being a combination of common dictionary words and descriptive of the services provided under the mark.\n\n**Legal Issues:**\n\nThe primary issue in this case was whether the trademark \"\" (News Nation) could be registered for broadcasting services, given its alleged lack of distinctive character. The appellant (News Nation Networks Private Limited) argued that the mark should be registered, while the respondent (The Registrar of Trademarks) opposed the registration, citing the mark's descriptive nature.\n\n**Arguments:**\n\nThe appellant's counsel, Mr. Manish Dhir, pointed out that identical marks had been registered for similar services in other states, which suggested that the Registrar of Trade Marks had taken inconsistent views in similar cases. The respondent's counsel, Mr. Harish Vaidyanathan Shankar, left the matter to the court, implying that the decision should be based on the merits of the case.\n\n**Court Findings:**\n\nThe High Court of Delhi, presided over by Hon'ble Mr. Justice C. Hari Shankar, considered the appellant's argument and observed that the Registrar of Trade Marks had indeed taken inconsistent views in similar cases. The court relied on the principle of judicial discipline, which demands consistency in rendering judgments. The court cited a judgment by Justice K.S. Radhakrishnan, which emphasized the importance of consistency in judicial decisions to maintain the people's faith in the judicial system.\n\n**Decision:**\n\nBased on the findings, the court set aside the impugned order (dated June 22, 2020) and allowed the application (No. 2833066) for registration of the trademark \"\" (News Nation) for broadcasting services. The court held that the Registrar of Trade Marks could not take contrary views in identical cases and that the registration of identical marks for similar services in other states was sufficient to demonstrate that the mark \"\" (News Nation) should also be registered.\n\nIn summary, the High Court of Delhi allowed the appeal, setting aside the decision of the Senior Examiner of Trade Marks, and directed the registration of the trademark \"\" (News Nation) for broadcasting services, citing the principle of consistency in judicial decisions and the registration of identical marks for similar services in other states.",
    "legal_precedents": [
      "Joy Regional \nTransport Authority"
    ],
    "full_text": "\n--- PAGE 1 ---\nNeutral Citation Number : 2023/DHC/000362 \nC.A.(COMM.IPD-TM) 8/2021 \n \nPage 1 of 3 \n \n \n$~3 (Original) \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.A.(COMM.IPD-TM) 8/2021 \n \nNEWS NATION NETWORKS PRIVATE LIMITED \n.. Appellant \n \n \n \n \nThrough: \nMr. Manish Dhir, Adv.  \n \n \n \n \n \nversus \n \n \n \nTHE REGISTRAR OF TRADEMARKS \n      ..... Respondent \nThrough: \nMr. \nHarish \nVaidyanathan \nShankar, CGSC with Mr. Srish Kumar \nMishra, Mr. Sagar Mehlawat and Mr \nAlexander Mathai Paikaday, Advs.  \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C. HARI SHANKAR \n \n \n \n \n      O R D E R (ORAL) \n% \n \n \n \n17.01.2023 \n \n \n1. \nThis appeal assails order dated 22nd June 2020, whereby the \nlearned Senior Examiner of Trade Marks has rejected the Application \nNo. 2833066, of the appellant, seeking registration of the trade mark \n“\n” for “broadcasting services through various modes and \nmeans including and not limited to radio, television, wireless and \ntelecommunication”, on the ground that it lacked distinctive character \nas it was a combination of common dictionary words and was \ndescriptive of the nature of the services being provided under the \nmark.  \n \n2. \nMr. Manish Dhir, learned Counsel for the appellant, has drawn \nmy attention to the fact that identical marks, for similar services \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:19.01.2023\n10:59:55\nSignature Not Verified\n\n--- PAGE 2 ---\nNeutral Citation Number : 2023/DHC/000362 \nC.A.(COMM.IPD-TM) 8/2021 \n \nPage 2 of 3 \n \n \nprovided for other States such as, \n \n and \n stand registered by the same Registrar of Trade Marks.   \n \n3. \nIn the circumstances, Mr. Harish Vaidyanathan Shankar, \nlearned Counsel for the respondent, fairly leaves the matter to the \ncourt. \n \n4. \nIt is trite that no judicial authority can take contrary views in \nidentical cases.  One may refer, in this context, to the following \npassage of the judgment of Justice K.S. Radhakrishan, as he then was, \nsitting singly as a Judge of High Court of Kerala in Joy v. Regional \nTransport Authority1: \n“3.  \nJudicial discipline demands consistency in rendering \njudgments. A Judicial Officer may hold different views on various \naspects. A Judicial Officer may err and pass contradictory orders \ninadvertently. But once it is brought to the knowledge of the \nJudicial Officer, he is duty bound to keep track of consistency. \nInconsistent orders passed by a judicial officer almost in the same \nfact situation, and that too on the same day, would give rise to \ncomplaint of discriminatory treatment, which will undermine the \npeople's faith in judicial system and the rule of law. It will cause \nresentment and anguish and make an imprint in the mind of the \nlitigant that he has been discriminated. A Judicial Officer may err \nand pass illegal orders, but he shall not err in consistency. He \nshould be consistent even in illegality.” \n \n5. \nIn view of the aforesaid, as identical marks, with respect to \nsimilar services being provided in other States, stand registered by the \nlearned Registrar, the impugned order cannot sustain.  It is, \naccordingly, set aside.  \n \n6. \nApplication No. 2833066 filed by the appellant for registration \n                                          \n1 1998 SCC OnLine Ker 344 \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:19.01.2023\n10:59:55\nSignature Not Verified\n\n--- PAGE 3 ---\nNeutral Citation Number : 2023/DHC/000362 \nC.A.(COMM.IPD-TM) 8/2021 \n \nPage 3 of 3 \n \n \nof the mark \n stands allowed. \n \n7. \nThe appeal stands allowed accordingly.  \n \n \n \nC. HARI SHANKAR, J. \n \nJANUARY 17, 2023 \ndsn \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:19.01.2023\n10:59:55\nSignature Not Verified\n"
  },
  "total_pages": 3,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0002",
      "start_index": 1,
      "end_index": 1,
      "summary": "According to the PDF document \"News Nation Networks Pvt Ltd. v. The Registrar of Trade Marks.pdf\", a legal proceeding took place in the High Court of Delhi at New Delhi. The case, C.A.(COMM.IPD-TM) 8/2021, involves News Nation Networks Private Limited (Appellant) and The Registrar of Trade Marks (Respondent). \n\nThe Appellant, represented by Mr. Manish Dhir, appealed against the order dated 22nd June 2020, which rejected their Application No. 2833066 for registration of the trade mark for broadcasting services. The rejection was based on the mark lacking distinctive character, being a combination of common dictionary words, and being descriptive of the services provided.\n\nThe appeal was heard by Hon'ble Mr. Justice C. Hari Shankar on 17th January 2023. The Appellant's counsel argued that identical marks were registered for similar services. The Respondent was represented by Mr. Harish Vaidyanathan Shankar, CGSC, along with other advocates.\n\nThe key facts of the case are:\n- Case Number: C.A.(COMM.IPD-TM) 8/2021\n- Neutral Citation Number: 2023/DHC/000362\n- Date of Order: 22nd June 2020\n- Date of Appeal Hearing: 17th January 2023\n- Appellant: News Nation Networks Private Limited\n- Respondent: The Registrar of Trade Marks\n\nThe PDF document provides details of the legal proceedings, including the parties involved, their representatives, and the dates of the orders and hearings. (Source: News Nation Networks Pvt Ltd. v. The Registrar of Trade Marks.pdf)",
      "pdf_source": "38. News Nation Networks Pvt Ltd. v. The Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "According to page 1 of the PDF \"38. News Nation Networks Pvt Ltd. v. The Registrar of Trade Marks.pdf\", the High Court of Delhi at New Delhi heard an appeal (C.A.(COMM.IPD-TM) 8/2021) filed by News Nation Networks Private Limited against the Registrar of Trade Marks. The appeal challenges an order dated June 22, 2020, rejecting the appellant's application (No. 2833066) to register the trade mark for broadcasting services. The rejection was based on the mark's lack of distinctive character, being a combination of common dictionary words descriptive of the services. The appellant's counsel, Mr. Manish Dhir, argued that identical marks were registered for similar services. The case was heard by Hon'ble Mr. Justice C. Hari Shankar on January 17, 2023.",
          "content": "Neutral Citation Number : 2023/DHC/000362 \nC.A.(COMM.IPD-TM) 8/2021 \n \nPage 1 of 3 \n \n \n$~3 (Original) \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.A.(COMM.IPD-TM) 8/2021 \n \nNEWS NATION NETWORKS PRIVATE LIMITED \n.. Appellant \n \n \n \n \nThrough: \nMr. Manish Dhir, Adv.  \n \n \n \n \n \nversus \n \n \n \nTHE REGISTRAR OF TRADEMARKS \n      ..... Respondent \nThrough: \nMr. \nHarish \nVaidyanathan \nShankar, CGSC with Mr. Srish Kumar \nMishra, Mr. Sagar Mehlawat and Mr \nAlexander Mathai Paikaday, Advs.  \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C. HARI SHANKAR \n \n \n \n \n      O R D E R (ORAL) \n% \n \n \n \n17.01.2023 \n \n \n1. \nThis appeal assails order dated 22nd June 2020, whereby the \nlearned Senior Examiner of Trade Marks has rejected the Application \nNo. 2833066, of the appellant, seeking registration of the trade mark \n“\n” for “broadcasting services through various modes and \nmeans including and not limited to radio, television, wireless and \ntelecommunication”, on the ground that it lacked distinctive character \nas it was a combination of common dictionary words and was \ndescriptive of the nature of the services being provided under the \nmark.  \n \n2. \nMr. Manish Dhir, learned Counsel for the appellant, has drawn \nmy attention to the fact that identical marks, for similar services \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:19.01.2023\n10:59:55\nSignature Not Verified",
          "pdf_source": "38. News Nation Networks Pvt Ltd. v. The Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Facts and Arguments",
      "node_id": "0004",
      "start_index": 2,
      "end_index": 2,
      "summary": "According to the PDF document \"News Nation Networks Pvt Ltd. v. The Registrar of Trade Marks.pdf\", a legal proceeding took place in the High Court of Delhi at New Delhi, with the case number C.A.(COMM.IPD-TM) 8/2021. The Neutral Citation Number is 2023/DHC/000362. \n\nThe appellant, News Nation Networks Private Limited, was represented by Mr. Manish Dhir, Adv., while the respondent, The Registrar of Trade Marks, was represented by Mr. Harish Vaidyanathan Shankar, CGSC, along with other advocates. The respondent's counsel left the matter to the court's discretion.\n\nThe court noted that identical marks for similar services were registered by the same Registrar of Trade Marks in other states. The court cited a judgment by Justice K.S. Radhakrishnan, emphasizing the importance of judicial discipline and consistency in rendering judgments. \n\nThe court ultimately set aside the impugned order, as it was inconsistent with the registrations of identical marks in other states. The application No. 2833066 filed by the appellant for registration was considered in this context. The decision was made on January 19, 2023, and was digitally signed by Kamla Rawat.\n\nSource: News Nation Networks Pvt Ltd. v. The Registrar of Trade Marks.pdf, Page 1-2 of 3.",
      "pdf_source": "38. News Nation Networks Pvt Ltd. v. The Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 2",
          "node_id": "0003",
          "start_index": 2,
          "end_index": 2,
          "summary": "According to page 2 of the PDF \"38. News Nation Networks Pvt Ltd. v. The Registrar of Trade Marks.pdf\", the respondent's counsel, Mr. Harish Vaidyanathan Shankar, leaves the matter to the court. The court cites a judgment by Justice K.S. Radhakrishnan, emphasizing the importance of consistency in judicial decisions. Since identical marks are registered for similar services in other states, the court sets aside the impugned order. The application No. 2833066 filed by the appellant for registration is considered. The case is C.A.(COMM.IPD-TM) 8/2021, with Neutral Citation Number : 2023/DHC/000362, and the decision was signed on January 19, 2023. (Source: PDF \"38. News Nation Networks Pvt Ltd. v. The Registrar of Trade Marks.pdf\", page 2)",
          "content": "Neutral Citation Number : 2023/DHC/000362 \nC.A.(COMM.IPD-TM) 8/2021 \n \nPage 2 of 3 \n \n \nprovided for other States such as, \n \n and \n stand registered by the same Registrar of Trade Marks.   \n \n3. \nIn the circumstances, Mr. Harish Vaidyanathan Shankar, \nlearned Counsel for the respondent, fairly leaves the matter to the \ncourt. \n \n4. \nIt is trite that no judicial authority can take contrary views in \nidentical cases.  One may refer, in this context, to the following \npassage of the judgment of Justice K.S. Radhakrishan, as he then was, \nsitting singly as a Judge of High Court of Kerala in Joy v. Regional \nTransport Authority1: \n“3.  \nJudicial discipline demands consistency in rendering \njudgments. A Judicial Officer may hold different views on various \naspects. A Judicial Officer may err and pass contradictory orders \ninadvertently. But once it is brought to the knowledge of the \nJudicial Officer, he is duty bound to keep track of consistency. \nInconsistent orders passed by a judicial officer almost in the same \nfact situation, and that too on the same day, would give rise to \ncomplaint of discriminatory treatment, which will undermine the \npeople's faith in judicial system and the rule of law. It will cause \nresentment and anguish and make an imprint in the mind of the \nlitigant that he has been discriminated. A Judicial Officer may err \nand pass illegal orders, but he shall not err in consistency. He \nshould be consistent even in illegality.” \n \n5. \nIn view of the aforesaid, as identical marks, with respect to \nsimilar services being provided in other States, stand registered by the \nlearned Registrar, the impugned order cannot sustain.  It is, \naccordingly, set aside.  \n \n6. \nApplication No. 2833066 filed by the appellant for registration \n                                          \n1 1998 SCC OnLine Ker 344 \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:19.01.2023\n10:59:55\nSignature Not Verified",
          "pdf_source": "38. News Nation Networks Pvt Ltd. v. The Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Decision and Orders",
      "node_id": "0006",
      "start_index": 3,
      "end_index": 3,
      "summary": "According to the PDF document \"News Nation Networks Pvt Ltd. v. The Registrar of Trade Marks.pdf\", a legal proceeding took place in the High Court of Delhi at New Delhi. The case, C.A.(COMM.IPD-TM) 8/2021, involved News Nation Networks Private Limited as the appellant and The Registrar of Trade Marks as the respondent. The appellant was represented by Mr. Manish Dhir, while the respondent was represented by Mr. Harish Vaidyanathan Shankar and other advocates.\n\nThe court's decision, dated January 17, 2023, allowed the appeal, as stated by Justice C. Hari Shankar. The order was digitally signed by Kamla Rawat on January 19, 2023. The document bears a Neutral Citation Number: 2023/DHC/000362.\n\nThe appeal pertained to a trademark registration, and the court's ruling favored the appellant. Although the specific details of the case, including the arguments and facts presented, are not mentioned in the provided section, the outcome is clear: the appeal was allowed, and the registration of the mark was permitted.\n\nAs per the PDF document, the key details of the case are:\n- Case number: C.A.(COMM.IPD-TM) 8/2021\n- Date of decision: January 17, 2023\n- Parties involved: News Nation Networks Private Limited (appellant) and The Registrar of Trade Marks (respondent)\n- Outcome: The appeal was allowed, and the registration of the mark was permitted.",
      "pdf_source": "38. News Nation Networks Pvt Ltd. v. The Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0005",
          "start_index": 3,
          "end_index": 3,
          "summary": "According to page 3 of the PDF \"38. News Nation Networks Pvt Ltd. v. The Registrar of Trade Marks.pdf\", the appeal (C.A.(COMM.IPD-TM) 8/2021) filed by News Nation Networks Private Limited against the Registrar of Trade Marks has been allowed by the High Court of Delhi. The decision was made by Justice C. Hari Shankar on January 17, 2023. The court order states that \"The appeal stands allowed accordingly.\" The PDF does not provide further details on the proceedings or arguments. The case has a Neutral Citation Number of 2023/DHC/000362. The decision was digitally signed by Kamla Rawat on January 19, 2023. (Source: PDF \"38. News Nation Networks Pvt Ltd. v. The Registrar of Trade Marks.pdf\", page 3)",
          "content": "Neutral Citation Number : 2023/DHC/000362 \nC.A.(COMM.IPD-TM) 8/2021 \n \nPage 3 of 3 \n \n \nof the mark \n stands allowed. \n \n7. \nThe appeal stands allowed accordingly.  \n \n \n \nC. HARI SHANKAR, J. \n \nJANUARY 17, 2023 \ndsn \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:19.01.2023\n10:59:55\nSignature Not Verified",
          "pdf_source": "38. News Nation Networks Pvt Ltd. v. The Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-15T18:37:16.432743",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}