{
  "doc_name": "4. Alpha vs Alpha",
  "pdf_source": "4. Alpha vs Alpha.pdf",
  "metadata": {
    "document_name": "4. Alpha vs Alpha",
    "source_pdf": "4. Alpha vs Alpha.pdf",
    "judges": [
      "AMIT BANSAL"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "C.O. (COMM.IPD-TM) 393/2022",
      "2023:DHC:1982"
    ],
    "dhc_numbers": [
      "2023:DHC:1982"
    ],
    "ia_numbers": [],
    "decision_date": "17 March, 2023",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      "Alpha Corp Development Private Limited"
    ],
    "defendants": [
      "Alpha Integrated Management Services Pvt. Ltd.",
      "ANR"
    ],
    "appellants": [],
    "respondents": [
      "Alpha Integrated Management Services Pvt. Ltd.",
      "ANR"
    ],
    "plaintiff_advocates": [
      "Mr. Sagar Chandra",
      "Ms.Srijan Uppal",
      "Mr. Abhishek Bhati",
      "Ms.Anisha Roy"
    ],
    "defendant_advocates": [
      "None"
    ],
    "appellant_advocates": [],
    "respondent_advocates": [
      "None"
    ],
    "damages_claimed": "988,145,000",
    "damages_awarded": null,
    "key_issues": [
      "Trademark infringement under the Trademarks Act, 1999, as the respondent's mark is alleged to be similar to the petitioner's registered mark ALPHA.",
      "Validity of the respondent's trademark registration, which the petitioner seeks to cancel under Sections 57 and 125 of the Trademarks Act, 1999.",
      "Prior user and prior registration of the mark ALPHA by the petitioner, which may establish its rights and priority over the respondent's mark.",
      "Passing off and unfair competition, as the respondent's use of a similar mark may confuse consumers and dilute the petitioner's goodwill and reputation.",
      "Malafides and bad faith on the part of the respondent, as evidenced by the incorporation of the respondent company by ex-employees of the petitioner with access to its records and data.",
      "Similarity in services and classes, as both the petitioner and respondent are engaged in real estate services in Class 36, increasing the likelihood of consumer confusion.",
      "Colour scheme and visual similarity, as the respondent's mark features the word ALPHA in a similar colour scheme to the petitioner's mark, potentially strengthening the claim of infringement.",
      "Acquired distinctiveness and goodwill, as the petitioner has used the mark ALPHA extensively and acquired significant goodwill and reputation, which may be protected under the Act.",
      "Ex-employees' access to confidential information and potential misuse, highlighting the issue of misappropriation of trade secrets and intellectual property.",
      "Cancellation of the respondent's trademark registration under Section 57 of the Trademarks Act, 1999, due to alleged non-compliance with the provisions of the Act."
    ],
    "decision_summary": "**Background**\n\nThe case involves a trademark dispute between Alpha Corp Development Private Limited (the petitioner) and Alpha Integrated Management Services Pvt. Ltd. (the respondent). The petitioner is engaged in real estate development and facility management services, while the respondent provides similar services. The petitioner has been using the mark \"ALPHA\" since 2003 and has obtained several trademark registrations for the mark in Classes 36 and 37 of the Trademarks Act, 1999. The respondent has also obtained a trademark registration for a mark that includes the word \"ALPHA\" in its name.\n\n**Legal Issues**\n\nThe petitioner filed a rectification petition under Sections 57 and 125 of the Trademarks Act, 1999, seeking cancellation of the respondent's trademark registration. The petitioner alleged that the respondent's mark is deceptively similar to its own mark \"ALPHA\" and that the respondent had acted with malafides in obtaining the registration. The petitioner also claimed that it had acquired vast goodwill and reputation in the mark \"ALPHA\" due to its long and extensive use.\n\n**Arguments**\n\nThe petitioner argued that:\n\n1. The respondent's mark is deceptively similar to its own mark \"ALPHA\", which could cause confusion among consumers.\n2. The respondent had acted with malafides in obtaining the registration, as its company was incorporated by ex-employees of the petitioner who had access to the petitioner's records and data.\n3. The respondent's use of a similar color scheme and font style for its mark was intended to give prominence to the word \"ALPHA\" and to deceive consumers.\n\nThe respondent did not appear in court to contest the petition.\n\n**Court Findings**\n\nThe court found that:\n\n1. The petitioner had established its goodwill and reputation in the mark \"ALPHA\" through its long and extensive use.\n2. The respondent's mark was deceptively similar to the petitioner's mark \"ALPHA\", which could cause confusion among consumers.\n3. The respondent had acted with malafides in obtaining the registration, as evidenced by the fact that its company was incorporated by ex-employees of the petitioner who had access to the petitioner's records and data.\n\n**Decision**\n\nThe court allowed the petitioner's rectification petition and ordered the cancellation of the respondent's trademark registration. The court held that the respondent's mark was deceptively similar to the petitioner's mark \"ALPHA\" and that the respondent had acted with malafides in obtaining the registration. The court also noted that the petitioner had established its goodwill and reputation in the mark \"ALPHA\" and that the respondent's use of a similar mark could cause confusion among consumers.\n\n**Conclusion**\n\nIn conclusion, the court's decision in this case highlights the importance of protecting trademark rights and preventing unauthorized use of similar marks that could cause confusion among consumers. The case also demonstrates the court's willingness to cancel trademark registrations that are obtained with malafides or that are deceptively similar to existing marks.",
    "legal_precedents": [],
    "full_text": "\n--- PAGE 1 ---\n2023:DHC:1982 \n \nC.O. (COMM.IPD-TM) 393/2022                                              Page 1 of 7 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n% \n \n \n \n \n \nDate of Decision : 17th March, 2023 \n \n+  \n \n \n \nC.O. (COMM.IPD-TM) 393/2022 \n \n \nALPHA CORP DEVELOPMENT PRIVATE  \nLIMITED  \n \n \n \n \n \n..... Petitioner \nThrough: \nMr. Sagar Chandra, Ms.Srijan Uppal, \nMr. Abhishek Bhati and Ms.Anisha \nRoy, Advocates. \n \n \n \n \nversus \n \n \nALPHA INTEGRATED MANAGEMENT  \nSERVICES PVT. LTD. AND ANR.  \n \n..... Respondents \n \n \n \n \nThrough: \nNone. \n \nCORAM: \n \nHON'BLE MR. JUSTICE AMIT BANSAL \nAMIT BANSAL, J. (Oral) \n1. \nThe present rectification petition has been filed on behalf of the \npetitioner seeking cancellation/removal of the trademark bearing registration \nnumber 3187803 and registered in the name of respondent no.1 in respect of \nreal estate services in Class 36 under Sections 57 and 125 of the Trademarks \nAct, 1999 (hereinafter ‘Act’).  \nCase set up by the petitioner \n2. \nThe case set up by the petitioner in the petition is as follows:  \n2.1 \nThe petitioner, Alpha Corp Development Private Limited, is engaged \nin the business of real estate development including development of \nmalls, hotels, townships, multiplexes and complexes and provides \nfacility management services such as maintenance, building \nautomation, security services among others, since 2003. \n2.2 \nThe petitioner is the registered proprietor of the mark ALPHA \nthrough its predecessor-in-interest, M/s Grandeur Estates Private \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.03.2023 18:55:18\nSignature Not Verified\n\n--- PAGE 2 ---\n2023:DHC:1982 \n \nC.O. (COMM.IPD-TM) 393/2022                                              Page 2 of 7 \n \nLimited, bearing registration no. 1483826 and 1483827 in Classes 36 \nand 37 of the Act. Several other registrations have also been obtained \nby the petitioner in respect of the mark ALPHA and its formative \nmarks. The earliest registration was granted on 1st September, 2006.  \n2.3 \nThe petitioner has successfully delivered several real estate projects \nunder the mark ALPHA, such as Alpha International City, Karnal \n(Haryana), \nAlpha \nInternational \nCity, \nFatehabad \n(Haryana), \nGurgaonOne-84 among others.  \n2.4 \nThe petitioner has also won several real estate awards and accolades \nover the years. Due to long and extensive use of the mark ALPHA, \nthe petitioner has acquired vast goodwill and reputation. The annual \nsales of the petitioner in the year 2018 amounted to Rs. 988,145,000/- \nand the petitioner has also incurred expenditure of Rs.6,241,000/- \ntowards advertisement and promotions in the said year.  \n2.5 \nThe respondent no.1 has obtained registration of the mark \n \n(hereinafter ‘impugned mark’ ) in respect of similar services as that of \nthe petitioner, in the name of the respondent no.1 under application \nno. 3187803 in Class 36 of the Act. The letter 'A' and the word \nALPHA in the impugned mark are written in black colour, which \nshows the intention of the respondent no. 1 to give prominence to the \nmark ALPHA in the impugned mark. The colour scheme adopted by \nthe respondent no.1 for the impugned mark is also similar to that of \nthe petitioner’s ALPHA marks.  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.03.2023 18:55:18\nSignature Not Verified\n\n--- PAGE 3 ---\n2023:DHC:1982 \n \nC.O. (COMM.IPD-TM) 393/2022                                              Page 3 of 7 \n \n2.6 \nThe malafides of the respondent no.l is evident from the fact that the \nrespondent no.l company was incorporated by the ex-employees of \nthe petitioner and its subsidiary company, Alpha G: Corp \nManagement Services Pvt. Ltd., on 23rd July, 2015, which is prior to \nthe date of resignation of the said employees. The said employees had \ncomplete access to the records and data of the petitioner and its \nsubsidiary company. \n2.7 \nPublic caution notices were published by the petitioner's subsidiary \ncompany in various newspapers when it came to know that its ex-\nemployees had incorporated a new company with confusingly similar \nname for providing identical services of facility management. \nThereafter, the respondent no.1 filed a defamation complaint before \nTis Hazari Courts, New Delhi. Against the summoning order dated \n14th May, 2016 passed in the aforementioned defamation complaint, \nthe petitioner filed a CRL.M.C. No.297/2017 before this Court, which \nis pending adjudication.  \n2.8 \nThe petitioner filed an application being SRN G43969063 dated 6th \nFebruary, 2017 before Ministry of Corporate Affairs (MCA) under \nSection 16 of the Companies Act, 2013 seeking a direction to the \nrespondent no. 1 to rectify its deceptively similar/identical trade \nname. The Regional Director, MCA held that the trade name of the \nrespondent no.1 closely resembles the name of the subsidiary \ncompany of the petitioner and directed them to change the name of \ntheir company vide order dated 1st August, 2017.  \n2.9 \nThe impugned mark was published in the Trade Mark Journal on 18th \nSeptember, 2017. However, the respondent no. 1 concealed the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.03.2023 18:55:18\nSignature Not Verified\n\n--- PAGE 4 ---\n2023:DHC:1982 \n \nC.O. (COMM.IPD-TM) 393/2022                                              Page 4 of 7 \n \nfactum of passing of the aforementioned order by the Regional \nDirector regarding change of name of the respondent no.1 company. \n2.10 The respondent no.l has challenged the aforesaid order of the \nRegional Director by filing a Writ Petition Civil No. 24380/2017 \nbefore High Court of Punjab and Haryana, which is presently pending \nadjudication. However, the High Court of Punjab and Haryana vide \norder dated 30th October, 2017 has stayed the operation of the order \ndated 1st August, 2017 passed by the Regional Director. \n2.11 The impugned mark has been adopted by the respondent no. 1 with \nthe sole intention of riding on the goodwill of the petitioner and to \ncreate confusion in the minds of the public and trade channel. \n2.12 Accordingly, the present rectification has been filed by the petitioner.  \nProceedings in the petition \n3. \n Notice in the present petition was issued by the Intellectual Property \nAppellate Board (IPAB) on 1st November, 2018. However, the respondent \nno.1 failed to appear before IPAB despite service. The respondent no.1 was \nproceeded against ex parte on 21st January, 2020. Thereafter, the present \nrectification got transferred to this Court after coming into effect of \nTribunals Reforms Act, 2022 and the Court notice was issued to the \nrespondent no.1 by this Court on 28th March, 2022. However, none appeared \non behalf of the respondent no.1 despite service. \n4. \nIt was noted in the order dated 23rd January, 2023 that the respondent \nno.1 has changed its corporate name from ‘Alpha Integrated Management \nService Private Limited to ‘Abante Integrated Management Services Private \nLimited’. Further, on 15th February, 2023, the counsel for the petitioner \nhanded over fresh trademark registrations granted in favour of the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.03.2023 18:55:18\nSignature Not Verified\n\n--- PAGE 5 ---\n2023:DHC:1982 \n \nC.O. (COMM.IPD-TM) 393/2022                                              Page 5 of 7 \n \nrespondent no.1 in respect of the marks \n(logo)  , \n(device) \nand ‘ABANTE’ (word). The court notice was also issued to the respondent \nno.1 including through attorney, who applied for the aforesaid registrations \non his behalf on the said date. Court notice was duly served on the \nrespondent no.1’s attorney. Despite service, none has appeared on behalf of \nthe respondent no.1. Nor any reply/counter-statement has been filed on \nbehalf of the respondent no.1. It is indicative of the fact that the respondent \nno.1 is not interested in pursuing the present petition, as it has already \nchanged its trademark and its corporate name.  \nAnalysis and Findings \n5. \n I have heard the counsels for the parties and perused the record of the \ncase.  \n6. \n In order to determine whether the trademark of the respondent no.1 is \nidentical to the trademark of the petitioner, it would be apposite to refer to \nthe two competing trademarks, as set out below:  \nRespondent no.1’s Trademark \nPetitioner’s Trademarks \n \n  ALPHA \n  \n \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.03.2023 18:55:18\nSignature Not Verified\n\n--- PAGE 6 ---\n2023:DHC:1982 \n \nC.O. (COMM.IPD-TM) 393/2022                                              Page 6 of 7 \n \n7. \nIt is pertinent to note that the prominent and essential feature of the \nimpugned mark is ‘ALPHA’, which is identical and deceptively similar to \nthe petitioner's mark ‘ALPHA’ and its other formative marks in respect of \nsimilar services. Therefore, the registration of the impugned mark is in \ncontravention of Section 11(1) of the Act.  \n8. \nThe respondent no. 1 was well aware of the petitioner's mark ALPHA \nsince respondent no. 1 was incorporated by ex-employees of the petitioner. \nThere can be no plausible reason for the respondent no. 1 to have chosen an \nidentical and a deceptively similar mark as that of the petitioner's mark for \nidentical goods. Clearly, the adoption of the mark by the respondent no.1 is \ndishonest and therefore, the respondent no.1 is not entitled to the benefit of \nSection 12 of the Act.  \n9. \nFrom the facts detailed above, it is clear that the petitioner is the \nproprietor of the impugned mark. The respondent no.1 cannot claim to be \nthe proprietor of the impugned trademark as there is nothing to show as to \nhow the impugned trademark has been adopted by the respondent no.1. \nTherefore, the application for registration of the impugned trademark is in \ncontravention of Section 18(1) of the Act. Further, the respondent no.1 is \nalso not entitled to the benefit of Section 11(4) of the Act as the petitioner \nhas not consented to the use of the impugned mark by the respondent no.1. \n10. \nThe grant of registration of the impugned trademark by the respondent \nno.2 is against the principles of Section 11(3)(a) of the Act, as there is no \ndispute that the petitioner is the prior user of the impugned trademark since \n2003 in India. Due to such a long, continuous and extensive use, the \nimpugned mark is solely associated with the petitioner. Therefore, the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.03.2023 18:55:18\nSignature Not Verified\n\n--- PAGE 7 ---\n2023:DHC:1982 \n \nC.O. (COMM.IPD-TM) 393/2022                                              Page 7 of 7 \n \nregistration of the impugned trademark should have been refused by the \nrespondent no.2. \n11. \nIn view of the discussion above, it is clear that the impugned \ntrademark has been adopted by the respondent no.1 dishonestly to trade \nupon the established goodwill and reputation of the petitioner and to project \nitself to be associated with the petitioner. The nature of the impugned \ntrademark is such that it will deceive the public and create confusion as \nregards the source of the goods manufactured and sold under the impugned \ntrademark.  \n12. \nAccordingly, the present petition is allowed and the impugned \ntrademark registered under trademark application no. 3187803 in the name \nof the respondent no.1 in Class 36 is removed from the Register of Trade \nMarks.  \n13. \n A copy of the order be sent to the respondents through e-mail. The \nRegistry is directed to supply a copy of the present order to the Trademark \nRegistry, at e-mail - llc-ipo@gov.in for compliance.  \n \n \n \nAMIT BANSAL, J \nMARCH 17, 2023 \nsr \n \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.03.2023 18:55:18\nSignature Not Verified\n"
  },
  "total_pages": 7,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "According to the PDF document \"Alpha vs Alpha.pdf\", the legal proceedings (Case No. C.O. (COMM.IPD-TM) 393/2022) are taking place in the High Court of Delhi at New Delhi. The petitioner, Alpha Corp Development Private Limited, is seeking cancellation/removal of the trademark (registration number 3187803) registered in the name of respondent no.1, Alpha Integrated Management Services Pvt. Ltd., for real estate services in Class 36.\n\nThe petitioner claims to have been using the mark \"ALPHA\" since 2003 and has acquired vast goodwill and reputation. They have also obtained several registrations for the mark \"ALPHA\" and its formative marks, with the earliest registration granted on September 1, 2006. The petitioner's annual sales in 2018 were Rs. 988,145,000/-, with an expenditure of Rs.6,241,000/- towards advertisement and promotions.\n\nThe respondent no.1 has registered a mark similar to the petitioner's, with the intention of giving prominence to the mark \"ALPHA\". The petitioner argues that this is a violation of their trademark rights. The case was decided on March 17, 2023, by Hon'ble Mr. Justice Amit Bansal. The document provides details of the case, including the parties, dates, and amounts involved. (Source: Alpha vs Alpha.pdf, pages 1-2)",
      "pdf_source": "4. Alpha vs Alpha.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "According to page 1 of the PDF \"4. Alpha vs Alpha.pdf\", a court case (C.O. (COMM.IPD-TM) 393/2022) was heard in the High Court of Delhi at New Delhi. The petitioner, Alpha Corp Development Private Limited, sought cancellation of a trademark (registration number 3187803) registered by respondent Alpha Integrated Management Services Pvt. Ltd. for real estate services in Class 36. The petition was filed under Sections 57 and 125 of the Trademarks Act, 1999. The petitioner, engaged in real estate development since 2003, claimed to be the registered proprietor of the mark \"ALPHA\". The case was decided on March 17, 2023, by Hon'ble Mr. Justice Amit Bansal. (Source: 2023:DHC:1982, Page 1 of 7)",
          "content": "2023:DHC:1982 \n \nC.O. (COMM.IPD-TM) 393/2022                                              Page 1 of 7 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n% \n \n \n \n \n \nDate of Decision : 17th March, 2023 \n \n+  \n \n \n \nC.O. (COMM.IPD-TM) 393/2022 \n \n \nALPHA CORP DEVELOPMENT PRIVATE  \nLIMITED  \n \n \n \n \n \n..... Petitioner \nThrough: \nMr. Sagar Chandra, Ms.Srijan Uppal, \nMr. Abhishek Bhati and Ms.Anisha \nRoy, Advocates. \n \n \n \n \nversus \n \n \nALPHA INTEGRATED MANAGEMENT  \nSERVICES PVT. LTD. AND ANR.  \n \n..... Respondents \n \n \n \n \nThrough: \nNone. \n \nCORAM: \n \nHON'BLE MR. JUSTICE AMIT BANSAL \nAMIT BANSAL, J. (Oral) \n1. \nThe present rectification petition has been filed on behalf of the \npetitioner seeking cancellation/removal of the trademark bearing registration \nnumber 3187803 and registered in the name of respondent no.1 in respect of \nreal estate services in Class 36 under Sections 57 and 125 of the Trademarks \nAct, 1999 (hereinafter ‘Act’).  \nCase set up by the petitioner \n2. \nThe case set up by the petitioner in the petition is as follows:  \n2.1 \nThe petitioner, Alpha Corp Development Private Limited, is engaged \nin the business of real estate development including development of \nmalls, hotels, townships, multiplexes and complexes and provides \nfacility management services such as maintenance, building \nautomation, security services among others, since 2003. \n2.2 \nThe petitioner is the registered proprietor of the mark ALPHA \nthrough its predecessor-in-interest, M/s Grandeur Estates Private \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.03.2023 18:55:18\nSignature Not Verified",
          "pdf_source": "4. Alpha vs Alpha.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "According to page 2 of the PDF \"4. Alpha vs Alpha.pdf\", the petitioner, Alpha Corp Development Private Limited, has obtained registrations for the mark \"ALPHA\" in Classes 36 and 37, with the earliest registration granted on September 1, 2006. The petitioner has developed several real estate projects under the \"ALPHA\" mark and has acquired vast goodwill and reputation through long and extensive use. In 2018, the petitioner's annual sales were Rs. 988,145,000, with Rs. 6,241,000 spent on advertisement and promotions. The respondent, Alpha Integrated Management Services Pvt. Ltd., has obtained registration for a similar mark, with the intention of giving prominence to the \"ALPHA\" mark. The case, C.O. (COMM.IPD-TM) 393/2022, is being heard in the High Court of Delhi, with the decision date being March 17, 2023. (Source: 4. Alpha vs Alpha.pdf, 2023:DHC:1982)",
          "content": "2023:DHC:1982 \n \nC.O. (COMM.IPD-TM) 393/2022                                              Page 2 of 7 \n \nLimited, bearing registration no. 1483826 and 1483827 in Classes 36 \nand 37 of the Act. Several other registrations have also been obtained \nby the petitioner in respect of the mark ALPHA and its formative \nmarks. The earliest registration was granted on 1st September, 2006.  \n2.3 \nThe petitioner has successfully delivered several real estate projects \nunder the mark ALPHA, such as Alpha International City, Karnal \n(Haryana), \nAlpha \nInternational \nCity, \nFatehabad \n(Haryana), \nGurgaonOne-84 among others.  \n2.4 \nThe petitioner has also won several real estate awards and accolades \nover the years. Due to long and extensive use of the mark ALPHA, \nthe petitioner has acquired vast goodwill and reputation. The annual \nsales of the petitioner in the year 2018 amounted to Rs. 988,145,000/- \nand the petitioner has also incurred expenditure of Rs.6,241,000/- \ntowards advertisement and promotions in the said year.  \n2.5 \nThe respondent no.1 has obtained registration of the mark \n \n(hereinafter ‘impugned mark’ ) in respect of similar services as that of \nthe petitioner, in the name of the respondent no.1 under application \nno. 3187803 in Class 36 of the Act. The letter 'A' and the word \nALPHA in the impugned mark are written in black colour, which \nshows the intention of the respondent no. 1 to give prominence to the \nmark ALPHA in the impugned mark. The colour scheme adopted by \nthe respondent no.1 for the impugned mark is also similar to that of \nthe petitioner’s ALPHA marks.  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.03.2023 18:55:18\nSignature Not Verified",
          "pdf_source": "4. Alpha vs Alpha.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0005",
      "start_index": 3,
      "end_index": 3,
      "summary": "According to the PDF document \"Alpha vs Alpha.pdf\", Section \"Background and Facts\" (2023:DHC:1982), the High Court of Delhi at New Delhi heard a case between Alpha Corp Development Private Limited (Petitioner) and Alpha Integrated Management Services Pvt. Ltd. and Anr. (Respondent). \n\nThe case involved a dispute over a deceptively similar trade name. The Petitioner alleged that the Respondent's company was incorporated by ex-employees who had access to the Petitioner's records and data. The Respondent's company was incorporated on July 23, 2015, prior to the ex-employees' resignation. \n\nKey legal proceedings include:\n- Publication of public caution notices by the Petitioner's subsidiary company\n- Filing of a defamation complaint by the Respondent before the Tis Hazari Courts, New Delhi\n- Petitioner's filing of a CRL.M.C. No.297/2017 before the High Court, which is pending adjudication\n- Application filed by the Petitioner before the Ministry of Corporate Affairs under Section 16 of the Companies Act, 2013, resulting in an order directing the Respondent to change its company name due to similarity with the Petitioner's subsidiary company\n\nImportant dates mentioned in the document include:\n- July 23, 2015: Incorporation of the Respondent's company\n- May 14, 2016: Summoning order passed in the defamation complaint\n- February 6, 2017: Petitioner's application before the Ministry of Corporate Affairs\n- August 1, 2017: Order directing the Respondent to change its company name\n- September 18, 2017: Publication of the impugned mark in the Trade Mark Journal\n\nThe information is based on the provided PDF document \"Alpha vs Alpha.pdf\" (Source: 2023:DHC:1982, C.O. (COMM.IPD-TM) 393/202",
      "pdf_source": "4. Alpha vs Alpha.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "According to page 3 of the PDF \"4. Alpha vs Alpha.pdf\", the respondent company, Alpha Integrated Management Services Pvt. Ltd., was incorporated by ex-employees of the petitioner, Alpha Corp Development Private Limited, on July 23, 2015. The petitioner's subsidiary company published public caution notices in newspapers due to the similar name and services offered by the respondent. The respondent filed a defamation complaint, and the petitioner filed a CRL.M.C. No.297/2017, which is pending. The petitioner also filed an application with the Ministry of Corporate Affairs, seeking a direction to change the respondent's trade name, which was found to be deceptively similar. The Regional Director ordered the respondent to change its name on August 1, 2017. The impugned mark was published in the Trade Mark Journal on September 18, 2017. (Source: 4. Alpha vs Alpha.pdf, 2023:DHC:1982)",
          "content": "2023:DHC:1982 \n \nC.O. (COMM.IPD-TM) 393/2022                                              Page 3 of 7 \n \n2.6 \nThe malafides of the respondent no.l is evident from the fact that the \nrespondent no.l company was incorporated by the ex-employees of \nthe petitioner and its subsidiary company, Alpha G: Corp \nManagement Services Pvt. Ltd., on 23rd July, 2015, which is prior to \nthe date of resignation of the said employees. The said employees had \ncomplete access to the records and data of the petitioner and its \nsubsidiary company. \n2.7 \nPublic caution notices were published by the petitioner's subsidiary \ncompany in various newspapers when it came to know that its ex-\nemployees had incorporated a new company with confusingly similar \nname for providing identical services of facility management. \nThereafter, the respondent no.1 filed a defamation complaint before \nTis Hazari Courts, New Delhi. Against the summoning order dated \n14th May, 2016 passed in the aforementioned defamation complaint, \nthe petitioner filed a CRL.M.C. No.297/2017 before this Court, which \nis pending adjudication.  \n2.8 \nThe petitioner filed an application being SRN G43969063 dated 6th \nFebruary, 2017 before Ministry of Corporate Affairs (MCA) under \nSection 16 of the Companies Act, 2013 seeking a direction to the \nrespondent no. 1 to rectify its deceptively similar/identical trade \nname. The Regional Director, MCA held that the trade name of the \nrespondent no.1 closely resembles the name of the subsidiary \ncompany of the petitioner and directed them to change the name of \ntheir company vide order dated 1st August, 2017.  \n2.9 \nThe impugned mark was published in the Trade Mark Journal on 18th \nSeptember, 2017. However, the respondent no. 1 concealed the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.03.2023 18:55:18\nSignature Not Verified",
          "pdf_source": "4. Alpha vs Alpha.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0009",
      "start_index": 4,
      "end_index": 6,
      "summary": "According to the PDF document \"Alpha vs Alpha.pdf,\" a legal case was heard in the High Court of Delhi (2023:DHC:1982). The petitioner, Alpha Corp Development Private Limited, filed a petition against Alpha Integrated Management Services Pvt. Ltd. and another respondent. The case involves a trademark dispute, with the petitioner alleging that the respondent's mark is identical and deceptively similar to its own mark \"ALPHA.\"\n\nThe respondent had challenged an order by the Regional Director regarding a change of name, which is pending in the High Court of Punjab and Haryana. However, the High Court stayed the operation of the order in 2017. The petitioner argued that the respondent adopted the mark to ride on its goodwill and create confusion.\n\nThe Intellectual Property Appellate Board (IPAB) issued a notice in 2018, but the respondent failed to appear. The case was later transferred to the High Court of Delhi, which issued a notice in 2022. Despite service, the respondent did not appear or file a reply. The court noted that the respondent had changed its corporate name to Abante Integrated Management Services Private Limited and registered new trademarks.\n\nThe court found that the respondent's mark is identical and deceptively similar to the petitioner's mark, contravening Section 11(1) of the Act. The respondent's awareness of the petitioner's mark, combined with its incorporation by ex-employees of the petitioner, suggests that the adoption of the mark was intentional. The decision was made on March 17, 2023, as stated in the PDF document.",
      "pdf_source": "4. Alpha vs Alpha.pdf",
      "nodes": [
        {
          "title": "Page 4",
          "node_id": "0006",
          "start_index": 4,
          "end_index": 4,
          "summary": "According to page 4 of the PDF \"Alpha vs Alpha.pdf\", the respondent (Alpha Integrated Management Services Pvt. Ltd.) challenged an order by the Regional Director regarding a name change by filing a Writ Petition (No. 24380/2017) with the High Court of Punjab and Haryana, which is still pending. The court stayed the Regional Director's order on October 30, 2017. The petitioner (Alpha Corp Development Private Limited) claims the respondent adopted a similar mark to ride on their goodwill and create confusion. \n\nThe Intellectual Property Appellate Board (IPAB) issued a notice on November 1, 2018, but the respondent failed to appear, leading to ex parte proceedings on January 21, 2020. The case was transferred to the High Court of Delhi after the Tribunals Reforms Act, 2022, came into effect. The respondent was served notice on March 28, 2022, but did not appear. The respondent has since changed its corporate name to 'Abante Integrated Management Services Private Limited'. (Source: Alpha vs Alpha.pdf, page 4)",
          "content": "2023:DHC:1982 \n \nC.O. (COMM.IPD-TM) 393/2022                                              Page 4 of 7 \n \nfactum of passing of the aforementioned order by the Regional \nDirector regarding change of name of the respondent no.1 company. \n2.10 The respondent no.l has challenged the aforesaid order of the \nRegional Director by filing a Writ Petition Civil No. 24380/2017 \nbefore High Court of Punjab and Haryana, which is presently pending \nadjudication. However, the High Court of Punjab and Haryana vide \norder dated 30th October, 2017 has stayed the operation of the order \ndated 1st August, 2017 passed by the Regional Director. \n2.11 The impugned mark has been adopted by the respondent no. 1 with \nthe sole intention of riding on the goodwill of the petitioner and to \ncreate confusion in the minds of the public and trade channel. \n2.12 Accordingly, the present rectification has been filed by the petitioner.  \nProceedings in the petition \n3. \n Notice in the present petition was issued by the Intellectual Property \nAppellate Board (IPAB) on 1st November, 2018. However, the respondent \nno.1 failed to appear before IPAB despite service. The respondent no.1 was \nproceeded against ex parte on 21st January, 2020. Thereafter, the present \nrectification got transferred to this Court after coming into effect of \nTribunals Reforms Act, 2022 and the Court notice was issued to the \nrespondent no.1 by this Court on 28th March, 2022. However, none appeared \non behalf of the respondent no.1 despite service. \n4. \nIt was noted in the order dated 23rd January, 2023 that the respondent \nno.1 has changed its corporate name from ‘Alpha Integrated Management \nService Private Limited to ‘Abante Integrated Management Services Private \nLimited’. Further, on 15th February, 2023, the counsel for the petitioner \nhanded over fresh trademark registrations granted in favour of the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.03.2023 18:55:18\nSignature Not Verified",
          "pdf_source": "4. Alpha vs Alpha.pdf",
          "nodes": []
        },
        {
          "title": "Page 5",
          "node_id": "0007",
          "start_index": 5,
          "end_index": 5,
          "summary": "According to page 5 of the PDF \"4. Alpha vs Alpha.pdf\", the court issued a notice to respondent no.1, Alpha Integrated Management Services Pvt. Ltd., regarding trademark registrations for the marks (logo), (device), and 'ABANTE' (word). Despite being served, respondent no.1 did not appear or file a reply. The court analyzed the competing trademarks, comparing respondent no.1's \"ALPHA\" trademark with the petitioner's, Alpha Corp Development Private Limited's, trademarks. The case, C.O. (COMM.IPD-TM) 393/2022, was heard by the High Court of Delhi at New Delhi, with the decision date being 17th March, 2023. The petitioner was represented by advocates Mr. Sagar Chandra, Ms. Srijan Uppal, Mr. Abhishek Bhati, and Ms. Anisha Roy. (Source: 2023:DHC:1982, PDF \"4. Alpha vs Alpha.pdf\")",
          "content": "2023:DHC:1982 \n \nC.O. (COMM.IPD-TM) 393/2022                                              Page 5 of 7 \n \nrespondent no.1 in respect of the marks \n(logo)  , \n(device) \nand ‘ABANTE’ (word). The court notice was also issued to the respondent \nno.1 including through attorney, who applied for the aforesaid registrations \non his behalf on the said date. Court notice was duly served on the \nrespondent no.1’s attorney. Despite service, none has appeared on behalf of \nthe respondent no.1. Nor any reply/counter-statement has been filed on \nbehalf of the respondent no.1. It is indicative of the fact that the respondent \nno.1 is not interested in pursuing the present petition, as it has already \nchanged its trademark and its corporate name.  \nAnalysis and Findings \n5. \n I have heard the counsels for the parties and perused the record of the \ncase.  \n6. \n In order to determine whether the trademark of the respondent no.1 is \nidentical to the trademark of the petitioner, it would be apposite to refer to \nthe two competing trademarks, as set out below:  \nRespondent no.1’s Trademark \nPetitioner’s Trademarks \n \n  ALPHA \n  \n \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.03.2023 18:55:18\nSignature Not Verified",
          "pdf_source": "4. Alpha vs Alpha.pdf",
          "nodes": []
        },
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "According to page 6 of the PDF \"4. Alpha vs Alpha.pdf\", the High Court of Delhi heard a case between Alpha Corp Development Private Limited (petitioner) and Alpha Integrated Management Services Pvt. Ltd. (respondent). The court noted that the respondent's mark 'ALPHA' is identical and deceptively similar to the petitioner's mark, contravening Section 11(1) of the Act. The respondent, incorporated by ex-employees of the petitioner, was aware of the petitioner's mark and adopted it dishonestly. The court decided that the respondent cannot claim to be the proprietor of the impugned trademark, and the application for registration is in contravention of Section 18(1) of the Act. The grant of registration by the respondent was against the principles of Section 11(3)(a) of the Act, as the petitioner is the prior user of the mark since 2003. (Source: 4. Alpha vs Alpha.pdf, 2023:DHC:1982)",
          "content": "2023:DHC:1982 \n \nC.O. (COMM.IPD-TM) 393/2022                                              Page 6 of 7 \n \n7. \nIt is pertinent to note that the prominent and essential feature of the \nimpugned mark is ‘ALPHA’, which is identical and deceptively similar to \nthe petitioner's mark ‘ALPHA’ and its other formative marks in respect of \nsimilar services. Therefore, the registration of the impugned mark is in \ncontravention of Section 11(1) of the Act.  \n8. \nThe respondent no. 1 was well aware of the petitioner's mark ALPHA \nsince respondent no. 1 was incorporated by ex-employees of the petitioner. \nThere can be no plausible reason for the respondent no. 1 to have chosen an \nidentical and a deceptively similar mark as that of the petitioner's mark for \nidentical goods. Clearly, the adoption of the mark by the respondent no.1 is \ndishonest and therefore, the respondent no.1 is not entitled to the benefit of \nSection 12 of the Act.  \n9. \nFrom the facts detailed above, it is clear that the petitioner is the \nproprietor of the impugned mark. The respondent no.1 cannot claim to be \nthe proprietor of the impugned trademark as there is nothing to show as to \nhow the impugned trademark has been adopted by the respondent no.1. \nTherefore, the application for registration of the impugned trademark is in \ncontravention of Section 18(1) of the Act. Further, the respondent no.1 is \nalso not entitled to the benefit of Section 11(4) of the Act as the petitioner \nhas not consented to the use of the impugned mark by the respondent no.1. \n10. \nThe grant of registration of the impugned trademark by the respondent \nno.2 is against the principles of Section 11(3)(a) of the Act, as there is no \ndispute that the petitioner is the prior user of the impugned trademark since \n2003 in India. Due to such a long, continuous and extensive use, the \nimpugned mark is solely associated with the petitioner. Therefore, the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.03.2023 18:55:18\nSignature Not Verified",
          "pdf_source": "4. Alpha vs Alpha.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0011",
      "start_index": 7,
      "end_index": 7,
      "summary": "According to the PDF document \"Alpha vs Alpha.pdf\", in the High Court of Delhi at New Delhi, a court decision was made on March 17, 2023, in the case of Alpha Corp Development Private Limited (Petitioner) vs. Alpha Integrated Management Services Pvt. Ltd. and Anr. (Respondents). The petition, C.O. (COMM.IPD-TM) 393/2022, was filed to challenge the registration of a trademark by the respondent.\n\nThe court ruled in favor of the petitioner, stating that the impugned trademark was adopted dishonestly by the respondent to trade on the petitioner's established goodwill and reputation, and would likely deceive the public and create confusion. The court ordered the removal of the impugned trademark, registered under trademark application no. 3187803 in Class 36, from the Register of Trade Marks.\n\nThe decision was made by Judge Amit Bansal, who directed the Registry to send a copy of the order to the respondents via email and to supply a copy to the Trademark Registry for compliance. The court's decision is summarized in the PDF document, which is referenced as 2023:DHC:1982. The document is 7 pages long and outlines the legal proceedings, facts, arguments, and decisions made in the case. \n\nSource: Alpha vs Alpha.pdf, Section: Court Decision, 2023:DHC:1982.",
      "pdf_source": "4. Alpha vs Alpha.pdf",
      "nodes": [
        {
          "title": "Page 7",
          "node_id": "0010",
          "start_index": 7,
          "end_index": 7,
          "summary": "According to page 7 of the PDF \"4. Alpha vs Alpha.pdf\", the High Court of Delhi ruled in favor of the petitioner, Alpha Corp Development Private Limited. The court found that the respondent, Alpha Integrated Management Services Pvt. Ltd., had adopted the impugned trademark dishonestly to trade on the petitioner's goodwill and reputation. The court ordered the removal of the impugned trademark (application no. 3187803) from the Register of Trade Marks, citing potential public deception and confusion. The decision was made by Judge Amit Bansal on March 17, 2023. A copy of the order was to be sent to the respondents and the Trademark Registry for compliance. (Source: 2023:DHC:1982, C.O. (COMM.IPD-TM) 393/2022, Page 7 of 7)",
          "content": "2023:DHC:1982 \n \nC.O. (COMM.IPD-TM) 393/2022                                              Page 7 of 7 \n \nregistration of the impugned trademark should have been refused by the \nrespondent no.2. \n11. \nIn view of the discussion above, it is clear that the impugned \ntrademark has been adopted by the respondent no.1 dishonestly to trade \nupon the established goodwill and reputation of the petitioner and to project \nitself to be associated with the petitioner. The nature of the impugned \ntrademark is such that it will deceive the public and create confusion as \nregards the source of the goods manufactured and sold under the impugned \ntrademark.  \n12. \nAccordingly, the present petition is allowed and the impugned \ntrademark registered under trademark application no. 3187803 in the name \nof the respondent no.1 in Class 36 is removed from the Register of Trade \nMarks.  \n13. \n A copy of the order be sent to the respondents through e-mail. The \nRegistry is directed to supply a copy of the present order to the Trademark \nRegistry, at e-mail - llc-ipo@gov.in for compliance.  \n \n \n \nAMIT BANSAL, J \nMARCH 17, 2023 \nsr \n \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:20.03.2023 18:55:18\nSignature Not Verified",
          "pdf_source": "4. Alpha vs Alpha.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-15T18:41:40.692131",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}