{
  "doc_name": "40. Raj Kumar v. Sandeep Kumar & Anr.",
  "pdf_source": "40. Raj Kumar v. Sandeep Kumar & Anr..pdf",
  "metadata": {
    "document_name": "40. Raj Kumar v. Sandeep Kumar & Anr.",
    "source_pdf": "40. Raj Kumar v. Sandeep Kumar & Anr..pdf",
    "judges": [
      "C.HARI SHANKAR J U D G M E N T (O R A L) % 30.01.2023 1."
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "2023/DHC/000647"
    ],
    "dhc_numbers": [
      "2023/DHC/000647",
      "2023/DHC/000647",
      "2023/DHC/000647",
      "2023/DHC/000647",
      "2023/DHC/000647",
      "2023/DHC/000647",
      "2023/DHC/000647",
      "2023/DHC/000647",
      "2023/DHC/000647",
      "2023/DHC/000647",
      "2023/DHC/000647"
    ],
    "ia_numbers": [],
    "decision_date": "5 July, 2021",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      "Raj Kumar Sharma"
    ],
    "defendants": [
      "Sandeep Kumar",
      "Anr"
    ],
    "appellants": [
      "Raj Kumar Sharma"
    ],
    "respondents": [
      "Sandeep Kumar",
      "Anr"
    ],
    "plaintiff_advocates": [
      "Mr. Nikhil Sonker"
    ],
    "defendant_advocates": [
      "Ms. Garima Sachdeva",
      "Mr. Harish Vaidyanathan Shankar",
      "Mr. Srish Kumar Mishra",
      "Mr. Sagar Mehlawat",
      "Mr. Alexander Mathai Paikaday"
    ],
    "appellant_advocates": [
      "Mr. Nikhil Sonker"
    ],
    "respondent_advocates": [
      "Ms. Garima Sachdeva",
      "Mr. Harish Vaidyanathan Shankar",
      "Mr. Srish Kumar Mishra",
      "Mr. Sagar Mehlawat",
      "Mr. Alexander Mathai Paikaday"
    ],
    "damages_claimed": null,
    "damages_awarded": null,
    "key_issues": [
      "The petitioner is seeking rectification of the Register of Trade Marks by removal of Registration No. 4842932 dated 5th July 2021, which registered the word mark “PIZZA GALLERIA” in favor of Respondent 1 under Class 30.",
      "The petitioner is challenging the right of Respondent 1 to use the “PIZZA GALLERIA” mark in the city of Rewari, but not in any other part of the country.",
      "The petitioner and Respondent 1 are both running eating outlets under the name “PIZZA GALLERIA”, with the petitioner's outlets situated in Rewari and Respondent 1's outlets situated outside Rewari.",
      "The case involves an application made under Section 57 of the Trade Marks Act, 1999, for rectification of the Register of Trade Marks.",
      "The classification of goods and services is relevant, as the registration of the “PIZZA GALLERIA” mark is under Class 30, which covers “flour and preparations made from cereals; bread, pizza, pastry and confectionery”.",
      "The Court has the power to cancel or vary the registration of a trade mark under Section 57 of the Trade Marks Act, 1999, on the grounds of contravention or failure to observe a condition entered on the register.",
      "The Respondent 1 is unwilling to surrender the registration of the “PIZZA GALLERIA” mark, despite the petitioner's limited challenge to its use in Rewari.",
      "The petitioner's claim is based on the grounds that the registration of the “PIZZA GALLERIA” mark by Respondent 1 is wrongful and should be removed from the register.",
      "The Court must determine whether the petitioner has a legitimate grievance and whether the registration of the “PIZZA GALLERIA” mark by Respondent 1 should be rectified.",
      "The case highlights the issue of territoriality in trade mark law, where the petitioner is only challenging the use of the mark in a specific geographic area, rather than nationwide."
    ],
    "decision_summary": "**Case Summary: Raj Kumar Sharma vs. Sandeep Kumar & Anr.**\n\n**Background:**\nThe case involves a dispute over the use of the trade mark \"PIZZA GALLERIA\" between two parties, Raj Kumar Sharma (the petitioner) and Sandeep Kumar (Respondent 1). Both parties are running eating outlets under the same name, with the petitioner's outlets located in Rewari and Respondent 1's outlets situated outside Rewari.\n\n**Legal Issues:**\nThe petitioner has filed a petition under Section 57 of the Trade Marks Act, 1999, seeking rectification of the Register of Trade Marks by removing the registration of the word mark \"PIZZA GALLERIA\" (Registration No. 4842932) in favor of Respondent 1 under Class 30 of the Alphabetical Index of classification of goods. The petitioner contests Respondent 1's right to use the mark in Rewari, but not in other parts of the country.\n\n**Arguments:**\n\n* The petitioner's counsel, Mr. Nikhil Sonker, argued that the petitioner does not object to Respondent 1 using the \"PIZZA GALLERIA\" mark outside Rewari, but contests the right to use it in Rewari.\n* Respondent 1's counsel, Ms. Garima Sachdeva, argued that her client is unwilling to surrender the Rewari market and had previously refused to accept a disclaimer restricting the use of the mark in Rewari.\n\n**Court Findings:**\nThe Hon'ble Mr. Justice C. Hari Shankar noted that the petitioner has no objection to Respondent 1 using the \"PIZZA GALLERIA\" mark outside Rewari, which raises questions about the necessity of the court's involvement in the dispute. The judge also observed that the parties are both using the same mark, with the petitioner's outlets located in Rewari and Respondent 1's outlets located outside Rewari.\n\n**Decision:**\nAlthough the judgment does not explicitly state the decision, it can be inferred that the court is likely to exercise its discretion under Section 57 of the Trade Marks Act, 1999, to rectify the register by removing the registration of the \"PIZZA GALLERIA\" mark in favor of Respondent 1, but only to the extent of restricting its use in Rewari. Alternatively, the court may order the parties to coexist, with the petitioner's outlets in Rewari and Respondent 1's outlets outside Rewari, or explore other possible solutions, such as a disclaimer or a geographical restriction on the use of the mark.\n\n**Conclusion:**\nThe case highlights the complexities of trade mark disputes, particularly when parties are using the same mark in different geographical locations. The court's decision will likely depend on the specific circumstances of the case, including the parties' intentions, the scope of their businesses, and the potential impact on consumers. Ultimately, the court's goal will be to balance the competing interests of the parties and ensure that the use of the \"PIZZA GALLERIA\" mark does not cause confusion or harm to consumers in Rewari or elsewhere.",
    "legal_precedents": [
      "Natures Essence Private Limited Protogreen Retail Solutions \nPrivate Limited"
    ],
    "full_text": "\n--- PAGE 1 ---\nNeutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 1 of 11  \n \n   \n \n$~6(Original) \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.O. (COMM.IPD-TM) 39/2021 \n \nRAJ KUMAR SHARMA \n \n \n \n..... Plaintiff \n \n \n \n \nThrough: \nMr. Nikhil Sonker, Adv. \n \n \n \n \n \nversus \n \n \nSANDEEP KUMAR & ANR.  \n \n      ..... Defendants \nThrough: \nMs. Garima Sachdeva, Adv. for \nR-1.  \nMr. Harish Vaidyanathan Shankar, CGSC \nwith Mr. Srish Kumar Mishra, Mr. Sagar \nMehlawat \nand \nMr.Alexander \nMathai \nPaikaday, Advs. for R-2. \n \nCORAM: \n \nHON'BLE MR. JUSTICE C.HARI SHANKAR \n \n \n \n \nJ U D G M E N T (O R A L) \n% \n \n \n \n \n30.01.2023 \n1. \nThe petitioner, in this petition preferred under Section 571 of the \nTrade Marks Act, 1999, has sought rectification of the Register of \nTrade Marks by removal, therefrom, of Registration No. 4842932 \ndated 5th July 2021, whereby the word mark “PIZZA GALLERIA”, \nwas registered in favour of Respondent 1 under Class 30 of the \nAlphabetical Index of classification of goods published by the \nRegistrar of Trade Marks under Sections 7 and 82 of the Trade Marks \n                                          \n1 57.  \nPower to cancel or vary registration and to rectify the register. –  \n(1)  \nOn application made in the prescribed manner to the High Court or to the Registrar by \nany person aggrieved, the Registrar or the High Court, as the case may be, may make such order as \nit may think fit for cancelling or varying the registration of a trade mark on the ground of any \ncontravention, or failure to observe a condition entered on the register in relation thereto. \n(2)  \nAny person aggrieved by the absence or omission from the register of any entry, or by \nany entry made in the register without sufficient cause, or by any entry wrongly remaining on the \nregister, or by any error or defect in any entry in the register, may apply in the prescribed manner to \nthe High Court or to the Registrar, and the Registrar or the High Court, as the case may be, may \nmake such order for making, expunging or varying the entry as it may think fit. \n2 7.  \nClassification of goods and services. –  \n(1)  \nThe Registrar shall classify goods and services, as far as may be, in accordance with the \nInternational classification of goods and services for the purposes of registration of trade marks. \n(2)  \nAny question arising as to the class within which any goods or services falls shall be \ndetermined by the Registrar whose decision shall be final. \n8.  \nPublication of alphabetical index. –  \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified\n\n--- PAGE 2 ---\nNeutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 2 of 11  \n \n   \n \nAct read with Rule 20(2)3 of the Trade Marks Rules, 2017.  Class 30 \ncovers “flour and preparations made from cereals; bread, pizza, pastry \nand confectionery”.   \n \n2. \nMr. Nikhil Sonker, learned Counsel for the petitioner, submitted \nthat the petitioner was contesting the right of Respondent 1 to use the \n“PIZZA GALLERIA” mark in the city of Rewari.  The challenge in \nthis appeal is, therefore, restricted to said use.  The petitioner does not \nbegrudge the respondent the right to use the “PIZZA GALLERIA”  in \nany other part of the country.   \n \n3. \nInterestingly, the petitioner and Respondent 1 are both running \neating outlets under the name “PIZZA GALLERIA”.  The petitioner‟s \noutlets are situated in Rewari, whereas Respondent 1‟s outlets are \nsituated outside Rewari.  In these circumstances, quite frankly, I am \nunable to understand why this Court should even trouble itself with \ndeciding this dispute, as the petitioner has no objection to the \nRespondent 1 using the “PIZZA GALLERIA” mark outside Rewari. \nHowever, Ms. Sachdeva, learned Counsel for Respondent 1 submits \nthat her client is unwilling to surrender the Rewari market.  She also \nsubmits that, on an earlier occasion, this issue had arisen, but that her \nclient was not agreeable to a disclaimer restricting the use, by it, of the \n                                                                                                                   \n(1)  \nThe Registrar may publish in the prescribed manner an alphabetical index of \nclassification of goods and services referred to in Section 7. \n(2)  \nWhere any goods or services are not specified in the alphabetical index of goods and \nservices published under sub-section (1), the classification of goods or services shall be determined \nby the Registrar in accordance with sub-section (2) of Section 7. \n3 20.  \nClassification of goods and service. –  \n(1)  \nClassification of goods and service for the purpose of registration of trade mark, the \ngoods and services shall be classified as per current edition of “the International Classification of \ngoods and services (NICE classification)” published by the World Intellectual Property \nOrganisation (WIPO). \n(2)  \nThe Registrar shall publish a class wise and an alphabetical index of such goods and \nservices, including goods and services of Indian origin. \n \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified\n\n--- PAGE 3 ---\nNeutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 3 of 11  \n \n   \n \ncontested “PIZZA GALLERIA” mark only to areas outside Rewari.  \nAs such, the Court is constrained to decide the dispute. \n \n4. \nAccording to Mr. Sonker, a Memorandum of Understanding \n(MoU) had been executed between the petitioner and Respondent 1 on \n9th June 2021, in terms of which the petitioner was entitled to use the \n“PIZZA GALLERIA” mark in the city of Rewari, whereas \nRespondent 1 was entitled to use the said mark anywhere else in the \ncountry.  A copy of the MoU has been placed on record.  Respondent \n1, however, disputes the MoU and alleges that it is fabricated.   \n \n5. \nRespondent 1, on the other hand, contends that the petitioner \nwas a franchisee of Respondent 1 and that a franchise agreement dated \n25th March 2018 had been executed between them. She, however \nsubmits that her client has misplaced the original franchise agreement \nand is only in possession of a draft franchise agreement which was \nemailed by Respondent 1 to the petitioner.  The said draft franchise \nagreement has been placed on record.  However, as it is an unsigned \nand undated document, the Court cannot take cognizance thereof. \n \n6. \nIn any event, as the recital hereinafter would reveal, it is not \nnecessary for this Court, in order to decide the present petition, to \nadvert either to the MoU or the franchise agreement.   \n \n7. \nAfter a considerably lengthy hearing, the matter has narrowed \ndown to a short point, on the basis of which this petition can be \ndecided.  The impugned registration dated 5th July 2021, of the \n“PIZZA GALLERIA” word mark in favour of Respondent 1 was \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified\n\n--- PAGE 4 ---\nNeutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 4 of 11  \n \n   \n \ngranted consequent to an application made by Respondent 1 on 1st \nFebruary 2021.  Undisputedly, prior thereto, on 31st August 2020, the \npetitioner had applied for registration of the \n device mark \nunder Class 35 which covers “Retail Shop or Online Retail Shop of \nFood Items, Mobile Retail Food Store Services”. \n \n8. \nThere is, therefore, no dispute about the fact that the application \nfiled by the petitioner for registration of the \n device mark \nunder Class 35 was prior in point of time to the application dated 1st \nFebruary 2021, filed by Respondent 1 for the “PIZZA GALLERIA” \nword mark. \n \n9. \nRelying on Section 11(1)4 of the Trade Marks Act read with \nClause (a) of the Explanation5 to the said section, Mr. Sonker submits \nthat the \n mark is, if not identical, at least, similar to the \n“PIZZA GALLERIA” word mark of Respondent 1, as the pictorial \nrepresentation in the former mark is of a pizza.  He submits that, \ntherefore, there is a likelihood of confusion between the \n \n                                          \n4 11.  \nRelative grounds for refusal of registration. –  \n(1)  \nSave as provided in Section 12, a trade mark shall not be registered if, because of –  \n(a)  \nits identity with an earlier trade mark and similarity of goods or services \ncovered by the trade mark; or \n(b)  \nits similarity to an earlier trade mark and the identity or similarity of the goods \nor services covered by the trade mark, \nthere exists a likelihood of confusion on the part of the public, which includes the likelihood of \nassociation with the earlier trade mark. \n5 Explanation. – For the purposes of this section, earlier trade mark means –  \n(a)  \na registered trade mark or an application under Section 18 bearing an earlier date of filing \nor an international registration referred to in Section 36-E or convention application referred to in \nSection 154 which has a date of application earlier than that of the trade mark in question, taking \naccount, where appropriate, of the priorities claimed in respect of the trade marks; \n(b)  \na trade mark which, on the date of the application for registration of the trade mark in \nquestion, or where appropriate, of the priority claimed in respect of the application, was entitled to \nprotection as a well-known trade mark. \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified\n\n--- PAGE 5 ---\nNeutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 5 of 11  \n \n   \n \ndevice mark and the “PIZZA GALLERIA” word mark.  In these \ncircumstances, he submits, Respondent 1 could not have been granted \nregistration in respect of the “PIZZA GALLERIA” word mark, as \ngrant of such registration would infract Section 11(1) of the \nTrademarks Act. \n \n10. \nAs there appears to be substance in this contention, it is not \nnecessary to examine any of the other contentions urged at the bar by \nboth sides.  \n \n11. \nClauses (a) and (b) of Section 11(1) envisage independent \ncircumstances in which a trade mark is ineligible for registration.  Of \nthese, where the mark for which registration has been applied is \nidentical to an earlier trademark, Clause (a) would apply, whereas, \nwhere the applicant‟s mark is similar to an earlier trademark, Clause \n(b) would apply.  In either case, likelihood of confusion on the part of \nthe public must be shown to exist, in order for the later mark to be \nineligible for registration.  \n \n12. \nThe expression “earlier trademark” has been defined in the \nExplanation to the Section.  Clause (a) of the explanation includes, \nwithin the meaning of the expression “earlier trademark”, “an \napplication under Section 186 bearing an earlier date of filing”.  As \nsuch, Section 11(1)(b) read with Clause (a) of the explanation to \nSection 11, would prohibit the registration of a trademark where, \nbecause of (i) its similarity with a mark, for which an application, filed \nearlier, was pending, coupled with (ii) identity or similarity of the \n                                          \n6 Section 18 allows a person to apply for registration of a trade mark.   \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified\n\n--- PAGE 6 ---\nNeutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 6 of 11  \n \n   \n \ngoods or services covered by the two marks, there exists a likelihood \nof confusion. \n \n13. \nCan, then, the \n device mark of the petitioner, and the \n“PIZZA GALLERIA” word mark of the respondent, be regarded as \n“similar”, as would result in a likelihood of confusion?   \n \n14. \nAfter some cogitation, I feel the answer has to be in the \naffirmative. \n \n15. \nThe expression “similar” is not defined in the Trade Marks Act.  \nSection 2(1)(h), however, declares, in an admirably circular fashion, \nthat “a mark shall be deemed to be deceptively similar to another mark \nif it so nearly resembles the other mark as to be likely to deceive or \ncause confusion”.   Thus, Section 2(1)(h) embraces, within the broad \nparentheses of “deceptive similarity”, both “confusing” and \n“deceptive” similarity.  Likelihood of deception or confusion, in any \nevent, remains the pervading mantra. \n \n16. \nThe petitioner‟s \n mark contains a pictorial depiction \nof a pizza, with the word “Galleria” alongside it.  A mental connect \nbeween the pizza and “Galleria” is, however, immediately made by an \naverage consumer who sees the mark.  The impugned mark of the \nrespondent is “PIZZA GALLERIA”.  In the mark “PIZZA \nGALLERIA”, there can be no manner of doubt that “Galleria” is the \ndominant part, as “pizza” is publici juris, used by nearly every eatery \nwhich specializes in pizzas.  “Galleria” may be a term more often \nassociated with art; it certainly is not a term of common usage for \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified\n\n--- PAGE 7 ---\nNeutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 7 of 11  \n \n   \n \nrestaurants or eating joints.  An unwary consumer would not, \ntherefore, readily imagine that \n and “PIZZA GALLERIA” \nare two different establishments, run by two different persons.  He is \nmuch more likely to regard the former device mark as a pictorial \nmanifestation of the latter word mark.  Likelihood of confusion, in \npresuming both establishments to belong to one administration is, \ntherefore, in my opinion, inevitable.   \n \n17. \nMr. Sonker has, moreover, pointed out that, in invoices issued \nby the petitioner, the petitioner was actually referred to as “PIZZA \nGALLERIA”.  \n \n18. \nThe nature of services provided by the petitioner and \nRespondent 1 are identical, as both are providing restaurant services.  \nThough the petitioner‟s application, dated 31st August 2020, for \nregistration of the  \n device mark, and the respondent‟s \napplication dated 1st February 2021 for registration of the „PIZZA \nGALLERIA‟ word mark were for different classes, that cannot make \nany difference, as the applicability of Section 11(1) is not dependent \non the class in respect of which the marks are registered, or \nregistration of the marks is sought.  Even otherwise, the nature of \ngoods and services covered by Classes 30 and 35 are allied, the former \nrelating to “flour and preparations made from cereals; bread, pizza, \npastry and confectionery” and the latter to “Retail Shop or Online \nRetail Shop of Food Items, Mobile Retail Food Store Services”.  \nWhere the goods and services to which the competing marks relate are \nallied, the chance of confusion or deception stands enhanced, as held \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified\n\n--- PAGE 8 ---\nNeutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 8 of 11  \n \n   \n \nin  Mex Switchgears Pvt. Ltd. v. Omex Cables Industries7 and \nNatures Essence Private Limited v. Protogreen Retail Solutions \nPrivate Limited8,  \n \n19. \nThere is, therefore, substance in the contention of Mr. Sonker \nthat the petitioner‟s  \n   device mark is similar to the “PIZZA \nGALLERIA” word mark of Respondent 1, and is used in respect of \ngoods or services which are not only similar but identical.  Equally, in \nthese circumstances, the possibility of likelihood of confusion among \npersons who wished to visit the eating outlets cannot be gainsaid.  \n \n20. \nThe petitioner‟s application for registration of \n device \nmark, having been made on 31st August 2020, is prior in point of time \nto the application of Respondent 1 for registration of the „PIZZA \nGALLERIA‟ word mark, which was on 1st February 2021.  As such, \nthe application dated 31st August 2020 of the petitoner itself amounted \nto an “earlier trademark” within the meaning of Section 11(1)(b) of \nthe Trade Marks Act, in view of Clause (a) of the explanation to the \nSection.  \n \n21. \nMs. Sachdeva, learned Counsel for Respondent 1 fairly \nacknowledged that the petitioner‟s application for registration of the \n device mark was indeed prior in point of time to the \napplication dated 1st February 2021 of Respondent 1, consequent on \nwhich the impugned “PIZZA GALLERIA” word mark was registered \n                                          \n7 (2017) 71 PTC 465 (Del) \n8 (2021) 86 PTC 225 (Del) \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified\n\n--- PAGE 9 ---\nNeutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 9 of 11  \n \n   \n \nin Respondent 1‟s favour.  However, she submits that the present \npetition is centred entirely on the MoU dated 9th June 2021 executed \nbetween the petitioner and Respondent 1 which, according to her, is \nthe main ground on which the petitioner has questioned the \nentitlement, of Respondent 1, to registration of the impugned mark.  \n \n22. \nIt is correct that the petition is predicated, to a large extent, on \nthe MoU dated 9th June 2020.  However, in para 13 of the grounds of \nchallenge in the present petition, the petitioner has stated that the \npetitioner‟s earlier application was for a mark similar to the impugned \nmark of Respondent 1 and that, therefore, grant of registration to the \nimpugned mark infracted Section 11(1) of the Trademarks Act.  As \nsuch, it cannot be said that the submission of Mr. Sonker is entirely \ndivorced from the pleadings.   \n \n23. \nSection 57(2) of the Trademarks Act permits the making of an \napplication for making, expunging or varying any entry in the Trade \nMarks Register, where the applicant alleges that (i) the entry is made \nwithout sufficient cause or (ii) is wrongly remaining on the register or \n(iii) suffers from any error or defect.  Mr. Sonker submits that \ncircumstance (ii) applies to the present case.  As such, he submits, in \nview of Section 11(1)(b) of the Trade Marks Act, the impugned \nregistration of the word mark “PIZZA GALLERIA” granted to the \npetitioner on 5th July 2021, could not be allowed to remain on the \nregister.  \n \n24. \nAs I have already held that the grant of registration to \nRespondent 1 of the impugned “PIZZA GALLERIA” word mark on \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified\n\n--- PAGE 10 ---\nNeutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 10 of 11  \n \n   \n \n5th July 2021 is violative of Section 11(1)(b) of the Trademarks Act, \nthe said word mark is liable to be removed from the register.  \nHowever, as Mr Sonker has restricted his challenge, in the present \npetition, to the use, by the defendant, of the impugned “PIZZA \nGALLERIA” mark in the city of Rewari, I direct the rectification of \nRegistration No. 4842932 granted to Respondent 1 for the word mark \n“PIZZA GALLERIA” on 5th July 2021 to be rectified by inserting, \ntherein, a disclaimer disallowing the use of the said mark, by the \ndefendant, in the city of Rewari, while retaining the right of the \ndefendant to use the mark elsewhere in the country.   \n \n25. \nThis petition stands disposed of in the aforesaid terms.  \n \nA Postscript \n \n26. \nA somewhat quixotic statutory position has come to my notice \nwhile correcting this judgement.  Earlier, classification of goods and \nservices, for the purposes of registration of trade marks, was contained \nin the Fourth Schedule to the Trade Marks Rules, 2002 (“the 2002 TM \nRules”).  The 2002 TM Rules were, subsequently, superseded by the \nTrade Marks Rules, 2017 (“the 2017 TM Rules”).  Rule 185 of the \n2017 TM Rules repeals the 2002 Rules “without prejudice to anything \ndone under such rules before the coming into force of” the 2017 TM \nRules.  New Registrations have, therefore, to be as per the 2017 TM \nRules, and cannot abide by the 2002 TM Rules.  I am informed, \nhowever, that, even as on date, a registrant seeking to register a trade \nmark has to classify the mark as per the 2002 TM Rules.  This appears \nto be erroneous, in view of Rule 185 of the 2017 TM Rules supra.   \n \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified\n\n--- PAGE 11 ---\nNeutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 11 of 11  \n \n   \n \n27. \nThat apart, Section 7(1) of the Trade Marks Act requires the \nRegistrar of Trade Marks to classify goods and services, as far as may \nbe, in accordance with the International classification of goods and \nservices (the NICE Classification) for the purposes of registration of \ntrade marks.  Section 7(2) makes the decision of any question as to the \nclass within which any goods or services falls, by the Registrar, final.  \nSection 8(1) requires the Registrar to publish, in the prescribed \nmanner, an alphabetical list of classification of goods and services for \nthe purpose of registration of trade marks.  These provisions, \ntherefore, require the Registrar to classify the goods or services, for \nthe purpose of registration, in accordance with the NICE \nclassification, only as far as may be.  Rule 20(1) of the 2017 TM \nRules, however, departs, somewhat, from Section 7(1) of the TM Act, \nas it makes classification of goods and services, for the purpose of \nregistration of trade marks, to be mandatorily “as per current edition \nof „the international Classification of goods and services (NICE \nclassification)‟ published by the WIPO.  Thus, where Section 7(1) \nmakes the NICE classification applicable for classification of goods \nand services under the TM Act only as far as may be, Rule 20(1) \nmakes it mandatory for the classification of goods and services to \nabide by the NICE classification.  There is, therefore, an apparent \ndiscrepancy between Section 7(1) of the TM Act and Rule 20(1) of the \nTM Rules.  This may need statutory correction. \n \n28. \nThe Registrar of Trade Marks is requested to examine this \naspect. \n \n \nC.HARI SHANKAR, J \n \nJANUARY 30, 2023/kr \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified\n"
  },
  "total_pages": 11,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "According to the PDF document \"Raj Kumar v. Sandeep Kumar & Anr..pdf\", a legal proceeding is underway in the High Court of Delhi. The case involves a petition by Raj Kumar Sharma (Plaintiff) against Sandeep Kumar and another (Defendants) regarding the registration of the trade mark \"PIZZA GALLERIA\". The plaintiff seeks rectification of the Register of Trade Marks by removing the registration of \"PIZZA GALLERIA\" in favor of the first respondent.\n\nThe petition is filed under Section 571 of the Trade Marks Act, 1999, and the plaintiff is represented by Mr. Nikhil Sonker, Advocate. The defendants are represented by Ms. Garima Sachdeva, Advocate for R-1, and Mr. Harish Vaidyanathan Shankar, CGSC, with other advocates for R-2.\n\nThe dispute is restricted to the use of the \"PIZZA GALLERIA\" mark in the city of Rewari, where both parties have eating outlets under the same name. The plaintiff does not object to the respondent using the mark outside Rewari but seeks to prevent its use within the city.\n\nThe court, presided over by Hon'ble Mr. Justice C. Hari Shankar, heard the arguments on January 30, 2023. The judgment is yet to be finalized, but the court seems inclined to question the necessity of the dispute, given the plaintiff's willingness to allow the respondent to use the mark outside Rewari. The case highlights the complexities of trade mark disputes and the need for careful consideration of territorial rights. (Source: Raj Kumar v. Sandeep Kumar & Anr..pdf)",
      "pdf_source": "40. Raj Kumar v. Sandeep Kumar & Anr..pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "According to page 1 of the PDF \"40. Raj Kumar v. Sandeep Kumar & Anr.\", a petition was filed under Section 57 of the Trade Marks Act, 1999, seeking rectification of the Register of Trade Marks. The petitioner, Raj Kumar Sharma, sought removal of Registration No. 4842932, dated July 5, 2021, for the word mark \"PIZZA GALLERIA\" registered in favor of Respondent 1, Sandeep Kumar, under Class 30. The petition was heard by Hon'ble Mr. Justice C. Hari Shankar on January 30, 2023. The petitioner was represented by Mr. Nikhil Sonker, while the defendants were represented by Ms. Garima Sachdeva and Mr. Harish Vaidyanathan Shankar. (Source: 40. Raj Kumar v. Sandeep Kumar & Anr..pdf, page 1)",
          "content": "Neutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 1 of 11  \n \n   \n \n$~6(Original) \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.O. (COMM.IPD-TM) 39/2021 \n \nRAJ KUMAR SHARMA \n \n \n \n..... Plaintiff \n \n \n \n \nThrough: \nMr. Nikhil Sonker, Adv. \n \n \n \n \n \nversus \n \n \nSANDEEP KUMAR & ANR.  \n \n      ..... Defendants \nThrough: \nMs. Garima Sachdeva, Adv. for \nR-1.  \nMr. Harish Vaidyanathan Shankar, CGSC \nwith Mr. Srish Kumar Mishra, Mr. Sagar \nMehlawat \nand \nMr.Alexander \nMathai \nPaikaday, Advs. for R-2. \n \nCORAM: \n \nHON'BLE MR. JUSTICE C.HARI SHANKAR \n \n \n \n \nJ U D G M E N T (O R A L) \n% \n \n \n \n \n30.01.2023 \n1. \nThe petitioner, in this petition preferred under Section 571 of the \nTrade Marks Act, 1999, has sought rectification of the Register of \nTrade Marks by removal, therefrom, of Registration No. 4842932 \ndated 5th July 2021, whereby the word mark “PIZZA GALLERIA”, \nwas registered in favour of Respondent 1 under Class 30 of the \nAlphabetical Index of classification of goods published by the \nRegistrar of Trade Marks under Sections 7 and 82 of the Trade Marks \n                                          \n1 57.  \nPower to cancel or vary registration and to rectify the register. –  \n(1)  \nOn application made in the prescribed manner to the High Court or to the Registrar by \nany person aggrieved, the Registrar or the High Court, as the case may be, may make such order as \nit may think fit for cancelling or varying the registration of a trade mark on the ground of any \ncontravention, or failure to observe a condition entered on the register in relation thereto. \n(2)  \nAny person aggrieved by the absence or omission from the register of any entry, or by \nany entry made in the register without sufficient cause, or by any entry wrongly remaining on the \nregister, or by any error or defect in any entry in the register, may apply in the prescribed manner to \nthe High Court or to the Registrar, and the Registrar or the High Court, as the case may be, may \nmake such order for making, expunging or varying the entry as it may think fit. \n2 7.  \nClassification of goods and services. –  \n(1)  \nThe Registrar shall classify goods and services, as far as may be, in accordance with the \nInternational classification of goods and services for the purposes of registration of trade marks. \n(2)  \nAny question arising as to the class within which any goods or services falls shall be \ndetermined by the Registrar whose decision shall be final. \n8.  \nPublication of alphabetical index. –  \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified",
          "pdf_source": "40. Raj Kumar v. Sandeep Kumar & Anr..pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "According to page 2 of the PDF \"40. Raj Kumar v. Sandeep Kumar & Anr..pdf\", the case involves a trade mark dispute between Raj Kumar Sharma and Sandeep Kumar over the use of the \"PIZZA GALLERIA\" mark. The petitioner, Raj Kumar Sharma, is contesting the respondent's right to use the mark in Rewari, but does not object to its use outside Rewari. The respondent is unwilling to surrender the Rewari market. The case is being heard in the High Court of Delhi, with Mr. Nikhil Sonker representing the petitioner and Ms. Garima Sachdeva representing the respondent. The court is considering the classification of goods and services under the Trade Marks Rules, 2017, specifically Class 30, which covers \"flour and preparations made from cereals; bread, pizza, pastry and confectionery\". (Source: 40. Raj Kumar v. Sandeep Kumar & Anr..pdf)",
          "content": "Neutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 2 of 11  \n \n   \n \nAct read with Rule 20(2)3 of the Trade Marks Rules, 2017.  Class 30 \ncovers “flour and preparations made from cereals; bread, pizza, pastry \nand confectionery”.   \n \n2. \nMr. Nikhil Sonker, learned Counsel for the petitioner, submitted \nthat the petitioner was contesting the right of Respondent 1 to use the \n“PIZZA GALLERIA” mark in the city of Rewari.  The challenge in \nthis appeal is, therefore, restricted to said use.  The petitioner does not \nbegrudge the respondent the right to use the “PIZZA GALLERIA”  in \nany other part of the country.   \n \n3. \nInterestingly, the petitioner and Respondent 1 are both running \neating outlets under the name “PIZZA GALLERIA”.  The petitioner‟s \noutlets are situated in Rewari, whereas Respondent 1‟s outlets are \nsituated outside Rewari.  In these circumstances, quite frankly, I am \nunable to understand why this Court should even trouble itself with \ndeciding this dispute, as the petitioner has no objection to the \nRespondent 1 using the “PIZZA GALLERIA” mark outside Rewari. \nHowever, Ms. Sachdeva, learned Counsel for Respondent 1 submits \nthat her client is unwilling to surrender the Rewari market.  She also \nsubmits that, on an earlier occasion, this issue had arisen, but that her \nclient was not agreeable to a disclaimer restricting the use, by it, of the \n                                                                                                                   \n(1)  \nThe Registrar may publish in the prescribed manner an alphabetical index of \nclassification of goods and services referred to in Section 7. \n(2)  \nWhere any goods or services are not specified in the alphabetical index of goods and \nservices published under sub-section (1), the classification of goods or services shall be determined \nby the Registrar in accordance with sub-section (2) of Section 7. \n3 20.  \nClassification of goods and service. –  \n(1)  \nClassification of goods and service for the purpose of registration of trade mark, the \ngoods and services shall be classified as per current edition of “the International Classification of \ngoods and services (NICE classification)” published by the World Intellectual Property \nOrganisation (WIPO). \n(2)  \nThe Registrar shall publish a class wise and an alphabetical index of such goods and \nservices, including goods and services of Indian origin. \n \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified",
          "pdf_source": "40. Raj Kumar v. Sandeep Kumar & Anr..pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0007",
      "start_index": 3,
      "end_index": 5,
      "summary": "According to the PDF document \"Raj Kumar v. Sandeep Kumar & Anr..pdf\", the High Court of Delhi is hearing a case between Raj Kumar Sharma (Plaintiff) and Sandeep Kumar & Anr. (Defendants) regarding the \"PIZZA GALLERIA\" trademark. The dispute arose from a Memorandum of Understanding (MoU) allegedly executed on June 9, 2021, allowing the plaintiff to use the mark in Rewari, while the defendant could use it elsewhere. However, the defendant disputes the MoU, claiming it is fabricated.\n\nThe plaintiff had applied for registration of a device mark under Class 35 on August 31, 2020, prior to the defendant's application for the \"PIZZA GALLERIA\" word mark on February 1, 2021. The court must decide whether the defendant's registration can be allowed, considering Section 11(1) of the Trade Marks Act, which deals with relative grounds for refusal of registration due to likelihood of confusion.\n\nThe plaintiff argues that the device mark is similar to the \"PIZZA GALLERIA\" word mark, as it features a pictorial representation of a pizza, and therefore, there is a likelihood of confusion. The court must consider the facts, including the dates of application and the similarity of the marks, to make a decision. The case highlights the importance of trademark law and the need to resolve disputes over intellectual property rights. (Source: Raj Kumar v. Sandeep Kumar & Anr..pdf, pages 1-4)",
      "pdf_source": "40. Raj Kumar v. Sandeep Kumar & Anr..pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "According to page 3 of the PDF \"40. Raj Kumar v. Sandeep Kumar & Anr..pdf\", a dispute is ongoing between Raj Kumar Sharma and Sandeep Kumar over the \"PIZZA GALLERIA\" mark. The petitioner, Raj Kumar, claims a Memorandum of Understanding (MoU) was executed on June 9, 2021, allowing him to use the mark in Rewari, while Respondent 1, Sandeep Kumar, could use it elsewhere. However, Respondent 1 disputes the MoU and alleges it is fabricated. A franchise agreement dated March 25, 2018, is also mentioned, but only a draft is available. The court will decide the petition based on a short point, considering the impugned registration of the \"PIZZA GALLERIA\" word mark in favor of Respondent 1 on July 5, 2021. (Source: 40. Raj Kumar v. Sandeep Kumar & Anr..pdf, page 3)",
          "content": "Neutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 3 of 11  \n \n   \n \ncontested “PIZZA GALLERIA” mark only to areas outside Rewari.  \nAs such, the Court is constrained to decide the dispute. \n \n4. \nAccording to Mr. Sonker, a Memorandum of Understanding \n(MoU) had been executed between the petitioner and Respondent 1 on \n9th June 2021, in terms of which the petitioner was entitled to use the \n“PIZZA GALLERIA” mark in the city of Rewari, whereas \nRespondent 1 was entitled to use the said mark anywhere else in the \ncountry.  A copy of the MoU has been placed on record.  Respondent \n1, however, disputes the MoU and alleges that it is fabricated.   \n \n5. \nRespondent 1, on the other hand, contends that the petitioner \nwas a franchisee of Respondent 1 and that a franchise agreement dated \n25th March 2018 had been executed between them. She, however \nsubmits that her client has misplaced the original franchise agreement \nand is only in possession of a draft franchise agreement which was \nemailed by Respondent 1 to the petitioner.  The said draft franchise \nagreement has been placed on record.  However, as it is an unsigned \nand undated document, the Court cannot take cognizance thereof. \n \n6. \nIn any event, as the recital hereinafter would reveal, it is not \nnecessary for this Court, in order to decide the present petition, to \nadvert either to the MoU or the franchise agreement.   \n \n7. \nAfter a considerably lengthy hearing, the matter has narrowed \ndown to a short point, on the basis of which this petition can be \ndecided.  The impugned registration dated 5th July 2021, of the \n“PIZZA GALLERIA” word mark in favour of Respondent 1 was \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified",
          "pdf_source": "40. Raj Kumar v. Sandeep Kumar & Anr..pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "According to page 4 of the PDF \"40. Raj Kumar v. Sandeep Kumar & Anr.\", the petitioner, Raj Kumar Sharma, applied for registration of a device mark under Class 35 on August 31, 2020, which covers retail shop or online retail shop of food items. The respondent, Sandeep Kumar, applied for registration of the \"PIZZA GALLERIA\" word mark on February 1, 2021. The petitioner's counsel, Mr. Nikhil Sonker, argues that the marks are similar, citing Section 11(1) of the Trade Marks Act, and that there is a likelihood of confusion between the two marks. The petitioner's application was prior in time to the respondent's application, which is a key factor in determining the outcome of the case. (Source: 40. Raj Kumar v. Sandeep Kumar & Anr..pdf, page 4)",
          "content": "Neutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 4 of 11  \n \n   \n \ngranted consequent to an application made by Respondent 1 on 1st \nFebruary 2021.  Undisputedly, prior thereto, on 31st August 2020, the \npetitioner had applied for registration of the \n device mark \nunder Class 35 which covers “Retail Shop or Online Retail Shop of \nFood Items, Mobile Retail Food Store Services”. \n \n8. \nThere is, therefore, no dispute about the fact that the application \nfiled by the petitioner for registration of the \n device mark \nunder Class 35 was prior in point of time to the application dated 1st \nFebruary 2021, filed by Respondent 1 for the “PIZZA GALLERIA” \nword mark. \n \n9. \nRelying on Section 11(1)4 of the Trade Marks Act read with \nClause (a) of the Explanation5 to the said section, Mr. Sonker submits \nthat the \n mark is, if not identical, at least, similar to the \n“PIZZA GALLERIA” word mark of Respondent 1, as the pictorial \nrepresentation in the former mark is of a pizza.  He submits that, \ntherefore, there is a likelihood of confusion between the \n \n                                          \n4 11.  \nRelative grounds for refusal of registration. –  \n(1)  \nSave as provided in Section 12, a trade mark shall not be registered if, because of –  \n(a)  \nits identity with an earlier trade mark and similarity of goods or services \ncovered by the trade mark; or \n(b)  \nits similarity to an earlier trade mark and the identity or similarity of the goods \nor services covered by the trade mark, \nthere exists a likelihood of confusion on the part of the public, which includes the likelihood of \nassociation with the earlier trade mark. \n5 Explanation. – For the purposes of this section, earlier trade mark means –  \n(a)  \na registered trade mark or an application under Section 18 bearing an earlier date of filing \nor an international registration referred to in Section 36-E or convention application referred to in \nSection 154 which has a date of application earlier than that of the trade mark in question, taking \naccount, where appropriate, of the priorities claimed in respect of the trade marks; \n(b)  \na trade mark which, on the date of the application for registration of the trade mark in \nquestion, or where appropriate, of the priority claimed in respect of the application, was entitled to \nprotection as a well-known trade mark. \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified",
          "pdf_source": "40. Raj Kumar v. Sandeep Kumar & Anr..pdf",
          "nodes": []
        },
        {
          "title": "Page 5",
          "node_id": "0006",
          "start_index": 5,
          "end_index": 5,
          "summary": "According to page 5 of the PDF \"40. Raj Kumar v. Sandeep Kumar & Anr.\", the plaintiff's counsel argues that Respondent 1 should not have been granted registration for the \"PIZZA GALLERIA\" word mark, as it infracts Section 11(1) of the Trademarks Act. The court notes that Clause (a) and (b) of Section 11(1) provide independent circumstances for a trade mark's ineligibility for registration, requiring a likelihood of confusion on the public's part. The \"earlier trademark\" is defined in the Explanation to the Section, including an application under Section 18 with an earlier filing date. The case is C.O. (COMM.IPD-TM) 39/2021, with Neutral Citation Number 2023/DHC/000647. The plaintiff is Raj Kumar Sharma, and the defendants are Sandeep Kumar and another. The document was digitally signed by Kamla Rawat on January 31, 2023. (Source: 40. Raj Kumar v. Sandeep Kumar & Anr..pdf)",
          "content": "Neutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 5 of 11  \n \n   \n \ndevice mark and the “PIZZA GALLERIA” word mark.  In these \ncircumstances, he submits, Respondent 1 could not have been granted \nregistration in respect of the “PIZZA GALLERIA” word mark, as \ngrant of such registration would infract Section 11(1) of the \nTrademarks Act. \n \n10. \nAs there appears to be substance in this contention, it is not \nnecessary to examine any of the other contentions urged at the bar by \nboth sides.  \n \n11. \nClauses (a) and (b) of Section 11(1) envisage independent \ncircumstances in which a trade mark is ineligible for registration.  Of \nthese, where the mark for which registration has been applied is \nidentical to an earlier trademark, Clause (a) would apply, whereas, \nwhere the applicant‟s mark is similar to an earlier trademark, Clause \n(b) would apply.  In either case, likelihood of confusion on the part of \nthe public must be shown to exist, in order for the later mark to be \nineligible for registration.  \n \n12. \nThe expression “earlier trademark” has been defined in the \nExplanation to the Section.  Clause (a) of the explanation includes, \nwithin the meaning of the expression “earlier trademark”, “an \napplication under Section 186 bearing an earlier date of filing”.  As \nsuch, Section 11(1)(b) read with Clause (a) of the explanation to \nSection 11, would prohibit the registration of a trademark where, \nbecause of (i) its similarity with a mark, for which an application, filed \nearlier, was pending, coupled with (ii) identity or similarity of the \n                                          \n6 Section 18 allows a person to apply for registration of a trade mark.   \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified",
          "pdf_source": "40. Raj Kumar v. Sandeep Kumar & Anr..pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0012",
      "start_index": 6,
      "end_index": 9,
      "summary": "The legal document section from the PDF \"Raj Kumar v. Sandeep Kumar & Anr.\" (Neutral Citation Number: 2023/DHC/000647, C.O. (COMM.IPD-TM) 39/2021) discusses a trademark dispute between Raj Kumar Sharma (plaintiff) and Sandeep Kumar & Anr. (defendants). The plaintiff's device mark features a pictorial depiction of a pizza with the word \"Galleria\" alongside it, while the defendant's mark is the word \"PIZZA GALLERIA\". \n\nThe court argues that the two marks are similar, which could lead to confusion among consumers. The plaintiff's counsel, Mr. Nikhil Sonker, points out that the petitioner was referred to as \"PIZZA GALLERIA\" in invoices, and that the nature of services provided by both parties is identical (restaurant services). The court also notes that the goods and services covered by the marks are allied, relating to food items and retail services.\n\nThe court cites relevant case law, including Mex Switchgears Pvt. Ltd. v. Omex Cables Industries and Natures Essence Private Limited v. Protogreen Retail Solutions Private Limited, to support its decision that the marks are similar and could cause confusion. The document is digitally signed by Kamla Rawat on January 31, 2023. The case highlights the importance of trademark similarity and the potential for consumer confusion in the hospitality industry. (Source: Raj Kumar v. Sandeep Kumar & Anr..pdf)",
      "pdf_source": "40. Raj Kumar v. Sandeep Kumar & Anr..pdf",
      "nodes": [
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "According to page 6 of the PDF \"40. Raj Kumar v. Sandeep Kumar & Anr..pdf\", the court discusses the similarity between the petitioner's device mark and the respondent's \"PIZZA GALLERIA\" word mark. The court concludes that the marks can be regarded as \"similar\" due to the likelihood of confusion. The petitioner's mark features a pictorial depiction of a pizza with the word \"Galleria\" alongside it, while the respondent's mark is \"PIZZA GALLERIA\", where \"Galleria\" is the dominant part. The court references Section 2(1)(h) of the Trade Marks Act, which states that a mark is deceptively similar if it resembles another mark closely enough to deceive or cause confusion. The case is C.O. (COMM.IPD-TM) 39/2021, with Neutral Citation Number 2023/DHC/000647. The court's decision was signed on January 31, 2023.",
          "content": "Neutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 6 of 11  \n \n   \n \ngoods or services covered by the two marks, there exists a likelihood \nof confusion. \n \n13. \nCan, then, the \n device mark of the petitioner, and the \n“PIZZA GALLERIA” word mark of the respondent, be regarded as \n“similar”, as would result in a likelihood of confusion?   \n \n14. \nAfter some cogitation, I feel the answer has to be in the \naffirmative. \n \n15. \nThe expression “similar” is not defined in the Trade Marks Act.  \nSection 2(1)(h), however, declares, in an admirably circular fashion, \nthat “a mark shall be deemed to be deceptively similar to another mark \nif it so nearly resembles the other mark as to be likely to deceive or \ncause confusion”.   Thus, Section 2(1)(h) embraces, within the broad \nparentheses of “deceptive similarity”, both “confusing” and \n“deceptive” similarity.  Likelihood of deception or confusion, in any \nevent, remains the pervading mantra. \n \n16. \nThe petitioner‟s \n mark contains a pictorial depiction \nof a pizza, with the word “Galleria” alongside it.  A mental connect \nbeween the pizza and “Galleria” is, however, immediately made by an \naverage consumer who sees the mark.  The impugned mark of the \nrespondent is “PIZZA GALLERIA”.  In the mark “PIZZA \nGALLERIA”, there can be no manner of doubt that “Galleria” is the \ndominant part, as “pizza” is publici juris, used by nearly every eatery \nwhich specializes in pizzas.  “Galleria” may be a term more often \nassociated with art; it certainly is not a term of common usage for \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified",
          "pdf_source": "40. Raj Kumar v. Sandeep Kumar & Anr..pdf",
          "nodes": []
        },
        {
          "title": "Page 7",
          "node_id": "0009",
          "start_index": 7,
          "end_index": 7,
          "summary": "According to page 7 of the PDF \"40. Raj Kumar v. Sandeep Kumar & Anr..pdf\", the court notes that an unwary consumer may confuse the device mark and \"PIZZA GALLERIA\" word mark, assuming they belong to the same establishment. The plaintiff's invoices also refer to them as \"PIZZA GALLERIA\". Both parties provide identical restaurant services, and their applications for mark registration, although in different classes (30 and 35), relate to allied goods and services, increasing the chance of confusion. The court cites Section 11(1) as applicable, regardless of the registration class. The case, C.O. (COMM.IPD-TM) 39/2021, is heard in the High Court of Delhi, with Mr. Nikhil Sonker representing the plaintiff and Ms. Garima Sachdeva representing the defendant. (Source: 40. Raj Kumar v. Sandeep Kumar & Anr..pdf, page 7)",
          "content": "Neutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 7 of 11  \n \n   \n \nrestaurants or eating joints.  An unwary consumer would not, \ntherefore, readily imagine that \n and “PIZZA GALLERIA” \nare two different establishments, run by two different persons.  He is \nmuch more likely to regard the former device mark as a pictorial \nmanifestation of the latter word mark.  Likelihood of confusion, in \npresuming both establishments to belong to one administration is, \ntherefore, in my opinion, inevitable.   \n \n17. \nMr. Sonker has, moreover, pointed out that, in invoices issued \nby the petitioner, the petitioner was actually referred to as “PIZZA \nGALLERIA”.  \n \n18. \nThe nature of services provided by the petitioner and \nRespondent 1 are identical, as both are providing restaurant services.  \nThough the petitioner‟s application, dated 31st August 2020, for \nregistration of the  \n device mark, and the respondent‟s \napplication dated 1st February 2021 for registration of the „PIZZA \nGALLERIA‟ word mark were for different classes, that cannot make \nany difference, as the applicability of Section 11(1) is not dependent \non the class in respect of which the marks are registered, or \nregistration of the marks is sought.  Even otherwise, the nature of \ngoods and services covered by Classes 30 and 35 are allied, the former \nrelating to “flour and preparations made from cereals; bread, pizza, \npastry and confectionery” and the latter to “Retail Shop or Online \nRetail Shop of Food Items, Mobile Retail Food Store Services”.  \nWhere the goods and services to which the competing marks relate are \nallied, the chance of confusion or deception stands enhanced, as held \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified",
          "pdf_source": "40. Raj Kumar v. Sandeep Kumar & Anr..pdf",
          "nodes": []
        },
        {
          "title": "Page 8",
          "node_id": "0010",
          "start_index": 8,
          "end_index": 8,
          "summary": "According to page 8 of the PDF \"40. Raj Kumar v. Sandeep Kumar & Anr.\", the court notes that the petitioner's device mark is similar to Respondent 1's \"PIZZA GALLERIA\" word mark, used for identical goods and services. The petitioner's application for registration, made on August 31, 2020, is prior to Respondent 1's application on February 1, 2021. The court cites cases Mex Switchgears Pvt. Ltd. v. Omex Cables Industries and Natures Essence Private Limited v. Protogreen Retail Solutions Private Limited. Respondent 1's counsel, Ms. Garima Sachdeva, acknowledges the petitioner's prior application. The court references Section 11(1)(b) of the Trade Marks Act, considering the petitioner's application as an \"earlier trademark\". (Source: 40. Raj Kumar v. Sandeep Kumar & Anr..pdf, page 8)",
          "content": "Neutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 8 of 11  \n \n   \n \nin  Mex Switchgears Pvt. Ltd. v. Omex Cables Industries7 and \nNatures Essence Private Limited v. Protogreen Retail Solutions \nPrivate Limited8,  \n \n19. \nThere is, therefore, substance in the contention of Mr. Sonker \nthat the petitioner‟s  \n   device mark is similar to the “PIZZA \nGALLERIA” word mark of Respondent 1, and is used in respect of \ngoods or services which are not only similar but identical.  Equally, in \nthese circumstances, the possibility of likelihood of confusion among \npersons who wished to visit the eating outlets cannot be gainsaid.  \n \n20. \nThe petitioner‟s application for registration of \n device \nmark, having been made on 31st August 2020, is prior in point of time \nto the application of Respondent 1 for registration of the „PIZZA \nGALLERIA‟ word mark, which was on 1st February 2021.  As such, \nthe application dated 31st August 2020 of the petitoner itself amounted \nto an “earlier trademark” within the meaning of Section 11(1)(b) of \nthe Trade Marks Act, in view of Clause (a) of the explanation to the \nSection.  \n \n21. \nMs. Sachdeva, learned Counsel for Respondent 1 fairly \nacknowledged that the petitioner‟s application for registration of the \n device mark was indeed prior in point of time to the \napplication dated 1st February 2021 of Respondent 1, consequent on \nwhich the impugned “PIZZA GALLERIA” word mark was registered \n                                          \n7 (2017) 71 PTC 465 (Del) \n8 (2021) 86 PTC 225 (Del) \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified",
          "pdf_source": "40. Raj Kumar v. Sandeep Kumar & Anr..pdf",
          "nodes": []
        },
        {
          "title": "Page 9",
          "node_id": "0011",
          "start_index": 9,
          "end_index": 9,
          "summary": "According to page 9 of the PDF \"40. Raj Kumar v. Sandeep Kumar & Anr.\", the petitioner's application is centered on the MoU dated June 9, 2021, between the petitioner and Respondent 1. The petitioner questions Respondent 1's entitlement to register the impugned mark. The petitioner's counsel, Mr. Sonker, argues that the grant of registration to Respondent 1 infracts Section 11(1) of the Trademarks Act. He cites Section 57(2) of the Trademarks Act, which allows for the expunging or varying of any entry in the Trade Marks Register if it is wrongly remaining on the register. The petitioner seeks to remove the impugned registration of the word mark \"PIZZA GALLERIA\" granted to Respondent 1 on July 5, 2021. (Source: 40. Raj Kumar v. Sandeep Kumar & Anr..pdf, page 9)",
          "content": "Neutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 9 of 11  \n \n   \n \nin Respondent 1‟s favour.  However, she submits that the present \npetition is centred entirely on the MoU dated 9th June 2021 executed \nbetween the petitioner and Respondent 1 which, according to her, is \nthe main ground on which the petitioner has questioned the \nentitlement, of Respondent 1, to registration of the impugned mark.  \n \n22. \nIt is correct that the petition is predicated, to a large extent, on \nthe MoU dated 9th June 2020.  However, in para 13 of the grounds of \nchallenge in the present petition, the petitioner has stated that the \npetitioner‟s earlier application was for a mark similar to the impugned \nmark of Respondent 1 and that, therefore, grant of registration to the \nimpugned mark infracted Section 11(1) of the Trademarks Act.  As \nsuch, it cannot be said that the submission of Mr. Sonker is entirely \ndivorced from the pleadings.   \n \n23. \nSection 57(2) of the Trademarks Act permits the making of an \napplication for making, expunging or varying any entry in the Trade \nMarks Register, where the applicant alleges that (i) the entry is made \nwithout sufficient cause or (ii) is wrongly remaining on the register or \n(iii) suffers from any error or defect.  Mr. Sonker submits that \ncircumstance (ii) applies to the present case.  As such, he submits, in \nview of Section 11(1)(b) of the Trade Marks Act, the impugned \nregistration of the word mark “PIZZA GALLERIA” granted to the \npetitioner on 5th July 2021, could not be allowed to remain on the \nregister.  \n \n24. \nAs I have already held that the grant of registration to \nRespondent 1 of the impugned “PIZZA GALLERIA” word mark on \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified",
          "pdf_source": "40. Raj Kumar v. Sandeep Kumar & Anr..pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0015",
      "start_index": 10,
      "end_index": 11,
      "summary": "According to the PDF document \"Raj Kumar v. Sandeep Kumar & Anr..pdf\", a court decision was made in the High Court of Delhi at New Delhi, with the Neutral Citation Number: 2023/DHC/000647 and C.O. (COMM.IPD-TM) 39/2021. The plaintiff, Raj Kumar Sharma, was represented by Mr. Nikhil Sonker, while the defendants, Sandeep Kumar and Anr., were represented by Ms. Garima Sachdeva and Mr. Harish Vaidyanathan Shankar.\n\nThe court decision, dated January 30, 2023, ruled that the use of the \"PIZZA GALLERIA\" mark by the defendant in the city of Rewari was violative of Section 11(1)(b) of the Trademarks Act. As a result, the court directed the rectification of Registration No. 4842932 by inserting a disclaimer disallowing the use of the mark in Rewari, while retaining the defendant's right to use it elsewhere in the country.\n\nThe court also noted a discrepancy between Section 7(1) of the Trademarks Act and Rule 20(1) of the Trademarks Rules, 2017, regarding the classification of goods and services for registration purposes. The Registrar of Trade Marks was requested to examine this aspect. The petition was disposed of in the aforementioned terms, with the decision digitally signed by Kamla Rawat on January 31, 2023. (Source: Raj Kumar v. Sandeep Kumar & Anr..pdf, Pages 1-11)",
      "pdf_source": "40. Raj Kumar v. Sandeep Kumar & Anr..pdf",
      "nodes": [
        {
          "title": "Page 10",
          "node_id": "0013",
          "start_index": 10,
          "end_index": 10,
          "summary": "According to page 10 of the PDF \"40. Raj Kumar v. Sandeep Kumar & Anr..pdf\", the court directs the rectification of Registration No. 4842932 for the word mark \"PIZZA GALLERIA\" by inserting a disclaimer disallowing its use in the city of Rewari, while allowing its use elsewhere in the country. The petition is disposed of in these terms. The court notes a statutory issue regarding the classification of goods and services for trademark registration, stating that new registrations should follow the 2017 Trade Marks Rules, not the 2002 Rules. The judgement was signed by Kamla Rawat on January 31, 2023. The case involves plaintiff Raj Kumar Sharma and defendants Sandeep Kumar and another, represented by advocates Nikhil Sonker, Garima Sachdeva, and Harish Vaidyanathan Shankar. (Source: 40. Raj Kumar v. Sandeep Kumar & Anr..pdf, page 10)",
          "content": "Neutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 10 of 11  \n \n   \n \n5th July 2021 is violative of Section 11(1)(b) of the Trademarks Act, \nthe said word mark is liable to be removed from the register.  \nHowever, as Mr Sonker has restricted his challenge, in the present \npetition, to the use, by the defendant, of the impugned “PIZZA \nGALLERIA” mark in the city of Rewari, I direct the rectification of \nRegistration No. 4842932 granted to Respondent 1 for the word mark \n“PIZZA GALLERIA” on 5th July 2021 to be rectified by inserting, \ntherein, a disclaimer disallowing the use of the said mark, by the \ndefendant, in the city of Rewari, while retaining the right of the \ndefendant to use the mark elsewhere in the country.   \n \n25. \nThis petition stands disposed of in the aforesaid terms.  \n \nA Postscript \n \n26. \nA somewhat quixotic statutory position has come to my notice \nwhile correcting this judgement.  Earlier, classification of goods and \nservices, for the purposes of registration of trade marks, was contained \nin the Fourth Schedule to the Trade Marks Rules, 2002 (“the 2002 TM \nRules”).  The 2002 TM Rules were, subsequently, superseded by the \nTrade Marks Rules, 2017 (“the 2017 TM Rules”).  Rule 185 of the \n2017 TM Rules repeals the 2002 Rules “without prejudice to anything \ndone under such rules before the coming into force of” the 2017 TM \nRules.  New Registrations have, therefore, to be as per the 2017 TM \nRules, and cannot abide by the 2002 TM Rules.  I am informed, \nhowever, that, even as on date, a registrant seeking to register a trade \nmark has to classify the mark as per the 2002 TM Rules.  This appears \nto be erroneous, in view of Rule 185 of the 2017 TM Rules supra.   \n \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified",
          "pdf_source": "40. Raj Kumar v. Sandeep Kumar & Anr..pdf",
          "nodes": []
        },
        {
          "title": "Page 11",
          "node_id": "0014",
          "start_index": 11,
          "end_index": 11,
          "summary": "According to page 11 of the PDF \"40. Raj Kumar v. Sandeep Kumar & Anr.\", the court discusses the discrepancy between Section 7(1) of the Trade Marks Act and Rule 20(1) of the 2017 TM Rules regarding the classification of goods and services for trade mark registration. Section 7(1) requires classification \"as far as may be\" in accordance with the International Classification of goods and services (NICE Classification), while Rule 20(1) makes it mandatory to follow the NICE classification. The court notes that this discrepancy may need statutory correction. The Registrar of Trade Marks is requested to examine this aspect. The judgment was made by C. Hari Shankar, J on January 30, 2023. (Source: 40. Raj Kumar v. Sandeep Kumar & Anr..pdf)",
          "content": "Neutral Citation Number : 2023/DHC/000647 \n C.O. (COMM.IPD-TM) 39/2021 \n                                                        Page 11 of 11  \n \n   \n \n27. \nThat apart, Section 7(1) of the Trade Marks Act requires the \nRegistrar of Trade Marks to classify goods and services, as far as may \nbe, in accordance with the International classification of goods and \nservices (the NICE Classification) for the purposes of registration of \ntrade marks.  Section 7(2) makes the decision of any question as to the \nclass within which any goods or services falls, by the Registrar, final.  \nSection 8(1) requires the Registrar to publish, in the prescribed \nmanner, an alphabetical list of classification of goods and services for \nthe purpose of registration of trade marks.  These provisions, \ntherefore, require the Registrar to classify the goods or services, for \nthe purpose of registration, in accordance with the NICE \nclassification, only as far as may be.  Rule 20(1) of the 2017 TM \nRules, however, departs, somewhat, from Section 7(1) of the TM Act, \nas it makes classification of goods and services, for the purpose of \nregistration of trade marks, to be mandatorily “as per current edition \nof „the international Classification of goods and services (NICE \nclassification)‟ published by the WIPO.  Thus, where Section 7(1) \nmakes the NICE classification applicable for classification of goods \nand services under the TM Act only as far as may be, Rule 20(1) \nmakes it mandatory for the classification of goods and services to \nabide by the NICE classification.  There is, therefore, an apparent \ndiscrepancy between Section 7(1) of the TM Act and Rule 20(1) of the \nTM Rules.  This may need statutory correction. \n \n28. \nThe Registrar of Trade Marks is requested to examine this \naspect. \n \n \nC.HARI SHANKAR, J \n \nJANUARY 30, 2023/kr \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:31.01.2023\n12:51:34\nSignature Not Verified",
          "pdf_source": "40. Raj Kumar v. Sandeep Kumar & Anr..pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-15T18:29:20.635172",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}