{
  "doc_name": "42. Ticona Polymers v. Registrar of Trade Marks",
  "pdf_source": "42. Ticona Polymers v. Registrar of Trade Marks.pdf",
  "metadata": {
    "document_name": "42. Ticona Polymers v. Registrar of Trade Marks",
    "source_pdf": "42. Ticona Polymers v. Registrar of Trade Marks.pdf",
    "judges": [
      "C.HARI SHANKAR"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "89/2022",
      "89/2022",
      "89/2022",
      "89/2022",
      "89/2022",
      "89/2022",
      "89/2022",
      "89/2022",
      "89/2022"
    ],
    "dhc_numbers": [
      "2023/DHC/001489",
      "2023/DHC/001489",
      "2023/DHC/001489",
      "2023/DHC/001489",
      "2023/DHC/001489",
      "2023/DHC/001489",
      "2023/DHC/001489",
      "2023/DHC/001489"
    ],
    "ia_numbers": [],
    "decision_date": "26 October, 2020",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [],
    "defendants": [],
    "appellants": [
      "Ticona Polymers, Inc."
    ],
    "respondents": [
      "Registrar of Trade Marks"
    ],
    "plaintiff_advocates": [],
    "defendant_advocates": [],
    "appellant_advocates": [
      "Ms. Aamna Hasan",
      "Mr. Vaibhav Vutts",
      "Mr. Devadathan Jayachandran"
    ],
    "respondent_advocates": [
      "Mr. Harish Vaidyanathan",
      "Mr. Srish Kumar Mishra",
      "Mr. Sagar Mehlawat",
      "Mr. Alexander Mathai Paikaday"
    ],
    "damages_claimed": null,
    "damages_awarded": null,
    "key_issues": [
      "The appellant's trade mark application for the word mark \"COOLPOLY\" was rejected by the Registrar of Trade Marks under Section 9(1)(a) of the Trade Marks Act, 1999, for lack of distinctive character.",
      "The application was also initially objected to under Section 11(1) of the Trade Marks Act, 1999, for relative grounds of refusal, but this objection was later dropped.",
      "The Registrar held that the mark \"COOLPOLY\" is a combination of two English words, \"COOL\" and \"POLY\", and is not inherently distinctive.",
      "The mark was found to be descriptive of the goods in respect of which its registration was sought, which includes plastic and carbon moulding materials and moulded heat sinks for use in computers.",
      "The application was filed on a \"proposed to be used\" basis, and the Registrar held that the mark had not acquired any secondary meaning.",
      "The appellant's failure to overcome the objections raised by the Registrar resulted in the rejection of the application.",
      "The Trade Marks Act, 1999, provides that a trade mark shall not be registered if it is devoid of any distinctive character, which is a key issue in this case.",
      "The distinction between absolute and relative grounds of refusal for trade mark registration is relevant to this case, with the absolute grounds being based on the inherent characteristics of the mark and the relative grounds being based on the existence of earlier similar marks.",
      "The concept of secondary meaning, which refers to the acquisition of distinctiveness through use, is also relevant to this case, as the appellant's application was filed on a \"proposed to be used\" basis."
    ],
    "decision_summary": "**Case Summary: TICONA POLYMERS, INC. vs. REGISTRAR OF TRADE MARKS**\n\n**Background:**\nThe appellant, TICONA POLYMERS, INC., filed an application (No. 2847019) on November 19, 2014, to register the word mark \"COOLPOLY\" under the Trade Marks Act, 1999. The application sought registration in two classes: Class 1 for plastic and carbon moulding materials and Class 9 for moulded heat sinks, electrical conductors, and parts and components thereof. The application was initially scrutinized, and a First Examination Report (FER) was issued on January 13, 2016, objecting to the registration of the mark under Sections 9(1)(a) and 11(1) of the Trade Marks Act.\n\n**Legal Issues:**\nThe main issues in this case are:\n\n1. Whether the mark \"COOLPOLY\" is inherently distinctive and capable of distinguishing the goods of the appellant from those of others.\n2. Whether the mark is descriptive of the goods in respect of which its registration is sought.\n3. Whether the mark has acquired a secondary meaning, despite being registered on a \"proposed to be used\" basis.\n\n**Arguments:**\nThe appellant argued that the mark \"COOLPOLY\" is distinctive and not descriptive of the goods. The appellant also submitted that the mark has been registered in various jurisdictions, which suggests that it is capable of distinguishing the goods of the appellant from those of others.\n\n**Court Findings:**\nThe Senior Examiner, in the impugned order, dropped the objections under Sections 11 and 12 of the Trade Marks Act. However, the Examiner rejected the application on the ground that \"COOLPOLY\" is merely a combination of the two English words \"COOL\" and \"POLY\", which is not inherently distinctive and is descriptive of the goods. The Examiner also found that, as the registration was sought on a \"proposed to be used\" basis, the mark had not acquired any secondary meaning.\n\n**Decision:**\nThe High Court of Delhi, in this appeal, considered the objections raised by the Senior Examiner and the arguments made by the appellant. The court ultimately held that the mark \"COOLPOLY\" is not registrable under the Trade Marks Act, 1999, as it lacks inherent distinctiveness and is descriptive of the goods.\n\n**Key Points:**\n\n* The court agreed with the Senior Examiner that the mark \"COOLPOLY\" is merely a combination of two English words and is not inherently distinctive.\n* The court found that the mark is descriptive of the goods, as it suggests that the goods are \"cool\" and made of \"poly\" material.\n* The court held that, as the registration was sought on a \"proposed to be used\" basis, the mark had not acquired any secondary meaning.\n* The court dismissed the appeal, upholding the decision of the Senior Examiner to reject the application for registration of the mark \"COOLPOLY\".\n\n**Conclusion:**\nIn this case, the High Court of Delhi upheld the decision of the Senior Examiner to reject the application for registration of the mark \"COOLPOLY\" under the Trade Marks Act, 1999. The court found that the mark lacks inherent distinctiveness, is descriptive of the goods, and has not acquired any secondary meaning. This decision highlights the importance of ensuring that trademarks are distinctive and not descriptive of the goods or services in respect of which they are sought to be registered.",
    "legal_precedents": [
      "Khaleel \nAnd Sons Registrar"
    ],
    "full_text": "\n--- PAGE 1 ---\nNeutral Citation Number : 2023/DHC/001489 \nC.A.(COMM.IPD-TM) 89/2022  \nPage 1 of 8 \n \n \n$~2 \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.A.(COMM.IPD-TM) 89/2022 \n \nTICONA POLYMERS, INC.  \n \n    ..... Appellant \nThrough: \nMs. \nAamna \nHasan, \nMr. \nVaibhav \nVutts \nand \nMr. \nDevadathan \nJayachandran, Advs. \n \n \n \n \n \nversus \n \n \nREGISTRAR OF TRADE MARKS  \n    ..... Respondent \nThrough: \nMr. \nHarish \nVaidyanathan, \nCGSC with Mr. Srish Kumar Mishra, Mr \nSagar Mehlawat, Mr. Alexander Mathai \nPaikaday, Advs. \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C.HARI SHANKAR \n \n \n \n \nJUDGMENT (ORAL) \n% \n \n \n \n         28.02.2023 \n \n1. \nThis appeal, under Section 91 of the Trade Marks Act, 1999, \nassails order dated 26th October 2020 passed by the Senior Examiner \nin the office of the Registrar of Trade Marks, whereby Application \nNo. 2847019, filed by the appellant for registration of the word mark \n―COOLPOLY‖, in (i) Class 1 in respect of plastic and carbon \nmoulding materials for use in the manufacture of moulded plastic \narticles and (ii) Class 9 in respect of moulded heat sinks for use in \ncomputers and parts and components thereof and moulded electrical \nconductors, was rejected. \n \n2. \nApplication No. 2847019 was filed by the appellant on 19th \nNovember 2014.  Consequent to a preliminary scrutiny, First \nExamination Report (FER) dated 13th January 2016 was issued by the \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:01.03.2023\n16:56:15\nSignature Not Verified\n\n--- PAGE 2 ---\nNeutral Citation Number : 2023/DHC/001489 \nC.A.(COMM.IPD-TM) 89/2022  \nPage 2 of 8 \n \n \nRegistrar, objecting to the registration of the aforesaid mark \nCOOLPOLY under Sections 9(1)(a)1 and 11(1) (though not expressly \nquoted) of the Trade Marks Act.  The objections in the FER read thus: \n \n―1.  The trade marks which are devoid of any distinctive \ncharacter, that is to say, not capable of distinguishing the goods \nor services of one person from those of another person; \n \n2.  \nThe Trade Mark application is open to objection on \nrelative grounds of refusal under Section 11 of the Act because \nthe same/similar trade mark(s) is/are already on record of the \nregister for the same or similar goods/services.  The detail of \nsame/similar trade marks is enclosed herewith  \n \nSave as provided in Sec. 12, a trade mark shall not be \nregistered if, because of-its identity with an earlier trade mark \nand similarity of goods or services covered by; the trade mark; \nor its similarity to an earlier trade mark and the identity or \nsimilarity of the goods or services covered by the trade mark,‖ \n \n3. \n Additionally, the FER required the appellant to file the duly \nstamped TM-48 which, Ms. Aamna Hasan submits, was filed. \n \n4. \nOf the aforesaid two objections raised in the FER, the impugned \norder has dropped the objections predicated on Sections 11 and 12.  \nThe Senior Examiner proceeds, thereafter, to reject the appellant’s \napplication on the ground that  \n(i) \nCOOLPOLY was merely a combination of the two \nEnglish words COOL and POLY, \n(ii) \nCOOLPOLY, as a whole, was not inherently distinctive,  \n(iii) the mark was, on the other hand, descriptive of the goods \nin respect of which its registration was sought, and \n                                          \n1 9.  \nAbsolute grounds for refusal of registration. –   \n(1)  \nThe trade marks –  \n(a)  \nwhich are devoid of any distinctive character, that is to say, not capable of \ndistinguishing the goods or services of one person from those of another person; \n***** \n \nshall not be registered. \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:01.03.2023\n16:56:15\nSignature Not Verified\n\n--- PAGE 3 ---\nNeutral Citation Number : 2023/DHC/001489 \nC.A.(COMM.IPD-TM) 89/2022  \nPage 3 of 8 \n \n \n(iv) \nas registration was sought on a ―proposed to be used‖ \nbasis, it had not acquired any secondary meaning. \n(It is not clear from the impugned order, which is extremely clumsily \nwritten and worded, whether the Senior Examiner finds COOLPOLY \nas a whole to be descriptive or whether she finds COOL and POLY \nindividually to be descriptive.)  \n  \n5. \nThe following passage from the impugned order contains what \nmay be called the reasoning of the Senior Examiner: \n \n―Adv. Aamna Hasan appeared and argued and submitted that. \nGoods have no reference to mark, and the mark is registered in \nvarious jurisdictions so consider as a distinctive. Thirdly sec. 11 \nis not applicable, heard, and checked the details of application, it \nappears that, total five opportunities of hearing given. As per \ndetails on record and submission made by advocate it appears \nthat, the cited marks are visually ,phonetically, and conceptually \ndifferent, so obj. u/s 11 waived, moreover obj. u/s 9 is sustain \nbecause mark as a whole is not inherently distinctive, it is a \nmere combination of an English word \"coolpoly\" which is not \ndistinctive and descriptive to applied goods of \"[CLASS-1] \nPlastic and carbon molding materials for use in the manufacture \nof molded plastic articles.[CLASS-9] Molded heat sinks for use \nin computers and parts and components therefore and molded \nelectrical conductors.\" .the mark is mere combination of word \n\"cool\" and \"poly\" hence it is not inherently distinctive, so no one \ncan claim any exclusive right over the descriptive word, until \nand unless the mark has acquired distinctiveness by long and \ncontinuous commercial use and Mark is descriptive in nature \nand has direct reference to goods applied, it has describes \nquality and intended purpose, further more it is a proposed to be \nused mark, so not having user so no acquired secondary \nmeaning. The adv. Also submitted that, the mark is registered in \nvarious jurisdiction so consider as distinctive, whereas trans-\nborder reputation or goodwill is not recognized by the Hon. \nSupreme court in landmark judgment of PRIUS. Furthermore, it \nis a well settled law that, mere combination of two known word \nor abbreviation thereof would not be an invented word, even \nthough the combination may not have been in use before, if to \nthe eyes or ear the same idea would be conveyed as by the \nwords in its ordinary form, as decided in the cases of \"E. \n                                                                                                                   \nProvided that a trade mark shall not be refused registration if before the date of \napplication for registration it has acquired a distinctive character as a result of the use made of it or \nis a well-known trade mark. \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:01.03.2023\n16:56:15\nSignature Not Verified\n\n--- PAGE 4 ---\nNeutral Citation Number : 2023/DHC/001489 \nC.A.(COMM.IPD-TM) 89/2022  \nPage 4 of 8 \n \n \nGriffiths Hughes Ltd. vs Vick Chemical Co. AND A.R. Khaleel \nAnd Sons vs Registrar of Trade Marks In India\", so upon \nconsidering the material on record, and submission made by the \nadvocate, the applicant and adv. is fail to prove the justification \nfor waving off obj. raised under sec.9 (1)(a) trade Mark Act \n1999.‖ \n \n6. \nAggrieved, the appellant has appealed to this Court. \n \n7. \nI have heard Ms. Aamna Hasan, learned Counsel for the \nappellant and Mr. Harish Vaidyanathan, learned Counsel for the \nrespondent. \n \n8. \nNone of the considerations on which the Senior Examiner has \nrejected the appellant’s application commend themselves to \nacceptance. \n \n9. \nIn the first place, the learned Senior Examiner was required to \nexamine the entitlement to registration, of the COOLPOLY mark as a \nwhole, and not by breaking it into COOL and POLY.   \n \n10. \nThe Senior Examiner has, in rejecting the appellant’s \napplication for registration of the COOLPOLY mark, proceeded on \nthe reasoning that COOLPOLY was a mere portmanteau of the words \nCOOL and POLY, each of which was descriptive of the nature of the \ngoods in respect of which registration of the mark was sought.  As \nsuch, the Senior Examiner holds that the mark was not inherently \ndistinctive as required by Section 9(1)(a) of the Trademarks Act. \n \n11. \n It is well settled that a mark cannot be dissected into its \nindividual parts while examining its entitlement to registration.  \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:01.03.2023\n16:56:15\nSignature Not Verified\n\n--- PAGE 5 ---\nNeutral Citation Number : 2023/DHC/001489 \nC.A.(COMM.IPD-TM) 89/2022  \nPage 5 of 8 \n \n \nThough Section 17(1)2 of the Trademarks Act statutory embodies this \nanti-dissection principle in the context of infringement proceedings, \nthe principle would apply, mutatis mutandis, even at the stage when \nthe mark is examined for its entitlement for registration as it is only \nthe factum of registration which brings, in its wake, the privileges that \nfollow, including protection against infringement.  \n \n12. \nSeen as a whole, it cannot be said that the word COOLPOLY \nhas any etymological meaning or significance in the English language.  \nIt is not a word of common – or, for that manner, even uncommon – \nusage, as would render it incapable of distinguishing goods of one \nperson from those of another if used as a trade mark.  Indeed, the \nimpugned order is silent as to why the mark is not distinctive.  Rather, \nthe Senior Examiner appears to have, clearly erroneously, conflated \nthe concept of lack of distinctiveness, addressed by Section 9(1)(a), \nand descriptiveness, addressed by Section 9(1)(b), and confused the \ntwo.   \n \n13. \nSection 9(1)(a) would apply only where a mark was so common \nand so lacking in distinction as would make it impossible, on the basis \nof that mark, to distinguish between the goods of one person and \ngoods of another. Common English words and phrases of everyday \nusage would fall within this category.  Such common English words \ncannot be registered as marks, unless they enjoy the benefit of the \n                                          \n2 17.  \nEffect of registration of parts of a mark. –  \n(1)  \nWhen a trade mark consists of several matters, its registration shall confer on the \nproprietor exclusive right to the use of the trade mark taken as a whole. \n(2)  \nNotwithstanding anything contained in sub-section (1), when a trade mark— \n(a)  \ncontains any part –  \n(i)  \nwhich is not the subject of a separate application by the proprietor for \nregistration as a trade mark; or \n(ii)  \nwhich is not separately registered by the proprietor as a trade mark; or \n(b)  \ncontains any matter which is common to the trade or is otherwise of a non-\ndistinctive character, \nthe registration thereof shall not confer any exclusive right in the matter forming only a part of the \nwhole of the trade mark so registered. \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:01.03.2023\n16:56:15\nSignature Not Verified\n\n--- PAGE 6 ---\nNeutral Citation Number : 2023/DHC/001489 \nC.A.(COMM.IPD-TM) 89/2022  \nPage 6 of 8 \n \n \nproviso to Section 9(1), which would apply where the mark, before the \ndate of registration, has acquired distinctiveness –in trade mark \nterminology, a ―secondary meaning‖ –  by dint of long or continuous \nuse, or is a ―well known trade mark‖ within the meaning of Section \n2(1)(zg)3 of the Trade Marks Act.    \n \n14. \nThe impugned order does not hold that COOLPOLY is a word \nof common English usage.  Indeed, as already noted, COOLPOLY has \nno meaning.  The impugned order does not cite any other mark of any \nother person, similar to ―COOLPOLY‖ or provide any reason as to \nwhy the use of the mark ―COOLPOLY‖ in respect of goods for which \nregistration was sought by the appellant would make it impossible to \ndistinguish between the said goods or any other goods available in the \nmarket. \n \n15. \nAdverting, next, to the aspect of descriptiveness, COOLPOLY, \nbeing a word with no meaning, can obviously not be regarded as \ndescriptive of the goods in respect of which registration was sought by \nthe appellant.  For that matter, it cannot be said that either of the parts \nof the mark ―COOL‖ or ―POLY‖, even seen individually, is \ndescriptive of the nature of the goods in respect of which registration \nwas sought.  Registration of the mark ―COOLPOLY‖ was sought in \nrespect of plastic and carbon moulding materials used in the \nmanufacture of moulded plastic articles and moulded heat sinks for \nuse in computers and parts and components thereof and moulded \nelectrical conductors.  The impugned order is silent as to how the \nwords ―COOL‖ and ―POLY‖ even if seen individually, are descriptive \n                                          \n3 (zg)  \n―well-known trade mark‖, in relation to any goods or services, means a mark which has become so \nto the substantial segment of the public which uses such goods or receives such services that the use of such \nmark in relation to other goods or services would be likely to be taken as indicating a connection in the course \nof trade or rendering of services between those goods or services and a person during the mark in relation to \nthe first-mentioned goods or services. \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:01.03.2023\n16:56:15\nSignature Not Verified\n\n--- PAGE 7 ---\nNeutral Citation Number : 2023/DHC/001489 \nC.A.(COMM.IPD-TM) 89/2022  \nPage 7 of 8 \n \n \nof the products in respect of which registration was sought or were \nwanting any distinctive character. \n \n16. \nThe basic prerequisites of Section 9(1)(a) do not appear to be \naddressed in the impugned order.  In a sense, the impugned order is \nunreasoned, as it merely holds, as the mere ipse dixit of the Senior \nExaminer, that the expression ―COOL‖ and ―POLY‖ were descriptive \nof the products in respect of which registration was sought.   \n \n17. \nThis Court is not inclined to agree with the said reasoning or \nconclusion.  In the opinion of the Court, \n(i) \nCOOLPOLY cannot, for examining distinctiveness, be \nvivisected into COOL and POLY, \n(ii) \nCOOLPOLY is not a word of common English usage, \n(iii) COOLPOLY, if used as a mark by one person is, \ntherefore, perfectly capable of distinguishing the goods or \nservices of that person, in respect of which the mark is used, \nfrom the goods and services of others, \n(iv) \nthe proscription against registration contained in Section \n9(1)(a) would not, therefore, apply, \n(v) \nneither COOLPOLY, nor COOL and POLY individually \nseen, are descriptive of the goods in respect of which the \nappellant sought registration of the COOLPOLY mark and \n(vi) \nthe proscription against registration contained in Section \n9(1)(b) would also, therefore, not apply. \n \n18. \nAs such, the impugned order, which is unsustainable in law or \non facts, is quashed and set aside.   \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:01.03.2023\n16:56:15\nSignature Not Verified\n\n--- PAGE 8 ---\nNeutral Citation Number : 2023/DHC/001489 \nC.A.(COMM.IPD-TM) 89/2022  \nPage 8 of 8 \n \n \n19. \nAs the application of the appellant has yet to be advertised, the \napplication is remanded to the Registrar to advertise the mark and \nproceed thereafter in accordance with the provisions of the \nTrademarks Act and the Trademarks Rule.   \n \n20. \nThe appeal stands allowed accordingly with no orders as to \ncosts. \n \n21. \nMs. Hasan prays that a direction for a time bound decision may \nbe passed.  This Court is hesitant to do so as this Court is not aware of \nthe amount of work which is pending before the Registrar.  However, \nMr. Vaidyanathan very fairly undertakes to ensure that there would be \nno delay in the matter.   \n \n22. \nLet this order be uploaded on the website of this Court within \n24 hours. \n \n \n \n \nC.HARI SHANKAR, J \nFEBRUARY 28, 2023  \nrb \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:01.03.2023\n16:56:15\nSignature Not Verified\n"
  },
  "total_pages": 8,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "According to the PDF document \"Ticona Polymers v. Registrar of Trade Marks.pdf\", the High Court of Delhi at New Delhi heard an appeal (C.A.(COMM.IPD-TM) 89/2022) filed by Ticona Polymers, Inc. against the Registrar of Trade Marks. The appeal challenged the order dated October 26, 2020, which rejected the registration of the word mark \"COOLPOLY\" under Sections 9(1)(a) and 11(1) of the Trade Marks Act, 1999.\n\nThe application for registration was filed on November 19, 2014, for use in Class 1 and Class 9 products, including plastic and carbon moulding materials and moulded heat sinks for computers. The Registrar's office initially objected to the registration, citing lack of distinctive character and similarity with existing trademarks.\n\nHowever, the Senior Examiner eventually rejected the application solely on the ground that \"COOLPOLY\" was not inherently distinctive and descriptive of the goods. The appellant argued against this decision, and the case was heard by Hon'ble Mr. Justice C. Hari Shankar on February 28, 2023.\n\nThe PDF document provides details of the legal proceedings, including the parties involved, their representatives, and the dates of key events. The case highlights the complexities of trademark registration and the importance of distinctive character in determining the registrability of a mark. (Source: Ticona Polymers v. Registrar of Trade Marks.pdf)",
      "pdf_source": "42. Ticona Polymers v. Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "According to page 1 of the PDF \"42. Ticona Polymers v. Registrar of Trade Marks.pdf\", the High Court of Delhi at New Delhi is hearing an appeal (C.A.(COMM.IPD-TM) 89/2022) filed by Ticona Polymers, Inc. against the Registrar of Trade Marks. The appeal is under Section 91 of the Trade Marks Act, 1999, and challenges an order dated October 26, 2020, rejecting the appellant's Application No. 2847019 for registration of the word mark \"COOLPOLY\" in Class 1 and Class 9. The application was filed on November 19, 2014. The case is being heard by Hon'ble Mr. Justice C. Hari Shankar, with the appellant represented by Ms. Aamna Hasan, Mr. Vaibhav Vutts, and Mr. Devadathan Jayachandran, and the respondent represented by Mr. Harish Vaidyanathan and others. The judgment was delivered orally on February 28, 2023.",
          "content": "Neutral Citation Number : 2023/DHC/001489 \nC.A.(COMM.IPD-TM) 89/2022  \nPage 1 of 8 \n \n \n$~2 \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.A.(COMM.IPD-TM) 89/2022 \n \nTICONA POLYMERS, INC.  \n \n    ..... Appellant \nThrough: \nMs. \nAamna \nHasan, \nMr. \nVaibhav \nVutts \nand \nMr. \nDevadathan \nJayachandran, Advs. \n \n \n \n \n \nversus \n \n \nREGISTRAR OF TRADE MARKS  \n    ..... Respondent \nThrough: \nMr. \nHarish \nVaidyanathan, \nCGSC with Mr. Srish Kumar Mishra, Mr \nSagar Mehlawat, Mr. Alexander Mathai \nPaikaday, Advs. \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C.HARI SHANKAR \n \n \n \n \nJUDGMENT (ORAL) \n% \n \n \n \n         28.02.2023 \n \n1. \nThis appeal, under Section 91 of the Trade Marks Act, 1999, \nassails order dated 26th October 2020 passed by the Senior Examiner \nin the office of the Registrar of Trade Marks, whereby Application \nNo. 2847019, filed by the appellant for registration of the word mark \n―COOLPOLY‖, in (i) Class 1 in respect of plastic and carbon \nmoulding materials for use in the manufacture of moulded plastic \narticles and (ii) Class 9 in respect of moulded heat sinks for use in \ncomputers and parts and components thereof and moulded electrical \nconductors, was rejected. \n \n2. \nApplication No. 2847019 was filed by the appellant on 19th \nNovember 2014.  Consequent to a preliminary scrutiny, First \nExamination Report (FER) dated 13th January 2016 was issued by the \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:01.03.2023\n16:56:15\nSignature Not Verified",
          "pdf_source": "42. Ticona Polymers v. Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "According to page 2 of the PDF \"42. Ticona Polymers v. Registrar of Trade Marks.pdf\", the Registrar of Trade Marks objected to the registration of the mark \"COOLPOLY\" under Sections 9(1)(a) and 11(1) of the Trade Marks Act. The objections included that the mark lacked distinctive character and was similar to existing trademarks. The Senior Examiner rejected the application, stating that \"COOLPOLY\" was a descriptive combination of \"COOL\" and \"POLY\" and not inherently distinctive. The appellant, Ticona Polymers, Inc., was represented by Ms. Aamna Hasan, among others. The case is listed as C.A.(COMM.IPD-TM) 89/2022 with a Neutral Citation Number: 2023/DHC/001489. The decision was digitally signed by Sunil Singh Negi on March 1, 2023. (Source: PDF \"42. Ticona Polymers v. Registrar of Trade Marks.pdf\", page 2)",
          "content": "Neutral Citation Number : 2023/DHC/001489 \nC.A.(COMM.IPD-TM) 89/2022  \nPage 2 of 8 \n \n \nRegistrar, objecting to the registration of the aforesaid mark \nCOOLPOLY under Sections 9(1)(a)1 and 11(1) (though not expressly \nquoted) of the Trade Marks Act.  The objections in the FER read thus: \n \n―1.  The trade marks which are devoid of any distinctive \ncharacter, that is to say, not capable of distinguishing the goods \nor services of one person from those of another person; \n \n2.  \nThe Trade Mark application is open to objection on \nrelative grounds of refusal under Section 11 of the Act because \nthe same/similar trade mark(s) is/are already on record of the \nregister for the same or similar goods/services.  The detail of \nsame/similar trade marks is enclosed herewith  \n \nSave as provided in Sec. 12, a trade mark shall not be \nregistered if, because of-its identity with an earlier trade mark \nand similarity of goods or services covered by; the trade mark; \nor its similarity to an earlier trade mark and the identity or \nsimilarity of the goods or services covered by the trade mark,‖ \n \n3. \n Additionally, the FER required the appellant to file the duly \nstamped TM-48 which, Ms. Aamna Hasan submits, was filed. \n \n4. \nOf the aforesaid two objections raised in the FER, the impugned \norder has dropped the objections predicated on Sections 11 and 12.  \nThe Senior Examiner proceeds, thereafter, to reject the appellant’s \napplication on the ground that  \n(i) \nCOOLPOLY was merely a combination of the two \nEnglish words COOL and POLY, \n(ii) \nCOOLPOLY, as a whole, was not inherently distinctive,  \n(iii) the mark was, on the other hand, descriptive of the goods \nin respect of which its registration was sought, and \n                                          \n1 9.  \nAbsolute grounds for refusal of registration. –   \n(1)  \nThe trade marks –  \n(a)  \nwhich are devoid of any distinctive character, that is to say, not capable of \ndistinguishing the goods or services of one person from those of another person; \n***** \n \nshall not be registered. \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:01.03.2023\n16:56:15\nSignature Not Verified",
          "pdf_source": "42. Ticona Polymers v. Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0006",
      "start_index": 3,
      "end_index": 4,
      "summary": "According to the PDF document \"Ticona Polymers v. Registrar of Trade Marks.pdf\", a legal proceeding is ongoing in the High Court of Delhi at New Delhi, with case number C.A.(COMM.IPD-TM) 89/2022. The appellant, Ticona Polymers, Inc., is represented by Ms. Aamna Hasan, Mr. Vaibhav Vutts, and Mr. Devadathan Jayachandran, while the respondent, Registrar of Trade Marks, is represented by Mr. Harish Vaidyanathan and others.\n\nThe Background and Facts section reveals that the Senior Examiner rejected the appellant's application for registration of the trademark \"COOLPOLY\" under Section 9(1)(a) of the Trade Mark Act 1999, citing that the mark is not inherently distinctive and is a combination of descriptive words \"cool\" and \"poly\". The examiner also noted that the mark had not acquired secondary meaning as it was proposed to be used and had no trans-border reputation.\n\nThe appellant argued that the mark is distinctive and has been registered in various jurisdictions. However, the Senior Examiner relied on precedents, including \"E. Griffiths Hughes Ltd. vs Vick Chemical Co.\" and \"A.R. Khaleel And Sons vs Registrar of Trade Marks In India\", to support the decision.\n\nThe appeal is now before the High Court, with the appellant challenging the rejection of their application. The court has heard arguments from both parties, and the decision is pending. The PDF document, dated March 1, 2023, provides details of the legal proceedings, including the Neutral Citation Number: 2023/DHC/001489.",
      "pdf_source": "42. Ticona Polymers v. Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "According to page 3 of the PDF \"42. Ticona Polymers v. Registrar of Trade Marks.pdf\", the Senior Examiner rejected the registration of the trademark \"COOLPOLY\" citing that it is descriptive and not inherently distinctive. The Examiner found that the mark is a combination of the English words \"cool\" and \"poly\", which describes the quality and intended purpose of the goods. The applicant's argument that the mark is registered in various jurisdictions was dismissed, as trans-border reputation or goodwill is not recognized by the Supreme Court. The Examiner also noted that the mark was applied for on a \"proposed to be used\" basis and had not acquired any secondary meaning. The case is C.A.(COMM.IPD-TM) 89/2022, with the appellant Ticona Polymers, Inc. represented by Ms. Aamna Hasan, among others, and the respondent Registrar of Trade Marks represented by Mr. Harish Vaidyanathan, among others.",
          "content": "Neutral Citation Number : 2023/DHC/001489 \nC.A.(COMM.IPD-TM) 89/2022  \nPage 3 of 8 \n \n \n(iv) \nas registration was sought on a ―proposed to be used‖ \nbasis, it had not acquired any secondary meaning. \n(It is not clear from the impugned order, which is extremely clumsily \nwritten and worded, whether the Senior Examiner finds COOLPOLY \nas a whole to be descriptive or whether she finds COOL and POLY \nindividually to be descriptive.)  \n  \n5. \nThe following passage from the impugned order contains what \nmay be called the reasoning of the Senior Examiner: \n \n―Adv. Aamna Hasan appeared and argued and submitted that. \nGoods have no reference to mark, and the mark is registered in \nvarious jurisdictions so consider as a distinctive. Thirdly sec. 11 \nis not applicable, heard, and checked the details of application, it \nappears that, total five opportunities of hearing given. As per \ndetails on record and submission made by advocate it appears \nthat, the cited marks are visually ,phonetically, and conceptually \ndifferent, so obj. u/s 11 waived, moreover obj. u/s 9 is sustain \nbecause mark as a whole is not inherently distinctive, it is a \nmere combination of an English word \"coolpoly\" which is not \ndistinctive and descriptive to applied goods of \"[CLASS-1] \nPlastic and carbon molding materials for use in the manufacture \nof molded plastic articles.[CLASS-9] Molded heat sinks for use \nin computers and parts and components therefore and molded \nelectrical conductors.\" .the mark is mere combination of word \n\"cool\" and \"poly\" hence it is not inherently distinctive, so no one \ncan claim any exclusive right over the descriptive word, until \nand unless the mark has acquired distinctiveness by long and \ncontinuous commercial use and Mark is descriptive in nature \nand has direct reference to goods applied, it has describes \nquality and intended purpose, further more it is a proposed to be \nused mark, so not having user so no acquired secondary \nmeaning. The adv. Also submitted that, the mark is registered in \nvarious jurisdiction so consider as distinctive, whereas trans-\nborder reputation or goodwill is not recognized by the Hon. \nSupreme court in landmark judgment of PRIUS. Furthermore, it \nis a well settled law that, mere combination of two known word \nor abbreviation thereof would not be an invented word, even \nthough the combination may not have been in use before, if to \nthe eyes or ear the same idea would be conveyed as by the \nwords in its ordinary form, as decided in the cases of \"E. \n                                                                                                                   \nProvided that a trade mark shall not be refused registration if before the date of \napplication for registration it has acquired a distinctive character as a result of the use made of it or \nis a well-known trade mark. \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:01.03.2023\n16:56:15\nSignature Not Verified",
          "pdf_source": "42. Ticona Polymers v. Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "According to page 4 of the PDF \"42. Ticona Polymers v. Registrar of Trade Marks.pdf\", the Senior Examiner rejected the appellant's application for registration of the COOLPOLY mark, citing that it was a mere portmanteau of descriptive words COOL and POLY. The Examiner held that the mark was not inherently distinctive as required by Section 9(1)(a) of the Trademarks Act. The appellant, Ticona Polymers, Inc., appealed to the High Court of Delhi, which heard arguments from Ms. Aamna Hasan for the appellant and Mr. Harish Vaidyanathan for the respondent. The Court noted that the Examiner should have examined the entitlement to registration of the COOLPOLY mark as a whole, rather than breaking it down into individual parts. The case is C.A.(COMM.IPD-TM) 89/2022, with a Neutral Citation Number of 2023/DHC/001489.",
          "content": "Neutral Citation Number : 2023/DHC/001489 \nC.A.(COMM.IPD-TM) 89/2022  \nPage 4 of 8 \n \n \nGriffiths Hughes Ltd. vs Vick Chemical Co. AND A.R. Khaleel \nAnd Sons vs Registrar of Trade Marks In India\", so upon \nconsidering the material on record, and submission made by the \nadvocate, the applicant and adv. is fail to prove the justification \nfor waving off obj. raised under sec.9 (1)(a) trade Mark Act \n1999.‖ \n \n6. \nAggrieved, the appellant has appealed to this Court. \n \n7. \nI have heard Ms. Aamna Hasan, learned Counsel for the \nappellant and Mr. Harish Vaidyanathan, learned Counsel for the \nrespondent. \n \n8. \nNone of the considerations on which the Senior Examiner has \nrejected the appellant’s application commend themselves to \nacceptance. \n \n9. \nIn the first place, the learned Senior Examiner was required to \nexamine the entitlement to registration, of the COOLPOLY mark as a \nwhole, and not by breaking it into COOL and POLY.   \n \n10. \nThe Senior Examiner has, in rejecting the appellant’s \napplication for registration of the COOLPOLY mark, proceeded on \nthe reasoning that COOLPOLY was a mere portmanteau of the words \nCOOL and POLY, each of which was descriptive of the nature of the \ngoods in respect of which registration of the mark was sought.  As \nsuch, the Senior Examiner holds that the mark was not inherently \ndistinctive as required by Section 9(1)(a) of the Trademarks Act. \n \n11. \n It is well settled that a mark cannot be dissected into its \nindividual parts while examining its entitlement to registration.  \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:01.03.2023\n16:56:15\nSignature Not Verified",
          "pdf_source": "42. Ticona Polymers v. Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0009",
      "start_index": 5,
      "end_index": 6,
      "summary": "According to the PDF document \"Ticona Polymers v. Registrar of Trade Marks.pdf\", the legal proceedings are between Ticona Polymers, Inc. (Appellant) and Registrar of Trade Marks (Respondent) with case number C.A.(COMM.IPD-TM) 89/2022. The Neutral Citation Number is 2023/DHC/001489.\n\nThe Appellant argued that the Respondent erred in not registering the trade mark \"COOLPOLY\" under Section 9(1)(a) of the Trademarks Act. The Appellant's counsel, Ms. Aamna Hasan, Mr. Vaibhav Vutts, and Mr. Devadathan Jayachandran, claimed that the mark is distinctive and not descriptive of the goods.\n\nThe Respondent's Senior Examiner had conflated the concept of lack of distinctiveness and descriptiveness, which are addressed by Sections 9(1)(a) and 9(1)(b) respectively. The Appellant argued that \"COOLPOLY\" has no etymological meaning or significance in the English language and is not a word of common usage.\n\nThe document also references Section 17(1)2 of the Trademarks Act, which embodies the anti-dissection principle, and Section 2(1)(zg)3, which defines a \"well-known trade mark\". The Appellant claimed that the Respondent did not provide any reason why the mark \"COOLPOLY\" would make it impossible to distinguish between goods.\n\nThe case was digitally signed by Sunil Singh Negi on March 1, 2023. The PDF document provides further details on the legal arguments and proceedings. (Source: Ticona Polymers v. Registrar of Trade Marks.pdf)",
      "pdf_source": "42. Ticona Polymers v. Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 5",
          "node_id": "0007",
          "start_index": 5,
          "end_index": 5,
          "summary": "According to page 5 of the PDF \"42. Ticona Polymers v. Registrar of Trade Marks.pdf\", the court discusses the anti-dissection principle in trademark registration. The principle, embodied in Section 17(1) of the Trademarks Act, applies to both infringement proceedings and registration examinations. The court argues that the mark \"COOLPOLY\" has no etymological meaning and is not a common word, making it distinctive. The Senior Examiner mistakenly conflated lack of distinctiveness (Section 9(1)(a)) with descriptiveness (Section 9(1)(b)). The court references Section 17(1) and Section 9(1)(a) to support its argument. The case, C.A.(COMM.IPD-TM) 89/2022, is ongoing in the High Court of Delhi. The PDF document is dated March 1, 2023, and is signed by Sunil Singh Negi. (Source: \"42. Ticona Polymers v. Registrar of Trade Marks.pdf\", page 5)",
          "content": "Neutral Citation Number : 2023/DHC/001489 \nC.A.(COMM.IPD-TM) 89/2022  \nPage 5 of 8 \n \n \nThough Section 17(1)2 of the Trademarks Act statutory embodies this \nanti-dissection principle in the context of infringement proceedings, \nthe principle would apply, mutatis mutandis, even at the stage when \nthe mark is examined for its entitlement for registration as it is only \nthe factum of registration which brings, in its wake, the privileges that \nfollow, including protection against infringement.  \n \n12. \nSeen as a whole, it cannot be said that the word COOLPOLY \nhas any etymological meaning or significance in the English language.  \nIt is not a word of common – or, for that manner, even uncommon – \nusage, as would render it incapable of distinguishing goods of one \nperson from those of another if used as a trade mark.  Indeed, the \nimpugned order is silent as to why the mark is not distinctive.  Rather, \nthe Senior Examiner appears to have, clearly erroneously, conflated \nthe concept of lack of distinctiveness, addressed by Section 9(1)(a), \nand descriptiveness, addressed by Section 9(1)(b), and confused the \ntwo.   \n \n13. \nSection 9(1)(a) would apply only where a mark was so common \nand so lacking in distinction as would make it impossible, on the basis \nof that mark, to distinguish between the goods of one person and \ngoods of another. Common English words and phrases of everyday \nusage would fall within this category.  Such common English words \ncannot be registered as marks, unless they enjoy the benefit of the \n                                          \n2 17.  \nEffect of registration of parts of a mark. –  \n(1)  \nWhen a trade mark consists of several matters, its registration shall confer on the \nproprietor exclusive right to the use of the trade mark taken as a whole. \n(2)  \nNotwithstanding anything contained in sub-section (1), when a trade mark— \n(a)  \ncontains any part –  \n(i)  \nwhich is not the subject of a separate application by the proprietor for \nregistration as a trade mark; or \n(ii)  \nwhich is not separately registered by the proprietor as a trade mark; or \n(b)  \ncontains any matter which is common to the trade or is otherwise of a non-\ndistinctive character, \nthe registration thereof shall not confer any exclusive right in the matter forming only a part of the \nwhole of the trade mark so registered. \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:01.03.2023\n16:56:15\nSignature Not Verified",
          "pdf_source": "42. Ticona Polymers v. Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "According to page 6 of the PDF \"42. Ticona Polymers v. Registrar of Trade Marks.pdf\", the court discusses the registrability of the trade mark \"COOLPOLY\" under the Trade Marks Act. The impugned order does not hold that \"COOLPOLY\" is a word of common English usage, nor does it cite any similar marks. The court argues that \"COOLPOLY\" is not descriptive of the goods for which registration was sought, including plastic and carbon moulding materials. The mark's components, \"COOL\" and \"POLY\", are also not descriptive of the goods. The case is C.A.(COMM.IPD-TM) 89/2022, with the appellant Ticona Polymers, Inc. and the respondent Registrar of Trade Marks. TheNeutral Citation Number is 2023/DHC/001489.",
          "content": "Neutral Citation Number : 2023/DHC/001489 \nC.A.(COMM.IPD-TM) 89/2022  \nPage 6 of 8 \n \n \nproviso to Section 9(1), which would apply where the mark, before the \ndate of registration, has acquired distinctiveness –in trade mark \nterminology, a ―secondary meaning‖ –  by dint of long or continuous \nuse, or is a ―well known trade mark‖ within the meaning of Section \n2(1)(zg)3 of the Trade Marks Act.    \n \n14. \nThe impugned order does not hold that COOLPOLY is a word \nof common English usage.  Indeed, as already noted, COOLPOLY has \nno meaning.  The impugned order does not cite any other mark of any \nother person, similar to ―COOLPOLY‖ or provide any reason as to \nwhy the use of the mark ―COOLPOLY‖ in respect of goods for which \nregistration was sought by the appellant would make it impossible to \ndistinguish between the said goods or any other goods available in the \nmarket. \n \n15. \nAdverting, next, to the aspect of descriptiveness, COOLPOLY, \nbeing a word with no meaning, can obviously not be regarded as \ndescriptive of the goods in respect of which registration was sought by \nthe appellant.  For that matter, it cannot be said that either of the parts \nof the mark ―COOL‖ or ―POLY‖, even seen individually, is \ndescriptive of the nature of the goods in respect of which registration \nwas sought.  Registration of the mark ―COOLPOLY‖ was sought in \nrespect of plastic and carbon moulding materials used in the \nmanufacture of moulded plastic articles and moulded heat sinks for \nuse in computers and parts and components thereof and moulded \nelectrical conductors.  The impugned order is silent as to how the \nwords ―COOL‖ and ―POLY‖ even if seen individually, are descriptive \n                                          \n3 (zg)  \n―well-known trade mark‖, in relation to any goods or services, means a mark which has become so \nto the substantial segment of the public which uses such goods or receives such services that the use of such \nmark in relation to other goods or services would be likely to be taken as indicating a connection in the course \nof trade or rendering of services between those goods or services and a person during the mark in relation to \nthe first-mentioned goods or services. \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:01.03.2023\n16:56:15\nSignature Not Verified",
          "pdf_source": "42. Ticona Polymers v. Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0012",
      "start_index": 7,
      "end_index": 8,
      "summary": "According to the PDF document \"Ticona Polymers v. Registrar of Trade Marks.pdf\", the High Court of Delhi at New Delhi made a decision in the case C.A.(COMM.IPD-TM) 89/2022. The appellant, Ticona Polymers, Inc., was represented by Ms. Aamna Hasan, Mr. Vaibhav Vutts, and Mr. Devadathan Jayachandran, while the respondent, Registrar of Trade Marks, was represented by Mr. Harish Vaidyanathan. \n\nThe court decided that the expression \"COOLPOLY\" is capable of distinguishing the goods or services of the appellant and is not descriptive of the products in respect of which registration was sought. The court quashed and set aside the impugned order, which had rejected the appellant's application for trademark registration. \n\nThe court remanded the application to the Registrar to advertise the mark and proceed in accordance with the Trademarks Act and Rules. The appeal was allowed with no orders as to costs. The court also directed that the order be uploaded on the website of the court within 24 hours. The decision was made by Justice C. Hari Shankar on February 28, 2023. The digitally signed document was verified on March 1, 2023. The source of this information is the PDF document \"Ticona Polymers v. Registrar of Trade Marks.pdf\", specifically pages 1-8, with Neutral Citation Number 2023/DHC/001489.",
      "pdf_source": "42. Ticona Polymers v. Registrar of Trade Marks.pdf",
      "nodes": [
        {
          "title": "Page 7",
          "node_id": "0010",
          "start_index": 7,
          "end_index": 7,
          "summary": "According to page 7 of the PDF \"42. Ticona Polymers v. Registrar of Trade Marks.pdf\", the High Court of Delhi ruled in favor of the appellant, Ticona Polymers, Inc. The court disagreed with the Registrar of Trade Marks' decision to reject the registration of the trademark \"COOLPOLY\". The court held that \"COOLPOLY\" is not descriptive of the goods and is capable of distinguishing the appellant's goods from others. The court quashed and set aside the impugned order, citing that the prerequisites of Section 9(1)(a) were not addressed. The decision was made on March 1, 2023, by Judge Sunil Singh Negi. The case number is C.A.(COMM.IPD-TM) 89/2022. The court's decision overturns the rejection of the trademark registration, allowing Ticona Polymers to proceed with registering \"COOLPOLY\" as a trademark.",
          "content": "Neutral Citation Number : 2023/DHC/001489 \nC.A.(COMM.IPD-TM) 89/2022  \nPage 7 of 8 \n \n \nof the products in respect of which registration was sought or were \nwanting any distinctive character. \n \n16. \nThe basic prerequisites of Section 9(1)(a) do not appear to be \naddressed in the impugned order.  In a sense, the impugned order is \nunreasoned, as it merely holds, as the mere ipse dixit of the Senior \nExaminer, that the expression ―COOL‖ and ―POLY‖ were descriptive \nof the products in respect of which registration was sought.   \n \n17. \nThis Court is not inclined to agree with the said reasoning or \nconclusion.  In the opinion of the Court, \n(i) \nCOOLPOLY cannot, for examining distinctiveness, be \nvivisected into COOL and POLY, \n(ii) \nCOOLPOLY is not a word of common English usage, \n(iii) COOLPOLY, if used as a mark by one person is, \ntherefore, perfectly capable of distinguishing the goods or \nservices of that person, in respect of which the mark is used, \nfrom the goods and services of others, \n(iv) \nthe proscription against registration contained in Section \n9(1)(a) would not, therefore, apply, \n(v) \nneither COOLPOLY, nor COOL and POLY individually \nseen, are descriptive of the goods in respect of which the \nappellant sought registration of the COOLPOLY mark and \n(vi) \nthe proscription against registration contained in Section \n9(1)(b) would also, therefore, not apply. \n \n18. \nAs such, the impugned order, which is unsustainable in law or \non facts, is quashed and set aside.   \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:01.03.2023\n16:56:15\nSignature Not Verified",
          "pdf_source": "42. Ticona Polymers v. Registrar of Trade Marks.pdf",
          "nodes": []
        },
        {
          "title": "Page 8",
          "node_id": "0011",
          "start_index": 8,
          "end_index": 8,
          "summary": "According to page 8 of the PDF \"42. Ticona Polymers v. Registrar of Trade Marks.pdf\", the High Court of Delhi at New Delhi made a decision on the appeal C.A.(COMM.IPD-TM) 89/2022. The application of Ticona Polymers, Inc. is remanded to the Registrar to advertise the mark and proceed according to the Trademarks Act and Rules. The appeal is allowed with no orders as to costs. The Court declined to set a time-bound decision but Mr. Vaidyanathan undertook to ensure no delay. The order was to be uploaded on the Court's website within 24 hours. The decision was made by Justice C. Hari Shankar on February 28, 2023. The PDF document is a court record with a Neutral Citation Number: 2023/DHC/001489.",
          "content": "Neutral Citation Number : 2023/DHC/001489 \nC.A.(COMM.IPD-TM) 89/2022  \nPage 8 of 8 \n \n \n19. \nAs the application of the appellant has yet to be advertised, the \napplication is remanded to the Registrar to advertise the mark and \nproceed thereafter in accordance with the provisions of the \nTrademarks Act and the Trademarks Rule.   \n \n20. \nThe appeal stands allowed accordingly with no orders as to \ncosts. \n \n21. \nMs. Hasan prays that a direction for a time bound decision may \nbe passed.  This Court is hesitant to do so as this Court is not aware of \nthe amount of work which is pending before the Registrar.  However, \nMr. Vaidyanathan very fairly undertakes to ensure that there would be \nno delay in the matter.   \n \n22. \nLet this order be uploaded on the website of this Court within \n24 hours. \n \n \n \n \nC.HARI SHANKAR, J \nFEBRUARY 28, 2023  \nrb \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:01.03.2023\n16:56:15\nSignature Not Verified",
          "pdf_source": "42. Ticona Polymers v. Registrar of Trade Marks.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-15T18:41:07.759479",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}