{
  "doc_name": "43. Twentieth Century Fox Film Corporation v. The Registrar",
  "pdf_source": "43. Twentieth Century Fox Film Corporation v. The Registrar.pdf",
  "metadata": {
    "document_name": "43. Twentieth Century Fox Film Corporation v. The Registrar",
    "source_pdf": "43. Twentieth Century Fox Film Corporation v. The Registrar.pdf",
    "judges": [
      "C.HARI SHANKAR"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "162/2022",
      "162/2022",
      "162/2022",
      "162/2022",
      "162/2022",
      "162/2022",
      "162/2022",
      "162/2022",
      "162/2022",
      "21666/2022",
      "21667/2022"
    ],
    "dhc_numbers": [
      "2023/DHC/001444",
      "2023/DHC/001444",
      "2023/DHC/001444",
      "2023/DHC/001444",
      "2023/DHC/001444",
      "2023/DHC/001444",
      "2023/DHC/001444",
      "2023/DHC/001444"
    ],
    "ia_numbers": [],
    "decision_date": "13 September, 2022",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [],
    "defendants": [
      "The Registrar"
    ],
    "appellants": [
      "Twentieth Century Fox Film Corporation"
    ],
    "respondents": [
      "The Registrar"
    ],
    "plaintiff_advocates": [],
    "defendant_advocates": [
      "Mr. Harish Vaidyanathan Shankar",
      "Mr. R. M. Tripathi"
    ],
    "appellant_advocates": [
      "Mr. Prithvi Singh"
    ],
    "respondent_advocates": [
      "Mr. Harish Vaidyanathan Shankar",
      "Mr. R. M. Tripathi"
    ],
    "damages_claimed": null,
    "damages_awarded": null,
    "key_issues": [
      "Registration of a trademark under the Trade Marks Act, 1999, is being contested due to alleged similarity with earlier marks.",
      "The appellant's mark is deemed deceptively similar to an earlier mark registered in favor of Mr. Avathar Varatharajan under Section 11(1) of the Trade Marks Act.",
      "Section 25(3) of the Trade Marks Act is cited as one of the earlier marks was not renewed and is deemed statutorily abandoned.",
      "The likelihood of confusion between the appellant's mark and the earlier mark is a key issue, with the appellant arguing that the overall impression conveyed by the two marks is completely different.",
      "Section 17 of the Trade Marks Act is relevant, as it requires rival marks to be seen as a whole without vivisecting them into individual components.",
      "The difference in goods for which the marks are registered is also a point of contention, with the appellant arguing that their goods are distinct from those associated with the earlier mark.",
      "The use of the mark for promotional purposes, specifically for the movie AVATAR, is a factor in the appellant's case for registration.",
      "The Senior Examiner's rejection of the appellant's defense under Section 11(1) of the Trade Marks Act is being appealed, with the appellant seeking to overturn the decision.",
      "The visual and phonetic distinctness of the appellant's mark from the earlier mark is a crucial aspect of the case, with the appellant arguing that their mark is uniquely recognizable."
    ],
    "decision_summary": "**Case Summary: Twentieth Century Fox Film Corporation v. The Registrar**\n\n**Background:**\nTwentieth Century Fox Film Corporation (the appellant) filed an application for the registration of the mark (the proposed mark) in Class 14, which includes various goods such as jewelry, watches, and clocks. The application was submitted on a proposed-to-be-used basis, with the intention of using the mark to promote the movie \"AVATAR,\" released in December 2022.\n\n**Legal Issues:**\nThe Trade Marks Registry, New Delhi, rejected the application, citing Section 11(1) of the Trade Marks Act, 1999, which states that a trade mark shall not be registered if it is similar to an earlier trade mark and the goods or services covered by the trade mark are identical or similar. The Registry cited two earlier marks, registered in favor of Mr. A. Shrivinasan and Mr. Avathar Varatharajan, as being deceptively similar to the proposed mark.\n\n**Arguments:**\nThe appellant argued that:\n\n1. The proposed mark was phonetically and visually distinct from the cited marks.\n2. The overall impression conveyed by the two marks was completely different, and there was no likelihood of confusion.\n3. The goods in respect of which the cited marks were registered were different from the goods in respect of which the appellant sought registration of its mark.\n4. The proposed mark was intended to promote the movie \"AVATAR,\" which was a unique and distinctive identifier.\n\nThe respondent (The Registrar) argued that the proposed mark was deceptively similar to the cited mark registered in favor of Mr. Avathar Varatharajan, and that the similarity was likely to result in confusion.\n\n**Court Findings:**\nThe High Court of Delhi, after hearing the arguments of both parties, considered the following:\n\n1. The earlier mark registered in favor of Mr. A. Shrivinasan was not renewed and was deemed statutorily abandoned under Section 25(3) of the Trade Marks Act.\n2. The only ground for refusing registration of the proposed mark was its deceptive similarity to the mark registered in favor of Mr. Avathar Varatharajan.\n\n**Decision:**\nThe court's decision is not explicitly stated in the provided text, as the judgment is incomplete. However, based on the arguments and findings, the court is expected to consider the similarity between the proposed mark and the cited mark, as well as the potential for confusion among consumers. The court may also consider the distinctive character of the proposed mark and its intended use in promoting the movie \"AVATAR.\" Ultimately, the court will decide whether the proposed mark can be registered under the Trade Marks Act, 1999.",
    "legal_precedents": [
      "AIR 1960 SC 142"
    ],
    "full_text": "\n--- PAGE 1 ---\nNeutral Citation Number : 2023/DHC/001444 \n C.A.(COMM.IPD-TM) 162/2022                                                                                           Page 1 of 8  \n \n   \n$~2 \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.A.(COMM.IPD-TM) 162/2022, I.A. 21666/2022 (Section 151 of \nthe CPC) and I.A. 21667/2022 (Order XLI Rule 27 of the CPC) \n \n \nTWENTIETH CENTURY FOX \nFILM CORPORATION  \n \n \n \n..... Appellant \n \n \n \n \nThrough: \nMr. Prithvi Singh, Adv. \n \n \n \n \n \nversus \n \n \nTHE REGISTRAR \n \n \n \n       \n..... Respondent \nThrough: \nMr. Harish Vaidyanathan Shankar, \nCGSC with Mr. R. M. Tripathi, Govt. Pleader \n \nCORAM: \n \nHON'BLE MR. JUSTICE C.HARI SHANKAR \n \n \n \n \nJUDGMENT (ORAL) \n% \n \n \n \n         27.02.2023 \n \n \n1. \nThis appeal under Section 91 of the Trade Marks Act assails order \ndated 13th September 2022, passed by the Senior Examiner of Trade \nMarks in the office of the Trade Marks Registry, New Delhi, rejecting \nApplication No. 4280126 submitted by the appellant for registration of \nthe \n mark, in Class 14, for ―Alarm clocks; bracelets; busts of \nprecious metal; charms; clocks; earrings; jewellery; jewellery cases of \nprecious metal; jewellery boxes not of precious metal; jewellery chains; \ndecorative key fobs; key chains; key rings; lapel pins; neck chains; \nnecklaces; necktie fasteners; nonmonetary coins; ornamental lapel pins; \npendants; rings; stop watches; tie clips; tie fasteners; tie tacks; wall \nclocks; watch bands; watch cases; watch chains; watch straps; watches; \nwedding bands; wrist watches on proposed to be used basis‖. \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:28.02.2023\n15:39:40\nSignature Not Verified\n\n--- PAGE 2 ---\nNeutral Citation Number : 2023/DHC/001444 \n C.A.(COMM.IPD-TM) 162/2022                                                                                           Page 2 of 8  \n \n   \n2. \nConsequent to submission of the aforesaid application by the \nappellant, the office of the trademark Registry issued First Examination \nReport (FER) dated 25th September 2019, objecting to the registration of \nthe proposed mark under Section 11(1) of the Trade Marks Act, 1999, on \nthe ground that it was deceptively similar to two earlier marks.  The two \nmarks which were cited were (i) \n, registered in favour of Mr. \nA. Shrivinasan and (ii) \n, registered in favour of Mr. Avathar \nVaratharajan. \n \n3. \nOf these two marks, the former mark was not renewed and, \naccordingly, was deemed to be statutorily abandoned under Section 25(3) \nof the Trade Marks Act. \n \n4. \nThe appellant, in its reply dated 19th October 2019 to the FER, \nsubmitted that (i) the appellant’s mark was phonetically and visually \ndistinct from the cited \n mark, (ii) the overall impression \nconveyed by the two marks was completely different and there was, \ntherefore, no likelihood of confusion, (iii) Section 17 of the Trade Marks \nAct required the rival marks to be seen as a whole, without vivisecting \nthe marks into their individual components, (iv)  the goods in respect of \nwhich the cited \n was registered were also different from \nthe goods in respect of which the appellant sought registration of its \nmark. \n \n5. \nMr. Prithvi Singh, learned Counsel for the appellant submits, \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:28.02.2023\n15:39:40\nSignature Not Verified\n\n--- PAGE 3 ---\nNeutral Citation Number : 2023/DHC/001444 \n C.A.(COMM.IPD-TM) 162/2022                                                                                           Page 3 of 8  \n \n   \nmoreover, that the goods in respect of which the registration of the \nappellant’s mark was sought were essentially towards promotion of the \nmovie AVATAR which was released in December 2022. \n \n6. \nThe Senior Examiner, by the impugned order dated 13th September \n2022, rejected the aforesaid defence put up by the appellant and \ndisallowed registration of the appellant’s mark under Section 11(1)1 of \nthe Trade Marks Act on the ground that it was visually and phonetically \nsimilar to the cited \nmark. \n \n7. \nAggrieved thereby, the appellant has approached this Court by \nmeans of the present appeal. \n \n8. \nI have heard Mr. Prithvi Singh, learned Counsel for the appellant \nand Mr. Harish Vaidyanathan Shankar, learned Counsel for the \nrespondent at some length. \n \n9. \nThe only ground on which registration of the \nmark of \nthe appellant has been refused, is that it is deceptively similar to the \n mark registered in favour of Mr. Avathar Varatharajan and \nthat the similarity was likely to result in confusion. \n                                          \n1 11.  \nRelative grounds for refusal of registration. –  \n(1)  \nSave as provided in Section 12, a trade mark shall not be registered if, because of— \n(a)  \nits identity with an earlier trade mark and similarity of goods or services covered by \nthe trade mark; or \n(b)  \nits similarity to an earlier trade mark and the identity or similarity of the goods or \nservices covered by the trade mark, \nthere exists a likelihood of confusion on the part of the public, which includes the likelihood of \nassociation with the earlier trade mark. \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:28.02.2023\n15:39:40\nSignature Not Verified\n\n--- PAGE 4 ---\nNeutral Citation Number : 2023/DHC/001444 \n C.A.(COMM.IPD-TM) 162/2022                                                                                           Page 4 of 8  \n \n   \n \n10. \nIt is clear, from a bare reading of Section 11(1) that mere identity \nor similarity of the mark of which registration is sought, and the earlier \nmark, is not sufficient as a ground to reject the application seeking \nregistration. Section 11(1) has two clauses. Clause (a) envisages a \nsituation in which applicant’s mark is identical to the earlier trademark \nand registration is sought in respect of similar goods and services.  \nClause (b) envisages a situation in which the applicant’s mark is similar \nto an earlier trade mark and the goods and services covered by the two \nmarks are identical or similar.  In either case, a third condition is required \nto be satisfied, which is that, owing to the identity or similarity between \nthe applicant’s mark and the cited mark, and the identity of similarity \nbetween the goods covered under two marks, there exists a likelihood of \nconfusion on the part of the public, which would include a likelihood of \nassociation with the earlier trade mark.  \n \n11. \nIn examining sustainability of the objections raised in the FER, the \nSenior Examiner was required, therefore, to assess whether (i) the \nappellant’s mark was identical or similar to the earlier cited mark \n, (ii) whether the goods and services covered by the two \nmarks were identical or similar and (iii) whether, because of these \nfactors, a likelihood of confusion on the part of the public existed. \n \n12. \nApplying these tests to the case at hand, the position that emerges \nis, as I find, thus: \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:28.02.2023\n15:39:40\nSignature Not Verified\n\n--- PAGE 5 ---\nNeutral Citation Number : 2023/DHC/001444 \n C.A.(COMM.IPD-TM) 162/2022                                                                                           Page 5 of 8  \n \n   \n(i) \nIt cannot be said that the applicant’s \n mark is \nidentical or similar to the cited \n mark.  No doubt, the \ntwo marks are phonetically similar and, perhaps, even identical. \nHowever, mere phonetic similarity is insufficient to render the \nmarks identical or similar within the meaning of Section 11(1).  \nThe identity or similarity has to be such as would result in \nlikelihood of confusion on the part of the public.   \n \n(ii) \nThe cited \n consists of the word ―AVATHAR‖ \nin English and Tamil, with the sketch of the face of a lady \nalongside.  It is the composite mark, as such, which has been \nregistered.  When comparing marks for the purpose of assessing \ninfringement, Section 172 of the Trade Marks Act specifically \nproscribes vivisection of marks into its individual components, and \nholds that where a mark is registered as a whole, exclusivity is \nconferred on the whole mark, and not on individual parts thereof.  \nIt is this very claim to exclusivity in the earlier mark, and the \npossibility of confusion, were the two marks to be simultaneously \nregistered, that forms the foundation of the proscription against \nregistration found in Section 11(1).  The possibility of confusion \n                                          \n2 17.  \nEffect of registration of parts of a mark. –  \n(1)  \nWhen a trade mark consists of several matters, its registration shall confer on the proprietor \nexclusive right to the use of the trade mark taken as a whole. \n(2)  \nNotwithstanding anything contained in sub-section (1), when a trade mark –  \n(a)  \ncontains any part –  \n(i)  \nwhich is not the subject of a separate application by the proprietor for \nregistration as a trade mark; or \n(ii)  \nwhich is not separately registered by the proprietor as a trade mark; or \n(b)  \ncontains any matter which is common to the trade or is otherwise of a non-\ndistinctive character, \nthe registration thereof shall not confer any exclusive right in the matter forming only a part of the \nwhole of the trade mark so registered. \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:28.02.2023\n15:39:40\nSignature Not Verified\n\n--- PAGE 6 ---\nNeutral Citation Number : 2023/DHC/001444 \n C.A.(COMM.IPD-TM) 162/2022                                                                                           Page 6 of 8  \n \n   \nhas, in either case, to be viewed from the perspective of the same \nmythical gentleman of average intelligence and imperfect \nrecollection, first invoked by the Supreme Court in Corn Products \nRefining Co. v. Shangrila Food Products Ltd3.  The impression, \ncreated on the ―mind’s eye‖ of such a gentleman is of the entire \nearlier mark, seen as a whole.  The principle that composite marks \nare to be compared as a whole, unless individual parts thereof are \nregistered separately, is a thread that runs through the Trade Marks \nAct.  One cannot, therefore, extract, from the cited \n \nmark, only the word ―AVATHAR‖ in order to compare it with the \nappellant’s \nmark.  The marks are to be compared as a \nwhole. \n \n(iii) Viewed thus, it is clear that there is no similarity between \nthe \ncited \n \nmark \nand \nthe \nappellant’s \nmark, except the phonetic similarity between the \nwords ―AVATHAR‖ and ―AVATAR‖.  The cited \n \nmark contains the sketch of a lady as well as the word \n―AVATHAR‖ written both in English and Tamil.  These features \nare completely absent in the appellant’s \n mark.  No \nperson of average intelligence and imperfect recollection would, \ntherefore, confuse the cited \nmark with the appellant’s \n mark.  It is extremely unlikely that the average \n                                          \n3 AIR 1960 SC 142 \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:28.02.2023\n15:39:40\nSignature Not Verified\n\n--- PAGE 7 ---\nNeutral Citation Number : 2023/DHC/001444 \n C.A.(COMM.IPD-TM) 162/2022                                                                                           Page 7 of 8  \n \n   \nconsumer would regard \n as merely an avatar4 of \n.  \n \n(iv) \nThe Court is of the opinion that the Senior Examiner erred \nin \nmerely \nemphasising \nthe \nphonetic \nsimilarity \nbetween \n―AVATHAR‖ and ―AVATAR‖, without recognising the fact that \nthe cited \n mark was a composite device mark \ncontaining a sketch, as well as the word AVATHAR written in two \nlanguages, compositely registered, with no registration of its \nindividual parts or elements.  The marks, to reiterate, were required \nto be compared as a whole and, when so compared, they cannot be \ntreated as similar, much less identical. \n \n13. \nIn that view of the matter, it is not necessary for this Court to enter \ninto the exercise of comparing the goods or classes in respect of which \nregistration was sought, as identity or similarity of the marks and identity \nor similarity of the goods are required to be cumulatively satisfied for \neither of clauses (a) and (b) of Section 11(1) to apply, the conjunctive \nlink, in each clause, being ―and‖, not ―or‖. If the competing marks are \nneither identical nor similar, therefore, no occasion arises to compare the \ngoods or services in respect of which the marks are registered, or \nproposed to be registered.   \n \n14. \nMoreover, and at the cost of repetition, in view of the difference \nbetween the two marks, there was no likelihood of confusion, on the part \n                                          \n4 ―Incarnation‖, in vernacular \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:28.02.2023\n15:39:40\nSignature Not Verified\n\n--- PAGE 8 ---\nNeutral Citation Number : 2023/DHC/001444 \n C.A.(COMM.IPD-TM) 162/2022                                                                                           Page 8 of 8  \n \n   \nof the public, between them.  The third requirement of Section 11(1) is \nalso, therefore, not satisfied. \n \n15. \nI am, therefore, of the considered opinion that the Senior Examiner \nhas erred in rejecting the appellant’s application. \n \n16. \nThe impugned order dated 13th September 2022 is, therefore, \nquashed and set aside. \n \n17. \nAs appellant’s mark was never advertised, having been rejected at \nan initial stage, the Registrar is directed to advertise the mark and \nproceed thereafter in accordance with law. \n \n18. \nThe appeal stands allowed in the aforesaid terms.  \n \n19. \nMiscellaneous applications do not survive for consideration and \nstand disposed of. \n \n20. \nLet this order be uploaded on the website of this Court within 24 \nhours. \n \n \nC. HARI SHANKAR, J \nFEBRUARY 27, 2023 \nrb \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:28.02.2023\n15:39:40\nSignature Not Verified\n"
  },
  "total_pages": 8,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "According to the PDF document \"43. Twentieth Century Fox Film Corporation v. The Registrar.pdf\", a legal proceeding is underway in the High Court of Delhi at New Delhi. The case involves an appeal by Twentieth Century Fox Film Corporation (Appellant) against the Registrar (Respondent) regarding a trademark registration application.\n\nKey facts include:\n- The Appellant applied for registration of a mark in Class 14 for various goods, including jewelry and watches.\n- The Senior Examiner of Trade Marks rejected the application, citing similarities to two earlier marks.\n- One of the earlier marks was deemed statutorily abandoned due to non-renewal.\n- The Appellant argued that its mark was phonetically and visually distinct from the cited mark and that there was no likelihood of confusion.\n\nThe Court is considering the appeal under Section 91 of the Trade Marks Act, with the Appellant represented by Mr. Prithvi Singh and the Respondent represented by Mr. Harish Vaidyanathan Shankar. The judgment is being presided over by Hon'ble Mr. Justice C. Hari Shankar. The appeal is against an order dated September 13, 2022, with the application for registration initially submitted by the Appellant and a First Examination Report issued on September 25, 2019. The matter is ongoing, with the Court reviewing the arguments and evidence presented by both parties. (Source: PDF document)",
      "pdf_source": "43. Twentieth Century Fox Film Corporation v. The Registrar.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "According to page 1 of the PDF \"43. Twentieth Century Fox Film Corporation v. The Registrar.pdf\", the case involves Twentieth Century Fox Film Corporation (Appellant) versus The Registrar (Respondent) in the High Court of Delhi. The appeal is under Section 91 of the Trade Marks Act, challenging an order dated September 13, 2022, that rejected the Appellant's Application No. 4280126 for registration of a mark in Class 14. The application was for various jewelry and timepiece items. The appeal was heard by Hon'ble Mr. Justice C. Hari Shankar on February 27, 2023. The Appellant was represented by Mr. Prithvi Singh, Adv., and the Respondent was represented by Mr. Harish Vaidyanathan Shankar, CGSC with Mr. R. M. Tripathi, Govt. Pleader. (Source: 43. Twentieth Century Fox Film Corporation v. The Registrar.pdf, Page 1)",
          "content": "Neutral Citation Number : 2023/DHC/001444 \n C.A.(COMM.IPD-TM) 162/2022                                                                                           Page 1 of 8  \n \n   \n$~2 \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.A.(COMM.IPD-TM) 162/2022, I.A. 21666/2022 (Section 151 of \nthe CPC) and I.A. 21667/2022 (Order XLI Rule 27 of the CPC) \n \n \nTWENTIETH CENTURY FOX \nFILM CORPORATION  \n \n \n \n..... Appellant \n \n \n \n \nThrough: \nMr. Prithvi Singh, Adv. \n \n \n \n \n \nversus \n \n \nTHE REGISTRAR \n \n \n \n       \n..... Respondent \nThrough: \nMr. Harish Vaidyanathan Shankar, \nCGSC with Mr. R. M. Tripathi, Govt. Pleader \n \nCORAM: \n \nHON'BLE MR. JUSTICE C.HARI SHANKAR \n \n \n \n \nJUDGMENT (ORAL) \n% \n \n \n \n         27.02.2023 \n \n \n1. \nThis appeal under Section 91 of the Trade Marks Act assails order \ndated 13th September 2022, passed by the Senior Examiner of Trade \nMarks in the office of the Trade Marks Registry, New Delhi, rejecting \nApplication No. 4280126 submitted by the appellant for registration of \nthe \n mark, in Class 14, for ―Alarm clocks; bracelets; busts of \nprecious metal; charms; clocks; earrings; jewellery; jewellery cases of \nprecious metal; jewellery boxes not of precious metal; jewellery chains; \ndecorative key fobs; key chains; key rings; lapel pins; neck chains; \nnecklaces; necktie fasteners; nonmonetary coins; ornamental lapel pins; \npendants; rings; stop watches; tie clips; tie fasteners; tie tacks; wall \nclocks; watch bands; watch cases; watch chains; watch straps; watches; \nwedding bands; wrist watches on proposed to be used basis‖. \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:28.02.2023\n15:39:40\nSignature Not Verified",
          "pdf_source": "43. Twentieth Century Fox Film Corporation v. The Registrar.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "According to page 2 of the PDF \"43. Twentieth Century Fox Film Corporation v. The Registrar.pdf\", the Twentieth Century Fox Film Corporation appealed a decision regarding trademark registration. The Trademark Registry issued a First Examination Report (FER) on September 25, 2019, objecting to the registration under Section 11(1) of the Trade Marks Act, 1999, due to similarity with two earlier marks. The appellant replied on October 19, 2019, arguing that their mark was distinct from the cited marks and there was no likelihood of confusion. The goods for which the cited mark was registered were also different from those for which the appellant sought registration. The appellant's counsel, Mr. Prithvi Singh, submitted these arguments. (Source: 43. Twentieth Century Fox Film Corporation v. The Registrar.pdf, page 2)",
          "content": "Neutral Citation Number : 2023/DHC/001444 \n C.A.(COMM.IPD-TM) 162/2022                                                                                           Page 2 of 8  \n \n   \n2. \nConsequent to submission of the aforesaid application by the \nappellant, the office of the trademark Registry issued First Examination \nReport (FER) dated 25th September 2019, objecting to the registration of \nthe proposed mark under Section 11(1) of the Trade Marks Act, 1999, on \nthe ground that it was deceptively similar to two earlier marks.  The two \nmarks which were cited were (i) \n, registered in favour of Mr. \nA. Shrivinasan and (ii) \n, registered in favour of Mr. Avathar \nVaratharajan. \n \n3. \nOf these two marks, the former mark was not renewed and, \naccordingly, was deemed to be statutorily abandoned under Section 25(3) \nof the Trade Marks Act. \n \n4. \nThe appellant, in its reply dated 19th October 2019 to the FER, \nsubmitted that (i) the appellant’s mark was phonetically and visually \ndistinct from the cited \n mark, (ii) the overall impression \nconveyed by the two marks was completely different and there was, \ntherefore, no likelihood of confusion, (iii) Section 17 of the Trade Marks \nAct required the rival marks to be seen as a whole, without vivisecting \nthe marks into their individual components, (iv)  the goods in respect of \nwhich the cited \n was registered were also different from \nthe goods in respect of which the appellant sought registration of its \nmark. \n \n5. \nMr. Prithvi Singh, learned Counsel for the appellant submits, \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:28.02.2023\n15:39:40\nSignature Not Verified",
          "pdf_source": "43. Twentieth Century Fox Film Corporation v. The Registrar.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0006",
      "start_index": 3,
      "end_index": 4,
      "summary": "According to the PDF document \"Twentieth Century Fox Film Corporation v. The Registrar.pdf\", the High Court of Delhi at New Delhi heard a case (C.A.(COMM.IPD-TM) 162/2022) regarding a trademark registration dispute between Twentieth Century Fox Film Corporation (appellant) and the Registrar (respondent). The appellant sought registration of its mark for goods related to the promotion of the movie \"AVATAR\", released in December 2022.\n\nThe Senior Examiner rejected the appellant's application under Section 11(1) of the Trade Marks Act, citing visual and phonetic similarity to an existing mark registered in favor of Mr. Avathar Varatharajan. The appellant appealed this decision, arguing that the rejection was unjustified.\n\nThe court considered the relative grounds for refusal of registration under Section 11(1), which requires a likelihood of confusion on the part of the public due to the identity or similarity of the marks and the goods or services covered. The court noted that the Senior Examiner was required to assess whether the appellant's mark was identical or similar to the cited mark, whether the goods and services covered were identical or similar, and whether a likelihood of confusion existed.\n\nThe case highlights the importance of careful examination of trademark applications to avoid confusion among the public. The PDF document provides a detailed account of the legal proceedings, including the arguments presented by the parties and the court's analysis of the case. (Source: Twentieth Century Fox Film Corporation v. The Registrar.pdf, Neutral Citation Number: 2023/DHC/001444)",
      "pdf_source": "43. Twentieth Century Fox Film Corporation v. The Registrar.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "According to page 3 of the PDF \"43. Twentieth Century Fox Film Corporation v. The Registrar.pdf\", the Senior Examiner rejected the appellant's (Twentieth Century Fox Film Corporation) defense and disallowed registration of their mark under Section 11(1) of the Trade Marks Act on September 13, 2022. The reason was that the mark was visually and phonetically similar to a cited mark registered in favor of Mr. Avathar Varatharajan. The appellant appealed to the High Court of Delhi, and the only ground for refusal of registration was the likelihood of confusion due to similarity with the earlier trade mark. The appeal was heard by the court, with Mr. Prithvi Singh representing the appellant and Mr. Harish Vaidyanathan Shankar representing the respondent. The case was digitally signed by Sunil Singh Negi on February 28, 2023.",
          "content": "Neutral Citation Number : 2023/DHC/001444 \n C.A.(COMM.IPD-TM) 162/2022                                                                                           Page 3 of 8  \n \n   \nmoreover, that the goods in respect of which the registration of the \nappellant’s mark was sought were essentially towards promotion of the \nmovie AVATAR which was released in December 2022. \n \n6. \nThe Senior Examiner, by the impugned order dated 13th September \n2022, rejected the aforesaid defence put up by the appellant and \ndisallowed registration of the appellant’s mark under Section 11(1)1 of \nthe Trade Marks Act on the ground that it was visually and phonetically \nsimilar to the cited \nmark. \n \n7. \nAggrieved thereby, the appellant has approached this Court by \nmeans of the present appeal. \n \n8. \nI have heard Mr. Prithvi Singh, learned Counsel for the appellant \nand Mr. Harish Vaidyanathan Shankar, learned Counsel for the \nrespondent at some length. \n \n9. \nThe only ground on which registration of the \nmark of \nthe appellant has been refused, is that it is deceptively similar to the \n mark registered in favour of Mr. Avathar Varatharajan and \nthat the similarity was likely to result in confusion. \n                                          \n1 11.  \nRelative grounds for refusal of registration. –  \n(1)  \nSave as provided in Section 12, a trade mark shall not be registered if, because of— \n(a)  \nits identity with an earlier trade mark and similarity of goods or services covered by \nthe trade mark; or \n(b)  \nits similarity to an earlier trade mark and the identity or similarity of the goods or \nservices covered by the trade mark, \nthere exists a likelihood of confusion on the part of the public, which includes the likelihood of \nassociation with the earlier trade mark. \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:28.02.2023\n15:39:40\nSignature Not Verified",
          "pdf_source": "43. Twentieth Century Fox Film Corporation v. The Registrar.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "According to page 4 of the PDF \"43. Twentieth Century Fox Film Corporation v. The Registrar.pdf\", the court discusses Section 11(1) of the trademark registration law. It states that mere identity or similarity of marks is not enough to reject a registration application. The court outlines two clauses: (a) identical marks for similar goods/services, and (b) similar marks for identical or similar goods/services. In both cases, a likelihood of public confusion must exist. The Senior Examiner must assess (i) mark similarity, (ii) goods/services similarity, and (iii) likelihood of public confusion. \n\nSource: 43. Twentieth Century Fox Film Corporation v. The Registrar.pdf, Page 4 of 8, Neutral Citation Number: 2023/DHC/001444, C.A.(COMM.IPD-TM) 162/2022.",
          "content": "Neutral Citation Number : 2023/DHC/001444 \n C.A.(COMM.IPD-TM) 162/2022                                                                                           Page 4 of 8  \n \n   \n \n10. \nIt is clear, from a bare reading of Section 11(1) that mere identity \nor similarity of the mark of which registration is sought, and the earlier \nmark, is not sufficient as a ground to reject the application seeking \nregistration. Section 11(1) has two clauses. Clause (a) envisages a \nsituation in which applicant’s mark is identical to the earlier trademark \nand registration is sought in respect of similar goods and services.  \nClause (b) envisages a situation in which the applicant’s mark is similar \nto an earlier trade mark and the goods and services covered by the two \nmarks are identical or similar.  In either case, a third condition is required \nto be satisfied, which is that, owing to the identity or similarity between \nthe applicant’s mark and the cited mark, and the identity of similarity \nbetween the goods covered under two marks, there exists a likelihood of \nconfusion on the part of the public, which would include a likelihood of \nassociation with the earlier trade mark.  \n \n11. \nIn examining sustainability of the objections raised in the FER, the \nSenior Examiner was required, therefore, to assess whether (i) the \nappellant’s mark was identical or similar to the earlier cited mark \n, (ii) whether the goods and services covered by the two \nmarks were identical or similar and (iii) whether, because of these \nfactors, a likelihood of confusion on the part of the public existed. \n \n12. \nApplying these tests to the case at hand, the position that emerges \nis, as I find, thus: \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:28.02.2023\n15:39:40\nSignature Not Verified",
          "pdf_source": "43. Twentieth Century Fox Film Corporation v. The Registrar.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0009",
      "start_index": 5,
      "end_index": 6,
      "summary": "According to the PDF document \"Twentieth Century Fox Film Corporation v. The Registrar.pdf\", a legal case is being heard in the High Court of Delhi (Neutral Citation Number: 2023/DHC/001444, C.A.(COMM.IPD-TM) 162/2022). The appellant, Twentieth Century Fox Film Corporation, is represented by Mr. Prithvi Singh, Advocate. The case revolves around a trade mark dispute.\n\nThe legal arguments presented focus on the similarity between the applicant's mark and the cited mark, \"AVATHAR\". The court notes that while the two marks are phonetically similar, mere phonetic similarity is insufficient to render them identical or similar within the meaning of Section 11(1) of the Trade Marks Act. The cited mark is a composite mark, consisting of the word \"AVATHAR\" in English and Tamil, along with a sketch of a lady's face.\n\nThe court cites Section 172 of the Trade Marks Act, which proscribes the vivisection of marks into individual components. The court also refers to Section 17 of the Trade Marks Act, which states that the registration of a trade mark confers exclusive rights to the use of the mark taken as a whole. The court concludes that there is no similarity between the cited mark and the appellant's mark, except for the phonetic similarity between the words \"AVATHAR\" and \"AVATAR\". The average person of average intelligence and imperfect recollection would not confuse the two marks. (Source: PDF document, pages 5-6)",
      "pdf_source": "43. Twentieth Century Fox Film Corporation v. The Registrar.pdf",
      "nodes": [
        {
          "title": "Page 5",
          "node_id": "0007",
          "start_index": 5,
          "end_index": 5,
          "summary": "According to page 5 of the PDF \"43. Twentieth Century Fox Film Corporation v. The Registrar.pdf\", the court discusses the similarity between the applicant's mark and the cited mark. Although the marks are phonetically similar, mere phonetic similarity is not enough to render them identical or similar under Section 11(1) of the Trade Marks Act. The court also references Section 172 of the Act, which proscribes vivisection of marks into individual components. The cited mark is a composite mark, consisting of the word \"AVATHAR\" in English and Tamil, with a sketch of a lady's face. The court notes that registration of a mark confers exclusive rights to the whole mark, not individual parts, as stated in Section 2(17) of the Act. (Source: PDF \"43. Twentieth Century Fox Film Corporation v. The Registrar.pdf\", page 5)",
          "content": "Neutral Citation Number : 2023/DHC/001444 \n C.A.(COMM.IPD-TM) 162/2022                                                                                           Page 5 of 8  \n \n   \n(i) \nIt cannot be said that the applicant’s \n mark is \nidentical or similar to the cited \n mark.  No doubt, the \ntwo marks are phonetically similar and, perhaps, even identical. \nHowever, mere phonetic similarity is insufficient to render the \nmarks identical or similar within the meaning of Section 11(1).  \nThe identity or similarity has to be such as would result in \nlikelihood of confusion on the part of the public.   \n \n(ii) \nThe cited \n consists of the word ―AVATHAR‖ \nin English and Tamil, with the sketch of the face of a lady \nalongside.  It is the composite mark, as such, which has been \nregistered.  When comparing marks for the purpose of assessing \ninfringement, Section 172 of the Trade Marks Act specifically \nproscribes vivisection of marks into its individual components, and \nholds that where a mark is registered as a whole, exclusivity is \nconferred on the whole mark, and not on individual parts thereof.  \nIt is this very claim to exclusivity in the earlier mark, and the \npossibility of confusion, were the two marks to be simultaneously \nregistered, that forms the foundation of the proscription against \nregistration found in Section 11(1).  The possibility of confusion \n                                          \n2 17.  \nEffect of registration of parts of a mark. –  \n(1)  \nWhen a trade mark consists of several matters, its registration shall confer on the proprietor \nexclusive right to the use of the trade mark taken as a whole. \n(2)  \nNotwithstanding anything contained in sub-section (1), when a trade mark –  \n(a)  \ncontains any part –  \n(i)  \nwhich is not the subject of a separate application by the proprietor for \nregistration as a trade mark; or \n(ii)  \nwhich is not separately registered by the proprietor as a trade mark; or \n(b)  \ncontains any matter which is common to the trade or is otherwise of a non-\ndistinctive character, \nthe registration thereof shall not confer any exclusive right in the matter forming only a part of the \nwhole of the trade mark so registered. \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:28.02.2023\n15:39:40\nSignature Not Verified",
          "pdf_source": "43. Twentieth Century Fox Film Corporation v. The Registrar.pdf",
          "nodes": []
        },
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "According to page 6 of the PDF \"43. Twentieth Century Fox Film Corporation v. The Registrar.pdf\", the court compared the marks as a whole, considering the entire earlier mark from the perspective of a gentleman of average intelligence and imperfect recollection. The principle is that composite marks are compared as a whole, unless individual parts are registered separately. The court found no similarity between the cited mark and the appellant's mark, except for phonetic similarity between \"AVATHAR\" and \"AVATAR\". The cited mark contains additional features, such as a lady's sketch and the word in English and Tamil, which are absent in the appellant's mark. The court concluded that no person of average intelligence would confuse the two marks. (Source: \"43. Twentieth Century Fox Film Corporation v. The Registrar.pdf\", page 6)",
          "content": "Neutral Citation Number : 2023/DHC/001444 \n C.A.(COMM.IPD-TM) 162/2022                                                                                           Page 6 of 8  \n \n   \nhas, in either case, to be viewed from the perspective of the same \nmythical gentleman of average intelligence and imperfect \nrecollection, first invoked by the Supreme Court in Corn Products \nRefining Co. v. Shangrila Food Products Ltd3.  The impression, \ncreated on the ―mind’s eye‖ of such a gentleman is of the entire \nearlier mark, seen as a whole.  The principle that composite marks \nare to be compared as a whole, unless individual parts thereof are \nregistered separately, is a thread that runs through the Trade Marks \nAct.  One cannot, therefore, extract, from the cited \n \nmark, only the word ―AVATHAR‖ in order to compare it with the \nappellant’s \nmark.  The marks are to be compared as a \nwhole. \n \n(iii) Viewed thus, it is clear that there is no similarity between \nthe \ncited \n \nmark \nand \nthe \nappellant’s \nmark, except the phonetic similarity between the \nwords ―AVATHAR‖ and ―AVATAR‖.  The cited \n \nmark contains the sketch of a lady as well as the word \n―AVATHAR‖ written both in English and Tamil.  These features \nare completely absent in the appellant’s \n mark.  No \nperson of average intelligence and imperfect recollection would, \ntherefore, confuse the cited \nmark with the appellant’s \n mark.  It is extremely unlikely that the average \n                                          \n3 AIR 1960 SC 142 \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:28.02.2023\n15:39:40\nSignature Not Verified",
          "pdf_source": "43. Twentieth Century Fox Film Corporation v. The Registrar.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0012",
      "start_index": 7,
      "end_index": 8,
      "summary": "According to the PDF document \"Twentieth Century Fox Film Corporation v. The Registrar\" (Neutral Citation Number: 2023/DHC/001444), the High Court of Delhi at New Delhi made a decision in the case C.A.(COMM.IPD-TM) 162/2022. The appellant, Twentieth Century Fox Film Corporation, was represented by Mr. Prithvi Singh, Adv. The court ruled in favor of the appellant, quashing and setting aside the impugned order dated September 13, 2022.\n\nThe court found that the Senior Examiner erred in rejecting the appellant's application, emphasizing only the phonetic similarity between the marks \"AVATHAR\" and \"AVATAR\" without considering the fact that the cited mark was a composite device mark with a sketch and the word \"AVATHAR\" written in two languages. The court held that the marks must be compared as a whole and, when so compared, they cannot be treated as similar.\n\nThe court also found that there was no likelihood of confusion between the two marks, and therefore, the third requirement of Section 11(1) was not satisfied. The Registrar was directed to advertise the appellant's mark and proceed in accordance with the law. The appeal was allowed, and miscellaneous applications were disposed of. The order was uploaded on the court's website on February 28, 2023. (Source: Twentieth Century Fox Film Corporation v. The Registrar.pdf, Pages 1-8)",
      "pdf_source": "43. Twentieth Century Fox Film Corporation v. The Registrar.pdf",
      "nodes": [
        {
          "title": "Page 7",
          "node_id": "0010",
          "start_index": 7,
          "end_index": 7,
          "summary": "According to page 7 of the PDF \"43. Twentieth Century Fox Film Corporation v. The Registrar.pdf\", the Court opinions that the Senior Examiner erred in emphasizing only the phonetic similarity between \"AVATHAR\" and \"AVATAR\". The Court notes that the marks should be compared as a whole, considering the composite device mark containing a sketch and the word \"AVATHAR\" in two languages. The Court decides that the marks are not similar, and therefore, there is no need to compare the goods or classes in respect of which registration was sought. The decision is based on the cumulative satisfaction of identity or similarity of marks and goods, as per Section 11(1) (Source: PDF \"43. Twentieth Century Fox Film Corporation v. The Registrar.pdf\", page 7).",
          "content": "Neutral Citation Number : 2023/DHC/001444 \n C.A.(COMM.IPD-TM) 162/2022                                                                                           Page 7 of 8  \n \n   \nconsumer would regard \n as merely an avatar4 of \n.  \n \n(iv) \nThe Court is of the opinion that the Senior Examiner erred \nin \nmerely \nemphasising \nthe \nphonetic \nsimilarity \nbetween \n―AVATHAR‖ and ―AVATAR‖, without recognising the fact that \nthe cited \n mark was a composite device mark \ncontaining a sketch, as well as the word AVATHAR written in two \nlanguages, compositely registered, with no registration of its \nindividual parts or elements.  The marks, to reiterate, were required \nto be compared as a whole and, when so compared, they cannot be \ntreated as similar, much less identical. \n \n13. \nIn that view of the matter, it is not necessary for this Court to enter \ninto the exercise of comparing the goods or classes in respect of which \nregistration was sought, as identity or similarity of the marks and identity \nor similarity of the goods are required to be cumulatively satisfied for \neither of clauses (a) and (b) of Section 11(1) to apply, the conjunctive \nlink, in each clause, being ―and‖, not ―or‖. If the competing marks are \nneither identical nor similar, therefore, no occasion arises to compare the \ngoods or services in respect of which the marks are registered, or \nproposed to be registered.   \n \n14. \nMoreover, and at the cost of repetition, in view of the difference \nbetween the two marks, there was no likelihood of confusion, on the part \n                                          \n4 ―Incarnation‖, in vernacular \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:28.02.2023\n15:39:40\nSignature Not Verified",
          "pdf_source": "43. Twentieth Century Fox Film Corporation v. The Registrar.pdf",
          "nodes": []
        },
        {
          "title": "Page 8",
          "node_id": "0011",
          "start_index": 8,
          "end_index": 8,
          "summary": "According to page 8 of the PDF \"43. Twentieth Century Fox Film Corporation v. The Registrar.pdf\", the court ruled in favor of the appellant, Twentieth Century Fox Film Corporation. The Senior Examiner's decision to reject the appellant's application was deemed erroneous. The court quashed and set aside the impugned order dated September 13, 2022. The Registrar was directed to advertise the mark and proceed according to law. The appeal was allowed, and miscellaneous applications were disposed of. The order was issued by C. Hari Shankar, J on February 27, 2023. The decision was digitally signed by Sunil Singh Negi on February 28, 2023. (Source: 43. Twentieth Century Fox Film Corporation v. The Registrar.pdf, page 8)",
          "content": "Neutral Citation Number : 2023/DHC/001444 \n C.A.(COMM.IPD-TM) 162/2022                                                                                           Page 8 of 8  \n \n   \nof the public, between them.  The third requirement of Section 11(1) is \nalso, therefore, not satisfied. \n \n15. \nI am, therefore, of the considered opinion that the Senior Examiner \nhas erred in rejecting the appellant’s application. \n \n16. \nThe impugned order dated 13th September 2022 is, therefore, \nquashed and set aside. \n \n17. \nAs appellant’s mark was never advertised, having been rejected at \nan initial stage, the Registrar is directed to advertise the mark and \nproceed thereafter in accordance with law. \n \n18. \nThe appeal stands allowed in the aforesaid terms.  \n \n19. \nMiscellaneous applications do not survive for consideration and \nstand disposed of. \n \n20. \nLet this order be uploaded on the website of this Court within 24 \nhours. \n \n \nC. HARI SHANKAR, J \nFEBRUARY 27, 2023 \nrb \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:28.02.2023\n15:39:40\nSignature Not Verified",
          "pdf_source": "43. Twentieth Century Fox Film Corporation v. The Registrar.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-15T18:38:51.873677",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}