{
  "doc_name": "46. Vinay Kumar GB v. Sudhir Kumar and Anr",
  "pdf_source": "46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf",
  "metadata": {
    "document_name": "46. Vinay Kumar GB v. Sudhir Kumar and Anr",
    "source_pdf": "46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf",
    "judges": [
      "C.HARI SHANKAR ORDER (ORAL) % 16.02.2023 C.O. (COMM.IPD-TM) 244/2021 C.O. (COMM.IPD-TM) 245/2021 C.O. (COMM.IPD-TM) 342/2021 C.O. (COMM.IPD-TM) 395/2021"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "779/2022",
      "779/2022"
    ],
    "dhc_numbers": [
      "2023/DHC/001191",
      "2023/DHC/001191",
      "2023/DHC/001191",
      "2023/DHC/001191",
      "2023/DHC/001191",
      "2023/DHC/001191",
      "2023/DHC/001191",
      "2023/DHC/001191",
      "2023/DHC/001191",
      "2023/DHC/001191",
      "2023/DHC/001191",
      "2023/DHC/001191",
      "2023/DHC/001191",
      "2023/DHC/001191",
      "2023/DHC/001191"
    ],
    "ia_numbers": [],
    "decision_date": "12 September, 2022",
    "order_date": null,
    "case_type": "Commercial",
    "subject_matter": null,
    "plaintiffs": [
      "Vinay Kumar GB",
      "Vijay Kumar GB",
      "Shri Sudhir Kumar"
    ],
    "defendants": [
      "Sudhir Kumar and Anr",
      "Vinay Kumar G B, Proprietor of Insights IAS and Insights Active Learning and Ors."
    ],
    "appellants": [],
    "respondents": [],
    "plaintiff_advocates": [
      "Mr. Sanjeev Sindhwani, Sr. Adv. with Ms. Kruttika Vijay and Mr. Sauhard Alung, Advs.",
      "Mr. Jayant Kumar and Mr. Amit Mehta, Advs."
    ],
    "defendant_advocates": [
      "Mr. Jayant Kumar and Mr. Amit Mehta, Advs. for R-1",
      "Mr. Sanjeev Sindhwani, Sr. Adv. with Ms. Kruttika Vijay and Mr. Sauhard Alung, Advs."
    ],
    "appellant_advocates": [],
    "respondent_advocates": [],
    "damages_claimed": null,
    "damages_awarded": null,
    "key_issues": [
      "The admissibility of rejoinders filed by the petitioners beyond the time stipulated in Rule 7(x)1 of the Intellectual Appellate Division (IPD) Rules, 2002 is a key issue in the case.",
      "The interpretation of the word \"shall\" in Rule 7(x) of the IPD Rules and its implications on the petitioner's right to file a rejoinder is a crucial aspect of the dispute.",
      "The applicability of Rule 7(x) of the IPD Rules to the present case, which involves original petitions, is a relevant consideration.",
      "The court's discretion in allowing or rejecting the rejoinders filed by the petitioners is a significant factor in the case.",
      "The potential impact of the IPD Rules on the petitioner's ability to present their case and respond to the respondent's reply is a key concern.",
      "The distinction between the court-directed timeline and the 30-day deadline for filing a rejoinder, as per Rule 7(x), is an important point of contention.",
      "The respondents' objection to the taking on record of the rejoinders filed by the petitioners raises questions about the fairness and procedural integrity of the proceedings.",
      "The role of the court in managing the timeline and procedure for filing rejoinders and replies in original petitions is a critical aspect of the case.",
      "The balance between the need for efficient and timely proceedings and the need to ensure that parties have a fair opportunity to present their case is a key consideration."
    ],
    "decision_summary": "**Case Summary: Vinay Kumar GB vs. Sudhir Kumar and Anr.**\n\n**Background:**\nThe case involves a dispute between Vinay Kumar GB, the proprietor of Insights IAS and Insights Active Learning, and Sudhir Kumar, the proprietor of Insight IAS Academy. The case is related to intellectual property rights, specifically trademark infringement. There are multiple connected matters, including C.O. (COMM.IPD-TM) 244/2021, C.O. (COMM.IPD-TM) 245/2021, C.O. (COMM.IPD-TM) 342/2021, C.O. (COMM.IPD-TM) 395/2021, and CS(COMM) 779/2022.\n\n**Legal Issues:**\nThe main issue in this case is whether the rejoinders filed by the petitioners (Vinay Kumar GB) can be taken on record, given that they were filed beyond the time stipulated in Rule 7(x) of the Intellectual Appellate Division (IPD) Rules, 2002.\n\n**Arguments:**\nMr. Jayant Kumar, the learned counsel for the respondent (Sudhir Kumar), argued that the rejoinders filed by the petitioners were filed beyond the maximum period of 30 days prescribed in Rule 7(x) of the IPD Rules. He contended that the use of the word \"shall\" in the rule forecloses the right of the petitioner to file a rejoinder once the maximum period has expired.\n\n**Court Findings:**\nThe court examined Rule 7(x) of the IPD Rules, which requires the rejoinder to be filed \"within the period prescribed by the Court or within 30 days from the date on which the Court directs the filing of such rejoinder.\" The court noted that the learned Joint Registrar had directed the filing of the rejoinder on September 12, 2022, without stipulating a specific period. The court observed that the rule requires the rejoinder to be filed within a maximum period of 30 days from the date of the direction.\n\n**Decision:**\nThe court ultimately decided to allow the rejoinders to be taken on record, despite being filed beyond the 30-day period. The court's decision is not explicitly stated in the provided text, but it can be inferred that the court did not accept Mr. Jayant Kumar's argument that the use of the word \"shall\" in Rule 7(x) forecloses the right of the petitioner to file a rejoinder once the maximum period has expired.\n\n**Implications:**\nThe court's decision suggests that the IPD Rules should be interpreted in a manner that allows for flexibility and does not unduly restrict the rights of parties to file rejoinders. The decision may have implications for future cases involving intellectual property disputes and the interpretation of the IPD Rules. However, the exact reasoning and implications of the court's decision are not fully clear from the provided text and would require further analysis of the entire judgment.",
    "legal_precedents": [
      "Bihar Bihar Rajya Bhumi Vikas Bank Samiti",
      "(2013) 3 SCC 594",
      "Manohar Lal Chopra Seth Hiralal",
      "(2005) 4 SCC 480",
      "(2005) 6 SCC 344",
      "(2018) 9 SCC 472",
      "Bihar Bihar Rajya Bhumi Vikas Bank \nSamiti",
      "Kailash Nanhku",
      "(2016) 14 SCC 275"
    ],
    "full_text": "\n--- PAGE 1 ---\nNeutral Citation Number : 2023/DHC/001191 \nC.O. (COMM.IPD-TM) 244/2021 and other connected matters                                                     Page 1 of 15 \n \n$~28 - 32 \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.O. (COMM.IPD-TM) 244/2021 \n \nVINAY KUMAR GB \n \n \n \n \n ..... Plaintiff \nThrough: \nMr. Sanjeev Sindhwani, Sr. \nAdv. with Ms. Kruttika Vijay and Mr. \nSauhard Alung, Advs. \n \n \n \n \n \nversus \n \n \nSUDHIR KUMAR AND ANR  \n \n      ..... Defendants \nThrough: \nMr. Jayant Kumar and Mr. \nAmit Mehta, Advs. for R-1 \n \n+  \nC.O. (COMM.IPD-TM) 245/2021 \n \nVINAY KUMAR GB \n \n \n \n \n..... Plaintiff \nThrough: \nMr. Sanjeev Sindhwani, Sr. \nAdv. with Ms. Kruttika Vijay and Mr. \nSauhard Alung, Advs. \n \n \n \n \n \nversus \n \n \nSUDHIR KUMAR AND ANR  \n \n      ..... Defendants \nThrough: \nMr. Jayant Kumar and Mr. \nAmit Mehta, Advs. for R-1 \n \n+  \nC.O. (COMM.IPD-TM) 342/2021 \n \nVIJAY KUMAR GB \n \n \n \n \n..... Plaintiff \nThrough: \nMr. Sanjeev Sindhwani, Sr. \nAdv. with Ms. Kruttika Vijay and Mr. \nSauhard Alung, Advs. \n \n \n \n \n \nversus \n \n \nSUDHIR KUMAR AND ANR  \n \n      ..... Defendants \nThrough: \nMr. Jayant Kumar and Mr. \nAmit Mehta, Advs. for R-1 \n \n+  \nC.O. (COMM.IPD-TM) 395/2021 \n \nVINAY KUMAR GB \n \n \n \n \n..... Plaintiff \nThrough: \nMr. Sanjeev Sindhwani, Sr. \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:20.02.2023\n15:43:21\nSignature Not Verified\n\n--- PAGE 2 ---\nNeutral Citation Number : 2023/DHC/001191 \nC.O. (COMM.IPD-TM) 244/2021 and other connected matters                                                     Page 2 of 15 \n \nAdv. with Ms. Kruttika Vijay and Mr. \nSauhard Alung, Advs. \n \n \n \n \n \nversus \n \n \nSUDHIR KUMAR AND ANR  \n \n      ..... Defendants \nThrough: \nMr. Jayant Kumar and Mr. \nAmit Mehta, Advs. for R-1 \n \n+  \nCS(COMM) 779/2022 \nSHRI SUDHIR KUMAR AT S. BALIYAN, \nPROPRIETOR OF INSIGHT IAS ACADEMY \n..... Plaintiff \nThrough: \nMr. Jayant Kumar and Mr. \nAmit Mehta, Advs. \n \n \n \n \n \nversus \n \nVINAY KUMAR G B, PROPRIETOR  \nOF INSIGHTS IAS AND INSIGHTS \nACTIVE LEARNING AND ORS. \n \n      ..... Defendants \nThrough: \nMr. Sanjeev Sindhwani, Sr. \nAdv. with Ms. Kruttika Vijay and Mr. \nSauhard Alung, Advs. \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C.HARI SHANKAR \n   ORDER (ORAL) \n% \n \n \n \n        16.02.2023 \n \nC.O. (COMM.IPD-TM) 244/2021 \nC.O. (COMM.IPD-TM) 245/2021 \nC.O. (COMM.IPD-TM) 342/2021 \nC.O. (COMM.IPD-TM) 395/2021 \nCS(COMM) 779/2022 \n \n \n1. \nThese matters were listed today in view of a somewhat intricate \nobjection raised by Mr Jayant Kumar, learned Counsel for the \nrespondents in CO (COMM. IPD-TM) 244/2021 and CO (COMM \nIPD-TM) 245/2021, to the taking, on record, of the rejoinders filed by \nthe petitioners.  This order disposes of the objection. \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:20.02.2023\n15:43:21\nSignature Not Verified\n\n--- PAGE 3 ---\nNeutral Citation Number : 2023/DHC/001191 \nC.O. (COMM.IPD-TM) 244/2021 and other connected matters                                                     Page 3 of 15 \n \n \n2. \nMr. Jayant Kumar, learned Counsel for the respondent \nsubmitted that the rejoinders filed by the petitioner in these petitions \nhad been filed beyond the time stipulated in Rule 7(x)1 of the \nIntellectual Appellate Division (IPD) Rules, 2002 as applicable to this \nCourt and that, therefore, they could not be taken on record. \nAccording to Mr. Jayant Kumar, the use of the word ―shall‖, in Rule \n7(x) of the IPD Rules supra forecloses the right of the petitioner to file \na rejoinder once the maximum period envisaged in the said Rule has \nexpired. \n \n3. \nRule 7(x) of the IPD Rules which, admittedly, relates to the \nprocedure to be followed in the case of original petitions, and would, \ntherefore, apply to the present case, requires the rejoinder to the reply \nfiled by the respondent in an original petition to be filed ―within the \nperiod prescribed by the Court or within 30 days from the date on \nwhich the Court directs the filing of such rejoinder‖. Mr. Jayant \nKumar points out that, in these cases, the learned Joint Registrar in \nthis Court had directed filing of rejoinder on 12th September 2022 \nwithout stipulating any period within which the rejoinder was to be \nfiled. Rule 7(x) would, therefore, in his submission, require the \nrejoinder to be filed within a maximum period of 30 days from 12th \nSeptember 2022. The rejoinder having been filed on 13th February \n2023, Mr. Jayant Kumar submits that it could not be taken on record. \nThe order dated 12th September 2022 of the learned Joint Registrar \n(Original) read thus: \n― \nReply/counter statement filed by respondent no. l along \nwith documents.  \nRejoinder \nto \ncounter \nstatement \nand \naffidavit \nof \n                                          \n1 7. \nProcedure for Original Petitions (Civil Original Petition) \n(x) \nRejoinder to the reply, if so directed, shall be filed within the period prescribed by the \nCourt or shall be filed within 60 days from the date on which the Court directs filing of the Reply. \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:20.02.2023\n15:43:21\nSignature Not Verified\n\n--- PAGE 4 ---\nNeutral Citation Number : 2023/DHC/001191 \nC.O. (COMM.IPD-TM) 244/2021 and other connected matters                                                     Page 4 of 15 \n \nadmission/denial be filed in terms of Delhi High Court Intellectual \nProperty Rights Division Rules 2022. \nIt is submitted by counsel for petitioner that connected \nmatter i.e. C.O. (COMM.IPD-TM) 737/2021 is listed before the \nHon'ble Court for 11.11.2022 and has prayed that this matter may \nbe listed along with the said case. \nAccordingly, list the matter for completion of pleadings on \n11.11.2022.‖ \n \n4. \nMr. Jayant Kumar has also placed reliance on Rule 52 in \nChapter VII of the Delhi High Court (Original Side) Rules, 2018 in \nconjunction with Rule 7(xiii)3 of the IPD Rules. He submits that, by \napplication of Rule 5 in Chapter VII of the Original Side Rules, the \nCourt was empowered to grant extension of time for filing rejoinder \nby a maximum period of 15 days beyond the period of 30 days \noriginally provided, subject to costs. The Rule, he submits, further \nprovides that, if the rejoinder is not filed within the said maximum \nperiod, it shall not be taken on record. \n \n5. \nThe mandate of Rule 5 in Chapter VII of the Original Side \nRules, according to Mr. Jayant Kumar, is clear and, therefore, the \nrejoinder filed by the petitioner in these petitions cannot be taken on \nrecord. \n \n6. \nMr. Sanjeev Sindhwani, learned Senior Counsel for the \n                                          \n2 5. \nReplication. – The replication, if any, shall be filed within 30 days of receipt of the \nwritten statement.  If the Court is satisfied that the plaintiff was prevented by sufficient cause for \nexceptional and unavoidable reasons in filing the replication within 30 days, it may extend the \ntime for filing the same by a further period not exceeding 15 days but not thereafter.  For such \nextension, the plaintiff shall be burdened with costs, as deemed appropriate.  The replication shall \nnot be taken on record, unless such costs have been paid/deposited.  In case no replication is filed \nwithin the extended time also, the Registrar shall forthwith place the matter for appropriate orders \nbefore the Court.  An advance copy of the replication together with legible copies of all documents \nin possession and power of plaintiff, that it seeks to file along with the replication, shall be served \non the defendant and the replication together with the said documents shall not be accepted unless \nit contains an endorsement of service signed by the defendant/his Advocate. \n3 (xiii) Procedures applicable to original petitions:  The provisions of the Commercial Courts \nAct, 2015, Delhi High Court (Original Side) Rules, 2018 and orders as also the practice directions \nissued from time to time, to the extent there is no inconsistency with these Rules, shall be \napplicable to original petitions filed in the IPD.  \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:20.02.2023\n15:43:21\nSignature Not Verified\n\n--- PAGE 5 ---\nNeutral Citation Number : 2023/DHC/001191 \nC.O. (COMM.IPD-TM) 244/2021 and other connected matters                                                     Page 5 of 15 \n \npetitioner submits that the contention of Mr. Jayant Kumar is \ncompletely misconceived. He places reliance on the judgment of \nSupreme Court in SCG Contracts (India) Pvt Ltd v. K.S. Chamankar \nInfrastructure Pvt Ltd4, specifically on paras 8, 9, 14 and 16 thereof, \nwhich read thus: \n―8. \nThe Commercial Courts, Commercial Division and \nCommercial Appellate Division of High Courts Act, 2015 came \ninto force on 23-10-2015 bringing in their wake certain \namendments to the Code of Civil Procedure. In Order 5 Rule 1, \nsub-rule (1), for the second proviso, the following proviso was \nsubstituted: \n \n―Provided further that where the defendant fails to file the \nwritten statement within the said period of thirty days, he \nshall be allowed to file the written statement on such other \nday, as may be specified by the court, for reasons to be \nrecorded in writing and on payment of such costs as the \ncourt deems fit, but which shall not be later than one \nhundred twenty days from the date of service of summons \nand on expiry of one hundred and twenty days from the \ndate of service of summons, the defendant shall forfeit the \nright to file the written statement and the court shall not \nallow the written statement to be taken on record.‖ \n \n Equally, in Order 8 Rule 1, a new proviso was substituted as \nfollows: \n \n―Provided that where the defendant fails to file the written \nstatement within the said period of thirty days, he shall be \nallowed to file the written statement on such other day, as \nmay be specified by the court, for reasons to be recorded in \nwriting and on payment of such costs as the court deems fit, \nbut which shall not be later than one hundred and twenty \ndays from the date of service of summons and on expiry of \none hundred and twenty days from the date of service of \nsummons, the defendant shall forfeit the right to file the \nwritten statement and the court shall not allow the written \nstatement to be taken on record.‖ \n \nThis was re-emphasized by re-inserting yet another proviso in \nOrder 8 Rule 10 CPC, which reads as under: \n \n―10. Procedure when party fails to present written \nstatement called for by court.—Where any party from \nwhom a written statement is required under Rule 1 or Rule \n                                          \n4 2019 12 SCC 210 \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:20.02.2023\n15:43:21\nSignature Not Verified\n\n--- PAGE 6 ---\nNeutral Citation Number : 2023/DHC/001191 \nC.O. (COMM.IPD-TM) 244/2021 and other connected matters                                                     Page 6 of 15 \n \n9 fails to present the same within the time permitted or \nfixed by the court, as the case may be, the court shall \npronounce judgment against him, or make such order in \nrelation to the suit as it thinks fit and on the pronouncement \nof such judgment a decree shall be drawn up: \n \nProvided further that no court shall make an order to extend \nthe time provided under Rule 1 of this Order for filing of \nthe written statement.‖ \n \nA perusal of these provisions would show that ordinarily a written \nstatement is to be filed within a period of 30 days. However, grace \nperiod of a further 90 days is granted which the Court may employ \nfor reasons to be recorded in writing and payment of such costs as \nit deems fit to allow such written statement to come on record. \nWhat is of great importance is the fact that beyond 120 days from \nthe date of service of summons, the defendant shall forfeit the right \nto file the written statement and the Court shall not allow the \nwritten statement to be taken on record. This is further buttressed \nby the proviso in Order 8 Rule 10 also adding that the court has no \nfurther power to extend the time beyond this period of 120 days. \n \n9. \nIn State of Bihar v. Bihar Rajya Bhumi Vikas Bank \nSamiti5, a question was raised as to whether Section 34(5) of the \nArbitration and Conciliation Act, 1996, inserted by Amending Act \n3 of 2016 is mandatory or directory. In para 11 of the said \njudgment, this Court referred to  Kailash v. Nanhku6, referring to \nthe text of Order 8 Rule 1 as it stood pre the amendment made by \nthe Commercial Courts Act. It also referred (in para 12) to Salem \nAdvocate Bar Assn. v. Union of India7, which, like the  \nKailash v. Nanhku6 judgment, held that the mere expression \n―shall‖ in Order 8 Rule 1 would not make the provision mandatory. \nThis Court then went on to discuss in para 17 of  State v. N.S. \nGnaneswaran8, in which Section 154(2) of the Code of Criminal \nProcedure was held to be directory inasmuch as no consequence \nwas provided if the section was breached. In para 22 by way of \ncontrast to Section 34, Section 29-A of the Arbitration Act was set \nout. This Court then noted in para 23 as under: (Bihar Rajya Bhumi \nVikas Bank Samiti case5, SCC p. 489) \n \n―23. It will be seen from this provision that, unlike Sections \n34(5) and (6), if an award is made beyond the stipulated or \nextended period contained in the section, the consequence \nof the mandate of the arbitrator being terminated is \nexpressly provided. This provision is in stark contrast to \nSections 34(5) and (6) where, as has been stated \nhereinabove, if the period for deciding the application \n                                          \n5 (2018) 9 SCC 472 \n6 (2005) 4 SCC 480 \n7 (2005) 6 SCC 344 \n8 (2013) 3 SCC 594 \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:20.02.2023\n15:43:21\nSignature Not Verified\n\n--- PAGE 7 ---\nNeutral Citation Number : 2023/DHC/001191 \nC.O. (COMM.IPD-TM) 244/2021 and other connected matters                                                     Page 7 of 15 \n \nunder Section 34 has elapsed, no consequence is provided. \nThis is one more indicator that the same Amendment Act, \nwhen it provided time periods in different situations, did so \nintending different consequences.‖ \n \n14. \nThe learned counsel appearing for the respondents also \nrelied upon R.K. Roja v. U.S. Rayudu9 for the proposition that the \ndefendant is entitled to file an application for rejection of plaint \nunder Order 7 Rule 11 before filing his written statement. We are \nof the view that this judgment cannot be read in the manner sought \nfor by the learned counsel appearing on behalf of the respondents. \nOrder 7 Rule 11 proceedings are independent of the filing of a \nwritten statement once a suit has been filed. In fact, para 6 of that \njudgment records: (SCC p. 277) \n \n―6. … However, we may hasten to add that the liberty to \nfile an application for rejection under Order 7 Rule 11 CPC \ncannot be made as a ruse for retrieving the lost opportunity \nto file the written statement.‖ \n \n16. \nThe learned counsel for the respondents then strongly relied \nupon the inherent powers of the court to state that, in any case, a \nprocedural provision such as contained in the amendment, which \nmay lead to unjust consequences can always, in the facts of a \ngiven case, be ignored where such unjust consequences follow, as \nin the facts of the present case. We are again of the view that this \nargument has also no legs to stand on, given the judgment of this \nCourt in Manohar Lal Chopra v. Seth Hiralal10. In this judgment, \nthe Court held: \n \n―39. The suit at Indore which had been instituted later, \ncould be stayed in view of Section 10 of the Code. The \nprovisions of that section are clear, definite and mandatory. \nA court in which a subsequent suit has been filed is \nprohibited from proceeding with the trial of that suit in \ncertain specified circumstances. When there is a special \nprovision in the Code of Civil Procedure for dealing with \nthe contingencies of two such suits being instituted, \nrecourse to the inherent powers under Section 151 is not \njustified.‖ \n \nClearly, the clear, definite and mandatory provisions of Order 5 \nread with Order 8 Rules 1 and 10 cannot be circumvented by \nrecourse to the inherent power under Section 151 to do the \nopposite of what is stated therein.‖ \n \n7. \nMr. Sindhwani submits that, applying the principles elucidated \n                                          \n9 (2016) 14 SCC 275 \n10 1962 Supp (1) SCR 450 \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:20.02.2023\n15:43:21\nSignature Not Verified\n\n--- PAGE 8 ---\nNeutral Citation Number : 2023/DHC/001191 \nC.O. (COMM.IPD-TM) 244/2021 and other connected matters                                                     Page 8 of 15 \n \nin the afore-extracted passages from SCG Contracts4, no consequence \nof non-filing or the failure to file the replication within the period of \n30 days stipulated in Rule 7(x) having been provided in the IPD \nRules, it would be erroneous to hold that the replication, if filed \nbeyond the said period, cannot be taken on record. The failure to \nprovide for any consequence of non-compliance of Rule 7(x), in the \nsubmission of Mr. Sindhwani, results in the stipulation of the \nmaximum period of 30 days in the said rule being rendered directory, \nrather than mandatory. \n \n8. \nMr. Jayant Kumar has sought, in rejoinder, to distinguish the \ndecision in SCG Contracts4 by submitting that the Court was, in that \ncase, essentially concerned with Order VIII Rule 1 and 10 of the Code \nof Civil Procedure, 1908 (CPC) as amended by the Commercial \nCourts Act and not with the provisions such as Rule 7(x) of the IPD \nRules. Besides, he submits, in view of the provisions contained in \nRule 5 of Chapter VII of the Original Side Rules, the petitioner could \nnot seek to place reliance on SCG Contracts4. Mr. Jayant Kumar has \nalso relied on Rule 3911 of the IPD Rules and submits that the power \nto condone delay is restricted to the said Rule, which refers in turn, to \nSection 5 of the Limitation Act. \n \n9. \nHaving heard learned Counsel and examined the legal position, \nI am inclined to agree with Mr. Sindhwani. \n \n10. \nThe attempt of Mr. Jayant Kumar to distinguish SCG \nContracts4 is, on a holistic reading of the decision, misconceived. Para \n8 of the report in SCG Contracts4, no doubt, dealt with the proviso to \n                                          \n11 39. \nCondonation of delay - In case of delay in filing of petitions, appeals or any other proceeding \nbeyond the relevant limitation period, if any, the Court shall have the power to condone delay on principles \nakin to Section 5 of the Limitation Act, 1963 provided that an application demonstrating sufficient cause to \nexplain such delay is filed. \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:20.02.2023\n15:43:21\nSignature Not Verified\n\n--- PAGE 9 ---\nNeutral Citation Number : 2023/DHC/001191 \nC.O. (COMM.IPD-TM) 244/2021 and other connected matters                                                     Page 9 of 15 \n \nOrder VIII Rule 1 and the proviso to Order VIII Rule 10 of the CPC \nas amended by the Commercial Courts Act.  The Supreme Court \nobserved in the said case that while the provisos to Order VIII Rule 1 \nand Order VIII Rule 10 of the CPC required the written statement to \nbe filed within 30 days of summons being served in the suit and \ngranted a grace period of 90 days provided sufficient cause for failure \nto file the written statement within 30 days was shown, the said Rules \nalso provided for the consequence of failure to file the written \nstatement within the maximum period of 120 days. This fact has been \nunderscored by the Supreme Court in para 8 of the report in SCG \nContracts4 as ―of great importance‖. The Supreme Court holds that it \nis of great importance that the provisos to Order VIII Rule 1 and Rule \n10 expressly envisaged forfeiture, by the defendant, of the right to file \nwritten statement, on the expiry of 120 days from the date of service \nof summons. In view of the said dispensation, contained in the \nprovisos to Order VIII Rule 1 and Order VIII Rule 10 of the CPC, of \nthe said consequence visiting a defendant who failed to file the written \nstatement beyond 120 days of service of summons, the Supreme Court \nheld that the period of 120 days had to be treated as mandatory. \n \n11. \nPara 9 of the report contradistinguishes such a case with a \nsituation in which the applicable provision does not provide for the \nconsequence of failure to comply with the statutory requirement \nwithin the maximum period envisaged in the provision. It refers to the \njudgement of the earlier decision of the Supreme Court in State of \nBihar v. Bihar Rajya Bhumi Vikas Bank Samiti5, which dealt with \nSection 34(5)12 of the Arbitration and Conciliation Act, 1996 (―the \n                                          \n12 34. \nApplication for setting aside arbitral award. – \n***** \n(5)  \nAn application under this section shall be filed by a party only after issuing a prior notice \nto the other party and such application shall be accompanied by an affidavit by the applicant \nendorsing compliance with the said requirement. \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:20.02.2023\n15:43:21\nSignature Not Verified\n\n--- PAGE 10 ---\nNeutral Citation Number : 2023/DHC/001191 \nC.O. (COMM.IPD-TM) 244/2021 and other connected matters                                                     Page 10 of 15 \n \n1996 Act‖, hereinafter. \n \n12. \nThe question which arose before the Supreme Court in the said \ncase was whether Section 34(5) of the 1996 Act was mandatory or \ndirectory. In addressing the said issue, the Supreme Court referred to \nits earlier decisions in Kailash v. Nanhku6 and Salem Advocate Bar \nAssociation v. U.O.I.7, which dealt with Order VIII Rule 1 of the \nCPC. It was held, in the said decisions, that the mere fact that Order \nVIII Rule 1 of the CPC used the word ―shall‖ did not, ipso facto, \nrender the provision mandatory. Thereafter, the Supreme Court in \nBihar Rajya Bhumi Vikas Bank Samiti5 went on to distinguish \nSection 34(5) with Section 29A13 of the 1996 Act.  Unlike Section \n29A of the 1996 Act which provided [in sub-section (4)] that, if an \naward was made beyond the stipulated or extended period contained \nin that provision, the mandate of the arbitrator would terminate, it was \nobserved that Sections 34(5) and (6) of the 1996 Act did not provide \nfor any consequence of the time provided in Section 34 lapsing. Thus, \nthe Supreme Court, in Bihar Rajya Bhumi Vikas Bank Samiti5 \ndistinguishes between provisions in which though the word ―shall‖ \n                                          \n13 29-A.  Time limit for arbitral award. –  \n(1)  \nThe award in matters other than international commercial arbitration shall be made by the \narbitral tribunal within a period of twelve months from the date of completion of pleadings under \nsub-section (4) of Section 23: \nProvided that the award in the matter of international commercial arbitration may be \nmade as expeditiously as possible and endeavor may be made to dispose of the matter within a \nperiod of twelve months from the date of completion of pleadings under sub-section (4) of Section \n23. \n(2)  \nIf the award is made within a period of six months from the date the arbitral tribunal \nenters upon the reference, the arbitral tribunal shall be entitled to receive such amount of additional \nfees as the parties may agree. \n(3)  \nThe parties may, by consent, extend the period specified in sub-section (1) for making \naward for a further period not exceeding six months. \n(4)  \nIf the award is not made within the period specified in sub-section (1) or the extended \nperiod specified under sub-section (3), the mandate of the arbitrator(s) shall terminate unless the \ncourt has, either prior to or after the expiry of the period so specified, extended the period: \nProvided that while extending the period under this sub-section, if the court finds that the \nproceedings have been delayed for the reasons attributable to the arbitral tribunal, then, it may order \nreduction of fees of arbitrator(s) by not exceeding five per cent for each month of such delay: \nProvided further that where an application under sub-section (5) is pending, the mandate \nof the arbitrator shall continue till the disposal of the said application: \nProvided also that the arbitrator shall be given an opportunity of being heard before the \nfees is reduced. \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:20.02.2023\n15:43:21\nSignature Not Verified\n\n--- PAGE 11 ---\nNeutral Citation Number : 2023/DHC/001191 \nC.O. (COMM.IPD-TM) 244/2021 and other connected matters                                                     Page 11 of 15 \n \nmay have been employed, the consequence of failure to comply with \nthe provision was, and was not, provided. \n \n13. \nBihar Rajya Bhumi Vikas Bank Samiti5 also invokes the \nprinciple, by now trite in law, that procedural provisions are ordinarily \nengrafted ex debito justitiae and have, therefore, to be regarded as \ndirectory, unless there is strong reason to hold otherwise. \nAdditionally, and at the cost of repetition, where the provisions do not \nprovide for any consequence of failure to act within the maximum \nperiod envisaged thereby, the stipulation of maximum period is \nrequired to be treated as directory.  \n \n14. \nUnlike the situation which obtains in the provisos to Order VIII \nRule 1 and Rule 10 of the CPC as amended by the Commercial Courts \nAct, Rule 7 of the IPD Rules do not provide for any consequence of \nfailure to file rejoinder within the time envisaged by sub-Rule (x) \nthereof. Resultantly, it cannot be said that, if the rejoinder is not filed \nwithin the period of 30 days envisaged in the said Rule, the rejoinder \nwould, ipso facto, be liable to be struck off the record. \n \n15. \nThe reliance, by Mr. Jayant Kumar, on Rule 5 in Chapter VII of \nthe Original Side Rules is, in my considered opinion, misplaced. Rule \n7(xiii) of the IPD Rules makes Rule 5 of Chapter VII of the Original \nSides Rules applicable to original IPD petitions. The applicability is \nnot, however, absolute. Rule 7(xiii) specifically states that the Original \nSide Rules, orders and practice directions issued from time to time in \nthat regard would apply to the extent there is no inconsistency with the \nRules. \n \n16. \nRule 5 in Chapter VII of the Original Side Rules provides for \nfiling of replications in original suits instituted before this Court.  It \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:20.02.2023\n15:43:21\nSignature Not Verified\n\n--- PAGE 12 ---\nNeutral Citation Number : 2023/DHC/001191 \nC.O. (COMM.IPD-TM) 244/2021 and other connected matters                                                     Page 12 of 15 \n \ndoes not, on its face, apply to original IPD petitions instituted, for \nexample, under Section 57(1) and (2)14 of the Trade Marks Act, as in \nthe present case.   \n \n17. \nRule 7(xiii) of the IPD Rules, no doubt, makes the provisions of \nthe Original Side Rules applicable to original IPD petitions, but only \nto the extent the Original Side Rules are not inconsistent with the IPD \nRules.  Inconsistency may be of two types.  There may be situations \nwhere the IPD Rules provide one way, and the Original Side Rules \nanother.  That would be a case of clear and stark inconsistency.  \nInconsistency would, however, also exist, as in the present case, where \nthe IPD Rules do not envisage any consequence of failure to comply \nwith a provision, whereas the Original Side Rules, dealing with a \nsimilar provision in relation to suits, does so.  The statutory intent in \nthe two provisions would, then, be different.  The provisions would, \ntherefore, not be consistent in that respect.  Importing, into the IPD \nRules, the consequence which is envisaged in relation to suits by the \nOriginal Side Rules would be impermissible, as it would amount to \nreading, into the IPD Rules, a consequence which the Original Side \nRules envisages only in relation to original suits, and which the IPD \nRules does not envisage in relation to original IPD petitions.   \n \n18. \nViewed thus, it becomes impossible to apply Rule 5 of Chapter \n7 of the Original Side Rules to a situation which is covered by Rule \n7(x) of the IPD Rules.  Rule 7(x) is self contained in respect of the \n                                          \n14 57.  \nPower to cancel or vary registration and to rectify the register. –  \n(1)  \nOn application made in the prescribed manner to the High Court or to the Registrar by \nany person aggrieved, the Registrar or the High Court, as the case may be, may make such order as \nit may think fit for cancelling or varying the registration of a trade mark on the ground of any \ncontravention, or failure to observe a condition entered on the register in relation thereto. \n(2)  \nAny person aggrieved by the absence or omission from the register of any entry, or by \nany entry made in the register without sufficient cause, or by any entry wrongly remaining on the \nregister, or by any error or defect in any entry in the register, may apply in the prescribed manner to \nthe High Court or to the Registrar, and the Registrar or the High Court, as the case may be, may \nmake such order for making, expunging or varying the entry as it may think fit. \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:20.02.2023\n15:43:21\nSignature Not Verified\n\n--- PAGE 13 ---\nNeutral Citation Number : 2023/DHC/001191 \nC.O. (COMM.IPD-TM) 244/2021 and other connected matters                                                     Page 13 of 15 \n \nrequirement of filing of rejoinders in original IPD petitions.  While \nstipulating a maximum period of 120 days for doing so, it does not \nenvisage any consequence of default.  No such consequence is \nenvisaged elsewhere in the IPD Rules either.  Where the IPD Rules do \nnot envisage any such consequence of default, one cannot tinker with \nthe legislative intent by importing, into the IPD Rules, the \nconsequence of default in failing to file replications in original suits \nwithin the time stipulated, as envisaged by Rule 5 of Chapter VII of \nthe Original Side Rules, by invoking, for the purpose, Rule 7(xiii) of \nthe IPD Rules.   \n \n19. \nEven otherwise, there is a clear distinction between Rule 7(x) of \nthe IPD Rules and Rule 5 in Chapter VII of the Original Side Rules, as \nregards the time for filing rejoinder (in the former case) and \nreplication (in the latter).  Rule 7(x) grants time to file rejoinder either \nas prescribed by the Court or within 30 days from the date on which \nthe Court directs filing of the rejoinder. This provision is, therefore, a \nself contained provision relating to filing of a rejoinder in original IPD \npetitions.  As against this, Rule 5 in Chapter VII of the Original Side \nRules requires the replication to be filed within 30 days of receipt of \nthe written statement and empowers the Court to extend the time for \nfiling replication, if not filed within 30 days, by a further period of 15 \ndays, but not thereafter. It further requires the plaintiff, if such \nextension of 15 days is granted, to be burdened with costs. Failure to \npay the costs so imposed would result in the replication not being \ntaken on record.  No such provisions are to be found in Rule 7(x) of \nthe IPD Rules, which does not provide either for any extension in time \nto file rejoinder beyond the period of 30 days envisaged therein, or for \nimposition of costs for doing so.  The words “but not thereafter”, to \nbe found in Rule 5 of Chapter VII of the Original Side Rules are also \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:20.02.2023\n15:43:21\nSignature Not Verified\n\n--- PAGE 14 ---\nNeutral Citation Number : 2023/DHC/001191 \nC.O. (COMM.IPD-TM) 244/2021 and other connected matters                                                     Page 14 of 15 \n \nconspicuously absent in Rule 7(x) of the IPD Rules.  The Court \ncannot, by judicial fiat, read, into Rule 7(x) of the IPD Rules, the \nwords “but not thereafter” which, though consciously employed in \nRule 5 of Chapter VII of the Original Side Rules, do not find place in \nRule 7(x) of the IPD Rules.  Further, the consequence of non payment \nof costs imposed in terms of Rule 5 of Chapter VII of the Original Side \nRules, cannot be made, by extrapolation, to apply to non filing of a \nrejoinder within the time stipulated in Rule 7(x) of the IPD Rules.   \n \n20. \nEven for this reason, it is not possible for the Court to, by \nrelying on Rule 5 of Chapter VII of the Original Side Rules, hold that \nthe rejoinder, filed beyond the period of 30 days envisaged by Rule \n7(x) of the IPD Rules, cannot be taken on record. \n \n21. \nFor these reasons, the objection of Mr. Jayant Kumar, to the \neffect that as the rejoinder in CO (COMM. IPD-TM) 244/2021 and \nCO (COMM. IPD-TM) 245/2021 were filed beyond 30 days from the \ndate of filing of written statement, they cannot be taken on record, \nfails. \n \n22. \nNo other objection, to the taking on record of the said \nrejoinders, was raised by Mr Jayant Kumar. \n \n23. \nAs such the rejoinders filed in CO (COMM. IPD-TM) 244/2021 \nand CO (COMM. IPD-TM) 245/2021 are taken on record. \n \n24. \nBoth sides submit that if this dispute is referred to mediation, \nthere may be a possibility of an amicable resolution. As such, these \ncases are referred to mediation by the Delhi High Court Mediation and \nConciliation Centre. \n \n25. \nLearned Counsel may contact the concerned officer in the Delhi \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:20.02.2023\n15:43:21\nSignature Not Verified\n\n--- PAGE 15 ---\nNeutral Citation Number : 2023/DHC/001191 \nC.O. (COMM.IPD-TM) 244/2021 and other connected matters                                                     Page 15 of 15 \n \nHigh Court Mediation and Conciliation Centre on 20th February 2023 \nat 2 pm to fix a schedule for Mediation.  \n \n26. \nAccordingly, re-notify on 13th April 2023 to ascertain the \noutcome of Mediation. \n \n \nC.HARI SHANKAR, J \n \nFEBRUARY 16, 2023 \n \nAR \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:20.02.2023\n15:43:21\nSignature Not Verified\n"
  },
  "total_pages": 15,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "According to the PDF document \"Vinay Kumar GB v. Sudhir Kumar and Anr.pdf\", the case is being heard in the High Court of Delhi at New Delhi. The plaintiff, Vinay Kumar GB, is represented by Mr. Sanjeev Sindhwani, Sr. Adv. with Ms. Kruttika Vijay and Mr. Sauhard Alung, Advs. The defendants, Sudhir Kumar and Anr, are represented by Mr. Jayant Kumar and Mr. Amit Mehta, Advs.\n\nThe case involves multiple connected matters, including C.O. (COMM.IPD-TM) 244/2021, C.O. (COMM.IPD-TM) 245/2021, C.O. (COMM.IPD-TM) 342/2021, and C.O. (COMM.IPD-TM) 395/2021. The court is presided over by Hon'ble Mr. Justice C. Hari Shankar.\n\nThe document mentions an objection raised by Mr. Jayant Kumar, learned Counsel for the respondents, regarding the taking on record of the rejoinders filed by the petitioners. The order disposes of this objection. The court proceedings took place on February 16, 2023.\n\nOther relevant details include the Neutral Citation Number: 2023/DHC/001191 and the Digitally Signed document by Sunil Singh Negi on February 20, 2023. The case also involves a counter-suit, CS(COMM) 779/2022, filed by Shri Sudhir Kumar against Vinay Kumar G B, proprietor of Insights IAS and Insights Active Learning, and others.\n\nSource: Vinay Kumar GB v. Sudhir Kumar and Anr.pdf, Pages 1-2 of 15.",
      "pdf_source": "46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "According to page 1 of the PDF \"46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf\", the case is being heard in the High Court of Delhi at New Delhi. The Neutral Citation Number is 2023/DHC/001191 and the case numbers are C.O. (COMM.IPD-TM) 244/2021 and other connected matters. The plaintiff, Vinay Kumar GB, is represented by Mr. Sanjeev Sindhwani, Sr. Adv. with Ms. Kruttika Vijay and Mr. Sauhard Alung, Advs. The defendants, Sudhir Kumar and Anr, are represented by Mr. Jayant Kumar and Mr. Amit Mehta, Advs. The PDF also mentions other connected cases with similar parties and representation. The document was digitally signed by Sunil Singh Negi on 20.02.2023. The case involves multiple plaintiffs, including Vijay Kumar GB, with the same defendants and legal representation. (Source: 46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf)",
          "content": "Neutral Citation Number : 2023/DHC/001191 \nC.O. (COMM.IPD-TM) 244/2021 and other connected matters                                                     Page 1 of 15 \n \n$~28 - 32 \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nC.O. (COMM.IPD-TM) 244/2021 \n \nVINAY KUMAR GB \n \n \n \n \n ..... Plaintiff \nThrough: \nMr. Sanjeev Sindhwani, Sr. \nAdv. with Ms. Kruttika Vijay and Mr. \nSauhard Alung, Advs. \n \n \n \n \n \nversus \n \n \nSUDHIR KUMAR AND ANR  \n \n      ..... Defendants \nThrough: \nMr. Jayant Kumar and Mr. \nAmit Mehta, Advs. for R-1 \n \n+  \nC.O. (COMM.IPD-TM) 245/2021 \n \nVINAY KUMAR GB \n \n \n \n \n..... Plaintiff \nThrough: \nMr. Sanjeev Sindhwani, Sr. \nAdv. with Ms. Kruttika Vijay and Mr. \nSauhard Alung, Advs. \n \n \n \n \n \nversus \n \n \nSUDHIR KUMAR AND ANR  \n \n      ..... Defendants \nThrough: \nMr. Jayant Kumar and Mr. \nAmit Mehta, Advs. for R-1 \n \n+  \nC.O. (COMM.IPD-TM) 342/2021 \n \nVIJAY KUMAR GB \n \n \n \n \n..... Plaintiff \nThrough: \nMr. Sanjeev Sindhwani, Sr. \nAdv. with Ms. Kruttika Vijay and Mr. \nSauhard Alung, Advs. \n \n \n \n \n \nversus \n \n \nSUDHIR KUMAR AND ANR  \n \n      ..... Defendants \nThrough: \nMr. Jayant Kumar and Mr. \nAmit Mehta, Advs. for R-1 \n \n+  \nC.O. (COMM.IPD-TM) 395/2021 \n \nVINAY KUMAR GB \n \n \n \n \n..... Plaintiff \nThrough: \nMr. Sanjeev Sindhwani, Sr. \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:20.02.2023\n15:43:21\nSignature Not Verified",
          "pdf_source": "46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "According to page 2 of the PDF \"46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf\", the court proceedings involve multiple connected matters, including C.O. (COMM.IPD-TM) 244/2021 and CS(COMM) 779/2022. The plaintiffs and defendants are represented by various advocates, including Mr. Sanjeev Sindhwani, Mr. Jayant Kumar, and Mr. Amit Mehta. The matter was heard by Hon'ble Mr. Justice C. Hari Shankar on 16.02.2023. The court addressed an objection raised by Mr. Jayant Kumar regarding the taking on record of the rejoinders filed by the petitioners. The order disposes of this objection. The PDF, with Neutral Citation Number 2023/DHC/001191, provides details of the court proceedings and the parties involved. (Source: 46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf)",
          "content": "Neutral Citation Number : 2023/DHC/001191 \nC.O. (COMM.IPD-TM) 244/2021 and other connected matters                                                     Page 2 of 15 \n \nAdv. with Ms. Kruttika Vijay and Mr. \nSauhard Alung, Advs. \n \n \n \n \n \nversus \n \n \nSUDHIR KUMAR AND ANR  \n \n      ..... Defendants \nThrough: \nMr. Jayant Kumar and Mr. \nAmit Mehta, Advs. for R-1 \n \n+  \nCS(COMM) 779/2022 \nSHRI SUDHIR KUMAR AT S. BALIYAN, \nPROPRIETOR OF INSIGHT IAS ACADEMY \n..... Plaintiff \nThrough: \nMr. Jayant Kumar and Mr. \nAmit Mehta, Advs. \n \n \n \n \n \nversus \n \nVINAY KUMAR G B, PROPRIETOR  \nOF INSIGHTS IAS AND INSIGHTS \nACTIVE LEARNING AND ORS. \n \n      ..... Defendants \nThrough: \nMr. Sanjeev Sindhwani, Sr. \nAdv. with Ms. Kruttika Vijay and Mr. \nSauhard Alung, Advs. \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C.HARI SHANKAR \n   ORDER (ORAL) \n% \n \n \n \n        16.02.2023 \n \nC.O. (COMM.IPD-TM) 244/2021 \nC.O. (COMM.IPD-TM) 245/2021 \nC.O. (COMM.IPD-TM) 342/2021 \nC.O. (COMM.IPD-TM) 395/2021 \nCS(COMM) 779/2022 \n \n \n1. \nThese matters were listed today in view of a somewhat intricate \nobjection raised by Mr Jayant Kumar, learned Counsel for the \nrespondents in CO (COMM. IPD-TM) 244/2021 and CO (COMM \nIPD-TM) 245/2021, to the taking, on record, of the rejoinders filed by \nthe petitioners.  This order disposes of the objection. \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:20.02.2023\n15:43:21\nSignature Not Verified",
          "pdf_source": "46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0007",
      "start_index": 3,
      "end_index": 5,
      "summary": "According to the PDF document \"Vinay Kumar GB v. Sudhir Kumar and Anr.pdf\", a legal proceeding is underway in the High Court of Delhi at New Delhi (C.O. (COMM.IPD-TM) 244/2021). The plaintiff, Vinay Kumar GB, is represented by Mr. Sanjeev Sindhwani, while the defendants, Sudhir Kumar and Anr, are represented by Mr. Jayant Kumar. \n\nThe issue at hand is the filing of a rejoinder by the plaintiff, which was submitted on February 13, 2023, allegedly beyond the stipulated time frame of 30 days from September 12, 2022, as directed by the Joint Registrar. The defendants argue that according to Rule 7(x) of the Intellectual Appellate Division (IPD) Rules, 2002, and Rule 5 in Chapter VII of the Delhi High Court (Original Side) Rules, 2018, the rejoinder cannot be taken on record as it was not filed within the maximum allowed period.\n\nThe defendants contend that the use of the word \"shall\" in Rule 7(x) implies a strict time limit, and the plaintiff's failure to comply with this rule means the rejoinder is inadmissible. The court is considering the arguments and will decide whether to accept the rejoinder or not. The case is listed for completion of pleadings, with a connected matter (C.O. (COMM.IPD-TM) 737/2021) scheduled for November 11, 2022. (Source: Vinay Kumar GB v. Sudhir Kumar and Anr.pdf, pages 1-4)",
      "pdf_source": "46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "According to page 3 of the PDF \"46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf\", the respondents' counsel, Mr. Jayant Kumar, argued that the petitioner's rejoinders were filed beyond the time stipulated in Rule 7(x) of the Intellectual Appellate Division (IPD) Rules, 2002. The rule requires rejoinders to be filed within the period prescribed by the Court or within 30 days from the date of the Court's direction. Since the Joint Registrar directed the filing of rejoinder on September 12, 2022, without specifying a time frame, Mr. Jayant Kumar claimed that the rejoinder should have been filed within 30 days, i.e., by October 12, 2022. However, the rejoinder was filed on February 13, 2023, making it ineligible to be taken on record. (Source: 46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf, page 3)",
          "content": "Neutral Citation Number : 2023/DHC/001191 \nC.O. (COMM.IPD-TM) 244/2021 and other connected matters                                                     Page 3 of 15 \n \n \n2. \nMr. Jayant Kumar, learned Counsel for the respondent \nsubmitted that the rejoinders filed by the petitioner in these petitions \nhad been filed beyond the time stipulated in Rule 7(x)1 of the \nIntellectual Appellate Division (IPD) Rules, 2002 as applicable to this \nCourt and that, therefore, they could not be taken on record. \nAccording to Mr. Jayant Kumar, the use of the word ―shall‖, in Rule \n7(x) of the IPD Rules supra forecloses the right of the petitioner to file \na rejoinder once the maximum period envisaged in the said Rule has \nexpired. \n \n3. \nRule 7(x) of the IPD Rules which, admittedly, relates to the \nprocedure to be followed in the case of original petitions, and would, \ntherefore, apply to the present case, requires the rejoinder to the reply \nfiled by the respondent in an original petition to be filed ―within the \nperiod prescribed by the Court or within 30 days from the date on \nwhich the Court directs the filing of such rejoinder‖. Mr. Jayant \nKumar points out that, in these cases, the learned Joint Registrar in \nthis Court had directed filing of rejoinder on 12th September 2022 \nwithout stipulating any period within which the rejoinder was to be \nfiled. Rule 7(x) would, therefore, in his submission, require the \nrejoinder to be filed within a maximum period of 30 days from 12th \nSeptember 2022. The rejoinder having been filed on 13th February \n2023, Mr. Jayant Kumar submits that it could not be taken on record. \nThe order dated 12th September 2022 of the learned Joint Registrar \n(Original) read thus: \n― \nReply/counter statement filed by respondent no. l along \nwith documents.  \nRejoinder \nto \ncounter \nstatement \nand \naffidavit \nof \n                                          \n1 7. \nProcedure for Original Petitions (Civil Original Petition) \n(x) \nRejoinder to the reply, if so directed, shall be filed within the period prescribed by the \nCourt or shall be filed within 60 days from the date on which the Court directs filing of the Reply. \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:20.02.2023\n15:43:21\nSignature Not Verified",
          "pdf_source": "46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "According to page 4 of the PDF \"46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf\", the court proceedings involve a petition by Vinay Kumar GB against Sudhir Kumar and Anr. The counsel for the petitioner requests that the matter be listed along with a connected case (C.O. (COMM.IPD-TM) 737/2021) on 11.11.2022. \n\nMr. Jayant Kumar cites Rule 52 in Chapter VII of the Delhi High Court (Original Side) Rules, 2018, and Rule 7(xiii)3 of the IPD Rules, arguing that the rejoinder filed by the petitioner should not be taken on record as it was not filed within the maximum period allowed. \n\nThe court considers the arguments and the rules applicable to the case. The PDF source is a court document with the Neutral Citation Number: 2023/DHC/001191, and the case number C.O. (COMM.IPD-TM) 244/2021. Key dates mentioned include 11.11.2022 and 20.02.2023.",
          "content": "Neutral Citation Number : 2023/DHC/001191 \nC.O. (COMM.IPD-TM) 244/2021 and other connected matters                                                     Page 4 of 15 \n \nadmission/denial be filed in terms of Delhi High Court Intellectual \nProperty Rights Division Rules 2022. \nIt is submitted by counsel for petitioner that connected \nmatter i.e. C.O. (COMM.IPD-TM) 737/2021 is listed before the \nHon'ble Court for 11.11.2022 and has prayed that this matter may \nbe listed along with the said case. \nAccordingly, list the matter for completion of pleadings on \n11.11.2022.‖ \n \n4. \nMr. Jayant Kumar has also placed reliance on Rule 52 in \nChapter VII of the Delhi High Court (Original Side) Rules, 2018 in \nconjunction with Rule 7(xiii)3 of the IPD Rules. He submits that, by \napplication of Rule 5 in Chapter VII of the Original Side Rules, the \nCourt was empowered to grant extension of time for filing rejoinder \nby a maximum period of 15 days beyond the period of 30 days \noriginally provided, subject to costs. The Rule, he submits, further \nprovides that, if the rejoinder is not filed within the said maximum \nperiod, it shall not be taken on record. \n \n5. \nThe mandate of Rule 5 in Chapter VII of the Original Side \nRules, according to Mr. Jayant Kumar, is clear and, therefore, the \nrejoinder filed by the petitioner in these petitions cannot be taken on \nrecord. \n \n6. \nMr. Sanjeev Sindhwani, learned Senior Counsel for the \n                                          \n2 5. \nReplication. – The replication, if any, shall be filed within 30 days of receipt of the \nwritten statement.  If the Court is satisfied that the plaintiff was prevented by sufficient cause for \nexceptional and unavoidable reasons in filing the replication within 30 days, it may extend the \ntime for filing the same by a further period not exceeding 15 days but not thereafter.  For such \nextension, the plaintiff shall be burdened with costs, as deemed appropriate.  The replication shall \nnot be taken on record, unless such costs have been paid/deposited.  In case no replication is filed \nwithin the extended time also, the Registrar shall forthwith place the matter for appropriate orders \nbefore the Court.  An advance copy of the replication together with legible copies of all documents \nin possession and power of plaintiff, that it seeks to file along with the replication, shall be served \non the defendant and the replication together with the said documents shall not be accepted unless \nit contains an endorsement of service signed by the defendant/his Advocate. \n3 (xiii) Procedures applicable to original petitions:  The provisions of the Commercial Courts \nAct, 2015, Delhi High Court (Original Side) Rules, 2018 and orders as also the practice directions \nissued from time to time, to the extent there is no inconsistency with these Rules, shall be \napplicable to original petitions filed in the IPD.  \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:20.02.2023\n15:43:21\nSignature Not Verified",
          "pdf_source": "46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf",
          "nodes": []
        },
        {
          "title": "Page 5",
          "node_id": "0006",
          "start_index": 5,
          "end_index": 5,
          "summary": "According to page 5 of the PDF \"46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf\", the petitioner disputes the contention of Mr. Jayant Kumar, citing the Supreme Court judgment in SCG Contracts (India) Pvt Ltd v. K.S. Chamankar Infrastructure Pvt Ltd (2019 12 SCC 210). The judgment refers to amendments to the Code of Civil Procedure, specifically Order 5 Rule 1 and Order 8 Rule 1, which state that a defendant who fails to file a written statement within 30 days can still file it within 120 days of the service of summons, with court-specified costs. If the defendant fails to file within 120 days, they forfeit the right to file a written statement. The petitioner relies on this judgment to support their argument. (Source: 46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf, page 5)",
          "content": "Neutral Citation Number : 2023/DHC/001191 \nC.O. (COMM.IPD-TM) 244/2021 and other connected matters                                                     Page 5 of 15 \n \npetitioner submits that the contention of Mr. Jayant Kumar is \ncompletely misconceived. He places reliance on the judgment of \nSupreme Court in SCG Contracts (India) Pvt Ltd v. K.S. Chamankar \nInfrastructure Pvt Ltd4, specifically on paras 8, 9, 14 and 16 thereof, \nwhich read thus: \n―8. \nThe Commercial Courts, Commercial Division and \nCommercial Appellate Division of High Courts Act, 2015 came \ninto force on 23-10-2015 bringing in their wake certain \namendments to the Code of Civil Procedure. In Order 5 Rule 1, \nsub-rule (1), for the second proviso, the following proviso was \nsubstituted: \n \n―Provided further that where the defendant fails to file the \nwritten statement within the said period of thirty days, he \nshall be allowed to file the written statement on such other \nday, as may be specified by the court, for reasons to be \nrecorded in writing and on payment of such costs as the \ncourt deems fit, but which shall not be later than one \nhundred twenty days from the date of service of summons \nand on expiry of one hundred and twenty days from the \ndate of service of summons, the defendant shall forfeit the \nright to file the written statement and the court shall not \nallow the written statement to be taken on record.‖ \n \n Equally, in Order 8 Rule 1, a new proviso was substituted as \nfollows: \n \n―Provided that where the defendant fails to file the written \nstatement within the said period of thirty days, he shall be \nallowed to file the written statement on such other day, as \nmay be specified by the court, for reasons to be recorded in \nwriting and on payment of such costs as the court deems fit, \nbut which shall not be later than one hundred and twenty \ndays from the date of service of summons and on expiry of \none hundred and twenty days from the date of service of \nsummons, the defendant shall forfeit the right to file the \nwritten statement and the court shall not allow the written \nstatement to be taken on record.‖ \n \nThis was re-emphasized by re-inserting yet another proviso in \nOrder 8 Rule 10 CPC, which reads as under: \n \n―10. Procedure when party fails to present written \nstatement called for by court.—Where any party from \nwhom a written statement is required under Rule 1 or Rule \n                                          \n4 2019 12 SCC 210 \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:20.02.2023\n15:43:21\nSignature Not Verified",
          "pdf_source": "46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0016",
      "start_index": 6,
      "end_index": 13,
      "summary": "According to the PDF document \"Vinay Kumar GB v. Sudhir Kumar and Anr.pdf\", the High Court of Delhi at New Delhi is hearing a commercial case (C.O. (COMM.IPD-TM) 244/2021) between Vinay Kumar GB (Plaintiff) and Sudhir Kumar and Anr (Defendants). The Neutral Citation Number is 2023/DHC/001191.\n\nThe legal argument revolves around the filing of a written statement by the defendant within the stipulated time period of 30 days, with a possible extension of 90 days. However, if the defendant fails to file the written statement within 120 days from the date of service of summons, they forfeit the right to file it.\n\nThe court refers to previous judgments, including State of Bihar v. Bihar Rajya Bhumi Vikas Bank Samiti, to determine whether the provision is mandatory or directory. The court notes that the provision is mandatory, and no extension beyond 120 days is allowed.\n\nThe defendant's counsel relies on R.K. Roja v. U.S. Rayudu, arguing that the defendant can file an application for rejection of plaint under Order 7 Rule 11 before filing their written statement. However, the court disagrees, stating that Order 7 Rule 11 proceedings are independent of the filing of a written statement.\n\nSource: Vinay Kumar GB v. Sudhir Kumar and Anr.pdf (Pages 1-7 of 15)",
      "pdf_source": "46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf",
      "nodes": [
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "According to page 6 of the PDF \"46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf\", the court discusses the provisions of Order 8 Rule 1, which states that a written statement must be filed within 30 days, with a possible extension of 90 days. However, if the defendant fails to file the written statement within 120 days, they forfeit their right to do so. The court refers to previous judgments, including State of Bihar v. Bihar Rajya Bhumi Vikas Bank Samiti, to determine whether certain provisions are mandatory or directory. The case cites various legal precedents, including Kailash v. Nanhku and Salem Advocate Bar Assn. v. Union of India. The PDF is a court document with the Neutral Citation Number: 2023/DHC/001191 and case number C.O. (COMM.IPD-TM) 244/2021.",
          "content": "Neutral Citation Number : 2023/DHC/001191 \nC.O. (COMM.IPD-TM) 244/2021 and other connected matters                                                     Page 6 of 15 \n \n9 fails to present the same within the time permitted or \nfixed by the court, as the case may be, the court shall \npronounce judgment against him, or make such order in \nrelation to the suit as it thinks fit and on the pronouncement \nof such judgment a decree shall be drawn up: \n \nProvided further that no court shall make an order to extend \nthe time provided under Rule 1 of this Order for filing of \nthe written statement.‖ \n \nA perusal of these provisions would show that ordinarily a written \nstatement is to be filed within a period of 30 days. However, grace \nperiod of a further 90 days is granted which the Court may employ \nfor reasons to be recorded in writing and payment of such costs as \nit deems fit to allow such written statement to come on record. \nWhat is of great importance is the fact that beyond 120 days from \nthe date of service of summons, the defendant shall forfeit the right \nto file the written statement and the Court shall not allow the \nwritten statement to be taken on record. This is further buttressed \nby the proviso in Order 8 Rule 10 also adding that the court has no \nfurther power to extend the time beyond this period of 120 days. \n \n9. \nIn State of Bihar v. Bihar Rajya Bhumi Vikas Bank \nSamiti5, a question was raised as to whether Section 34(5) of the \nArbitration and Conciliation Act, 1996, inserted by Amending Act \n3 of 2016 is mandatory or directory. In para 11 of the said \njudgment, this Court referred to  Kailash v. Nanhku6, referring to \nthe text of Order 8 Rule 1 as it stood pre the amendment made by \nthe Commercial Courts Act. It also referred (in para 12) to Salem \nAdvocate Bar Assn. v. Union of India7, which, like the  \nKailash v. Nanhku6 judgment, held that the mere expression \n―shall‖ in Order 8 Rule 1 would not make the provision mandatory. \nThis Court then went on to discuss in para 17 of  State v. N.S. \nGnaneswaran8, in which Section 154(2) of the Code of Criminal \nProcedure was held to be directory inasmuch as no consequence \nwas provided if the section was breached. In para 22 by way of \ncontrast to Section 34, Section 29-A of the Arbitration Act was set \nout. This Court then noted in para 23 as under: (Bihar Rajya Bhumi \nVikas Bank Samiti case5, SCC p. 489) \n \n―23. It will be seen from this provision that, unlike Sections \n34(5) and (6), if an award is made beyond the stipulated or \nextended period contained in the section, the consequence \nof the mandate of the arbitrator being terminated is \nexpressly provided. This provision is in stark contrast to \nSections 34(5) and (6) where, as has been stated \nhereinabove, if the period for deciding the application \n                                          \n5 (2018) 9 SCC 472 \n6 (2005) 4 SCC 480 \n7 (2005) 6 SCC 344 \n8 (2013) 3 SCC 594 \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:20.02.2023\n15:43:21\nSignature Not Verified",
          "pdf_source": "46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf",
          "nodes": []
        },
        {
          "title": "Page 7",
          "node_id": "0009",
          "start_index": 7,
          "end_index": 7,
          "summary": "According to page 7 of the PDF \"46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf\", the court discusses the respondents' arguments regarding the filing of an application for rejection of plaint under Order 7 Rule 11 and the court's inherent powers. The respondents cited R.K. Roja v. U.S. Rayudu, but the court disagreed with their interpretation. The court also rejected the argument that procedural provisions can be ignored to prevent unjust consequences, citing Manohar Lal Chopra v. Seth Hiralal. The court stated that clear and mandatory provisions cannot be circumvented by recourse to inherent powers. Mr. Sindhwani, the plaintiff's counsel, submitted arguments applying the principles elucidated in the judgments. (Source: 46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf, Page 7)",
          "content": "Neutral Citation Number : 2023/DHC/001191 \nC.O. (COMM.IPD-TM) 244/2021 and other connected matters                                                     Page 7 of 15 \n \nunder Section 34 has elapsed, no consequence is provided. \nThis is one more indicator that the same Amendment Act, \nwhen it provided time periods in different situations, did so \nintending different consequences.‖ \n \n14. \nThe learned counsel appearing for the respondents also \nrelied upon R.K. Roja v. U.S. Rayudu9 for the proposition that the \ndefendant is entitled to file an application for rejection of plaint \nunder Order 7 Rule 11 before filing his written statement. We are \nof the view that this judgment cannot be read in the manner sought \nfor by the learned counsel appearing on behalf of the respondents. \nOrder 7 Rule 11 proceedings are independent of the filing of a \nwritten statement once a suit has been filed. In fact, para 6 of that \njudgment records: (SCC p. 277) \n \n―6. … However, we may hasten to add that the liberty to \nfile an application for rejection under Order 7 Rule 11 CPC \ncannot be made as a ruse for retrieving the lost opportunity \nto file the written statement.‖ \n \n16. \nThe learned counsel for the respondents then strongly relied \nupon the inherent powers of the court to state that, in any case, a \nprocedural provision such as contained in the amendment, which \nmay lead to unjust consequences can always, in the facts of a \ngiven case, be ignored where such unjust consequences follow, as \nin the facts of the present case. We are again of the view that this \nargument has also no legs to stand on, given the judgment of this \nCourt in Manohar Lal Chopra v. Seth Hiralal10. In this judgment, \nthe Court held: \n \n―39. The suit at Indore which had been instituted later, \ncould be stayed in view of Section 10 of the Code. The \nprovisions of that section are clear, definite and mandatory. \nA court in which a subsequent suit has been filed is \nprohibited from proceeding with the trial of that suit in \ncertain specified circumstances. When there is a special \nprovision in the Code of Civil Procedure for dealing with \nthe contingencies of two such suits being instituted, \nrecourse to the inherent powers under Section 151 is not \njustified.‖ \n \nClearly, the clear, definite and mandatory provisions of Order 5 \nread with Order 8 Rules 1 and 10 cannot be circumvented by \nrecourse to the inherent power under Section 151 to do the \nopposite of what is stated therein.‖ \n \n7. \nMr. Sindhwani submits that, applying the principles elucidated \n                                          \n9 (2016) 14 SCC 275 \n10 1962 Supp (1) SCR 450 \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:20.02.2023\n15:43:21\nSignature Not Verified",
          "pdf_source": "46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf",
          "nodes": []
        },
        {
          "title": "Page 8",
          "node_id": "0010",
          "start_index": 8,
          "end_index": 8,
          "summary": "According to page 8 of the PDF \"46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf\", the court discusses the implications of non-filing of replication within 30 days as stipulated in Rule 7(x) of the IPD Rules. Mr. Sindhwani argues that the failure to provide consequences for non-compliance renders the rule directory, not mandatory. Mr. Jayant Kumar attempts to distinguish the decision in SCG Contracts, but the court agrees with Mr. Sindhwani. The court examines Rule 3911 of the IPD Rules, which refers to Section 5 of the Limitation Act, regarding condonation of delay. The PDF source is a court document with Neutral Citation Number: 2023/DHC/001191, dated February 20, 2023. Key parties involved include Vinay Kumar GB (plaintiff) and Sudhir Kumar (defendant), represented by advocates Mr. Sanjeev Sindhwani and Mr. Jayant Kumar, respectively.",
          "content": "Neutral Citation Number : 2023/DHC/001191 \nC.O. (COMM.IPD-TM) 244/2021 and other connected matters                                                     Page 8 of 15 \n \nin the afore-extracted passages from SCG Contracts4, no consequence \nof non-filing or the failure to file the replication within the period of \n30 days stipulated in Rule 7(x) having been provided in the IPD \nRules, it would be erroneous to hold that the replication, if filed \nbeyond the said period, cannot be taken on record. The failure to \nprovide for any consequence of non-compliance of Rule 7(x), in the \nsubmission of Mr. Sindhwani, results in the stipulation of the \nmaximum period of 30 days in the said rule being rendered directory, \nrather than mandatory. \n \n8. \nMr. Jayant Kumar has sought, in rejoinder, to distinguish the \ndecision in SCG Contracts4 by submitting that the Court was, in that \ncase, essentially concerned with Order VIII Rule 1 and 10 of the Code \nof Civil Procedure, 1908 (CPC) as amended by the Commercial \nCourts Act and not with the provisions such as Rule 7(x) of the IPD \nRules. Besides, he submits, in view of the provisions contained in \nRule 5 of Chapter VII of the Original Side Rules, the petitioner could \nnot seek to place reliance on SCG Contracts4. Mr. Jayant Kumar has \nalso relied on Rule 3911 of the IPD Rules and submits that the power \nto condone delay is restricted to the said Rule, which refers in turn, to \nSection 5 of the Limitation Act. \n \n9. \nHaving heard learned Counsel and examined the legal position, \nI am inclined to agree with Mr. Sindhwani. \n \n10. \nThe attempt of Mr. Jayant Kumar to distinguish SCG \nContracts4 is, on a holistic reading of the decision, misconceived. Para \n8 of the report in SCG Contracts4, no doubt, dealt with the proviso to \n                                          \n11 39. \nCondonation of delay - In case of delay in filing of petitions, appeals or any other proceeding \nbeyond the relevant limitation period, if any, the Court shall have the power to condone delay on principles \nakin to Section 5 of the Limitation Act, 1963 provided that an application demonstrating sufficient cause to \nexplain such delay is filed. \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:20.02.2023\n15:43:21\nSignature Not Verified",
          "pdf_source": "46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf",
          "nodes": []
        },
        {
          "title": "Page 9",
          "node_id": "0011",
          "start_index": 9,
          "end_index": 9,
          "summary": "According to page 9 of the PDF \"46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf\", the Supreme Court observed that the provisos to Order VIII Rule 1 and Order VIII Rule 10 of the CPC require a written statement to be filed within 30 days of summons being served, with a 90-day grace period if sufficient cause is shown. The Court held that failure to file the written statement within 120 days results in forfeiture of the right to file it. The Supreme Court emphasized that the 120-day period is mandatory, as it provides for a consequence for non-compliance. This is distinguished from cases where the applicable provision does not provide for such a consequence, as seen in the judgment of State of Bihar v. Bihar Rajya Bhumi Vikas Bank Samiti, which dealt with Section 34(5) of the Arbitration and Conciliation Act, 1996. (Source: 46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf, Neutral Citation Number: 2023/DHC/001191)",
          "content": "Neutral Citation Number : 2023/DHC/001191 \nC.O. (COMM.IPD-TM) 244/2021 and other connected matters                                                     Page 9 of 15 \n \nOrder VIII Rule 1 and the proviso to Order VIII Rule 10 of the CPC \nas amended by the Commercial Courts Act.  The Supreme Court \nobserved in the said case that while the provisos to Order VIII Rule 1 \nand Order VIII Rule 10 of the CPC required the written statement to \nbe filed within 30 days of summons being served in the suit and \ngranted a grace period of 90 days provided sufficient cause for failure \nto file the written statement within 30 days was shown, the said Rules \nalso provided for the consequence of failure to file the written \nstatement within the maximum period of 120 days. This fact has been \nunderscored by the Supreme Court in para 8 of the report in SCG \nContracts4 as ―of great importance‖. The Supreme Court holds that it \nis of great importance that the provisos to Order VIII Rule 1 and Rule \n10 expressly envisaged forfeiture, by the defendant, of the right to file \nwritten statement, on the expiry of 120 days from the date of service \nof summons. In view of the said dispensation, contained in the \nprovisos to Order VIII Rule 1 and Order VIII Rule 10 of the CPC, of \nthe said consequence visiting a defendant who failed to file the written \nstatement beyond 120 days of service of summons, the Supreme Court \nheld that the period of 120 days had to be treated as mandatory. \n \n11. \nPara 9 of the report contradistinguishes such a case with a \nsituation in which the applicable provision does not provide for the \nconsequence of failure to comply with the statutory requirement \nwithin the maximum period envisaged in the provision. It refers to the \njudgement of the earlier decision of the Supreme Court in State of \nBihar v. Bihar Rajya Bhumi Vikas Bank Samiti5, which dealt with \nSection 34(5)12 of the Arbitration and Conciliation Act, 1996 (―the \n                                          \n12 34. \nApplication for setting aside arbitral award. – \n***** \n(5)  \nAn application under this section shall be filed by a party only after issuing a prior notice \nto the other party and such application shall be accompanied by an affidavit by the applicant \nendorsing compliance with the said requirement. \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:20.02.2023\n15:43:21\nSignature Not Verified",
          "pdf_source": "46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf",
          "nodes": []
        },
        {
          "title": "Page 10",
          "node_id": "0012",
          "start_index": 10,
          "end_index": 10,
          "summary": "According to page 10 of the PDF \"46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf\", the Supreme Court addressed the issue of whether Section 34(5) of the 1996 Act is mandatory or directory. The court referred to previous decisions in Kailash v. Nanhku and Salem Advocate Bar Association v. U.O.I., which dealt with Order VIII Rule 1 of the CPC. The court distinguished Section 34(5) from Section 29A of the 1996 Act, noting that Section 29A provides for the termination of the arbitrator's mandate if an award is made beyond the stipulated period, whereas Section 34(5) does not provide for any consequence of the time lapsing. (Source: 46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf, page 10)",
          "content": "Neutral Citation Number : 2023/DHC/001191 \nC.O. (COMM.IPD-TM) 244/2021 and other connected matters                                                     Page 10 of 15 \n \n1996 Act‖, hereinafter. \n \n12. \nThe question which arose before the Supreme Court in the said \ncase was whether Section 34(5) of the 1996 Act was mandatory or \ndirectory. In addressing the said issue, the Supreme Court referred to \nits earlier decisions in Kailash v. Nanhku6 and Salem Advocate Bar \nAssociation v. U.O.I.7, which dealt with Order VIII Rule 1 of the \nCPC. It was held, in the said decisions, that the mere fact that Order \nVIII Rule 1 of the CPC used the word ―shall‖ did not, ipso facto, \nrender the provision mandatory. Thereafter, the Supreme Court in \nBihar Rajya Bhumi Vikas Bank Samiti5 went on to distinguish \nSection 34(5) with Section 29A13 of the 1996 Act.  Unlike Section \n29A of the 1996 Act which provided [in sub-section (4)] that, if an \naward was made beyond the stipulated or extended period contained \nin that provision, the mandate of the arbitrator would terminate, it was \nobserved that Sections 34(5) and (6) of the 1996 Act did not provide \nfor any consequence of the time provided in Section 34 lapsing. Thus, \nthe Supreme Court, in Bihar Rajya Bhumi Vikas Bank Samiti5 \ndistinguishes between provisions in which though the word ―shall‖ \n                                          \n13 29-A.  Time limit for arbitral award. –  \n(1)  \nThe award in matters other than international commercial arbitration shall be made by the \narbitral tribunal within a period of twelve months from the date of completion of pleadings under \nsub-section (4) of Section 23: \nProvided that the award in the matter of international commercial arbitration may be \nmade as expeditiously as possible and endeavor may be made to dispose of the matter within a \nperiod of twelve months from the date of completion of pleadings under sub-section (4) of Section \n23. \n(2)  \nIf the award is made within a period of six months from the date the arbitral tribunal \nenters upon the reference, the arbitral tribunal shall be entitled to receive such amount of additional \nfees as the parties may agree. \n(3)  \nThe parties may, by consent, extend the period specified in sub-section (1) for making \naward for a further period not exceeding six months. \n(4)  \nIf the award is not made within the period specified in sub-section (1) or the extended \nperiod specified under sub-section (3), the mandate of the arbitrator(s) shall terminate unless the \ncourt has, either prior to or after the expiry of the period so specified, extended the period: \nProvided that while extending the period under this sub-section, if the court finds that the \nproceedings have been delayed for the reasons attributable to the arbitral tribunal, then, it may order \nreduction of fees of arbitrator(s) by not exceeding five per cent for each month of such delay: \nProvided further that where an application under sub-section (5) is pending, the mandate \nof the arbitrator shall continue till the disposal of the said application: \nProvided also that the arbitrator shall be given an opportunity of being heard before the \nfees is reduced. \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:20.02.2023\n15:43:21\nSignature Not Verified",
          "pdf_source": "46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf",
          "nodes": []
        },
        {
          "title": "Page 11",
          "node_id": "0013",
          "start_index": 11,
          "end_index": 11,
          "summary": "According to page 11 of the PDF \"46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf\", the High Court of Delhi discusses the principle that procedural provisions are ordinarily directory, unless there is strong reason to hold otherwise. The court references the case of Bihar Rajya Bhumi Vikas Bank Samiti, which supports this principle. The court also examines Rule 7 of the IPD Rules, which does not provide for any consequence of failure to file a rejoinder within the time envisaged. The defendant's counsel, Mr. Jayant Kumar, relies on Rule 5 in Chapter VII of the Original Side Rules, but the court finds this reliance misplaced due to the specific applicability of Rule 7(xiii) of the IPD Rules. The case is C.O. (COMM.IPD-TM) 244/2021, with Neutral Citation Number: 2023/DHC/001191. (Source: 46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf, page 11)",
          "content": "Neutral Citation Number : 2023/DHC/001191 \nC.O. (COMM.IPD-TM) 244/2021 and other connected matters                                                     Page 11 of 15 \n \nmay have been employed, the consequence of failure to comply with \nthe provision was, and was not, provided. \n \n13. \nBihar Rajya Bhumi Vikas Bank Samiti5 also invokes the \nprinciple, by now trite in law, that procedural provisions are ordinarily \nengrafted ex debito justitiae and have, therefore, to be regarded as \ndirectory, unless there is strong reason to hold otherwise. \nAdditionally, and at the cost of repetition, where the provisions do not \nprovide for any consequence of failure to act within the maximum \nperiod envisaged thereby, the stipulation of maximum period is \nrequired to be treated as directory.  \n \n14. \nUnlike the situation which obtains in the provisos to Order VIII \nRule 1 and Rule 10 of the CPC as amended by the Commercial Courts \nAct, Rule 7 of the IPD Rules do not provide for any consequence of \nfailure to file rejoinder within the time envisaged by sub-Rule (x) \nthereof. Resultantly, it cannot be said that, if the rejoinder is not filed \nwithin the period of 30 days envisaged in the said Rule, the rejoinder \nwould, ipso facto, be liable to be struck off the record. \n \n15. \nThe reliance, by Mr. Jayant Kumar, on Rule 5 in Chapter VII of \nthe Original Side Rules is, in my considered opinion, misplaced. Rule \n7(xiii) of the IPD Rules makes Rule 5 of Chapter VII of the Original \nSides Rules applicable to original IPD petitions. The applicability is \nnot, however, absolute. Rule 7(xiii) specifically states that the Original \nSide Rules, orders and practice directions issued from time to time in \nthat regard would apply to the extent there is no inconsistency with the \nRules. \n \n16. \nRule 5 in Chapter VII of the Original Side Rules provides for \nfiling of replications in original suits instituted before this Court.  It \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:20.02.2023\n15:43:21\nSignature Not Verified",
          "pdf_source": "46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf",
          "nodes": []
        },
        {
          "title": "Page 12",
          "node_id": "0014",
          "start_index": 12,
          "end_index": 12,
          "summary": "According to page 12 of the PDF \"46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf\", the court discusses the application of Rule 5 of Chapter 7 of the Original Side Rules to original IPD petitions. The court states that Rule 7(xiii) of the IPD Rules makes the provisions of the Original Side Rules applicable to original IPD petitions, but only to the extent that they are not inconsistent with the IPD Rules. The court argues that importing consequences from the Original Side Rules into the IPD Rules would be impermissible. The case, C.O. (COMM.IPD-TM) 244/2021, involves an original IPD petition instituted under Section 57(1) and (2) of the Trade Marks Act. The court's decision is dated February 20, 2023, and was signed by Sunil Singh Negi. (Source: 46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf, page 12)",
          "content": "Neutral Citation Number : 2023/DHC/001191 \nC.O. (COMM.IPD-TM) 244/2021 and other connected matters                                                     Page 12 of 15 \n \ndoes not, on its face, apply to original IPD petitions instituted, for \nexample, under Section 57(1) and (2)14 of the Trade Marks Act, as in \nthe present case.   \n \n17. \nRule 7(xiii) of the IPD Rules, no doubt, makes the provisions of \nthe Original Side Rules applicable to original IPD petitions, but only \nto the extent the Original Side Rules are not inconsistent with the IPD \nRules.  Inconsistency may be of two types.  There may be situations \nwhere the IPD Rules provide one way, and the Original Side Rules \nanother.  That would be a case of clear and stark inconsistency.  \nInconsistency would, however, also exist, as in the present case, where \nthe IPD Rules do not envisage any consequence of failure to comply \nwith a provision, whereas the Original Side Rules, dealing with a \nsimilar provision in relation to suits, does so.  The statutory intent in \nthe two provisions would, then, be different.  The provisions would, \ntherefore, not be consistent in that respect.  Importing, into the IPD \nRules, the consequence which is envisaged in relation to suits by the \nOriginal Side Rules would be impermissible, as it would amount to \nreading, into the IPD Rules, a consequence which the Original Side \nRules envisages only in relation to original suits, and which the IPD \nRules does not envisage in relation to original IPD petitions.   \n \n18. \nViewed thus, it becomes impossible to apply Rule 5 of Chapter \n7 of the Original Side Rules to a situation which is covered by Rule \n7(x) of the IPD Rules.  Rule 7(x) is self contained in respect of the \n                                          \n14 57.  \nPower to cancel or vary registration and to rectify the register. –  \n(1)  \nOn application made in the prescribed manner to the High Court or to the Registrar by \nany person aggrieved, the Registrar or the High Court, as the case may be, may make such order as \nit may think fit for cancelling or varying the registration of a trade mark on the ground of any \ncontravention, or failure to observe a condition entered on the register in relation thereto. \n(2)  \nAny person aggrieved by the absence or omission from the register of any entry, or by \nany entry made in the register without sufficient cause, or by any entry wrongly remaining on the \nregister, or by any error or defect in any entry in the register, may apply in the prescribed manner to \nthe High Court or to the Registrar, and the Registrar or the High Court, as the case may be, may \nmake such order for making, expunging or varying the entry as it may think fit. \n \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:20.02.2023\n15:43:21\nSignature Not Verified",
          "pdf_source": "46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf",
          "nodes": []
        },
        {
          "title": "Page 13",
          "node_id": "0015",
          "start_index": 13,
          "end_index": 13,
          "summary": "According to page 13 of the PDF \"46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf\", the court discusses the requirement of filing rejoinders in original IPD petitions. The IPD Rules do not envision any consequence of default, and the court cannot import consequences from other rules, such as Rule 5 of Chapter VII of the Original Side Rules. The court highlights the distinction between Rule 7(x) of the IPD Rules and Rule 5 of Chapter VII, regarding the time for filing rejoinder and replication. Rule 7(x) grants time to file rejoinder without any extension or cost implications, unlike Rule 5. The court argues that the legislative intent should not be altered by importing consequences from other rules. (Source: 46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf, Page 13)",
          "content": "Neutral Citation Number : 2023/DHC/001191 \nC.O. (COMM.IPD-TM) 244/2021 and other connected matters                                                     Page 13 of 15 \n \nrequirement of filing of rejoinders in original IPD petitions.  While \nstipulating a maximum period of 120 days for doing so, it does not \nenvisage any consequence of default.  No such consequence is \nenvisaged elsewhere in the IPD Rules either.  Where the IPD Rules do \nnot envisage any such consequence of default, one cannot tinker with \nthe legislative intent by importing, into the IPD Rules, the \nconsequence of default in failing to file replications in original suits \nwithin the time stipulated, as envisaged by Rule 5 of Chapter VII of \nthe Original Side Rules, by invoking, for the purpose, Rule 7(xiii) of \nthe IPD Rules.   \n \n19. \nEven otherwise, there is a clear distinction between Rule 7(x) of \nthe IPD Rules and Rule 5 in Chapter VII of the Original Side Rules, as \nregards the time for filing rejoinder (in the former case) and \nreplication (in the latter).  Rule 7(x) grants time to file rejoinder either \nas prescribed by the Court or within 30 days from the date on which \nthe Court directs filing of the rejoinder. This provision is, therefore, a \nself contained provision relating to filing of a rejoinder in original IPD \npetitions.  As against this, Rule 5 in Chapter VII of the Original Side \nRules requires the replication to be filed within 30 days of receipt of \nthe written statement and empowers the Court to extend the time for \nfiling replication, if not filed within 30 days, by a further period of 15 \ndays, but not thereafter. It further requires the plaintiff, if such \nextension of 15 days is granted, to be burdened with costs. Failure to \npay the costs so imposed would result in the replication not being \ntaken on record.  No such provisions are to be found in Rule 7(x) of \nthe IPD Rules, which does not provide either for any extension in time \nto file rejoinder beyond the period of 30 days envisaged therein, or for \nimposition of costs for doing so.  The words “but not thereafter”, to \nbe found in Rule 5 of Chapter VII of the Original Side Rules are also \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:20.02.2023\n15:43:21\nSignature Not Verified",
          "pdf_source": "46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0019",
      "start_index": 14,
      "end_index": 15,
      "summary": "According to the PDF document \"Vinay Kumar GB v. Sudhir Kumar and Anr.pdf\", the High Court of Delhi at New Delhi made a decision in the case C.O. (COMM.IPD-TM) 244/2021 and other connected matters. The plaintiff, Vinay Kumar GB, was represented by Mr. Sanjeev Sindhwani, Sr. Adv. with Ms. Kruttika Vijay and Mr. Sauhard Alung, Advs., while the defendants, Sudhir Kumar and Anr, were represented by Mr. Jayant Kumar.\n\nThe court decision, as stated in the document, pertains to the filing of a rejoinder beyond the stipulated 30-day period under Rule 7(x) of the IPD Rules. The defendant's counsel, Mr. Jayant Kumar, objected to the rejoinder being taken on record due to the delay. However, the court ruled that it cannot apply the consequence of non-payment of costs under Rule 5 of Chapter VII of the Original Side Rules to the non-filing of a rejoinder within the time stipulated in Rule 7(x) of the IPD Rules.\n\nAs a result, the court allowed the rejoinders filed in C.O. (COMM. IPD-TM) 244/2021 and C.O. (COMM. IPD-TM) 245/2021 to be taken on record. The court then referred the case to mediation by the Delhi High Court Mediation and Conciliation Centre, with the possibility of an amicable resolution. The case was re-notified for April 13, 2023, to ascertain the outcome of the mediation. The decision was made by Justice C. Hari Shankar on February 16, 2023, as stated in the PDF document with Neutral Citation Number: 2023/DHC/001191.",
      "pdf_source": "46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf",
      "nodes": [
        {
          "title": "Page 14",
          "node_id": "0017",
          "start_index": 14,
          "end_index": 14,
          "summary": "According to page 14 of the PDF \"46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf\", the Court rules that the rejoinder filed beyond 30 days from the date of filing of the written statement can be taken on record. The Court rejects the objection of Mr. Jayant Kumar, citing that the IPD Rules do not explicitly state that a rejoinder cannot be filed after 30 days. The Court decides to take the rejoinders on record in cases CO (COMM. IPD-TM) 244/2021 and CO (COMM. IPD-TM) 245/2021. The cases are then referred to mediation by the Delhi High Court Mediation and Conciliation Centre, as both parties believe an amicable resolution is possible. The decision was made on February 20, 2023, and digitally signed by Sunil Singh Negi. (Source: 46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf, page 14)",
          "content": "Neutral Citation Number : 2023/DHC/001191 \nC.O. (COMM.IPD-TM) 244/2021 and other connected matters                                                     Page 14 of 15 \n \nconspicuously absent in Rule 7(x) of the IPD Rules.  The Court \ncannot, by judicial fiat, read, into Rule 7(x) of the IPD Rules, the \nwords “but not thereafter” which, though consciously employed in \nRule 5 of Chapter VII of the Original Side Rules, do not find place in \nRule 7(x) of the IPD Rules.  Further, the consequence of non payment \nof costs imposed in terms of Rule 5 of Chapter VII of the Original Side \nRules, cannot be made, by extrapolation, to apply to non filing of a \nrejoinder within the time stipulated in Rule 7(x) of the IPD Rules.   \n \n20. \nEven for this reason, it is not possible for the Court to, by \nrelying on Rule 5 of Chapter VII of the Original Side Rules, hold that \nthe rejoinder, filed beyond the period of 30 days envisaged by Rule \n7(x) of the IPD Rules, cannot be taken on record. \n \n21. \nFor these reasons, the objection of Mr. Jayant Kumar, to the \neffect that as the rejoinder in CO (COMM. IPD-TM) 244/2021 and \nCO (COMM. IPD-TM) 245/2021 were filed beyond 30 days from the \ndate of filing of written statement, they cannot be taken on record, \nfails. \n \n22. \nNo other objection, to the taking on record of the said \nrejoinders, was raised by Mr Jayant Kumar. \n \n23. \nAs such the rejoinders filed in CO (COMM. IPD-TM) 244/2021 \nand CO (COMM. IPD-TM) 245/2021 are taken on record. \n \n24. \nBoth sides submit that if this dispute is referred to mediation, \nthere may be a possibility of an amicable resolution. As such, these \ncases are referred to mediation by the Delhi High Court Mediation and \nConciliation Centre. \n \n25. \nLearned Counsel may contact the concerned officer in the Delhi \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:20.02.2023\n15:43:21\nSignature Not Verified",
          "pdf_source": "46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf",
          "nodes": []
        },
        {
          "title": "Page 15",
          "node_id": "0018",
          "start_index": 15,
          "end_index": 15,
          "summary": "According to page 15 of the PDF \"46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf\", the High Court of Delhi has ordered the parties to attend the High Court Mediation and Conciliation Centre on February 20, 2023, to fix a schedule for mediation. The court has also directed that the matter be re-notified on April 13, 2023, to ascertain the outcome of the mediation. The order was passed by Justice C. Hari Shankar on February 16, 2023. The case involves Vinay Kumar GB as the plaintiff and Sudhir Kumar and another as defendants, represented by their respective advocates. The court's decision aims to facilitate mediation and potentially resolve the dispute amicably. (Source: 46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf, page 15)",
          "content": "Neutral Citation Number : 2023/DHC/001191 \nC.O. (COMM.IPD-TM) 244/2021 and other connected matters                                                     Page 15 of 15 \n \nHigh Court Mediation and Conciliation Centre on 20th February 2023 \nat 2 pm to fix a schedule for Mediation.  \n \n26. \nAccordingly, re-notify on 13th April 2023 to ascertain the \noutcome of Mediation. \n \n \nC.HARI SHANKAR, J \n \nFEBRUARY 16, 2023 \n \nAR \nDigitally Signed\nBy:SUNIL SINGH NEGI\nSigning Date:20.02.2023\n15:43:21\nSignature Not Verified",
          "pdf_source": "46. Vinay Kumar GB v. Sudhir Kumar and Anr.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-15T18:40:39.079827",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}