{
  "doc_name": "48. Vinod Kumar v. Intellectual Property Appellate Board & Ors",
  "pdf_source": "48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf",
  "metadata": {
    "document_name": "48. Vinod Kumar v. Intellectual Property Appellate Board & Ors",
    "source_pdf": "48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf",
    "judges": [
      "C.HARI SHANKAR"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "310/2020",
      "310/2020",
      "310/2020",
      "310/2020",
      "310/2020",
      "310/2020"
    ],
    "dhc_numbers": [
      "2022/DHC/005508",
      "2022/DHC/005508",
      "2022/DHC/005508",
      "2022/DHC/005508",
      "2022/DHC/005508",
      "2022/DHC/005508"
    ],
    "ia_numbers": [],
    "decision_date": "30 December, 2020",
    "order_date": null,
    "case_type": "Civil",
    "subject_matter": null,
    "plaintiffs": [
      "Vinod Kumar"
    ],
    "defendants": [
      "Intellectual Property Appellate Board"
    ],
    "appellants": [
      "Vinod Kumar"
    ],
    "respondents": [
      "Intellectual Property Appellate Board and Ors.",
      "FK Bearing Group Co. Ltd."
    ],
    "plaintiff_advocates": [
      "Mr. Prince Arora"
    ],
    "defendant_advocates": [
      "Mr. Siddharth Bambha",
      "Ms. Sucharu Garg",
      "Mr. Abhilash Gupta",
      "Suwarn Rajan Chauhan",
      "Akshay Srivastava"
    ],
    "appellant_advocates": [
      "Mr. Prince Arora"
    ],
    "respondent_advocates": [
      "Mr. Siddharth Bambha",
      "Ms. Sucharu Garg"
    ],
    "damages_claimed": "5,000",
    "damages_awarded": null,
    "key_issues": [
      "The petitioner's request for adjournment was rejected by the Intellectual Property Appellate Board due to misrepresentation of facts.",
      "The petitioner's counsel was found to have made false claims of being in self-quarantine due to COVID-19, while social media evidence showed they were on holiday.",
      "The Intellectual Property Appellate Board has the power to dismiss adjournment applications with costs for misrepresentation.",
      "The Board can report instances of professional misconduct to the Bar Council of India for appropriate action.",
      "The petitioner had sought rectification of trademark registrations, which were allowed by the Board on merits.",
      "The petitioner had argued before the Board, but their arguments were not found sufficient to warrant a favorable decision.",
      "The use of social media evidence to discredit a party's claims is a valid legal tactic.",
      "The Intellectual Property Appellate Board has the authority to impose costs on a party for frivolous or misleading claims.",
      "The rejection of the adjournment application was based on the Board's discretion and the petitioner's history of non-representation at previous hearings.",
      "The petitioner's failure to successfully argue their case before the Board led to the rectification of the trademark registrations in favor of the respondent."
    ],
    "decision_summary": "**Case Summary: Vinod Kumar v. Intellectual Property Appellate Board and Ors.**\n\n**Background:**\n\nThe case involves a writ petition filed by Vinod Kumar under Article 226 of the Constitution of India, challenging an order dated December 30, 2020, passed by the Intellectual Property Appellate Board (IPAB) in Rectification Petitions ORA/108/2020/TM/DEL and ORA/117/2020/TM/DEL. The petitioner was the respondent before the IPAB, and the rectification petitions were filed by the respondent (FK Bearing Group Co. Ltd.) against the petitioner.\n\n**Legal Issues:**\n\nThe primary issue in this case is the rejection of an adjournment petition by the IPAB, which led to the IPAB passing an order allowing the rectification petitions on merit. The petitioner's counsel had requested an adjournment due to COVID-19 restrictions, stating that their office was closed, and the main arguing counsel was in self-quarantine. However, the IPAB found that this representation was false, as evidenced by the counsel's Facebook posts, which showed that he was on holiday during the relevant period.\n\n**Arguments:**\n\nThe petitioner's counsel argued that the adjournment petition was genuine and that the Facebook posts were not relevant to the merits of the case. The respondent's counsel, on the other hand, argued that the adjournment petition was an attempt to delay the proceedings and that the false representation was made with the intent to secure an adjournment.\n\n**Court Findings:**\n\nThe IPAB found that the adjournment petition was an attempt to mislead the court and that the false representation was made with the intent to secure an adjournment. The IPAB also found that the counsel's Facebook posts were evidence of his lack of credibility. The IPAB, therefore, rejected the adjournment petition, allowed the rectification petitions on merit, and awarded costs against the petitioner's counsel.\n\n**Decision:**\n\nThe High Court of Delhi, in its judgment dated December 12, 2022, considered the petitioner's challenge to the IPAB's order. The court noted that the IPAB had passed directions against the learned counsel for making false averments before it and had also awarded costs and referred the matter to the Bar Council of India in the event of failure to pay the costs. The court's decision in this case is not provided in the given pages, and therefore, the final outcome of the case remains unknown.\n\n**Key Takeaways:**\n\n1. The case highlights the importance of credibility and honesty in legal proceedings.\n2. The IPAB's decision to reject the adjournment petition and allow the rectification petitions on merit was based on the finding that the petitioner's counsel had made false representations.\n3. The case also underscores the consequences of making false representations before a court or tribunal, including the imposition of costs and potential referral to the Bar Council of India.",
    "legal_precedents": [
      "(2000) 8 SCC 532",
      "India Chandra \nGovind Ji"
    ],
    "full_text": "\n--- PAGE 1 ---\nNeutral Citation Number :2022/DHC/005508 \nCS(COMM) 310/2020                                                                                               Page 1 of 6 \n \n$~ 20(Original) \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n \n+  \nW.P.(C)-IPD 50/2021 & CM APPL. 7338/2021 \n \nVINOD KUMAR  \n \n \n \n         ..... Petitioner \n \n \n \n \nThrough: \nMr. Prince Arora, Adv. \n \n \n \n \n \nversus \n \nINTELLECTUAL PROPERTY APPELLATE BOARD AND \nORS  \n \n \n \n \n \n    ..... Respondents \nThrough: \nMr. Siddharth Bambha and Ms. \nSucharu Garg, Advs for R 3 \n \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C.HARI SHANKAR \n \n \n \n \nJUDGMENT(O R A L) \n% \n \n \n \n \n12.12.2022 \n \n1. \nThis writ petition, under Article 226 of the Constitution of India, \nassails order dated 30th December 2020 passed by the learned Intellectual \nProperty Appellate Board (the learned IPAB) in Rectification Petitions \nORA/108/2020/TM/DEL and ORA/117/2020/TM/DEL (FK Bearing \nGroup Co. Ltd. v. Vinod Kumar & Anr.) The petitioner was Respondent \n1 before the learned IPAB and Respondent 2 herein was the appellant. \nThe rectification petitions were, therefore, instituted by Respondent 2 \nagainst the petitioner. \n \n2. \nThe impugned order allows the rectifications petitions filed by \nRespondent 2 on merits. \n \n3. \nBefore the learned IPAB, the petitioner had sought an \nadjournment. The adjournment was rejected by the learned IPAB. Para 3 \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n15:36:20\nSignature Not Verified\n\n--- PAGE 2 ---\nNeutral Citation Number :2022/DHC/005508 \nCS(COMM) 310/2020                                                                                               Page 2 of 6 \n \nof the impugned order dated 30th December 2020, which deals with the \nsaid request, reads thus: \n \n“There is no representation on behalf of the Respondent No.1 at this \nand on the last few hearings and the matter today came up for final \nhearing of the on 29th December 2020; there was an adjournment \npetition filed by the Respondent No.1 and one counsel Mr. Abhilash \nGupta (Enrollment No.D/3897/2019) on behalf of Suwarn Rajan \nChauhan \n(Enrollment \nNo.D/667/2000) \n& \nAkshay \nSrivastava \n(Enrollment No.D/1967/2008) represented and informed the counsel's \noffice is closed due to covid-19 and the employees are isolated to their \nresidences and the main arguing counsel is also directed to be in self-\nquarantine \ntill \n01-01-2021; \nthe \nRespondent \nin \nadjournment \npetition/Rectification Applicant filed its counter and annexed the \nFacebook page of the Mr. Akshay Srivastava who is lead counsel in \nthe matter. In the said Facebook page of Mr. Akshay Srivastava the \nstatus is updated has been travelling for a holiday since 24.12.2020 to \nTirupati, Rameswaram, Maduria and the last activity shown on his \nFacebook account is that he was at Marina Beach, Chennai on \n27.12.2020 screen shots of his Facebook profile clearly exhibited the \nsame. In light of the same it is falsely represented before this Board \nthat the main counsel is in quarantine while it has been shown to us \nthrough the Facebook postings that the said Counsel is on a holiday, \nwe have no reason not to believe the said representation by the \nRespondent/Rectification Applicant pointing out through the Facebook \nprintouts. It is a matter of regret that such irresponsible false \nrepresentations are made before this Board. This sought of \nmisrepresentations are unwarranted and does not go well with the bar \nand bench, we may be constrained to report this sought of reckless \nsubmissions to the Bar Council. Since a deliberate wrong irresponsible \nrepresentation has been before us with an intent to secure an \nadjournment in the matter the said Adjournment application is being \ndismissed with costs of Rs.5,000/ -. The same may be deposited with \nPM Cares fund at the earliest not before 07th January 2021 and the \ndeposit slip be filed with this Board failing which we shall report to \nBar Council of India to take appropriate action against the said \ncounsels Suwarn Rajan Chauhan (Enrollment No.D/667/2000) & \nAkshay Srivastava (Enrollment No.D/1967/2008).” \n \n4. \nThe learned IPAB proceeded to pass directions against learned \nCounsel for having, as it thought, made false averments before it with \nrespect to availability of learned Counsel.  It has also awarded costs and \nhas referred the matter to the Bar Council of India in the event of failure \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n15:36:20\nSignature Not Verified\n\n--- PAGE 3 ---\nNeutral Citation Number :2022/DHC/005508 \nCS(COMM) 310/2020                                                                                               Page 3 of 6 \n \nto pay the costs imposed. \n \n5. \nIn the present petition, this Court, vide order dated 23rd February \n2021, directed the learned Counsel who had been appearing in the matter \nbefore the learned IPAB to file individual affidavits, explaining their \nfailure to be present before the learned IPAB on 30th December 2020. \n \n6. \nThree learned Counsel were appearing on behalf of Respondent 1 \nbefore the learned IPAB, namely Abhilash Gupta, Akshay Srivastava and \nSuwarn Rajan Chauhan. As is apparent from para 3 of the impugned \norder, the learned IPAB proceeded on the premise that Akshay Srivastava \nwas the lead Counsel. Save and except a statement to the said effect \nhaving been made by learned Counsel for Respondent 2, there appears to \nbe no justification for the learned IPAB’s presumption that Akshay \nSrivastava was the lead Counsel in the matter. \n \n7. \nBefore this Court, it has been submitted that the arguing Counsel \nbefore the learned IPAB was Suwarn Rajan Chauhan who was indeed \nunder quarantine and expired on 30th April 2021. \n \n8. \nThis Court has also seen some of the earlier orders passed by the \nlearned IPAB in the said proceedings in which it does appear that Suwarn \nRajan Chauhan was principally appearing on behalf of the petitioner. \n \n9. \nIn that view of the matter, this Court is unable to sustain the \nimpugned order, insofar as it refused to adjourn the matter on the premise \nthat Akshay Srivastava was the lead Counsel and that he was at Chennai \non the date when the matter was taken up. \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n15:36:20\nSignature Not Verified\n\n--- PAGE 4 ---\nNeutral Citation Number :2022/DHC/005508 \nCS(COMM) 310/2020                                                                                               Page 4 of 6 \n \n \n10. \nEven otherwise, in my considered opinion, before taking an \nadverse view against the Counsel on the basis of a Facebook post, and \nreferring the matter to the Bar Council of India, the learned IPAB ought, \nat the very least, to have given an opportunity to the Counsel to explain \nthe circumstances. Postings on Facebook cannot be treated as \ndeterminative of the location of a person at a particular point of time, at \nleast by a Court. Even if a Court is to take an adverse view in that regard, \nthe Counsel ought to be given an opportunity to explain the position \nbefore such a view is taken. This Court is of the concerned opinion that \nthe learned IPAB was needlessly strict in imposing costs and referring \nthe matter to the Bar Council of India in such circumstances. \n \n11. \nIn view of the fact that Suwarn Rajan Chauhan was indeed \nquarantined at the relevant time and expired, unfortunately, thereafter, \nthis Court is not entering into any of the other aspects of the matter \nregarding non-absence of Counsel on behalf of the petitioner on 30th \nDecember 2020. \n \n12. \nSo far as the earlier adjournments taken by the petitioner, if any, \nare concerned, the matter stands covered by the following passage from \nthe judgment of the Supreme Court in State Bank of India v. Chandra \nGovind Ji1: \n \n“7. \nIn ascertaining whether a party had reasonable \nopportunity to put forward his case or not, one should not \nordinarily go beyond the date on which adjournment is \nsought for. The earlier adjournment, if any, granted would \ncertainly be for reasonable grounds and that aspect need not \n                                          \n1 (2000) 8 SCC 532 \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n15:36:20\nSignature Not Verified\n\n--- PAGE 5 ---\nNeutral Citation Number :2022/DHC/005508 \nCS(COMM) 310/2020                                                                                               Page 5 of 6 \n \nbe once again examined if on the date on which adjournment \nis sought for the party concerned has a reasonable ground. \nThe mere fact that in the past adjournments had been sought \nfor would not be of any materiality. If the adjournment had \nbeen sought for on flimsy grounds the same would have been \nrejected. Therefore, in our view, the High Court as well as the \nlearned District Judge and the Rent Controller have all \nmissed the essence of the matter.” \n \n13. \nIn view of the aforesaid discussion, the impugned order dated 30th \nDecember 2020 is quashed and set aside. The rectification petitions filed \nby Respondent 2 shall stand restored for re-hearing.  \n \n14. \nInasmuch as the learned IPAB has subsequently been abolished, \nthe rectification petitions would have to be heard by this Court. The \nRegistry is directed to register the rectification petitions under the \nappropriate nomenclature and list them before the Court on 23rd February \n2023 for hearing and disposal. Let the record from the learned IPAB be \nalso requisitioned prior to the said date. \n \n15. \nFor the purpose of registration, the Respondent 2 is directed to \nplace on record a photocopy of the entire record along with an \nappropriate affidavit under Section 65-B of the Evidence Act, 1872. \nRespondent 2 undertakes to provide the registry with the entire record of \nthe rectification petitions filed before the learned IPAB within a period of \nfour weeks. On the said record being provided the rectification petitions \nwould be numbered and registered before this Court and listed before the \nCourt for disposal on 23rd February 2023. \n \n16. \nMr. Siddharth Bamba learned Counsel for Respondent 2 points out \nthat, Respondent 2 was enjoying interim relief vide order dated 10th July \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n15:36:20\nSignature Not Verified\n\n--- PAGE 6 ---\nNeutral Citation Number :2022/DHC/005508 \nCS(COMM) 310/2020                                                                                               Page 6 of 6 \n \n2020 passed by the learned IPAB which was in force till the passing of \nthe impugned order dated 30th December 2020. \n \n17. \nAs the impugned order, which is in favour of Respondent 2, has \nbeen quashed only on the ground of violation of the principles of natural \njustice, Respondent 2 would be entitled to be restored to the position in \nwhich it was at the time of its passing. \n \n18. \nAs such, the order dated 10th July 2020 passed by the learned \nIPAB shall stand restored and remain in operation till this Court decides \nthe two rectification petitions. \n \n19. \nList the rectification petitions, duly registered, for hearing and \ndisposal on 23rd February 2023. \n \n20. \nThis writ petition stands allowed accordingly.  No costs. \n \n \n \nC.HARI SHANKAR, J \n \nDECEMBER 12, 2022/AR \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n15:36:20\nSignature Not Verified\n"
  },
  "total_pages": 6,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "According to the PDF document \"Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf\", a writ petition was filed by Vinod Kumar under Article 226 of the Indian Constitution, challenging an order dated December 30, 2020, passed by the Intellectual Property Appellate Board (IPAB). The IPAB allowed rectification petitions filed by Respondent 2, FK Bearing Group Co. Ltd., against Vinod Kumar.\n\nThe petitioner had sought an adjournment before the IPAB, which was rejected. The IPAB found that the petitioner's counsel had made a false representation that the main counsel was in self-quarantine due to COVID-19, while the counsel's Facebook page showed that he was on holiday. The IPAB dismissed the adjournment application with costs of Rs. 5,000, to be deposited with the PM Cares fund.\n\nThe key parties involved are Vinod Kumar (petitioner), Intellectual Property Appellate Board (respondent 1), and FK Bearing Group Co. Ltd. (respondent 2). The case was heard by Hon'ble Mr. Justice C. Hari Shankar on December 12, 2022. The petition was filed in response to the IPAB's order in Rectification Petitions ORA/108/2020/TM/DEL and ORA/117/2020/TM/DEL. The PDF document provides details of the legal proceedings, including the arguments, decisions, and facts of the case. (Source: Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf)",
      "pdf_source": "48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "According to page 1 of the PDF \"48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf\", the case involves a writ petition (W.P.(C)-IPD 50/2021) filed by Vinod Kumar against the Intellectual Property Appellate Board (IPAB) and others. The petition challenges an order dated December 30, 2020, passed by the IPAB in rectification petitions ORA/108/2020/TM/DEL and ORA/117/2020/TM/DEL. The IPAB allowed the rectification petitions filed by Respondent 2 (FK Bearing Group Co. Ltd.) against the petitioner, Vinod Kumar. The petitioner had sought an adjournment before the IPAB, which was rejected. The case was heard by Hon'ble Mr. Justice C. Hari Shankar on December 12, 2022. The petitioner was represented by Mr. Prince Arora, while the respondents were represented by Mr. Siddharth Bambha and Ms. Sucharu Garg. (Source: PDF page 1)",
          "content": "Neutral Citation Number :2022/DHC/005508 \nCS(COMM) 310/2020                                                                                               Page 1 of 6 \n \n$~ 20(Original) \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n \n+  \nW.P.(C)-IPD 50/2021 & CM APPL. 7338/2021 \n \nVINOD KUMAR  \n \n \n \n         ..... Petitioner \n \n \n \n \nThrough: \nMr. Prince Arora, Adv. \n \n \n \n \n \nversus \n \nINTELLECTUAL PROPERTY APPELLATE BOARD AND \nORS  \n \n \n \n \n \n    ..... Respondents \nThrough: \nMr. Siddharth Bambha and Ms. \nSucharu Garg, Advs for R 3 \n \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C.HARI SHANKAR \n \n \n \n \nJUDGMENT(O R A L) \n% \n \n \n \n \n12.12.2022 \n \n1. \nThis writ petition, under Article 226 of the Constitution of India, \nassails order dated 30th December 2020 passed by the learned Intellectual \nProperty Appellate Board (the learned IPAB) in Rectification Petitions \nORA/108/2020/TM/DEL and ORA/117/2020/TM/DEL (FK Bearing \nGroup Co. Ltd. v. Vinod Kumar & Anr.) The petitioner was Respondent \n1 before the learned IPAB and Respondent 2 herein was the appellant. \nThe rectification petitions were, therefore, instituted by Respondent 2 \nagainst the petitioner. \n \n2. \nThe impugned order allows the rectifications petitions filed by \nRespondent 2 on merits. \n \n3. \nBefore the learned IPAB, the petitioner had sought an \nadjournment. The adjournment was rejected by the learned IPAB. Para 3 \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n15:36:20\nSignature Not Verified",
          "pdf_source": "48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "According to page 2 of the PDF \"48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf\", the Intellectual Property Appellate Board (IPAB) dismissed an adjournment application with costs of Rs.5,000/- due to a false representation by Respondent's counsel, Akshay Srivastava. The counsel claimed to be in self-quarantine, but his Facebook page showed he was on holiday. The IPAB found this to be an \"irresponsible false representation\" and ordered the costs to be deposited into the PM Cares fund by January 7, 2021. Failure to do so would result in a report to the Bar Council of India. The IPAB's decision was made on December 30, 2020, and the case involved Petitioner Vinod Kumar and Respondents Intellectual Property Appellate Board and others. (Source: 48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf, page 2)",
          "content": "Neutral Citation Number :2022/DHC/005508 \nCS(COMM) 310/2020                                                                                               Page 2 of 6 \n \nof the impugned order dated 30th December 2020, which deals with the \nsaid request, reads thus: \n \n“There is no representation on behalf of the Respondent No.1 at this \nand on the last few hearings and the matter today came up for final \nhearing of the on 29th December 2020; there was an adjournment \npetition filed by the Respondent No.1 and one counsel Mr. Abhilash \nGupta (Enrollment No.D/3897/2019) on behalf of Suwarn Rajan \nChauhan \n(Enrollment \nNo.D/667/2000) \n& \nAkshay \nSrivastava \n(Enrollment No.D/1967/2008) represented and informed the counsel's \noffice is closed due to covid-19 and the employees are isolated to their \nresidences and the main arguing counsel is also directed to be in self-\nquarantine \ntill \n01-01-2021; \nthe \nRespondent \nin \nadjournment \npetition/Rectification Applicant filed its counter and annexed the \nFacebook page of the Mr. Akshay Srivastava who is lead counsel in \nthe matter. In the said Facebook page of Mr. Akshay Srivastava the \nstatus is updated has been travelling for a holiday since 24.12.2020 to \nTirupati, Rameswaram, Maduria and the last activity shown on his \nFacebook account is that he was at Marina Beach, Chennai on \n27.12.2020 screen shots of his Facebook profile clearly exhibited the \nsame. In light of the same it is falsely represented before this Board \nthat the main counsel is in quarantine while it has been shown to us \nthrough the Facebook postings that the said Counsel is on a holiday, \nwe have no reason not to believe the said representation by the \nRespondent/Rectification Applicant pointing out through the Facebook \nprintouts. It is a matter of regret that such irresponsible false \nrepresentations are made before this Board. This sought of \nmisrepresentations are unwarranted and does not go well with the bar \nand bench, we may be constrained to report this sought of reckless \nsubmissions to the Bar Council. Since a deliberate wrong irresponsible \nrepresentation has been before us with an intent to secure an \nadjournment in the matter the said Adjournment application is being \ndismissed with costs of Rs.5,000/ -. The same may be deposited with \nPM Cares fund at the earliest not before 07th January 2021 and the \ndeposit slip be filed with this Board failing which we shall report to \nBar Council of India to take appropriate action against the said \ncounsels Suwarn Rajan Chauhan (Enrollment No.D/667/2000) & \nAkshay Srivastava (Enrollment No.D/1967/2008).” \n \n4. \nThe learned IPAB proceeded to pass directions against learned \nCounsel for having, as it thought, made false averments before it with \nrespect to availability of learned Counsel.  It has also awarded costs and \nhas referred the matter to the Bar Council of India in the event of failure \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n15:36:20\nSignature Not Verified",
          "pdf_source": "48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0005",
      "start_index": 3,
      "end_index": 3,
      "summary": "According to the PDF document \"Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf\", the High Court of Delhi at New Delhi heard the case W.P.(C)-IPD 50/2021 & CM APPL. 7338/2021. The petitioner, Vinod Kumar, was represented by Mr. Prince Arora, Advocate, while the respondents, Intellectual Property Appellate Board and others, were represented by Mr. Siddhar. \n\nThe background and facts of the case reveal that the Intellectual Property Appellate Board (IPAB) had imposed costs on the petitioner due to the absence of his counsel on December 30, 2020. The petitioner's counsel, Suwarn Rajan Chauhan, was under quarantine and later expired on April 30, 2021. However, the IPAB presumed that Akshay Srivastava was the lead counsel and proceeded with the case.\n\nThe High Court of Delhi, however, found that Suwarn Rajan Chauhan was the arguing counsel and was principally appearing on behalf of the petitioner. The court also reviewed earlier orders passed by the IPAB, which confirmed Chauhan's role as the lead counsel. \n\nAs a result, the High Court was unable to sustain the IPAB's order, which had refused to adjourn the matter due to the presumed absence of the lead counsel, Akshay Srivastava. The court's decision was made on February 23, 2021, and was digitally signed by Kamla Rawat on December 13, 2022. The details of the case can be found in the PDF document, which bears the Neutral Citation Number: 2022/DHC/005508.",
      "pdf_source": "48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "According to page 3 of the PDF \"48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf\", the High Court of Delhi is hearing a petition (W.P.(C)-IPD 50/2021) filed by Vinod Kumar. The Court had previously directed three learned Counsel (Abhilash Gupta, Akshay Srivastava, and Suwarn Rajan Chauhan) to file individual affidavits explaining their failure to appear before the IPAB on December 30, 2020. The IPAB had presumed Akshay Srivastava as the lead Counsel, but the Court found that Suwarn Rajan Chauhan was the arguing Counsel and was under quarantine. The Court also reviewed earlier orders where Chauhan was principally appearing on behalf of the petitioner. The Court refused to sustain the impugned order, which had refused to adjourn the matter based on the incorrect assumption about the lead Counsel. (Source: 48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf, page 3)",
          "content": "Neutral Citation Number :2022/DHC/005508 \nCS(COMM) 310/2020                                                                                               Page 3 of 6 \n \nto pay the costs imposed. \n \n5. \nIn the present petition, this Court, vide order dated 23rd February \n2021, directed the learned Counsel who had been appearing in the matter \nbefore the learned IPAB to file individual affidavits, explaining their \nfailure to be present before the learned IPAB on 30th December 2020. \n \n6. \nThree learned Counsel were appearing on behalf of Respondent 1 \nbefore the learned IPAB, namely Abhilash Gupta, Akshay Srivastava and \nSuwarn Rajan Chauhan. As is apparent from para 3 of the impugned \norder, the learned IPAB proceeded on the premise that Akshay Srivastava \nwas the lead Counsel. Save and except a statement to the said effect \nhaving been made by learned Counsel for Respondent 2, there appears to \nbe no justification for the learned IPAB’s presumption that Akshay \nSrivastava was the lead Counsel in the matter. \n \n7. \nBefore this Court, it has been submitted that the arguing Counsel \nbefore the learned IPAB was Suwarn Rajan Chauhan who was indeed \nunder quarantine and expired on 30th April 2021. \n \n8. \nThis Court has also seen some of the earlier orders passed by the \nlearned IPAB in the said proceedings in which it does appear that Suwarn \nRajan Chauhan was principally appearing on behalf of the petitioner. \n \n9. \nIn that view of the matter, this Court is unable to sustain the \nimpugned order, insofar as it refused to adjourn the matter on the premise \nthat Akshay Srivastava was the lead Counsel and that he was at Chennai \non the date when the matter was taken up. \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n15:36:20\nSignature Not Verified",
          "pdf_source": "48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0009",
      "start_index": 4,
      "end_index": 6,
      "summary": "According to the PDF document \"Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf\", the legal proceedings involve a petition filed by Vinod Kumar against the Intellectual Property Appellate Board (IPAB) and others. The case, W.P.(C)-IPD 50/2021 & CM APPL. 7338/2021, was heard in the High Court of Delhi at New Delhi. \n\nThe petitioner's counsel, Mr. Prince Arora, argued that the IPAB had taken an adverse view against the counsel based on a Facebook post, referring the matter to the Bar Council of India without giving the counsel an opportunity to explain. The court agreed, stating that postings on Facebook cannot be treated as determinative of a person's location at a particular point in time.\n\nThe court also considered the fact that a person, Suwarn Rajan Chauhan, was quarantined and later expired, and therefore did not enter into other aspects of the matter regarding the non-absence of counsel on behalf of the petitioner on December 30, 2020.\n\nThe court quashed and set aside the impugned order dated December 30, 2020, and restored the rectification petitions filed by Respondent 2 for re-hearing. As the IPAB has been abolished, the rectification petitions will be heard by the High Court. The registry was directed to register the petitions and list them for hearing on February 23, 2023. (Source: Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf)",
      "pdf_source": "48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf",
      "nodes": [
        {
          "title": "Page 4",
          "node_id": "0006",
          "start_index": 4,
          "end_index": 4,
          "summary": "According to page 4 of the PDF \"48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf\", the Court opinion is that the Intellectual Property Appellate Board (IPAB) was too strict in imposing costs and referring the matter to the Bar Council of India based on a Facebook post. The Court believes that the Counsel should have been given an opportunity to explain the circumstances before taking an adverse view. The case involves Vinod Kumar, the petitioner, and the IPAB, with the Court citing a Supreme Court judgment in State Bank of India v. Chandra Govind Ji (2000) 8 SCC 532. The Court decides not to delve into other aspects of the matter due to the quarantine and subsequent passing of Suwarn Rajan Chauhan. (Source: 48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf, page 4)",
          "content": "Neutral Citation Number :2022/DHC/005508 \nCS(COMM) 310/2020                                                                                               Page 4 of 6 \n \n \n10. \nEven otherwise, in my considered opinion, before taking an \nadverse view against the Counsel on the basis of a Facebook post, and \nreferring the matter to the Bar Council of India, the learned IPAB ought, \nat the very least, to have given an opportunity to the Counsel to explain \nthe circumstances. Postings on Facebook cannot be treated as \ndeterminative of the location of a person at a particular point of time, at \nleast by a Court. Even if a Court is to take an adverse view in that regard, \nthe Counsel ought to be given an opportunity to explain the position \nbefore such a view is taken. This Court is of the concerned opinion that \nthe learned IPAB was needlessly strict in imposing costs and referring \nthe matter to the Bar Council of India in such circumstances. \n \n11. \nIn view of the fact that Suwarn Rajan Chauhan was indeed \nquarantined at the relevant time and expired, unfortunately, thereafter, \nthis Court is not entering into any of the other aspects of the matter \nregarding non-absence of Counsel on behalf of the petitioner on 30th \nDecember 2020. \n \n12. \nSo far as the earlier adjournments taken by the petitioner, if any, \nare concerned, the matter stands covered by the following passage from \nthe judgment of the Supreme Court in State Bank of India v. Chandra \nGovind Ji1: \n \n“7. \nIn ascertaining whether a party had reasonable \nopportunity to put forward his case or not, one should not \nordinarily go beyond the date on which adjournment is \nsought for. The earlier adjournment, if any, granted would \ncertainly be for reasonable grounds and that aspect need not \n                                          \n1 (2000) 8 SCC 532 \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n15:36:20\nSignature Not Verified",
          "pdf_source": "48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf",
          "nodes": []
        },
        {
          "title": "Page 5",
          "node_id": "0007",
          "start_index": 5,
          "end_index": 5,
          "summary": "According to page 5 of the PDF \"48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf\", the High Court quashed and set aside the impugned order dated 30th December 2020. The rectification petitions filed by Respondent 2 shall be restored for re-hearing. Since the IPAB has been abolished, the rectification petitions will be heard by the Court. The Registry is directed to register the petitions and list them for hearing on 23rd February 2023. Respondent 2 is required to provide the entire record of the rectification petitions within four weeks. The Court also notes that Respondent 2 was enjoying interim relief vide order dated 10th July. The case involves Vinod Kumar as the petitioner and Intellectual Property Appellate Board and others as respondents, with Mr. Prince Arora and Mr. Siddharth Bamba as counsels. (Source: 48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf)",
          "content": "Neutral Citation Number :2022/DHC/005508 \nCS(COMM) 310/2020                                                                                               Page 5 of 6 \n \nbe once again examined if on the date on which adjournment \nis sought for the party concerned has a reasonable ground. \nThe mere fact that in the past adjournments had been sought \nfor would not be of any materiality. If the adjournment had \nbeen sought for on flimsy grounds the same would have been \nrejected. Therefore, in our view, the High Court as well as the \nlearned District Judge and the Rent Controller have all \nmissed the essence of the matter.” \n \n13. \nIn view of the aforesaid discussion, the impugned order dated 30th \nDecember 2020 is quashed and set aside. The rectification petitions filed \nby Respondent 2 shall stand restored for re-hearing.  \n \n14. \nInasmuch as the learned IPAB has subsequently been abolished, \nthe rectification petitions would have to be heard by this Court. The \nRegistry is directed to register the rectification petitions under the \nappropriate nomenclature and list them before the Court on 23rd February \n2023 for hearing and disposal. Let the record from the learned IPAB be \nalso requisitioned prior to the said date. \n \n15. \nFor the purpose of registration, the Respondent 2 is directed to \nplace on record a photocopy of the entire record along with an \nappropriate affidavit under Section 65-B of the Evidence Act, 1872. \nRespondent 2 undertakes to provide the registry with the entire record of \nthe rectification petitions filed before the learned IPAB within a period of \nfour weeks. On the said record being provided the rectification petitions \nwould be numbered and registered before this Court and listed before the \nCourt for disposal on 23rd February 2023. \n \n16. \nMr. Siddharth Bamba learned Counsel for Respondent 2 points out \nthat, Respondent 2 was enjoying interim relief vide order dated 10th July \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n15:36:20\nSignature Not Verified",
          "pdf_source": "48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf",
          "nodes": []
        },
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "According to page 6 of the PDF \"48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf\", the court decided to quash the impugned order dated December 30, 2020, due to a violation of natural justice principles. As a result, the order dated July 10, 2020, passed by the Intellectual Property Appellate Board (IPAB) will be restored and remain in operation until the court decides on the two rectification petitions. The rectification petitions are scheduled for hearing and disposal on February 23, 2023. The writ petition was allowed without costs. The decision was made by Judge C. Hari Shankar on December 12, 2022. (Source: \"48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf\", page 6)",
          "content": "Neutral Citation Number :2022/DHC/005508 \nCS(COMM) 310/2020                                                                                               Page 6 of 6 \n \n2020 passed by the learned IPAB which was in force till the passing of \nthe impugned order dated 30th December 2020. \n \n17. \nAs the impugned order, which is in favour of Respondent 2, has \nbeen quashed only on the ground of violation of the principles of natural \njustice, Respondent 2 would be entitled to be restored to the position in \nwhich it was at the time of its passing. \n \n18. \nAs such, the order dated 10th July 2020 passed by the learned \nIPAB shall stand restored and remain in operation till this Court decides \nthe two rectification petitions. \n \n19. \nList the rectification petitions, duly registered, for hearing and \ndisposal on 23rd February 2023. \n \n20. \nThis writ petition stands allowed accordingly.  No costs. \n \n \n \nC.HARI SHANKAR, J \n \nDECEMBER 12, 2022/AR \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n15:36:20\nSignature Not Verified",
          "pdf_source": "48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0010",
      "start_index": 7,
      "end_index": 6,
      "summary": "Section 'Court Decision' from 48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf - No extractable content",
      "pdf_source": "48. Vinod Kumar v. Intellectual Property Appellate Board & Ors.pdf",
      "nodes": []
    }
  ],
  "created_at": "2025-07-15T18:40:19.017998",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}