{
  "doc_name": "49. DFM Foods Ltd. v. Ishvi Food Pvt. Ltd.",
  "pdf_source": "49. DFM Foods Ltd. v. Ishvi Food Pvt. Ltd..pdf",
  "metadata": {
    "document_name": "49. DFM Foods Ltd. v. Ishvi Food Pvt. Ltd.",
    "source_pdf": "49. DFM Foods Ltd. v. Ishvi Food Pvt. Ltd..pdf",
    "judges": [
      "C.HARI SHANKAR"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "432/2021",
      "432/2021",
      "432/2021",
      "432/2021",
      "11736/2021",
      "11737/2021"
    ],
    "dhc_numbers": [
      "2022/DHC/005501",
      "2022/DHC/005501",
      "2022/DHC/005501"
    ],
    "ia_numbers": [],
    "decision_date": "28 September, 2022",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      "DFM Foods Ltd."
    ],
    "defendants": [
      "ISHVI Food Private Limited & ANR."
    ],
    "appellants": [],
    "respondents": [],
    "plaintiff_advocates": [
      "Mr. Dhruv Anand",
      "Ms. Udita Patro",
      "Ms. Swati Jain",
      "Ms. Nimrat Singh"
    ],
    "defendant_advocates": [
      "Mr. Jagmeet Singh Randhawa"
    ],
    "appellant_advocates": [],
    "respondent_advocates": [],
    "damages_claimed": null,
    "damages_awarded": null,
    "key_issues": [
      "Trademark infringement by the defendants through the use of the \"CURLS\" trademark without authorization",
      "Passing off of the defendants' goods as those originating from the plaintiff",
      "Violation of the plaintiff's trademark rights by the defendants",
      "Undertaking by the defendants to cease all activities that infringe on the plaintiff's trademark rights",
      "Destruction of infringing goods by the defendants within a specified timeframe",
      "Foregoing of the plaintiff's claim for delivery up, rendition of accounts, damages, and costs",
      "Binding effect of the undertakings on the defendants' legal heirs, representatives, and assigns-in-business",
      "Breach of undertakings by the defendants entitling the plaintiff to claim damages",
      "Adjudication of the suit in terms of the settlement agreement and prayer clauses of the plaint",
      "Enforceability of the settlement agreement as a decree of the court"
    ],
    "decision_summary": "**Case Summary: DFM Foods Ltd. vs. Ishvi Food Private Limited & Anr. (CS(COMM) 432/2021)**\n\n**Background:**\n\nThe case revolves around a trademark dispute between DFM Foods Ltd. (the Plaintiff) and Ishvi Food Private Limited & Anr. (the Defendants). The Plaintiff is the proprietor of the trademark \"CURLS,\" which is used in relation to their corn-based snack products. The Defendants were allegedly using the same trademark, thereby infringing the Plaintiff's trademark rights and passing off their products as those of the Plaintiff.\n\n**Legal Issues:**\n\nThe main legal issues in this case are:\n\n1. Trademark infringement: The Plaintiff alleged that the Defendants' use of the \"CURLS\" trademark constituted an infringement of their registered trademark rights.\n2. Passing off: The Plaintiff claimed that the Defendants' actions were also an attempt to pass off their products as those of the Plaintiff, thereby confusing consumers and damaging the Plaintiff's reputation.\n\n**Arguments:**\n\nThe Plaintiff argued that the Defendants' actions were a clear infringement of their trademark rights and an attempt to pass off their products as those of the Plaintiff. The Defendants, on the other hand, were represented by their counsel, who agreed to the terms of the settlement on behalf of their clients.\n\n**Court Findings:**\n\nThe case was resolved through a settlement agreement, which was executed with the intervention of the Delhi High Court Mediation and Conciliation Centre. The terms of the settlement agreement were as follows:\n\n1. The Defendants acknowledged the Plaintiff as the proprietor of the \"CURLS\" trademark.\n2. The Defendants admitted to having violated the Plaintiff's trademark rights and passing off their products as those of the Plaintiff.\n3. The Defendants undertook not to import, offer for sale, supply, sell, advertise, manufacture, or deal in goods bearing the \"CURLS\" trademark in relation to their corn-based snack products or any other deceptively similar trademark.\n4. The Defendants undertook to destroy all infringing goods in their possession within a week from the date of recordal of the compromise.\n5. The Plaintiff forgave their claim for delivery up, rendition of accounts, damages, and costs in consideration of the Defendants' undertaking.\n\n**Decision:**\n\nThe Court decreed the suit in terms of the settlement agreement, which was treated as a part of the Court's order. The parties were directed to remain bound by the terms of the settlement, and the Registry was directed to draw up a decree sheet accordingly. The Plaintiff was also entitled to a refund of the Court fee, if any, deposited by them.\n\n**Conclusion:**\n\nThe case highlights the importance of protecting intellectual property rights, particularly trademarks, in the food industry. The settlement agreement demonstrates a commitment from the Defendants to respect the Plaintiff's trademark rights and refrain from any further infringing activities. The Court's decision to decree the suit in terms of the settlement agreement ensures that the parties are bound by the terms of the agreement and provides a clear resolution to the dispute.",
    "legal_precedents": [],
    "full_text": "\n--- PAGE 1 ---\n                              Neutral Citation Number : 2022/DHC/005501 \n \nCS(COMM) 432/2021                                                                                               Page 1 of 3 \n \n$~3(Original) \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nCS(COMM) 432/2021 & I.A. 11736/2021, I.A. 11737/2021 \n \nDFM FOODS LTD \n \n \n \n           ..... Plaintiff \nThrough: \nMr. Dhruv Anand, Ms. Udita \nPatro, Ms. Swati Jain and Ms. Nimrat Singh, \nAdvs. \n \n \n \n \n \nversus \n \n \nISHVI FOOD PRIVATE LIMITED & ANR.      ..... Defendants \n \n \n \n \nThrough: Mr. Jagmeet Singh Randhawa, Adv. \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C.HARI SHANKAR \n \n \n \n \nJUDGMENT (O R A L) \n% \n \n \n \n        12.12.2022 \n \n \n1. \nThe dispute between the parties stands amicably resolved vide \nSettlement Agreement dated 28th September 2022, executed with the \nintervention of the Delhi High Court Mediation and Conciliation Centre. \nThe Settlement Agreement has been placed on record. Learned Counsel \nfor the parties are present. The terms of settlement, as per the Settlement \nAgreement, read thus: \n \n“i. \nThe Defendant Nos. 1 and 2 acknowledge the Plaintiff to be \nthe proprietor of the trademark \"CURLS\" as mentioned in paragraph \n12 of the Plaint. \n \nii. \nThe Defendant Nos. 1 and 2 acknowledge that by stocking, \noffering for sale, selling or otherwise dealing in products bearing the \n\"CURLS\" trademarks of the Plaintiff, the Defendants have violated the \ntrademark rights of the Plaintiff, as also passed off their products as \nthose originating from the Plaintiff. \n \niii. \nThe Defendant Nos. 1 and 2 undertake to this Hon'ble Court \nnot to import, offer for sale or supply, sell, supply, advertise, \nmanufacture or cause to be manufactured, or in any way deal in goods \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n13:22:28\nSignature Not Verified\n\n--- PAGE 2 ---\n                              Neutral Citation Number : 2022/DHC/005501 \n \nCS(COMM) 432/2021                                                                                               Page 2 of 3 \n \nbearing the \"CURLS\" trademark of the Plaintiff in relation to the \nmanufacture, sale, advertising, marketing etc. of its corn based snack \nproduct or in relation to any product or any other deceptively similar \ntrademark, so as to result in infringement of the registered trademarks \nof the Plaintiff and passing off, through any means, including dealing \nin such products through any store/shop/outlet or through social media \nplatforms like Facebook, WhatsApp, etc/or through ecommerce \nplatforms. \n \niv. \nThe Defendant Nos. 1 and 2 further undertake to this Hon’ble \nCourt not to do any other act amounting to passing off of the \nDefendants’ goods as those originating from the Plaintiff. \n \nv. \nThe Defendant Nos. 1 and 2 also undertake to destroy all \ninfringing goods of any description in their possession within a week \nfrom the date of recordal of this compromise on a date and time fixed \nmutually by both the parties and furnish proof of the same to the \nPlaintiff. \n \nvi. \nIn consideration of the abovementioned undertaking by the \nDefendant Nos. 1 and 2, the Plaintiff foregoes its claim for delivery \nup, rendition of accounts, damages and costs under paragraph 43 (d)-\n(g) of the Plaint. \n \nvii. \nThe undertakings given herein shall also be binding on all the \nlegal heirs, representatives and assigns-in-business of the Defendant \nNos. 1 and 2 herein. A breach of these undertakings shall \nautomatically entitle the Plaintiff to claim for the damages prayed for \nin the suit.” \n \n \n2. \nLearned Counsel for the parties agreed on behalf of their \nrespective clients to remain bound by the terms of settlement.  \n \n3. \nIn view thereof, nothing survives for adjudication in the present \nsuit. \n \n4. \nThe suit is, therefore, decreed and in terms of prayer clauses (A) to \n(C) in para 43 of the plaint read with the aforesaid Settlement Agreement \ndated 28th September 2022, which shall be treated as a part of this order. \n \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n13:22:28\nSignature Not Verified\n\n--- PAGE 3 ---\n                              Neutral Citation Number : 2022/DHC/005501 \n \nCS(COMM) 432/2021                                                                                               Page 3 of 3 \n \n5. \nParties shall remain bound by the terms of settlement. \n \n6. \nThe Registry is directed draw up a decree sheet accordingly. \n \n7. \nThe plaintiff shall also be entitled to refund of the Court fee, if any, \ndeposited by it. \n \n \n \nC.HARI SHANKAR, J \n \nDECEMBER 12, 2022/AR \n \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n13:22:28\nSignature Not Verified\n"
  },
  "total_pages": 3,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0002",
      "start_index": 1,
      "end_index": 1,
      "summary": "According to the PDF document \"DFM Foods Ltd. v. Ishvi Food Pvt. Ltd.\", a legal dispute was resolved through a Settlement Agreement dated September 28, 2022, with the intervention of the Delhi High Court Mediation and Conciliation Centre. The case, CS(COMM) 432/2021, was heard in the High Court of Delhi at New Delhi, with Hon'ble Mr. Justice C. Hari Shankar presiding.\n\nThe plaintiff, DFM Foods Ltd, was represented by Mr. Dhruv Anand, Ms. Udita Patro, Ms. Swati Jain, and Ms. Nimrat Singh, while the defendants, Ishvi Food Private Limited and another, were represented by Mr. Jagmeet Singh Randhawa. The dispute was resolved on December 12, 2022, with the defendants acknowledging DFM Foods Ltd as the proprietor of the trademark \"CURLS\" and admitting to violating the plaintiff's trademark rights by passing off their products as those of the plaintiff.\n\nThe Settlement Agreement stipulated that the defendants would not import, offer for sale, or supply goods bearing the \"CURLS\" trademark, and would cease all dealings with such goods. The agreement was placed on record, and the counsel for both parties were present in court. The judgment, delivered orally, confirmed the terms of the settlement. The PDF document, \"DFM Foods Ltd. v. Ishvi Food Pvt. Ltd.\", provides a detailed account of the case, including the legal proceedings, facts, and decisions. (Source: 49. DFM Foods Ltd. v. Ishvi Food Pvt. Ltd..pdf)",
      "pdf_source": "49. DFM Foods Ltd. v. Ishvi Food Pvt. Ltd..pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "According to page 1 of the PDF \"49. DFM Foods Ltd. v. Ishvi Food Pvt. Ltd.\", the dispute between DFM Foods Ltd. (Plaintiff) and Ishvi Food Private Limited (Defendant) has been amicably resolved through a Settlement Agreement dated September 28, 2022, with the intervention of the Delhi High Court Mediation and Conciliation Centre. The terms of the settlement include the Defendant acknowledging the Plaintiff's trademark \"CURLS\" and admitting to violating the Plaintiff's trademark rights. The Defendant undertakes not to deal in goods bearing the \"CURLS\" trademark. The case was heard by Hon'ble Mr. Justice C. Hari Shankar on December 12, 2022. The Plaintiff was represented by Mr. Dhruv Anand, Ms. Udita Patro, Ms. Swati Jain, and Ms. Nimrat Singh, while the Defendant was represented by Mr. Jagmeet Singh Randhawa. (Source: 49. DFM Foods Ltd. v. Ishvi Food Pvt. Ltd..pdf)",
          "content": "Neutral Citation Number : 2022/DHC/005501 \n \nCS(COMM) 432/2021                                                                                               Page 1 of 3 \n \n$~3(Original) \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nCS(COMM) 432/2021 & I.A. 11736/2021, I.A. 11737/2021 \n \nDFM FOODS LTD \n \n \n \n           ..... Plaintiff \nThrough: \nMr. Dhruv Anand, Ms. Udita \nPatro, Ms. Swati Jain and Ms. Nimrat Singh, \nAdvs. \n \n \n \n \n \nversus \n \n \nISHVI FOOD PRIVATE LIMITED & ANR.      ..... Defendants \n \n \n \n \nThrough: Mr. Jagmeet Singh Randhawa, Adv. \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C.HARI SHANKAR \n \n \n \n \nJUDGMENT (O R A L) \n% \n \n \n \n        12.12.2022 \n \n \n1. \nThe dispute between the parties stands amicably resolved vide \nSettlement Agreement dated 28th September 2022, executed with the \nintervention of the Delhi High Court Mediation and Conciliation Centre. \nThe Settlement Agreement has been placed on record. Learned Counsel \nfor the parties are present. The terms of settlement, as per the Settlement \nAgreement, read thus: \n \n“i. \nThe Defendant Nos. 1 and 2 acknowledge the Plaintiff to be \nthe proprietor of the trademark \"CURLS\" as mentioned in paragraph \n12 of the Plaint. \n \nii. \nThe Defendant Nos. 1 and 2 acknowledge that by stocking, \noffering for sale, selling or otherwise dealing in products bearing the \n\"CURLS\" trademarks of the Plaintiff, the Defendants have violated the \ntrademark rights of the Plaintiff, as also passed off their products as \nthose originating from the Plaintiff. \n \niii. \nThe Defendant Nos. 1 and 2 undertake to this Hon'ble Court \nnot to import, offer for sale or supply, sell, supply, advertise, \nmanufacture or cause to be manufactured, or in any way deal in goods \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n13:22:28\nSignature Not Verified",
          "pdf_source": "49. DFM Foods Ltd. v. Ishvi Food Pvt. Ltd..pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Facts and Arguments",
      "node_id": "0004",
      "start_index": 2,
      "end_index": 2,
      "summary": "According to the legal document section from the PDF \"49. DFM Foods Ltd. v. Ishvi Food Pvt. Ltd..pdf\", the case involves a trademark infringement and passing off dispute between DFM Foods Ltd. (Plaintiff) and Ishvi Food Pvt. Ltd. (Defendant). The Plaintiff alleged that the Defendant was using a deceptively similar trademark \"CURLS\" for their corn-based snack product, resulting in infringement of the Plaintiff's registered trademarks.\n\nThe parties reached a settlement agreement on September 28, 2022, wherein the Defendant undertook not to use the \"CURLS\" trademark or any similar mark, and to destroy all infringing goods within a week. The Defendant also undertook not to pass off their goods as those originating from the Plaintiff. In consideration of these undertakings, the Plaintiff forewent its claim for delivery up, rendition of accounts, damages, and costs.\n\nThe court accepted the settlement agreement and decreed the suit in terms of the agreement. The undertakings given by the Defendant were made binding on their legal heirs, representatives, and assigns-in-business. The court ordered that any breach of these undertakings would entitle the Plaintiff to claim damages.\n\nKey dates mentioned in the document include September 28, 2022 (settlement agreement date) and December 13, 2022 (signing date of the court order). The case was filed as CS(COMM) 432/2021 and I.A. 11736/2021, I.A. 11737/2021 in the High Court of Delhi at New Delhi. The PDF source provides a detailed account of the legal proceedings and settlement agreement.",
      "pdf_source": "49. DFM Foods Ltd. v. Ishvi Food Pvt. Ltd..pdf",
      "nodes": [
        {
          "title": "Page 2",
          "node_id": "0003",
          "start_index": 2,
          "end_index": 2,
          "summary": "According to page 2 of the PDF \"49. DFM Foods Ltd. v. Ishvi Food Pvt. Ltd.\", the Defendant Nos. 1 and 2 undertook not to infringe the Plaintiff's \"CURLS\" trademark. They agreed to destroy all infringing goods within a week and furnish proof to the Plaintiff. In consideration, the Plaintiff forgave its claim for delivery up, damages, and costs. The undertakings were binding on the Defendants' legal heirs and representatives. The parties agreed to the terms of settlement on September 28, 2022. The court decreed the suit in favor of the Plaintiff, with the Settlement Agreement treated as part of the order, signed by Kamla Rawat on December 13, 2022. (Source: 49. DFM Foods Ltd. v. Ishvi Food Pvt. Ltd..pdf)",
          "content": "Neutral Citation Number : 2022/DHC/005501 \n \nCS(COMM) 432/2021                                                                                               Page 2 of 3 \n \nbearing the \"CURLS\" trademark of the Plaintiff in relation to the \nmanufacture, sale, advertising, marketing etc. of its corn based snack \nproduct or in relation to any product or any other deceptively similar \ntrademark, so as to result in infringement of the registered trademarks \nof the Plaintiff and passing off, through any means, including dealing \nin such products through any store/shop/outlet or through social media \nplatforms like Facebook, WhatsApp, etc/or through ecommerce \nplatforms. \n \niv. \nThe Defendant Nos. 1 and 2 further undertake to this Hon’ble \nCourt not to do any other act amounting to passing off of the \nDefendants’ goods as those originating from the Plaintiff. \n \nv. \nThe Defendant Nos. 1 and 2 also undertake to destroy all \ninfringing goods of any description in their possession within a week \nfrom the date of recordal of this compromise on a date and time fixed \nmutually by both the parties and furnish proof of the same to the \nPlaintiff. \n \nvi. \nIn consideration of the abovementioned undertaking by the \nDefendant Nos. 1 and 2, the Plaintiff foregoes its claim for delivery \nup, rendition of accounts, damages and costs under paragraph 43 (d)-\n(g) of the Plaint. \n \nvii. \nThe undertakings given herein shall also be binding on all the \nlegal heirs, representatives and assigns-in-business of the Defendant \nNos. 1 and 2 herein. A breach of these undertakings shall \nautomatically entitle the Plaintiff to claim for the damages prayed for \nin the suit.” \n \n \n2. \nLearned Counsel for the parties agreed on behalf of their \nrespective clients to remain bound by the terms of settlement.  \n \n3. \nIn view thereof, nothing survives for adjudication in the present \nsuit. \n \n4. \nThe suit is, therefore, decreed and in terms of prayer clauses (A) to \n(C) in para 43 of the plaint read with the aforesaid Settlement Agreement \ndated 28th September 2022, which shall be treated as a part of this order. \n \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n13:22:28\nSignature Not Verified",
          "pdf_source": "49. DFM Foods Ltd. v. Ishvi Food Pvt. Ltd..pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Decision and Orders",
      "node_id": "0006",
      "start_index": 3,
      "end_index": 3,
      "summary": "According to the PDF document \"DFM Foods Ltd. v. Ishvi Food Pvt. Ltd.\", a legal proceeding was held in the High Court of Delhi at New Delhi. The case, CS(COMM) 432/2021, involved DFM Foods Ltd. as the plaintiff and Ishvi Food Pvt. Ltd. as the defendant. The plaintiff was represented by advocates Mr. Dhruv Anand, Ms. Udita Patro, Ms. Swati Jain, and Ms. Nimrat Singh.\n\nThe court, presided over by Justice C. Hari Shankar, issued a decision on December 12, 2022. The parties had reached a settlement, the terms of which they were bound to follow. The Registry was directed to draw up a decree sheet accordingly. Additionally, the plaintiff was entitled to a refund of any court fees deposited.\n\nThe key points from the decision are:\n\n* Parties are bound by the settlement terms\n* A decree sheet will be drawn up by the Registry\n* The plaintiff is entitled to a refund of court fees, if any\n* The decision was made on December 12, 2022, and digitally signed on December 13, 2022\n\nThe Neutral Citation Number for this case is 2022/DHC/005501. The PDF document, \"DFM Foods Ltd. v. Ishvi Food Pvt. Ltd.\", provides the details of the legal proceedings, including the parties involved, their representatives, and the court's decision. (Source: DFM Foods Ltd. v. Ishvi Food Pvt. Ltd..pdf)",
      "pdf_source": "49. DFM Foods Ltd. v. Ishvi Food Pvt. Ltd..pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0005",
          "start_index": 3,
          "end_index": 3,
          "summary": "According to page 3 of the PDF \"49. DFM Foods Ltd. v. Ishvi Food Pvt. Ltd.\", the High Court of Delhi at New Delhi made the following decisions: \n\n* Parties are bound by the terms of settlement (point 5).\n* The Registry is directed to draw up a decree sheet accordingly (point 6).\n* The plaintiff, DFM Foods Ltd., is entitled to a refund of court fees deposited (point 7).\n\nThe decision was made by Judge C. Hari Shankar on December 12, 2022. The case details are CS(COMM) 432/2021 and I.A. 11736/2021, I.A. 11737/2021. The plaintiff was represented by advocates Mr. Dhruv Anand, Ms. Udita Patro, Ms. Swati Jain, and Ms. Nimrat Singh. The document was digitally signed by Kamla Rawat on December 13, 2022. (Source: 49. DFM Foods Ltd. v. Ishvi Food Pvt. Ltd..pdf)",
          "content": "Neutral Citation Number : 2022/DHC/005501 \n \nCS(COMM) 432/2021                                                                                               Page 3 of 3 \n \n5. \nParties shall remain bound by the terms of settlement. \n \n6. \nThe Registry is directed draw up a decree sheet accordingly. \n \n7. \nThe plaintiff shall also be entitled to refund of the Court fee, if any, \ndeposited by it. \n \n \n \nC.HARI SHANKAR, J \n \nDECEMBER 12, 2022/AR \n \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n13:22:28\nSignature Not Verified",
          "pdf_source": "49. DFM Foods Ltd. v. Ishvi Food Pvt. Ltd..pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-15T18:41:16.733102",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}