{
  "doc_name": "5. Vinod agarwal vs Meera Devi",
  "pdf_source": "5. Vinod agarwal vs Meera Devi.pdf",
  "metadata": {
    "document_name": "5. Vinod agarwal vs Meera Devi",
    "source_pdf": "5. Vinod agarwal vs Meera Devi.pdf",
    "judges": [
      "AMIT BANSAL"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "41/2022",
      "41/2022",
      "41/2022",
      "41/2022",
      "41/2022",
      "41/2022",
      "2106/2022"
    ],
    "dhc_numbers": [
      "2023/DHC/001820",
      "2023/DHC/001820",
      "2023/DHC/001820",
      "2023/DHC/001820",
      "2023/DHC/001820"
    ],
    "ia_numbers": [],
    "decision_date": "10 March, 2023",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [],
    "defendants": [],
    "appellants": [
      "Vinod Aggarwal trading as Vaneet Sales Corporation"
    ],
    "respondents": [
      "Meera Devi & Anr."
    ],
    "plaintiff_advocates": [],
    "defendant_advocates": [],
    "appellant_advocates": [
      "Ms. Purva Chugh",
      "Ms. Sonia Sharma"
    ],
    "respondent_advocates": [],
    "damages_claimed": "11,300",
    "damages_awarded": null,
    "key_issues": [
      "Trademark rectification and cancellation of the impugned trademark 'BAL BIHAR SUPER'",
      "Registration of a deceptively similar trademark 'LAL BAHAR CHHAAP' by a third party",
      "Opposition to the registration of a similar trademark and its subsequent abandonment",
      "Passing off and infringement of the petitioner's trademark 'LAL BIHARI CHAAP'",
      "Validity and subsistence of the petitioner's trademark registrations in Class 34",
      "Copyright ownership of the artistic work in the 'LAL BIHARI CHAAP' labels",
      "Misuse of a similar trademark, packaging, and trade dress by a third party",
      "Cancellation/removal of the impugned trademark from the Register of Trade Marks",
      "Procedure for re-numbering a civil original trademark rectification petition",
      "Enforcement of intellectual property rights and protection against unfair trade practices"
    ],
    "decision_summary": "**Background:**\nThe case involves a trademark rectification petition filed by Vinod Aggarwal Trading as Vaneet Sales Corporation (the petitioner) against Meera Devi and another (the respondents). The petitioner is engaged in the business of manufacturing and trading tobacco products and has registered the trademark 'LAL BIHARI CHAAP' in Class 34. The petitioner claims to have been using this trademark since 1990 and has also obtained copyright for the artistic work in the 'LAL BIHARI CHAAP' labels.\n\n**Legal Issues:**\nThe legal issue in this case revolves around the registration of the trademark 'BAL BIHARI SUPER' (word per se) by the respondent, Meera Devi, under application no. 4256368 in Class 34. The petitioner alleges that this trademark is deceptively similar to their registered trademark 'LAL BIHARI CHAAP' and is likely to cause confusion among consumers.\n\n**Arguments:**\nThe petitioner argues that they have been using the 'LAL BIHARI CHAAP' trademark for over three decades and have established a significant reputation in the market. They claim that the respondent's attempt to register the 'BAL BIHARI SUPER' trademark is an attempt to ride on their reputation and cause confusion among consumers. The petitioner also points out that the respondent's husband, Mr. Raghupati Maurya, had previously applied for a similar trademark 'LAL BAHAR CHHAAP', which was opposed by the petitioner and ultimately abandoned.\n\n**Court Findings:**\nThe court notes that the petitioner has established a significant reputation in the market with their 'LAL BIHARI CHAAP' trademark and has obtained copyright for the artistic work in the labels. The court also observes that the respondent's application for the 'BAL BIHARI SUPER' trademark was filed on a proposed to be used basis, which raises suspicions about the respondent's intentions.\n\n**Decision:**\nThe court directs the Registry to re-number the present petition as a civil original trademark rectification petition. The court also notes that the petition is at a preliminary stage and that the respondents have not filed any response to the petition. The court orders the respondents to file their response to the petition within a specified timeframe.\n\n**Conclusion:**\nIn conclusion, the case involves a trademark rectification petition filed by the petitioner against the respondent's registration of the 'BAL BIHARI SUPER' trademark. The petitioner argues that this trademark is deceptively similar to their registered trademark 'LAL BIHARI CHAAP' and is likely to cause confusion among consumers. The court has directed the Registry to re-number the petition and has ordered the respondents to file their response to the petition. The outcome of the case will depend on the response filed by the respondents and the court's subsequent findings.",
    "legal_precedents": [],
    "full_text": "\n--- PAGE 1 ---\n2023/DHC/001820 \n \nC.A.(COMM.IPD-TM) 41/2022                                                                                       Page 1 of 5 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n \n% \n \n \n \n                 Date of decision: 10th March, 2023 \n \n+  \nC.A.(COMM.IPD-TM) 41/2022 and I.A. 2106/2022 (for stay) \n \nVINOD AGGARWAL TRADING AS VANEET SALES \nCORPORATION  \n \n \n \n \n..... Appellant \nThrough: \nMs. Purva Chugh and Ms. Sonia \nSharma, Advocates. \n \n \n \n \n \nversus \n \n \nMEERA DEVI & ANR.  \n \n \n \n..... Respondents \n \n \n \n \nThrough: \nNone. \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE AMIT BANSAL \n \n \n \n \n \nJUDGMENT \n \nAMIT BANSAL, J. (Oral) \n1. \nThe present petition is a civil original trademark rectification petition \nand has been wrongly numbered as an appeal.  Accordingly, the Registry is \ndirected to re-number the present petition as a civil original trademark \nrectification petition.   \n2. \nThe present petition has been filed seeking cancellation/removal of \nthe impugned trademark ‘BAL BIHAR SUPER’ (word per se), registered \nunder no.4256368 in Class 34 in the name of the respondent no.1, from the \nRegister of Trade Marks. \n3. \nBriefly, the case set up in the petition is that the petitioner is engaged \nin the business of manufacturing and trading all kinds of unmanufactured \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:14.03.2023 15:05:52\nSignature Not Verified\n\n--- PAGE 2 ---\n2023/DHC/001820 \n \nC.A.(COMM.IPD-TM) 41/2022                                                                                       Page 2 of 5 \n \ntobacco/tobacco since the year 1990. The petitioner also has many \nregistrations of the trademark/label ‘LAL BIHARI CHAAP’ in Class 34, \ndetails of which are given in paragraph 5 of the petition. All the aforesaid \ntrademark registrations are valid and subsisting. The petitioner owns the \ncopyright of the artistic work in the ‘LAL BIHARI CHAAP’ labels.  \n4. \nThe petitioner has also filed its sales turnover in respect of its \nproducts from the financial year 1989-90 to 2020- 21. The turnover of the \npetitioner in the year 2007-08 was around Rs.11,300/-, whereas the turnover \nin the financial year 2020-21 was around Rs.1,82,45,136. It is claimed that \napproximately 85% of the turnover is from the mark ‘LAL BIHARI \nCHAAP’.  \n5. \nSometime in September, 2018 the petitioner came across tobacco \nproducts bearing the trade mark ‘LAL BAHAR CHHAAP’, being \nmanufactured by M/s Shriram Maurya Enterprise. On inquiry it came to \nknow that one Mr. Raghupati Maurya was selling the tobacco products \nunder a deceptively similar trademark, packaging/trade dress and has also \napplied for the registration of said trademark/label ‘LAL BAHAR \nCHHAAP’ with the Trademark Registry under application no.3822767 \ndated 3rd May, 2018, on a proposed to be used basis. The petitioner opposed \nthe registration of the aforesaid mark by filing opposition on 16th October, \n2018, which was not contested by Mr. Raghupati Maurya and therefore, \nresulted in the abandonment of his application. \n6. \nThereafter, the petitioner made a complaint through his dealer, Mr. \nSushil Gupta at Uttam Nagar Police Station and the matter was amicably \ncompromised by Mr. Raghupati Maurya due to the intervention of a local \npolice. Mr. Raghupati Maurya admitted to using the trademark similar to the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:14.03.2023 15:05:52\nSignature Not Verified\n\n--- PAGE 3 ---\n2023/DHC/001820 \n \nC.A.(COMM.IPD-TM) 41/2022                                                                                       Page 3 of 5 \n \npetitioner's trademark/label ‘LAL BIHARI CHAAP’ and on 28th September, \n2018 gave an undertaking to not manufacture and/or sell the tobacco \nproducts bearing a similar trade mark/trade dress as that of the petitioner. \nMr. Raghupati Maurya also willingly handed over the infringing goods and \nlabels available at the premises over to the dealer of the petitioner. \n7. \nOn 10th October, 2018, not even two weeks after giving the said \nundertaking, Mr. Raghupati Maurya filed yet another similar trademark \napplication for trademark/label ‘BAL BAHAR CHHAP GOLD’ on a \nproposed to be used basis, which was again opposed by the petitioner and is \npending before the Trade Marks Registry. \n8. \nSometime in April 2021, the petitioner came across the application \nno.4777955 of the respondent no.1, Mrs. Meera Devi, who is the wife of Mr. \nRaghupati Maurya for registration of the trademark ‘BAL BIHARI SUPER’ \n(device) claiming user since 5th August, 2019. The petitioner opposed the \nregistration of the aforesaid trademark by filing opposition on 27th April, \n2021.  \n9. \nThe aforesaid application was associated with the word mark ‘BAL \nBIHARI SUPER’ registered under application no.4256368 dated 5th August, \n2019 in the name of the respondent no.1, on a proposed to be used basis.  \n10. \nAccordingly, the petitioner has filed the present petition.  \nPROCEEDINGS IN THE CASE \n11. \nNotice in the petition was issued on 8th February, 2022.  \n12. \nThe order dated 9th November, 2022 passed by the Joint Registrar \nrecords that the respondent no.1 refused to receive the notice issued and \nhence, the respondent no.1 was deemed to have been served. None appeared \non behalf of the respondent no.1 on 22nd December, 2022 and 27th February, \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:14.03.2023 15:05:52\nSignature Not Verified\n\n--- PAGE 4 ---\n2023/DHC/001820 \n \nC.A.(COMM.IPD-TM) 41/2022                                                                                       Page 4 of 5 \n \n2023 also. Despite granting an opportunity to file reply, the respondent no.1 \nhas failed to rebut the case of the petitioner. It is indicative of the fact that \nthe respondent no.1 has nothing substantial to urge, by way of a response to \nthe averments in the petition. \nANALYSIS AND FINDINGS \n13. \nI have heard the counsel for the petitioner and perused the record of \nthe case.  \n14. \nFrom the facts detailed above, it is evident that Mr. Raghupati Maurya \nand Mrs. Meera Devi (respondent no.1), who are husband and wife, are \ncolluding with each other. Together, both of them have filed four trademark \napplications which are similar to the registered trademarks of the petitioner. \nThree of the aforesaid applications have been filed after acknowledging the \nrights of the petitioner and giving an undertaking to not use the trademark \n‘LAL BIHARI CHAAP’ or other similar marks. In order to get over the said \nundertaking, Mr. Raghupati Maurya started filing applications in the name \nof his wife, the respondent no.1. \n15. \nThe adoption and the use of the impugned mark ‘BAL BIHARI \nSUPER’ by the respondent no.1, which is very similar to the trademark \n‘LAL BIHARI CHAAP’ of the petitioner, is likely to create confusion in the \nmarket. Not only is the trademark of the respondent no.1 similar to the \ntrademark of the plaintiff but the nature of the goods of the petitioner and \nthe respondent no.1 are identical i.e., tobacco related products falling in \nClass 34.  It is clear that the adoption of the said mark by the respondent \nno.1 is with the sole purpose of trading upon the goodwill and reputation of \nthe petitioner. The mark of the respondent no.1 is also likely to deceive \nunwary consumers of their association with the petitioner. Therefore, the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:14.03.2023 15:05:52\nSignature Not Verified\n\n--- PAGE 5 ---\n2023/DHC/001820 \n \nC.A.(COMM.IPD-TM) 41/2022                                                                                       Page 5 of 5 \n \naforesaid registration in favour of the respondent no.1 could not have been \ngranted in terms of Section 11 of the Trade Marks Act, 1999 (hereinafter \n‘the Act’) \n16. \nThe adoption of the trademark ‘BAL BIIHARI SUPER’ by the \nrespondent no.1 is dishonest, as is evident from the acknowledgment of the \npetitioner’s right in the trademark/label ‘LAL BIHARI CHAAP’ by the \nhusband of the respondent no.1 and an undertaking to not use marks similar \nto those of the petitioner. Therefore, the respondent no.1 is not entitled to the \nbenefit of Section 12 of the Act.  \n17. \nThe petitioner is the prior adopter and continuous and exclusive user \nof the said trademark in respect of unmanufactured tobacco/tobacco since \n12th February, 1990. Therefore, the trademark registered in favour of the \nrespondent no.1 is liable to be cancelled in terms of Section 57 of the Act. \n18. \nThe impugned registration under no.4256368 in Class 34 remains on \nthe Register of Trade Marks without sufficient cause.  \n19. \nAccordingly, the present petition is allowed and the trademark \nregistered under application no.4256368 in the name of the respondent no.1 \nin Class 34 is removed from the Register of Trade Marks.   \n20. \nPending application also stands disposed of.    \n21. \nThe Registry is directed to supply a copy of the present order to the \nTrademark Registry, at e-mail - llc-ipo@gov.in for compliance. \n \n \nAMIT BANSAL, J. \nMARCH 10, 2023 \nat \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:14.03.2023 15:05:52\nSignature Not Verified\n"
  },
  "total_pages": 5,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0002",
      "start_index": 1,
      "end_index": 1,
      "summary": "According to the PDF document \"Vinod Agarwal vs Meera Devi.pdf\", the case involves a trademark rectification petition filed by Vinod Aggarwal, trading as Vaneet Sales Corporation, against Meera Devi and another respondent. The petition, numbered as C.A.(COMM.IPD-TM) 41/2022, was heard in the High Court of Delhi at New Delhi on March 10, 2023.\n\nThe petitioner, represented by advocates Ms. Purva Chugh and Ms. Sonia Sharma, sought the cancellation of the trademark \"BAL BIHAR SUPER\" (word per se), registered under no. 4256368 in Class 34 in the name of respondent Meera Devi. The petitioner claimed to be engaged in the business of manufacturing and trading various products and sought the removal of the impugned trademark from the Register of Trade Marks.\n\nThe court, presided over by Hon'ble Mr. Justice Amit Bansal, noted that the petition was wrongly numbered as an appeal and directed the Registry to re-number it as a civil original trademark rectification petition. The judgment, delivered orally, was digitally signed by Justice Amit Bansal on March 14, 2023. The PDF document, sourced from 2023/DHC/001820, provides details of the case, including the parties, dates, and proceedings. (Source: Vinod Agarwal vs Meera Devi.pdf)",
      "pdf_source": "5. Vinod agarwal vs Meera Devi.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "According to page 1 of the PDF \"5. Vinod agarwal vs Meera Devi.pdf\", a civil original trademark rectification petition (initially wrongly numbered as an appeal, C.A.(COMM.IPD-TM) 41/2022) was filed by Vinod Aggarwal trading as Vaneet Sales Corporation. The petition seeks cancellation of the trademark 'BAL BIHAR SUPER' (registered under no. 4256368 in Class 34) owned by respondent Meera Devi. The case was heard by Hon'ble Mr. Justice Amit Bansal on March 10, 2023. The petitioner is represented by Ms. Purva Chugh and Ms. Sonia Sharma, while the respondent had no representation. The petition aims to remove the impugned trademark from the Register of Trade Marks. (Source: 5. Vinod agarwal vs Meera Devi.pdf, 2023/DHC/001820)",
          "content": "2023/DHC/001820 \n \nC.A.(COMM.IPD-TM) 41/2022                                                                                       Page 1 of 5 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n \n% \n \n \n \n                 Date of decision: 10th March, 2023 \n \n+  \nC.A.(COMM.IPD-TM) 41/2022 and I.A. 2106/2022 (for stay) \n \nVINOD AGGARWAL TRADING AS VANEET SALES \nCORPORATION  \n \n \n \n \n..... Appellant \nThrough: \nMs. Purva Chugh and Ms. Sonia \nSharma, Advocates. \n \n \n \n \n \nversus \n \n \nMEERA DEVI & ANR.  \n \n \n \n..... Respondents \n \n \n \n \nThrough: \nNone. \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE AMIT BANSAL \n \n \n \n \n \nJUDGMENT \n \nAMIT BANSAL, J. (Oral) \n1. \nThe present petition is a civil original trademark rectification petition \nand has been wrongly numbered as an appeal.  Accordingly, the Registry is \ndirected to re-number the present petition as a civil original trademark \nrectification petition.   \n2. \nThe present petition has been filed seeking cancellation/removal of \nthe impugned trademark ‘BAL BIHAR SUPER’ (word per se), registered \nunder no.4256368 in Class 34 in the name of the respondent no.1, from the \nRegister of Trade Marks. \n3. \nBriefly, the case set up in the petition is that the petitioner is engaged \nin the business of manufacturing and trading all kinds of unmanufactured \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:14.03.2023 15:05:52\nSignature Not Verified",
          "pdf_source": "5. Vinod agarwal vs Meera Devi.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Facts and Arguments",
      "node_id": "0006",
      "start_index": 2,
      "end_index": 4,
      "summary": "According to the PDF document \"Vinod Agarwal vs Meera Devi.pdf\" (2023/DHC/001820), the legal proceedings involve a trademark dispute between Vinod Aggarwal, trading as Vaneet Sales Corporation, and Meera Devi. The petitioner, Vinod Aggarwal, has been manufacturing tobacco products under the trademark \"LAL BIHARI CHAAP\" since 1990 and owns the copyright of the artistic work in the label.\n\nThe dispute arose when the petitioner discovered that Meera Devi's husband, Raghupati Maurya, was selling tobacco products under a deceptively similar trademark \"LAL BAHAR CHHAAP\" in 2018. The petitioner opposed the registration of the mark, which was abandoned by Raghupati Maurya. However, Raghupati Maurya continued to file similar trademark applications, including \"BAL BAHAR CHHAP GOLD\" and \"BAL BIHARI SUPER\", which were opposed by the petitioner.\n\nThe petitioner filed a petition against Meera Devi, who had applied for registration of the trademark \"BAL BIHARI SUPER\" in 2021. The court issued a notice on February 8, 2022, which was deemed served as Meera Devi refused to receive it. The respondent did not appear in court on multiple dates, including December 22, 2022, and February 27, 2022.\n\nThe petitioner's sales turnover from 1989-90 to 2020-21 was submitted, with a significant increase from Rs. 11,300 in 2007-08 to Rs. 1,82,45,136 in 2020-21, with approximately 85% of the turnover attributed to the \"LAL BIHARI CHAAP\" mark. The case highlights the ongoing trademark dispute and the petitioner's efforts to protect their intellectual property rights. (Source: Vinod Agar",
      "pdf_source": "5. Vinod agarwal vs Meera Devi.pdf",
      "nodes": [
        {
          "title": "Page 2",
          "node_id": "0003",
          "start_index": 2,
          "end_index": 2,
          "summary": "According to page 2 of the PDF \"5. Vinod agarwal vs Meera Devi.pdf\", the petitioner, Vinod Aggarwal, has been manufacturing tobacco products under the trademark 'LAL BIHARI CHAAP' since 1990. The petitioner has valid trademark registrations and owns the copyright of the artistic work in the labels. The sales turnover of the petitioner from 1989-90 to 2020-21 was submitted, with a significant increase from Rs.11,300 in 2007-08 to Rs.1,82,45,136 in 2020-21, with approximately 85% of the turnover coming from the 'LAL BIHARI CHAAP' mark.\n\nIn 2018, the petitioner discovered tobacco products with a deceptively similar trademark 'LAL BAHAR CHHAAP' being sold by Mr. Raghupati Maurya. The petitioner opposed the registration of this mark and filed a complaint, which was compromised after Mr. Raghupati Maurya admitted to using a similar trademark. (Source: 5. Vinod agarwal vs Meera Devi.pdf, 2023/DHC/001820, C.A.(COMM.IPD-TM) 41/2022)",
          "content": "2023/DHC/001820 \n \nC.A.(COMM.IPD-TM) 41/2022                                                                                       Page 2 of 5 \n \ntobacco/tobacco since the year 1990. The petitioner also has many \nregistrations of the trademark/label ‘LAL BIHARI CHAAP’ in Class 34, \ndetails of which are given in paragraph 5 of the petition. All the aforesaid \ntrademark registrations are valid and subsisting. The petitioner owns the \ncopyright of the artistic work in the ‘LAL BIHARI CHAAP’ labels.  \n4. \nThe petitioner has also filed its sales turnover in respect of its \nproducts from the financial year 1989-90 to 2020- 21. The turnover of the \npetitioner in the year 2007-08 was around Rs.11,300/-, whereas the turnover \nin the financial year 2020-21 was around Rs.1,82,45,136. It is claimed that \napproximately 85% of the turnover is from the mark ‘LAL BIHARI \nCHAAP’.  \n5. \nSometime in September, 2018 the petitioner came across tobacco \nproducts bearing the trade mark ‘LAL BAHAR CHHAAP’, being \nmanufactured by M/s Shriram Maurya Enterprise. On inquiry it came to \nknow that one Mr. Raghupati Maurya was selling the tobacco products \nunder a deceptively similar trademark, packaging/trade dress and has also \napplied for the registration of said trademark/label ‘LAL BAHAR \nCHHAAP’ with the Trademark Registry under application no.3822767 \ndated 3rd May, 2018, on a proposed to be used basis. The petitioner opposed \nthe registration of the aforesaid mark by filing opposition on 16th October, \n2018, which was not contested by Mr. Raghupati Maurya and therefore, \nresulted in the abandonment of his application. \n6. \nThereafter, the petitioner made a complaint through his dealer, Mr. \nSushil Gupta at Uttam Nagar Police Station and the matter was amicably \ncompromised by Mr. Raghupati Maurya due to the intervention of a local \npolice. Mr. Raghupati Maurya admitted to using the trademark similar to the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:14.03.2023 15:05:52\nSignature Not Verified",
          "pdf_source": "5. Vinod agarwal vs Meera Devi.pdf",
          "nodes": []
        },
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "According to page 3 of the PDF \"5. Vinod agarwal vs Meera Devi.pdf\", the petitioner's trademark 'LAL BIHARI CHAAP' was infringed upon by Mr. Raghupati Maurya, who gave an undertaking not to manufacture or sell similar products on September 28, 2018. However, he filed another trademark application for 'BAL BAHAR CHHAP GOLD' on October 10, 2018. The petitioner also opposed the registration of 'BAL BIHARI SUPER' by Mrs. Meera Devi, Mr. Maurya's wife, who claimed user since August 5, 2019. The petitioner filed the present petition, and notice was issued on February 8, 2022. The respondent refused to receive the notice and was deemed served. No one appeared on behalf of the respondent on December 22, 2022, and February 27, 2022. (Source: 5. Vinod agarwal vs Meera Devi.pdf, 2023/DHC/001820, C.A.(COMM.IPD-TM) 41/2022)",
          "content": "2023/DHC/001820 \n \nC.A.(COMM.IPD-TM) 41/2022                                                                                       Page 3 of 5 \n \npetitioner's trademark/label ‘LAL BIHARI CHAAP’ and on 28th September, \n2018 gave an undertaking to not manufacture and/or sell the tobacco \nproducts bearing a similar trade mark/trade dress as that of the petitioner. \nMr. Raghupati Maurya also willingly handed over the infringing goods and \nlabels available at the premises over to the dealer of the petitioner. \n7. \nOn 10th October, 2018, not even two weeks after giving the said \nundertaking, Mr. Raghupati Maurya filed yet another similar trademark \napplication for trademark/label ‘BAL BAHAR CHHAP GOLD’ on a \nproposed to be used basis, which was again opposed by the petitioner and is \npending before the Trade Marks Registry. \n8. \nSometime in April 2021, the petitioner came across the application \nno.4777955 of the respondent no.1, Mrs. Meera Devi, who is the wife of Mr. \nRaghupati Maurya for registration of the trademark ‘BAL BIHARI SUPER’ \n(device) claiming user since 5th August, 2019. The petitioner opposed the \nregistration of the aforesaid trademark by filing opposition on 27th April, \n2021.  \n9. \nThe aforesaid application was associated with the word mark ‘BAL \nBIHARI SUPER’ registered under application no.4256368 dated 5th August, \n2019 in the name of the respondent no.1, on a proposed to be used basis.  \n10. \nAccordingly, the petitioner has filed the present petition.  \nPROCEEDINGS IN THE CASE \n11. \nNotice in the petition was issued on 8th February, 2022.  \n12. \nThe order dated 9th November, 2022 passed by the Joint Registrar \nrecords that the respondent no.1 refused to receive the notice issued and \nhence, the respondent no.1 was deemed to have been served. None appeared \non behalf of the respondent no.1 on 22nd December, 2022 and 27th February, \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:14.03.2023 15:05:52\nSignature Not Verified",
          "pdf_source": "5. Vinod agarwal vs Meera Devi.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "According to page 4 of the PDF \"5. Vinod agarwal vs Meera Devi.pdf\", the respondent, Meera Devi, failed to rebut the case of the petitioner, Vinod Aggarwal, despite being given the opportunity. The court analyzed the facts and found that Meera Devi and her husband, Raghupati Maurya, were colluding to file trademark applications similar to the petitioner's registered trademarks. The respondent's mark, \"BAL BIHARI SUPER\", is similar to the petitioner's \"LAL BIHARI CHAAP\" and may create confusion in the market. The court decided that the respondent's adoption of the mark was to trade on the petitioner's goodwill and reputation. The case, C.A.(COMM.IPD-TM) 41/2022, was decided on March 10, 2023. (Source: 5. Vinod agarwal vs Meera Devi.pdf)",
          "content": "2023/DHC/001820 \n \nC.A.(COMM.IPD-TM) 41/2022                                                                                       Page 4 of 5 \n \n2023 also. Despite granting an opportunity to file reply, the respondent no.1 \nhas failed to rebut the case of the petitioner. It is indicative of the fact that \nthe respondent no.1 has nothing substantial to urge, by way of a response to \nthe averments in the petition. \nANALYSIS AND FINDINGS \n13. \nI have heard the counsel for the petitioner and perused the record of \nthe case.  \n14. \nFrom the facts detailed above, it is evident that Mr. Raghupati Maurya \nand Mrs. Meera Devi (respondent no.1), who are husband and wife, are \ncolluding with each other. Together, both of them have filed four trademark \napplications which are similar to the registered trademarks of the petitioner. \nThree of the aforesaid applications have been filed after acknowledging the \nrights of the petitioner and giving an undertaking to not use the trademark \n‘LAL BIHARI CHAAP’ or other similar marks. In order to get over the said \nundertaking, Mr. Raghupati Maurya started filing applications in the name \nof his wife, the respondent no.1. \n15. \nThe adoption and the use of the impugned mark ‘BAL BIHARI \nSUPER’ by the respondent no.1, which is very similar to the trademark \n‘LAL BIHARI CHAAP’ of the petitioner, is likely to create confusion in the \nmarket. Not only is the trademark of the respondent no.1 similar to the \ntrademark of the plaintiff but the nature of the goods of the petitioner and \nthe respondent no.1 are identical i.e., tobacco related products falling in \nClass 34.  It is clear that the adoption of the said mark by the respondent \nno.1 is with the sole purpose of trading upon the goodwill and reputation of \nthe petitioner. The mark of the respondent no.1 is also likely to deceive \nunwary consumers of their association with the petitioner. Therefore, the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:14.03.2023 15:05:52\nSignature Not Verified",
          "pdf_source": "5. Vinod agarwal vs Meera Devi.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Decision and Orders",
      "node_id": "0008",
      "start_index": 5,
      "end_index": 5,
      "summary": "According to the PDF document \"Vinod Agarwal vs Meera Devi.pdf\", a legal proceeding was held in the High Court of Delhi at New Delhi, dated March 10, 2023. The case number is C.A.(COMM.IPD-TM) 41/2022, and the decision was made by Amit Bansal, J. The appellant, Vinod Aggarwal, trading as Vaneet Sales Corporation, was represented by Ms. Purva Chugh and Ms. Sonia Sharma, Advocates.\n\nThe respondent, Meera Devi, had a trademark registration under application no. 4256368 in Class 34, which the appellant contested. The court found that the adoption of the trademark \"BAL BIIHARI SUPER\" by the respondent was dishonest, as her husband had acknowledged the petitioner's right to the trademark/label \"LAL BIHARI CHAAP\" and undertaken not to use similar marks.\n\nThe court ruled in favor of the appellant, stating that the respondent's registration could not have been granted under Section 11 of the Trade Marks Act, 1999. The petitioner was found to be the prior adopter and continuous user of the trademark since February 12, 1990. The court ordered the removal of the trademark registered under application no. 4256368 in the name of the respondent from the Register of Trade Marks, citing Section 57 of the Act. The pending application was also disposed of, and the Registry was directed to supply a copy of the order to the Trademark Registry for compliance (Source: Vinod Agarwal vs Meera Devi.pdf, 2023/DHC/001820).",
      "pdf_source": "5. Vinod agarwal vs Meera Devi.pdf",
      "nodes": [
        {
          "title": "Page 5",
          "node_id": "0007",
          "start_index": 5,
          "end_index": 5,
          "summary": "According to page 5 of the PDF \"Vinod agarwal vs Meera Devi.pdf\", the High Court of Delhi ruled in favor of the appellant, Vinod Aggarwal. The court found that the respondent, Meera Devi, had dishonestly adopted the trademark \"BAL BIIHARI SUPER\" and was not entitled to its registration. The petitioner, Vinod Aggarwal, was found to be the prior adopter and continuous user of the trademark \"LAL BIHARI CHAAP\" since February 12, 1990. The court ordered the cancellation of the respondent's trademark registration (no. 4256368) in Class 34, as it remained on the Register of Trade Marks without sufficient cause. The decision was made on March 10, 2023, by Judge Amit Bansal. (Source: Vinod agarwal vs Meera Devi.pdf, page 5)",
          "content": "2023/DHC/001820 \n \nC.A.(COMM.IPD-TM) 41/2022                                                                                       Page 5 of 5 \n \naforesaid registration in favour of the respondent no.1 could not have been \ngranted in terms of Section 11 of the Trade Marks Act, 1999 (hereinafter \n‘the Act’) \n16. \nThe adoption of the trademark ‘BAL BIIHARI SUPER’ by the \nrespondent no.1 is dishonest, as is evident from the acknowledgment of the \npetitioner’s right in the trademark/label ‘LAL BIHARI CHAAP’ by the \nhusband of the respondent no.1 and an undertaking to not use marks similar \nto those of the petitioner. Therefore, the respondent no.1 is not entitled to the \nbenefit of Section 12 of the Act.  \n17. \nThe petitioner is the prior adopter and continuous and exclusive user \nof the said trademark in respect of unmanufactured tobacco/tobacco since \n12th February, 1990. Therefore, the trademark registered in favour of the \nrespondent no.1 is liable to be cancelled in terms of Section 57 of the Act. \n18. \nThe impugned registration under no.4256368 in Class 34 remains on \nthe Register of Trade Marks without sufficient cause.  \n19. \nAccordingly, the present petition is allowed and the trademark \nregistered under application no.4256368 in the name of the respondent no.1 \nin Class 34 is removed from the Register of Trade Marks.   \n20. \nPending application also stands disposed of.    \n21. \nThe Registry is directed to supply a copy of the present order to the \nTrademark Registry, at e-mail - llc-ipo@gov.in for compliance. \n \n \nAMIT BANSAL, J. \nMARCH 10, 2023 \nat \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:14.03.2023 15:05:52\nSignature Not Verified",
          "pdf_source": "5. Vinod agarwal vs Meera Devi.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-15T18:41:27.414220",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}