{
  "doc_name": "50. Cedar Properties & Trading LLP & Ors.",
  "pdf_source": "50. Cedar Properties & Trading LLP & Ors..pdf",
  "metadata": {
    "document_name": "50. Cedar Properties & Trading LLP & Ors.",
    "source_pdf": "50. Cedar Properties & Trading LLP & Ors..pdf",
    "judges": [
      "C.HARI SHANKAR"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "614/2021",
      "614/2021",
      "614/2021",
      "614/2021",
      "15757/2021"
    ],
    "dhc_numbers": [
      "2022/DHC/005466",
      "2022/DHC/005466",
      "2022/DHC/005466"
    ],
    "ia_numbers": [],
    "decision_date": "1 September, 2022",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      "Cedar Properties & Trading LLP"
    ],
    "defendants": [
      "Innova Captab Ltd"
    ],
    "appellants": [],
    "respondents": [],
    "plaintiff_advocates": [
      "Ms. Yashmeet",
      "Ms. Arushi Singh"
    ],
    "defendant_advocates": [
      "Mr. Chander Shekhar Patney",
      "Mr. K. D. Sharma"
    ],
    "appellant_advocates": [],
    "respondent_advocates": [],
    "damages_claimed": "2,00,50,000",
    "damages_awarded": null,
    "key_issues": [
      "Trade mark infringement is a key issue in the case, with the plaintiff alleging that the defendant's use of the mark \"DROTAWAL\" is identical to and/or deceptively similar to the plaintiff's registered trade mark \"DROTIN/DROTIN M\".",
      "The plaintiff is seeking a permanent injunction to restrain the defendant from manufacturing, selling, and advertising medicinal and pharmaceutical preparations under the impugned trade marks.",
      "The issue of passing off is also relevant, with the plaintiff alleging that the defendant's use of the impugned trade marks is likely to cause confusion or deception in the mind of the public.",
      "Unfair competition and dilution of the plaintiff's trade mark are also key issues in the case, with the plaintiff alleging that the defendant's actions are likely to erode the distinctiveness of the plaintiff's trade mark.",
      "The plaintiff is seeking an order for delivery up of all infringing packaging, labels, and other materials for destruction or erasure.",
      "The issue of rendition of accounts and payment of profits illegally earned by the defendant is also relevant, with the plaintiff seeking a decree for an amount to be determined.",
      "The plaintiff is seeking a decree for a specific amount of Rs. 2,00,50,000, which suggests that damages or compensation are also a key issue in the case.",
      "The defendant's submission to suffer a decree in terms of prayers (i) and (ii) of the prayer clause indicates that the issue of liability has been conceded, and the only remaining issue is the extent of the relief to be granted.",
      "The court's decision to decree the suit without trial, and the plaintiff's entitlement to a refund of court fees, are also key issues in the case."
    ],
    "decision_summary": "**Case Summary: Cedar Properties & Trading LLP vs. Innova Captab Ltd & Ors. (CS(COMM) 614/2021)**\n\n**Background:**\n\nThe case involves a dispute between Cedar Properties & Trading LLP (the Plaintiffs) and Innova Captab Ltd & Ors. (the Defendants) regarding the infringement of the Plaintiffs' registered trade mark \"DROTIN/DROTIN M\" (Registration No. 732349). The Plaintiffs alleged that the Defendants were manufacturing, selling, and advertising medicinal and pharmaceutical preparations under the impugned trade mark \"DROTAWAL\", which is identical to and/or deceptively similar to the Plaintiffs' registered trade mark.\n\n**Legal Issues:**\n\nThe primary issues in this case were:\n\n1. Whether the Defendants' use of the trade mark \"DROTAWAL\" constitutes an infringement of the Plaintiffs' registered trade mark \"DROTIN/DROTIN M\".\n2. Whether the Defendants' actions amount to passing off and unfair competition.\n3. Whether the Plaintiffs are entitled to a decree for permanent injunction, delivery up of infringing materials, and rendition of accounts of profits earned by the Defendants.\n\n**Arguments:**\n\nThe Plaintiffs argued that the Defendants' use of the trade mark \"DROTAWAL\" is likely to cause confusion or deception in the mind of the public, and that it infringes their registered trade mark. The Defendants, on the other hand, did not contest the allegations and instead submitted to a decree in terms of prayers (i) and (ii) of the prayer clause in the plaint.\n\n**Court Findings:**\n\nThe High Court of Delhi, presided over by Hon'ble Mr. Justice C. Hari Shankar, noted that the Defendants had submitted to a decree in terms of prayers (i) and (ii) of the prayer clause in the plaint. As a result, the Court did not need to delve into the merits of the dispute.\n\n**Decision:**\n\nThe Court decreed the suit in favor of the Plaintiffs in terms of prayer clauses (i) and (ii) of the prayer clause in the plaint, which are:\n\ni) A decree for permanent injunction restraining the Defendants from manufacturing, selling, offering for sale, advertising, directly or indirectly dealing in medicinal and pharmaceutical preparations under the impugned trade mark \"DROTAWAL\" or any other mark that may be identical to and/or deceptively similar to the Plaintiffs' registered trade mark \"DROTIN/DROTIN M\".\n\nii) A decree for permanent injunction restraining the Defendants from manufacturing, selling, offering for sale, advertising, directly or indirectly dealing in medicinal and pharmaceutical preparations under the impugned trade mark \"DROTAWAL\" or any other mark that may be identical to and/or deceptively similar with the Plaintiffs' registered trade mark \"DROTIN\".\n\nThe Court also ordered the registry to draw up a decree sheet and noted that the Plaintiffs would be entitled to a refund of court fees, if any, deposited by them, as the suit was decreed without a trial.\n\n**Conclusion:**\n\nIn this case, the Defendants' submission to a decree in terms of prayers (i) and (ii) of the prayer clause in the plaint led to a straightforward decision in favor of the Plaintiffs. The Court's decree effectively prevents the Defendants from using the trade mark \"DROTAWAL\" or any other mark that may infringe the Plaintiffs' registered trade mark \"DROTIN/DROTIN M\".",
    "legal_precedents": [],
    "full_text": "\n--- PAGE 1 ---\n                       Neutral Citation Number : 2022/DHC/005466 \n \nCS(COMM) 614/2021                                                                                   Page 1 of 3 \n \n$~8 \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nCS(COMM) 614/2021 & I.A. 15757/2021 \n \nCEDAR PROPERTIES & TRADING LLP & ORS. \n..... Plaintiffs \nThrough: \nMs. Yashmeet and Ms. Arushi \nSingh, Advs. \n \n \n \n \n \nversus \n \n \nINNOVA CAPTAB LTD & ORS. \n \n           ..... Defendants \nThrough: \nMr. Chander Shekhar Patney & \nMr. K. D. Sharma, Advs. for D 1 to 3 \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C.HARI SHANKAR \n \nJUDGMENT(O R A L) \n% \n \n \n \n       09.12.2022 \n \n1. \nThe prayer clause in the present plaint, instituted by the plaintiff \nagainst the defendants, reads thus: \n \n“37. \nIt is, therefore, respectfully prayed that this Hon'ble Court may \nbe pleased to grant the following reliefs: \n \ni)  \nA decree for permanent injunction restraining the \nDefendants, their servants, agents, assigns in business, its \ndealers, stockists etc. from manufacturing, selling, offering \nfor sale, advertising, directly or indirectly dealing in \nmedicinal and pharmaceutical/medicinal preparations under \nthe impugned Trade Marks \"DROTAWAL\" or any other \nmark that may be identical to and/or deceptively similar to the \nPlaintiffs Trade Mark “DROTIN/DROTIN M” as is likely to \ncause confusion or deception or which is likely to have an \nassociation \nwith \nthe \nregistered \nmark \namounting \nto \ninfringement of the Plaintiffs' registered trade mark No. \n732349;  \n \nii)  \nA decree for permanent injunction restraining the \nDefendants, their servants, agents, assigns in business, its \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n16:46:47\nSignature Not Verified\n\n--- PAGE 2 ---\n                       Neutral Citation Number : 2022/DHC/005466 \n \nCS(COMM) 614/2021                                                                                   Page 2 of 3 \n \ndealers, stockists etc. from manufacturing, selling, offering \nfor sale, advertising, directly or indirectly dealing in \nmedicinal and pharmaceutical preparations under the \nimpugned trademarks \"DROTAWAL\" or any other mark that \nmay be identical to and/or deceptively similar with the \nPlaintiff's registered trade mark DROTIN, as may be likely to \ncause confusion or deception in the mind of the public in \nmistaking the Defendant's goods/business as and for those of \nthe Plaintiffs amounting to infringement, passing off & unfair \ncompetition/dilution. \n \niii)  \nA decree for delivery up of all the infringing \npackaging, labels, blocks, dyes, articles etc. to an authorised \nrepresentative of the Plaintiffs for destruction/erasure. \n \niv)  \nAn order for rendition of accounts of profits \nillegally earned by the Defendant and a decree for an amount \nso found due; \n \nv)  \nA decree of Rs. 2,00,50,000/-. \n \nvi)  \nAn order for costs in the proceedings; and \n \nvii) \nAny further order as this Hon'ble Court deems fit \nand proper in the facts and circumstances of this case.” \n \n \n2. \nOn 1st September 2022, the learned Counsel for the defendants \nsubmitted under instructions that the defendants were ready to suffer a \ndecree in terms of the prayers (i) and (ii) of the prayer clause in the \nplaint. \n \n3. \nAs such, it is not necessary for this Court to enter into the merits of \nthe dispute. \n \n4. \nThe suit, accordingly, stands decreed in terms of prayer clauses (i)  \nand (ii) in para 37 of the plaint reproduced hereinabove. \n \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n16:46:47\nSignature Not Verified\n\n--- PAGE 3 ---\n                       Neutral Citation Number : 2022/DHC/005466 \n \nCS(COMM) 614/2021                                                                                   Page 3 of 3 \n \n5. \nLet a decree sheet be drawn up by the registry. \n6. \nAs the suit has been decreed without trial, the plaintiffs would be \nentitled to be refunded the Court fees, if any, deposited by them. \n \n \nC.HARI SHANKAR, J \n \nDECEMBER 9, 2022/AR \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n16:46:47\nSignature Not Verified\n"
  },
  "total_pages": 3,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0002",
      "start_index": 1,
      "end_index": 1,
      "summary": "According to the PDF document \"50. Cedar Properties & Trading LLP & Ors..pdf\", a legal case is ongoing in the High Court of Delhi at New Delhi. The case details are as follows:\n\n* Case Number: CS(COMM) 614/2021 and I.A. 15757/2021\n* Neutral Citation Number: 2022/DHC/005466\n* Parties involved:\n\t+ Plaintiffs: Cedar Properties & Trading LLP and others, represented by Ms. Yashmeet and Ms. Arushi Singh\n\t+ Defendants: Innova Captab Ltd and others, represented by Mr. Chander Shekhar Patney and Mr. K. D. Sharma\n* Date of Judgment: 09.12.2022\n* Judge: Hon'ble Mr. Justice C. Hari Shankar\n\nThe plaintiffs are seeking relief in the form of a permanent injunction to restrain the defendants from manufacturing, selling, and advertising medicinal and pharmaceutical preparations under the trade mark \"DROTAWAL\" or any other mark that may be identical to or deceptively similar to the plaintiffs' registered trade mark \"DROTIN/DROTIN M\" (No. 732349). \n\nThe plaintiffs claim that the defendants' actions may cause confusion or deception and amount to infringement of their registered trade mark. The court has been asked to grant a decree for permanent injunction to protect the plaintiffs' trade mark rights. The document is digitally signed by Kamla Rawat on 13.12.2022. (Source: 50. Cedar Properties & Trading LLP & Ors..pdf)",
      "pdf_source": "50. Cedar Properties & Trading LLP & Ors..pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "According to page 1 of the PDF \"50. Cedar Properties & Trading LLP & Ors..pdf\", a court case (CS(COMM) 614/2021) is being heard in the High Court of Delhi at New Delhi. The plaintiffs, Cedar Properties & Trading LLP & Ors., are represented by Ms. Yashmeet and Ms. Arushi Singh, while the defendants, Innova Captab Ltd & Ors., are represented by Mr. Chander Shekhar Patney and Mr. K. D. Sharma. The case is being presided over by Hon'ble Mr. Justice C. Hari Shankar. The plaintiffs are seeking a permanent injunction to restrain the defendants from using the trade mark \"DROTAWAL\" or any similar mark that may cause confusion with their registered trade mark \"DROTIN/DROTIN M\" (No. 732349). The judgment was given on December 9, 2022.",
          "content": "Neutral Citation Number : 2022/DHC/005466 \n \nCS(COMM) 614/2021                                                                                   Page 1 of 3 \n \n$~8 \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n+  \nCS(COMM) 614/2021 & I.A. 15757/2021 \n \nCEDAR PROPERTIES & TRADING LLP & ORS. \n..... Plaintiffs \nThrough: \nMs. Yashmeet and Ms. Arushi \nSingh, Advs. \n \n \n \n \n \nversus \n \n \nINNOVA CAPTAB LTD & ORS. \n \n           ..... Defendants \nThrough: \nMr. Chander Shekhar Patney & \nMr. K. D. Sharma, Advs. for D 1 to 3 \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE C.HARI SHANKAR \n \nJUDGMENT(O R A L) \n% \n \n \n \n       09.12.2022 \n \n1. \nThe prayer clause in the present plaint, instituted by the plaintiff \nagainst the defendants, reads thus: \n \n“37. \nIt is, therefore, respectfully prayed that this Hon'ble Court may \nbe pleased to grant the following reliefs: \n \ni)  \nA decree for permanent injunction restraining the \nDefendants, their servants, agents, assigns in business, its \ndealers, stockists etc. from manufacturing, selling, offering \nfor sale, advertising, directly or indirectly dealing in \nmedicinal and pharmaceutical/medicinal preparations under \nthe impugned Trade Marks \"DROTAWAL\" or any other \nmark that may be identical to and/or deceptively similar to the \nPlaintiffs Trade Mark “DROTIN/DROTIN M” as is likely to \ncause confusion or deception or which is likely to have an \nassociation \nwith \nthe \nregistered \nmark \namounting \nto \ninfringement of the Plaintiffs' registered trade mark No. \n732349;  \n \nii)  \nA decree for permanent injunction restraining the \nDefendants, their servants, agents, assigns in business, its \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n16:46:47\nSignature Not Verified",
          "pdf_source": "50. Cedar Properties & Trading LLP & Ors..pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Facts and Arguments",
      "node_id": "0004",
      "start_index": 2,
      "end_index": 2,
      "summary": "According to the PDF document \"50. Cedar Properties & Trading LLP & Ors..pdf\", a legal proceeding was held in the High Court of Delhi at New Delhi (CS(COMM) 614/2021 & I.A. 15757/2021). The plaintiffs, Cedar Properties & Trading LLP & Ors., were represented by Ms. Yashmeet and Ms. Arushi Singh, while the defendants, Innova Captab Ltd & Ors., were represented by Mr. Chander Shekhar.\n\nThe plaintiffs sought relief against the defendants for infringement, passing off, and unfair competition regarding the trademark \"DROTIN\". The plaintiffs prayed for a decree to restrain the defendants from manufacturing, selling, or dealing in medicinal and pharmaceutical preparations under the impugned trademarks \"DROTAWAL\" or any similar mark. They also sought delivery up of infringing materials, rendition of accounts of profits, and a decree for an amount of Rs. 2,00,50,000.\n\nOn September 1, 2022, the defendants submitted that they were ready to suffer a decree in terms of prayers (i) and (ii) of the plaint. As a result, the court deemed it unnecessary to delve into the merits of the dispute. The suit was decreed in favor of the plaintiffs in terms of prayers (i) and (ii) on December 13, 2022. The court's decision was digitally signed by Kamla Rawat. The PDF document provides a detailed account of the legal proceedings, including the parties involved, dates, and amounts claimed. (Source: \"50. Cedar Properties & Trading LLP & Ors..pdf\")",
      "pdf_source": "50. Cedar Properties & Trading LLP & Ors..pdf",
      "nodes": [
        {
          "title": "Page 2",
          "node_id": "0003",
          "start_index": 2,
          "end_index": 2,
          "summary": "According to page 2 of the PDF \"50. Cedar Properties & Trading LLP & Ors..pdf\", the plaintiffs, Cedar Properties & Trading LLP & Ors., are seeking relief against the defendants, Innova Captab Ltd & Ors., for trademark infringement, passing off, and unfair competition. The plaintiffs are seeking a decree to restrain the defendants from manufacturing, selling, or dealing in medicinal and pharmaceutical preparations under the trademark \"DROTAWAL\" or any similar mark. \n\nThe defendants, through their counsel, submitted on September 1, 2022, that they were ready to suffer a decree in terms of prayers (i) and (ii) of the prayer clause. As a result, the court decreed the suit in terms of prayer clauses (i) and (ii) on December 13, 2022. The decree includes a restraining order against the defendants and an order for delivery up of infringing materials. (Source: \"50. Cedar Properties & Trading LLP & Ors..pdf\", page 2)",
          "content": "Neutral Citation Number : 2022/DHC/005466 \n \nCS(COMM) 614/2021                                                                                   Page 2 of 3 \n \ndealers, stockists etc. from manufacturing, selling, offering \nfor sale, advertising, directly or indirectly dealing in \nmedicinal and pharmaceutical preparations under the \nimpugned trademarks \"DROTAWAL\" or any other mark that \nmay be identical to and/or deceptively similar with the \nPlaintiff's registered trade mark DROTIN, as may be likely to \ncause confusion or deception in the mind of the public in \nmistaking the Defendant's goods/business as and for those of \nthe Plaintiffs amounting to infringement, passing off & unfair \ncompetition/dilution. \n \niii)  \nA decree for delivery up of all the infringing \npackaging, labels, blocks, dyes, articles etc. to an authorised \nrepresentative of the Plaintiffs for destruction/erasure. \n \niv)  \nAn order for rendition of accounts of profits \nillegally earned by the Defendant and a decree for an amount \nso found due; \n \nv)  \nA decree of Rs. 2,00,50,000/-. \n \nvi)  \nAn order for costs in the proceedings; and \n \nvii) \nAny further order as this Hon'ble Court deems fit \nand proper in the facts and circumstances of this case.” \n \n \n2. \nOn 1st September 2022, the learned Counsel for the defendants \nsubmitted under instructions that the defendants were ready to suffer a \ndecree in terms of the prayers (i) and (ii) of the prayer clause in the \nplaint. \n \n3. \nAs such, it is not necessary for this Court to enter into the merits of \nthe dispute. \n \n4. \nThe suit, accordingly, stands decreed in terms of prayer clauses (i)  \nand (ii) in para 37 of the plaint reproduced hereinabove. \n \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n16:46:47\nSignature Not Verified",
          "pdf_source": "50. Cedar Properties & Trading LLP & Ors..pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Decision and Orders",
      "node_id": "0006",
      "start_index": 3,
      "end_index": 3,
      "summary": "According to the PDF document \"50. Cedar Properties & Trading LLP & Ors..pdf\", a legal proceeding took place in the High Court of Delhi at New Delhi, with case number CS(COMM) 614/2021 and Neutral Citation Number: 2022/DHC/005466. The plaintiffs, Cedar Properties & Trading LLP and others, were represented by Ms. Yashmeet and Ms. Arushi Singh, while the defendants, Innova CapTab Ltd and others, were represented by Mr. Chander Shekhar.\n\nThe court, presided over by Justice C. Hari Shankar, made a decision on December 9, 2022. The suit was decreed without trial, and the court ordered that a decree sheet be drawn up by the registry. As a result, the plaintiffs are entitled to a refund of court fees, if any, that they had deposited.\n\nThe key dates mentioned in the document are December 9, 2022, when the decision was made, and December 13, 2022, when the document was digitally signed by Kamla Rawat. The document does not mention any specific amounts or detailed arguments, but it outlines the basic structure of the legal proceeding and the court's decision. The PDF source provides a brief overview of the case, highlighting the parties involved, the court's decision, and the subsequent orders. Overall, the document provides a concise summary of the legal proceeding, focusing on the key facts and decisions. (Source: 50. Cedar Properties & Trading LLP & Ors..pdf)",
      "pdf_source": "50. Cedar Properties & Trading LLP & Ors..pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0005",
          "start_index": 3,
          "end_index": 3,
          "summary": "According to page 3 of the PDF \"50. Cedar Properties & Trading LLP & Ors..pdf\", the court proceedings CS(COMM) 614/2021 resulted in a decree without trial. The registry is instructed to draw up a decree sheet (Point 5). The plaintiffs, Cedar Properties & Trading LLP & Ors., are entitled to a refund of court fees deposited, as the suit was decreed without trial (Point 6). The decision was made by Judge C. Hari Shankar on December 9, 2022. The document was digitally signed by Kamla Rawat on December 13, 2022. No specific amounts or detailed arguments are mentioned on this page. (Source: 50. Cedar Properties & Trading LLP & Ors..pdf)",
          "content": "Neutral Citation Number : 2022/DHC/005466 \n \nCS(COMM) 614/2021                                                                                   Page 3 of 3 \n \n5. \nLet a decree sheet be drawn up by the registry. \n6. \nAs the suit has been decreed without trial, the plaintiffs would be \nentitled to be refunded the Court fees, if any, deposited by them. \n \n \nC.HARI SHANKAR, J \n \nDECEMBER 9, 2022/AR \nDigitally Signed\nBy:KAMLA RAWAT\nSigning Date:13.12.2022\n16:46:47\nSignature Not Verified",
          "pdf_source": "50. Cedar Properties & Trading LLP & Ors..pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-15T18:29:48.339266",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}