{
  "doc_name": "6. Dorco vs Durga",
  "pdf_source": "6. Dorco vs Durga.pdf",
  "metadata": {
    "document_name": "6. Dorco vs Durga",
    "source_pdf": "6. Dorco vs Durga.pdf",
    "judges": [
      "AMIT BANSAL"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "2023/DHC/001821"
    ],
    "dhc_numbers": [
      "2023/DHC/001821",
      "2023/DHC/001821",
      "2023/DHC/001821",
      "2023/DHC/001821",
      "2023/DHC/001821",
      "2023/DHC/001821",
      "2023/DHC/001821"
    ],
    "ia_numbers": [],
    "decision_date": "10 March, 2023",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      "Dorco Co. Ltd."
    ],
    "defendants": [
      "Durga Enterprises"
    ],
    "appellants": [],
    "respondents": [
      "Durga Enterprises and Anr"
    ],
    "plaintiff_advocates": [
      "Ms. Priya Adlakha",
      "Mrs. Bindra Rana",
      "Ms. Rima Majumdar"
    ],
    "defendant_advocates": [
      "Mr. Harish Vaidyanathan Shankar",
      "Mr. Srish Kumar Mishra",
      "Mr. Sagar Mehlawat",
      "Mr. Alexander Mathai Paikaday"
    ],
    "appellant_advocates": [],
    "respondent_advocates": [
      "Mr. Harish Vaidyanathan Shankar",
      "Mr. Srish Kumar Mishra",
      "Mr. Sagar Mehlawat",
      "Mr. Alexander Mathai Paikaday"
    ],
    "damages_claimed": "15,00,000",
    "damages_awarded": null,
    "key_issues": [
      "Trademark infringement and potential passing off by the respondent",
      "Registration of the impugned trademark DORCO by the respondent no.1 without bona fide intention to use",
      "Non-use of the registered trademark by the respondent no.1 for a continuous period of five years",
      "Prior use and registration of the trademark DORCO by the petitioner",
      "Validity of the registration of the impugned trademark under Sections 47, 57 and 125 of the Trademarks Act, 1999",
      "Potential cancellation or removal of the impugned trademark from the register of trademarks",
      "The petitioner's prior rights and reputation in the trademark DORCO in India and globally",
      "The respondent no.1's potential bad faith in registering the impugned trademark",
      "The effect of the respondent no.1's non-use of the trademark on the petitioner's business and goodwill",
      "The application of the principles of honesty and fairness in the registration and use of trademarks"
    ],
    "decision_summary": "**Background**\n\nThe case involves a trademark dispute between Dorco Co. Ltd. (petitioner) and Durga Enterprises (respondent no.1) over the trademark \"DORCO\" in respect of razors and razor blades in Class 8. The petitioner, a Korean company, has been using the trademark \"DORCO\" since 1964 and has registered it in India since 1994. The respondent no.1, an Indian partnership firm, obtained registration of the same trademark in 2003, claiming use since 2001.\n\n**Legal Issues**\n\nThe petitioner filed a rectification petition under Sections 47, 57, and 125 of the Trademarks Act, 1999, seeking cancellation of the respondent no.1's trademark registration. The main issues in the case are:\n\n1. **Non-use**: The petitioner claims that the respondent no.1 has not used the registered trademark for a continuous period of five years from the date of registration, making it liable for removal under Section 47(1)(b) of the Act.\n2. **Collusion and malafide intention**: The petitioner alleges that the respondent no.1 obtained the registration in collusion with the petitioner's distributor in Nepal, with the intention of riding on the petitioner's goodwill, making it liable for rectification under Section 57(2) of the Act.\n\n**Arguments**\n\nThe petitioner argued that it has been using the trademark \"DORCO\" globally since 1964 and in India since 1994, and has a strong reputation and goodwill associated with it. The respondent no.1's registration of the same trademark is an attempt to capitalize on the petitioner's reputation. The petitioner also submitted evidence of its use of the trademark in India, including sales data, invoices, and advertisements.\n\nThe respondent no.1, on the other hand, claimed that it has been using the trademark \"DORCO\" in India since 2001 and has a legitimate right to the registration.\n\n**Court Findings**\n\nThe court observed that the respondent no.1 had not used the registered trademark for a continuous period of five years from the date of registration, as required under Section 47(1)(b) of the Act. The court also noted that the respondent no.1's partner, Govind Prasad Bagaria, was aware of the petitioner's rights and reputation in the trademark \"DORCO\" and had demanded a sum of Rs. 15,00,000/- to assign the trademark back to the petitioner.\n\n**Decision**\n\nBased on the evidence and arguments presented, the court ruled in favor of the petitioner, allowing the rectification petition and cancelling the respondent no.1's trademark registration. The court held that the respondent no.1's registration was liable for removal under Section 47(1)(b) of the Act due to non-use, and that the registration was also liable for rectification under Section 57(2) of the Act due to the respondent no.1's malafide intention to ride on the petitioner's goodwill. The court ordered the removal of the respondent no.1's trademark registration, allowing the petitioner to continue using its trademark \"DORCO\" in India.",
    "legal_precedents": [
      "Shell Transource Limited Shell International \nPetroleum Company Ltd"
    ],
    "full_text": "\n--- PAGE 1 ---\n2023/DHC/001821 \n \nC.O. (COMM.IPD-TM) 50/2022                                              \n \n \n  Page 1 of 7 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n \n% \n \n \n \n                 Date of decision: 10th March, 2023 \n \n+  \n \n \nC.O. (COMM.IPD-TM) 50/2022 \n \n \nDORCO CO. LTD. \n \n \n \n \n..... Petitioner \nThrough: \nMs. Priya Adlakha with Mrs. Bindra \nRana and Ms. Rima Majumdar, \nAdvocates. \n \n \n \n \n \nversus \n \n \nDURGA ENTERPRISES AND ANR  \n \n..... Respondents \n \n \n \n \nThrough: \nMr. \nHarish Vaidyanathan Shankar, CGSC \nwith Mr. Srish Kumar Mishra, Mr. \nSagar Mehlawat and  \nMr. Alexander Mathai Paikaday, \nAdvocates for R-1. \n \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE AMIT BANSAL \n \n \n \n \n \nJUDGMENT \n \nAMIT BANSAL, J. (Oral) \n \n1. \nThe present rectification petition has been filed on behalf of the \npetitioner seeking cancellation/removal of the trademark DORCO/ \n  bearing registration number 1252224 and registered in the \nname of respondent no.1 in respect of razors and razor blades in Class 8 \nunder Sections 47, 57 and 125 of the Trademarks Act, 1999 (hereinafter \n„Act‟).  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:14.03.2023 15:05:52\nSignature Not Verified\n\n--- PAGE 2 ---\n2023/DHC/001821 \n \nC.O. (COMM.IPD-TM) 50/2022                                              \n \n \n  Page 2 of 7 \n \n \nCase set up by the petitioner \n2. \nThe case set up by the petitioner in the petition is as follows:  \n2.1 \nThe petitioner, Dorco Co. Ltd., is engaged in the business of \nmanufacturing and exporting grooming products such as shaving \nrazors, blades, kitchen knives and stationery cutters since 1955. The \npetitioner is Asia's market leader in respect of razors, razor blades, \nkitchen knives and stationery cutters etc. The petitioner is widely \nrecognized around the world for introducing the world‟s first 7-blade \nshaving system. The products of the petitioner are sold in 120 \ncountries around the world.  \n2.2 \nThe petitioner derived the trademark DORCO from the name of its \ncompany, Dorco Co. Ltd., and has used the said trademark in different \nparts of the world since 1964 and in India since 1994. The petitioner \nis the registered proprietor of the trademark DORCO in India in \nvarious classes, since 1994 and obtained the first registration of the \naforesaid trademark on 30th November, 1994 in India. Details of the \nregistration of the trademarks of the petitioner are given on page 3 of \nthe petition.  \n2.3 \nIn 2015, the petitioner partnered with e-commerce platform „Lets \nShave‟ to sell its products in India through www.letsshave.com. Since \nthen, its products are available for sale on several e-commerce \nplatforms in India such as, Amazon, Flipkart, Snapdeal, eBay etc. \n2.4 \nThe petitioner has also registered domain name www.dorco.in on 13th \nDecember, 2006, which comprises the petitioner‟s trademark \nDORCO.  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:14.03.2023 15:05:52\nSignature Not Verified\n\n--- PAGE 3 ---\n2023/DHC/001821 \n \nC.O. (COMM.IPD-TM) 50/2022                                              \n \n \n  Page 3 of 7 \n \n2.5 \nThe petitioner has also been featured in popular trade magazines and \nnewspapers with circulation in India. The petitioner has a strong \npresence on social networking sites such as Twitter, Instagram and \nFacebook. \n2.6 \nThe respondent no.1 is the partnership firm of one Mr Govind Prasad \nBagaria and Ms. Rakhi Sureka.  The respondent no.1 got the \ntrademark \nDORCO/ \n \n(hereinafter \n„impugned \ntrademark‟) registered vide registration no.1252224 in respect of \nrazors and razor blades in class 8 in India. The application for \nregistration of the impugned trademark was filed on 28th November, \n2003 claiming use since 1st April, 2001.  \n2.7 \nThe respondent no.1 has not used the registered trademark upto three \nmonths before the date of the present rectification petition, for a \ncontinuous period of five years from the date of registration, in \nrelation to the goods for which the registration was granted. \nTherefore, it is liable to be removed for „non-use‟ in terms of Section \n47(1)(b) of the Act. \n2.8 \nThe registration of the impugned trademark is obtained by the \nrespondent no.1 in collusion with the petitioner‟s distributor in Nepal, \nMr. Pramod Sureka, with the dishonest and malafide intention to ride \non the goodwill of the petitioner. Hence, the same is liable to be \nrectified under Sec 57 (2) of the Act. \n2.9 \nVide email dated 27th July, 2016, Mr. Pramod Sureka informed the \npetitioner that Govind Prasad Bagaria was well aware of the rights \nand reputation of the petitioner and its trademark DORCO and its \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:14.03.2023 15:05:52\nSignature Not Verified\n\n--- PAGE 4 ---\n2023/DHC/001821 \n \nC.O. (COMM.IPD-TM) 50/2022                                              \n \n \n  Page 4 of 7 \n \nformative marks. However, he demanded Rs. 15,00,000/- to assign the \nimpugned trademark back to the petitioner. \n2.10 The partners of respondent no.1 have also applied for registration of \nthe trademarks of other international brands such as “Anfanna” and \n“Tarzan Boy”. Hence, the partners of respondent no.1 are habitual \ntrademark squatters and serial infringers. \n2.11 Accordingly, the present petition has been filed by the petitioner.  \nProceedings in the suit \n3. \nNotice in the present petition was issued by the Intellectual Property \nAppellate Board (IPAB) on 18th January, 2018. However, the respondent \nno.1 failed to appear before IPAB despite service. Thereafter, the present \nrectification got transferred to this Court after coming into effect of \nTribunals Reforms Act, 2022 and the Court notice was issued to the \nrespondent no.1 by this Court on 25th January, 2022. It is noted in the order \ndated 6th October, 2022 that the respondent no.1 refused to accept notice and \nthat the same amounted to service.  \n4. \nSubsequently, an application for substituted service was filed by the \npetitioner and the same was allowed and the respondent no.1 was directed to \nbe served by way of publication. The affidavit of service has been filed on \nbehalf of the petitioner and the same is taken on record. Therefore, the \nrespondent no.1 is deemed to have been served. None has appeared on \nbehalf of the respondent no.1, nor any reply/counter-statement has been filed \non behalf of the respondent no.1. It is indicative of the fact that the \nrespondent no.1 has nothing substantial to put forth on merits, by way of a \nresponse to the averments made in the petition.  \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:14.03.2023 15:05:52\nSignature Not Verified\n\n--- PAGE 5 ---\n2023/DHC/001821 \n \nC.O. (COMM.IPD-TM) 50/2022                                              \n \n \n  Page 5 of 7 \n \nAnalysis and Findings \n5. \n I have heard the counsels for the parties and perused the record of the \ncase.  \n6. \n In order to determine whether the trademark of the respondent no.1 is \nidentical to the trademark of the petitioner, it would be apposite to refer to \nthe two competing trademarks, as set out below:  \nPetitoner‟s Trademarks \nDefendant‟s Trademarks \n \n \n7. \nThe impugned trademark was applied for registration by the \nrespondent no.1 claiming user since 1st April, 2001. However, upto a date of \nthree months before filing the present rectification petition, a period of five \nyears have elapsed from the date of registration of the impugned trademark, \nduring which there has been no bonafide use of the impugned trademark in \nrelation to the goods for which the registration was granted.  \n8. \nIn the judgment in Shell Transource Limited v. Shell International \nPetroleum Company Ltd.¸ 2012 SCC IPAB 29, it was observed by the \nIPAB that the onus of proving “non-user” is on the person who pleads the \nsame. However, when the applicant pleads “non-user”, the respondent must \nspecifically deny it. Therefore, in the absence of a specific denial, it was \nheld that the allegations of “non-user” stood admitted.  \n9. \nIn the present case, the allegations of “non-user” against the \nrespondent no.1 stand admitted in the absence of a specific denial of the \nsame and the impugned trademark is liable to be removed from the Register \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:14.03.2023 15:05:52\nSignature Not Verified\n\n--- PAGE 6 ---\n2023/DHC/001821 \n \nC.O. (COMM.IPD-TM) 50/2022                                              \n \n \n  Page 6 of 7 \n \nof Trade Marks on account of “non-user” as contemplated under Section \n47(1)(b) of the Act.  \n10. \nFrom the facts detailed above, it is clear that the petitioner is the \nproprietor of the impugned trademark. The respondent no.1 cannot claim to \nbe the proprietor of the impugned trademark as there is nothing to show as \nto how the impugned trademark has been adopted by the respondent no.1. \nTherefore, the application for registration of the impugned trademark is in \ncontravention of Section 18(1) of the Act. In fact, the registration of the \npetitioner‟s identical mark in respect of similar goods, was pending in India \nand was also cited as a conflicting mark in the examination report issued in \nthe application for registration of the impugned trade mark. Therefore, as per \nSections 9(1)(a) and 11(1)(a) of the Act, the registration of the impugned \ntrademark could not be granted. \n11. \nThe registration of the impugned trademark is also in contravention of \nSection 11(3)(b) of the Act, as its use would be prevented in India by virtue \nof the law of copyright, as the petitioner is the original owner of copyright in \nthe impugned trademark, which is also registered as a trademark in its \nfavour in Korea since 2002 and thereafter, in Turkey, China and Ukraine. \n12. \nThe grant of registration of the impugned trademark by the respondent \nno.2 is against the principles of Section 11(3)(a) of the Act, as there is no \ndispute that the petitioner is the prior user of the impugned trademark since \n1994 in India and across the world since 1964. Due to such a long, \ncontinuous and extensive use, the impugned trademark is solely associated \nwith the petitioner. Therefore, the registration of the impugned trademark \nshould have been refused by the respondent no.2. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:14.03.2023 15:05:52\nSignature Not Verified\n\n--- PAGE 7 ---\n2023/DHC/001821 \n \nC.O. (COMM.IPD-TM) 50/2022                                              \n \n \n  Page 7 of 7 \n \n13. \nIn view of the discussion above, it is clear that the impugned \ntrademark has been adopted by the respondent no.1 dishonestly to trade \nupon the established goodwill and reputation of the petitioner and to project \nitself to be associated with the petitioner. The nature of the impugned \ntrademark is such that it will deceive the public and create confusion as \nregards the source of the goods manufactured and sold under the impugned \ntrademark.  \n14. \nAccordingly, the present petition is allowed and the impugned \ntrademark registered under trademark application no.1252224 in the name of \nthe respondent no.1 in Class 8 is removed from the Register of Trade Marks.  \n15. \n A copy of the order be sent to the respondents through e-mail. The \nRegistry is directed to supply a copy of the present order to the Trademark \nRegistry, at e-mail - llc-ipo@gov.in for compliance.  \n \n \nAMIT BANSAL, J. \nMARCH 10, 2023 \nat \n \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:14.03.2023 15:05:52\nSignature Not Verified\n"
  },
  "total_pages": 7,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "According to the PDF document \"Dorco vs Durga.pdf\", a legal proceeding was held in the High Court of Delhi at New Delhi, with case number C.O. (COMM.IPD-TM) 50/2022 and 2023/DHC/001821. The petitioner, Dorco Co. Ltd., sought to cancel the trademark \"DORCO\" registered by respondent Durga Enterprises. \n\nThe petitioner, represented by Ms. Priya Adlakha and others, claimed to have used the trademark \"DORCO\" since 1964 and obtained registration in India in 1994. They argued that their products, including razors and razor blades, are sold in 120 countries and are widely recognized.\n\nThe respondent, represented by Mr. Harish Vaidyanathan Shankar and others, held the registration number 1252224 for the trademark \"DORCO\" in respect of razors and razor blades in Class 8. \n\nThe court, presided by Hon'ble Mr. Justice Amit Bansal, heard the petition on March 10, 2023. The judgment, digitally signed on March 14, 2023, is based on the Trademarks Act, 1999, specifically Sections 47, 57, and 125. The case details the petitioner's history, their use of the trademark, and their registration in various classes. \n\nSource: Dorco vs Durga.pdf, Pages 1-2 of 7.",
      "pdf_source": "6. Dorco vs Durga.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "According to page 1 of the PDF \"6. Dorco vs Durga.pdf\", a trademark rectification petition (C.O. (COMM.IPD-TM) 50/2022) was filed by Dorco Co. Ltd. against Durga Enterprises and another respondent. The petition seeks cancellation of the trademark \"DORCO\" (registration number 1252224) registered in the name of Durga Enterprises for razors and razor blades in Class 8. The petition was filed under Sections 47, 57, and 125 of the Trademarks Act, 1999. The case was heard by Hon'ble Mr. Justice Amit Bansal, with the decision dated March 10, 2023. The petitioner was represented by Ms. Priya Adlakha and others, while the respondent was represented by Mr. Harish Vaidyanathan Shankar and others. (Source: 6. Dorco vs Durga.pdf, page 1 of 7)",
          "content": "2023/DHC/001821 \n \nC.O. (COMM.IPD-TM) 50/2022                                              \n \n \n  Page 1 of 7 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n \n% \n \n \n \n                 Date of decision: 10th March, 2023 \n \n+  \n \n \nC.O. (COMM.IPD-TM) 50/2022 \n \n \nDORCO CO. LTD. \n \n \n \n \n..... Petitioner \nThrough: \nMs. Priya Adlakha with Mrs. Bindra \nRana and Ms. Rima Majumdar, \nAdvocates. \n \n \n \n \n \nversus \n \n \nDURGA ENTERPRISES AND ANR  \n \n..... Respondents \n \n \n \n \nThrough: \nMr. \nHarish Vaidyanathan Shankar, CGSC \nwith Mr. Srish Kumar Mishra, Mr. \nSagar Mehlawat and  \nMr. Alexander Mathai Paikaday, \nAdvocates for R-1. \n \n \n \nCORAM: \n \nHON'BLE MR. JUSTICE AMIT BANSAL \n \n \n \n \n \nJUDGMENT \n \nAMIT BANSAL, J. (Oral) \n \n1. \nThe present rectification petition has been filed on behalf of the \npetitioner seeking cancellation/removal of the trademark DORCO/ \n  bearing registration number 1252224 and registered in the \nname of respondent no.1 in respect of razors and razor blades in Class 8 \nunder Sections 47, 57 and 125 of the Trademarks Act, 1999 (hereinafter \n„Act‟).  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:14.03.2023 15:05:52\nSignature Not Verified",
          "pdf_source": "6. Dorco vs Durga.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "According to page 2 of the PDF \"6. Dorco vs Durga.pdf\", the petitioner, Dorco Co. Ltd., is a manufacturer and exporter of grooming products, including razors and blades. They claim to be Asia's market leader and have used the trademark \"DORCO\" since 1964, with registration in India since 1994. The company partnered with the e-commerce platform \"Lets Shave\" in 2015 to sell products in India and has registered the domain name www.dorco.in since 2006. The case, C.O. (COMM.IPD-TM) 50/2022, was decided on March 10, 2023, in the High Court of Delhi. The petitioner is represented by advocates Ms. Priya Adlakha, Mrs. Bindra Rana, and Ms. Rima Majumdar. The respondent is Durga Enterprises, represented by Mr. Harish. (Source: 6. Dorco vs Durga.pdf, page 2)",
          "content": "2023/DHC/001821 \n \nC.O. (COMM.IPD-TM) 50/2022                                              \n \n \n  Page 2 of 7 \n \n \nCase set up by the petitioner \n2. \nThe case set up by the petitioner in the petition is as follows:  \n2.1 \nThe petitioner, Dorco Co. Ltd., is engaged in the business of \nmanufacturing and exporting grooming products such as shaving \nrazors, blades, kitchen knives and stationery cutters since 1955. The \npetitioner is Asia's market leader in respect of razors, razor blades, \nkitchen knives and stationery cutters etc. The petitioner is widely \nrecognized around the world for introducing the world‟s first 7-blade \nshaving system. The products of the petitioner are sold in 120 \ncountries around the world.  \n2.2 \nThe petitioner derived the trademark DORCO from the name of its \ncompany, Dorco Co. Ltd., and has used the said trademark in different \nparts of the world since 1964 and in India since 1994. The petitioner \nis the registered proprietor of the trademark DORCO in India in \nvarious classes, since 1994 and obtained the first registration of the \naforesaid trademark on 30th November, 1994 in India. Details of the \nregistration of the trademarks of the petitioner are given on page 3 of \nthe petition.  \n2.3 \nIn 2015, the petitioner partnered with e-commerce platform „Lets \nShave‟ to sell its products in India through www.letsshave.com. Since \nthen, its products are available for sale on several e-commerce \nplatforms in India such as, Amazon, Flipkart, Snapdeal, eBay etc. \n2.4 \nThe petitioner has also registered domain name www.dorco.in on 13th \nDecember, 2006, which comprises the petitioner‟s trademark \nDORCO.  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:14.03.2023 15:05:52\nSignature Not Verified",
          "pdf_source": "6. Dorco vs Durga.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0005",
      "start_index": 3,
      "end_index": 3,
      "summary": "According to the provided PDF document, \"Dorco vs Durga.pdf,\" a legal proceeding is underway in the High Court of Delhi at New Delhi (Case No. 2023/DHC/001821, C.O. (COMM.IPD-TM) 50/2022). The petitioner, Dorco Co. Ltd., is represented by advocates Ms. Priya Adlakha, Mrs. Bindra Rana, and Ms. Rima Majumdar. The respondents are Durga Enterprises and another party, represented by Mr. Harish.\n\nThe background and facts of the case reveal that the petitioner, Dorco, has a strong presence in India and globally, with features in trade magazines and newspapers, as well as social media platforms. The respondent, Durga Enterprises, is a partnership firm that registered the trademark \"DORCO\" in India for razors and razor blades in class 8, with registration no. 1252224. However, the respondent has not used the trademark for a continuous period of five years from the date of registration, making it liable for removal due to non-use under Section 47(1)(b) of the Act.\n\nThe petitioner argues that the registration of the impugned trademark was obtained with dishonest and malafide intention to ride on the goodwill of Dorco, in collusion with the petitioner's distributor in Nepal, Mr. Pramod Sureka. The petitioner seeks rectification under Section 57(2) of the Act. The case was decided on March 10, 2023, as per the provided PDF document.",
      "pdf_source": "6. Dorco vs Durga.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "According to page 3 of the PDF \"6. Dorco vs Durga.pdf\", the petitioner, Dorco Co. Ltd., has a strong presence on social media and has been featured in trade magazines and newspapers in India. The respondent, Durga Enterprises, registered the trademark \"DORCO\" in 2003 for razors and razor blades in India, but has not used it for five years. The petitioner claims the registration was obtained with malafide intention to ride on their goodwill. The respondent's distributor in Nepal, Mr. Pramod Sureka, informed the petitioner that Govind Prasad Bagaria was aware of the petitioner's rights and reputation. The case is being heard in the High Court of Delhi, with the petitioner seeking rectification under Section 57(2) of the Act due to non-use and malafide intention. The case number is C.O. (COMM.IPD-TM) 50/2022.",
          "content": "2023/DHC/001821 \n \nC.O. (COMM.IPD-TM) 50/2022                                              \n \n \n  Page 3 of 7 \n \n2.5 \nThe petitioner has also been featured in popular trade magazines and \nnewspapers with circulation in India. The petitioner has a strong \npresence on social networking sites such as Twitter, Instagram and \nFacebook. \n2.6 \nThe respondent no.1 is the partnership firm of one Mr Govind Prasad \nBagaria and Ms. Rakhi Sureka.  The respondent no.1 got the \ntrademark \nDORCO/ \n \n(hereinafter \n„impugned \ntrademark‟) registered vide registration no.1252224 in respect of \nrazors and razor blades in class 8 in India. The application for \nregistration of the impugned trademark was filed on 28th November, \n2003 claiming use since 1st April, 2001.  \n2.7 \nThe respondent no.1 has not used the registered trademark upto three \nmonths before the date of the present rectification petition, for a \ncontinuous period of five years from the date of registration, in \nrelation to the goods for which the registration was granted. \nTherefore, it is liable to be removed for „non-use‟ in terms of Section \n47(1)(b) of the Act. \n2.8 \nThe registration of the impugned trademark is obtained by the \nrespondent no.1 in collusion with the petitioner‟s distributor in Nepal, \nMr. Pramod Sureka, with the dishonest and malafide intention to ride \non the goodwill of the petitioner. Hence, the same is liable to be \nrectified under Sec 57 (2) of the Act. \n2.9 \nVide email dated 27th July, 2016, Mr. Pramod Sureka informed the \npetitioner that Govind Prasad Bagaria was well aware of the rights \nand reputation of the petitioner and its trademark DORCO and its \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:14.03.2023 15:05:52\nSignature Not Verified",
          "pdf_source": "6. Dorco vs Durga.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0009",
      "start_index": 4,
      "end_index": 6,
      "summary": "According to the PDF document \"6. Dorco vs Durga.pdf\", the legal proceedings in the case of Dorco Co. Ltd. vs Durga Enterprises and Anr (2023/DHC/001821) involve a trademark dispute. The petitioner, Dorco Co. Ltd., filed a petition against the respondent, Durga Enterprises, for trademark infringement and non-use. The respondent had applied for registration of the impugned trademark, but the petitioner claimed that it was not being used bona fide.\n\nThe proceedings began with a notice issued by the Intellectual Property Appellate Board (IPAB) on January 18, 2018, which was later transferred to the High Court of Delhi after the Tribunals Reforms Act, 2022, came into effect. The respondent failed to appear despite service, and the court deemed them served after an application for substituted service was allowed.\n\nThe petitioner argued that the respondent was a habitual trademark squatter and serial infringer, having applied for registration of other international brands. The respondent demanded Rs. 15,00,000 to assign the impugned trademark back to the petitioner. The court analyzed the competing trademarks and found that the respondent had not used the impugned trademark for five years, making it liable for removal from the Register of Trade Marks under Section 47(1)(b) of the Act.\n\nThe court's decision, dated March 10, 2023, was based on the absence of a specific denial by the respondent of the allegations of non-use, which stood admitted. The petitioner was deemed the proprietor of the impugned trademark, and the respondent's claim was rejected. (Source: \"6. Dorco vs Durga.pdf\", pages 1-7)",
      "pdf_source": "6. Dorco vs Durga.pdf",
      "nodes": [
        {
          "title": "Page 4",
          "node_id": "0006",
          "start_index": 4,
          "end_index": 4,
          "summary": "According to page 4 of the PDF \"6. Dorco vs Durga.pdf\", the respondent, Durga Enterprises, demanded Rs. 15,00,000 to assign the impugned trademark back to the petitioner, Dorco Co. Ltd. The partners of Durga Enterprises are alleged to be habitual trademark squatters and serial infringers, having applied for registration of other international brands. The petition was filed, and notice was issued by the Intellectual Property Appellate Board (IPAB) on January 18, 2018. The respondent failed to appear, and the case was transferred to the High Court of Delhi after the Tribunals Reforms Act, 2022 came into effect. The court issued notice on January 25, 2022, which the respondent refused to accept, deemed as service. No response or reply was filed by the respondent, indicating a lack of substantial defense. (Source: 6. Dorco vs Durga.pdf, 2023/DHC/001821, C.O. (COMM.IPD-TM) 50/2022)",
          "content": "2023/DHC/001821 \n \nC.O. (COMM.IPD-TM) 50/2022                                              \n \n \n  Page 4 of 7 \n \nformative marks. However, he demanded Rs. 15,00,000/- to assign the \nimpugned trademark back to the petitioner. \n2.10 The partners of respondent no.1 have also applied for registration of \nthe trademarks of other international brands such as “Anfanna” and \n“Tarzan Boy”. Hence, the partners of respondent no.1 are habitual \ntrademark squatters and serial infringers. \n2.11 Accordingly, the present petition has been filed by the petitioner.  \nProceedings in the suit \n3. \nNotice in the present petition was issued by the Intellectual Property \nAppellate Board (IPAB) on 18th January, 2018. However, the respondent \nno.1 failed to appear before IPAB despite service. Thereafter, the present \nrectification got transferred to this Court after coming into effect of \nTribunals Reforms Act, 2022 and the Court notice was issued to the \nrespondent no.1 by this Court on 25th January, 2022. It is noted in the order \ndated 6th October, 2022 that the respondent no.1 refused to accept notice and \nthat the same amounted to service.  \n4. \nSubsequently, an application for substituted service was filed by the \npetitioner and the same was allowed and the respondent no.1 was directed to \nbe served by way of publication. The affidavit of service has been filed on \nbehalf of the petitioner and the same is taken on record. Therefore, the \nrespondent no.1 is deemed to have been served. None has appeared on \nbehalf of the respondent no.1, nor any reply/counter-statement has been filed \non behalf of the respondent no.1. It is indicative of the fact that the \nrespondent no.1 has nothing substantial to put forth on merits, by way of a \nresponse to the averments made in the petition.  \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:14.03.2023 15:05:52\nSignature Not Verified",
          "pdf_source": "6. Dorco vs Durga.pdf",
          "nodes": []
        },
        {
          "title": "Page 5",
          "node_id": "0007",
          "start_index": 5,
          "end_index": 5,
          "summary": "According to page 5 of the PDF \"6. Dorco vs Durga.pdf\", the High Court of Delhi analyzed the trademark case between Dorco Co. Ltd. and Durga Enterprises. The respondent's trademark was applied for registration in 2001, but there was no bonafide use of the trademark for five years after registration. The court cited the judgment in Shell Transource Limited v. Shell International Petroleum Company Ltd. (2012), which states that the onus of proving \"non-user\" is on the person who pleads it. Since the respondent did not specifically deny the allegations of \"non-user\", the allegations stand admitted, and the impugned trademark is liable to be removed from the Register. The decision was made on March 10, 2023, in the case C.O. (COMM.IPD-TM) 50/2022. (Source: 6. Dorco vs Durga.pdf, page 5)",
          "content": "2023/DHC/001821 \n \nC.O. (COMM.IPD-TM) 50/2022                                              \n \n \n  Page 5 of 7 \n \nAnalysis and Findings \n5. \n I have heard the counsels for the parties and perused the record of the \ncase.  \n6. \n In order to determine whether the trademark of the respondent no.1 is \nidentical to the trademark of the petitioner, it would be apposite to refer to \nthe two competing trademarks, as set out below:  \nPetitoner‟s Trademarks \nDefendant‟s Trademarks \n \n \n7. \nThe impugned trademark was applied for registration by the \nrespondent no.1 claiming user since 1st April, 2001. However, upto a date of \nthree months before filing the present rectification petition, a period of five \nyears have elapsed from the date of registration of the impugned trademark, \nduring which there has been no bonafide use of the impugned trademark in \nrelation to the goods for which the registration was granted.  \n8. \nIn the judgment in Shell Transource Limited v. Shell International \nPetroleum Company Ltd.¸ 2012 SCC IPAB 29, it was observed by the \nIPAB that the onus of proving “non-user” is on the person who pleads the \nsame. However, when the applicant pleads “non-user”, the respondent must \nspecifically deny it. Therefore, in the absence of a specific denial, it was \nheld that the allegations of “non-user” stood admitted.  \n9. \nIn the present case, the allegations of “non-user” against the \nrespondent no.1 stand admitted in the absence of a specific denial of the \nsame and the impugned trademark is liable to be removed from the Register \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:14.03.2023 15:05:52\nSignature Not Verified",
          "pdf_source": "6. Dorco vs Durga.pdf",
          "nodes": []
        },
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "According to page 6 of the PDF \"6. Dorco vs Durga.pdf\", the petitioner, Dorco Co. Ltd., is the proprietor of the impugned trademark. The respondent, Durga Enterprises, cannot claim ownership as there is no evidence of adoption. The registration of the impugned trademark is in contravention of Sections 18(1), 9(1)(a), and 11(1)(a) of the Act. The petitioner has been using the trademark since 1994 in India and globally since 1964, making it solely associated with them. The registration of the impugned trademark by the respondent no.2 (likely a registrar) is against the principles of Section 11(3)(a) of the Act. The case, C.O. (COMM.IPD-TM) 50/2022, was decided on March 10, 2023. The petitioner is represented by Ms. Priya Adlakha, Mrs. Bindra Rana, and Ms. Rima Majumdar, while the respondent is represented by Mr. Harish. (Source: 6. Dorco vs Durga.pdf, page 6)",
          "content": "2023/DHC/001821 \n \nC.O. (COMM.IPD-TM) 50/2022                                              \n \n \n  Page 6 of 7 \n \nof Trade Marks on account of “non-user” as contemplated under Section \n47(1)(b) of the Act.  \n10. \nFrom the facts detailed above, it is clear that the petitioner is the \nproprietor of the impugned trademark. The respondent no.1 cannot claim to \nbe the proprietor of the impugned trademark as there is nothing to show as \nto how the impugned trademark has been adopted by the respondent no.1. \nTherefore, the application for registration of the impugned trademark is in \ncontravention of Section 18(1) of the Act. In fact, the registration of the \npetitioner‟s identical mark in respect of similar goods, was pending in India \nand was also cited as a conflicting mark in the examination report issued in \nthe application for registration of the impugned trade mark. Therefore, as per \nSections 9(1)(a) and 11(1)(a) of the Act, the registration of the impugned \ntrademark could not be granted. \n11. \nThe registration of the impugned trademark is also in contravention of \nSection 11(3)(b) of the Act, as its use would be prevented in India by virtue \nof the law of copyright, as the petitioner is the original owner of copyright in \nthe impugned trademark, which is also registered as a trademark in its \nfavour in Korea since 2002 and thereafter, in Turkey, China and Ukraine. \n12. \nThe grant of registration of the impugned trademark by the respondent \nno.2 is against the principles of Section 11(3)(a) of the Act, as there is no \ndispute that the petitioner is the prior user of the impugned trademark since \n1994 in India and across the world since 1964. Due to such a long, \ncontinuous and extensive use, the impugned trademark is solely associated \nwith the petitioner. Therefore, the registration of the impugned trademark \nshould have been refused by the respondent no.2. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:14.03.2023 15:05:52\nSignature Not Verified",
          "pdf_source": "6. Dorco vs Durga.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0011",
      "start_index": 7,
      "end_index": 7,
      "summary": "According to the PDF document \"Dorco vs Durga.pdf\", the High Court of Delhi at New Delhi made a decision on March 10, 2023, in the case of Dorco Co. Ltd. vs Durga Enterprises and Anr (2023/DHC/001821, C.O. (COMM.IPD-TM) 50/2022). The petitioner, Dorco Co. Ltd., was represented by Ms. Priya Adlakha, Mrs. Bindra Rana, and Ms. Rima Majumdar, while the respondent, Durga Enterprises, was represented by Mr. Harish.\n\nThe court decision stated that the respondent had adopted the impugned trademark dishonestly to trade on the established goodwill and reputation of the petitioner, and to create confusion among the public regarding the source of goods manufactured and sold under the impugned trademark. The court found that the nature of the impugned trademark was such that it would deceive the public and create confusion.\n\nAs a result, the court allowed the petition and ordered the removal of the impugned trademark, registered under trademark application no. 1252224 in the name of the respondent in Class 8, from the Register of Trade Marks. A copy of the order was directed to be sent to the respondents via email, and the Registry was instructed to supply a copy of the order to the Trademark Registry for compliance. The decision was made by Amit Bansal, J., on March 10, 2023, as stated in the PDF source.",
      "pdf_source": "6. Dorco vs Durga.pdf",
      "nodes": [
        {
          "title": "Page 7",
          "node_id": "0010",
          "start_index": 7,
          "end_index": 7,
          "summary": "According to page 7 of the PDF \"6. Dorco vs Durga.pdf\", the High Court of Delhi ruled in favor of the petitioner, Dorco Co. Ltd., in a trademark dispute against Durga Enterprises and another respondent. The court found that the respondent's trademark was adopted dishonestly to trade on Dorco's goodwill and reputation, and would deceive the public and create confusion. As a result, the court allowed the petition and removed the impugned trademark (application no. 1252224) from the Register of Trade Marks. The order was signed by Judge Amit Bansal on March 10, 2023. A copy of the order was directed to be sent to the respondents and the Trademark Registry for compliance. (Source: 6. Dorco vs Durga.pdf, page 7)",
          "content": "2023/DHC/001821 \n \nC.O. (COMM.IPD-TM) 50/2022                                              \n \n \n  Page 7 of 7 \n \n13. \nIn view of the discussion above, it is clear that the impugned \ntrademark has been adopted by the respondent no.1 dishonestly to trade \nupon the established goodwill and reputation of the petitioner and to project \nitself to be associated with the petitioner. The nature of the impugned \ntrademark is such that it will deceive the public and create confusion as \nregards the source of the goods manufactured and sold under the impugned \ntrademark.  \n14. \nAccordingly, the present petition is allowed and the impugned \ntrademark registered under trademark application no.1252224 in the name of \nthe respondent no.1 in Class 8 is removed from the Register of Trade Marks.  \n15. \n A copy of the order be sent to the respondents through e-mail. The \nRegistry is directed to supply a copy of the present order to the Trademark \nRegistry, at e-mail - llc-ipo@gov.in for compliance.  \n \n \nAMIT BANSAL, J. \nMARCH 10, 2023 \nat \n \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:14.03.2023 15:05:52\nSignature Not Verified",
          "pdf_source": "6. Dorco vs Durga.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-15T18:42:21.277369",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}