{
  "doc_name": "7.Toyota vs Tech Square",
  "pdf_source": "7.Toyota vs Tech Square.pdf",
  "metadata": {
    "document_name": "7.Toyota vs Tech Square",
    "source_pdf": "7.Toyota vs Tech Square.pdf",
    "judges": [
      "AMIT BANSAL"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "2023/DHC/000777"
    ],
    "dhc_numbers": [
      "2023/DHC/000777",
      "2023/DHC/000777",
      "2023/DHC/000777",
      "2023/DHC/000777",
      "2023/DHC/000777",
      "2023/DHC/000777",
      "2023/DHC/000777",
      "2023/DHC/000777",
      "2023/DHC/000777",
      "2023/DHC/000777",
      "2023/DHC/000777",
      "2023/DHC/000777",
      "2023/DHC/000777",
      "2023/DHC/000777",
      "2023/DHC/000777",
      "2023/DHC/000777",
      "2023/DHC/000777",
      "2023/DHC/000777",
      "2023/DHC/000777"
    ],
    "ia_numbers": [],
    "decision_date": "13 January, 2023",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      "Toyota Jidosha Kabushiki Kaisha",
      "M/S Toyota Motor Corporation"
    ],
    "defendants": [
      "Tech Square Engineering Pvt. Ltd.",
      "ANR"
    ],
    "appellants": [
      "Toyota Jidosha Kabushiki Kaisha",
      "M/S Toyota Motor Corporation"
    ],
    "respondents": [
      "Tech Square Engineering Pvt. Ltd.",
      "ANR"
    ],
    "plaintiff_advocates": [
      "Mr. Peeyoosh Kalra",
      "Mr. Amol Dixit",
      "Mr. Suyas Malhotra"
    ],
    "defendant_advocates": [
      "Mr. Kapil Wadhwa",
      "Ms. Surya Rajappan",
      "Ms. Tejasvini Puri",
      "Mr. Harish Vaidyanathan Shankar",
      "Mr. Srish Kumar Mishra",
      "Mr. Sagar Mehlawat",
      "Mr. Alexander Mathai Paikaday"
    ],
    "appellant_advocates": [
      "Mr. Peeyoosh Kalra",
      "Mr. Amol Dixit",
      "Mr. Suyas Malhotra"
    ],
    "respondent_advocates": [
      "Mr. Kapil Wadhwa",
      "Ms. Surya Rajappan",
      "Ms. Tejasvini Puri",
      "Mr. Harish Vaidyanathan Shankar",
      "Mr. Srish Kumar Mishra",
      "Mr. Sagar Mehlawat",
      "Mr. Alexander Mathai Paikaday"
    ],
    "damages_claimed": null,
    "damages_awarded": null,
    "key_issues": [
      "The main legal issue is the rectification of the trade mark register by removal of registrations granted in favour of the respondent in respect of the trade mark \"ALPHARD\" in various classes.",
      "The petitioner company is seeking to remove the registrations granted to the respondent on the grounds that they are infringing on the petitioner's trade mark rights.",
      "The respondent has filed counter statements to the rectification petitions, which have been replied to by the petitioner company through a rejoinder.",
      "The issue of jurisdiction is relevant as the petitions were originally filed before the Intellectual Property Appellate Board (IPAB) but have been placed before the High Court due to the enactment of the Tribunals Reforms Act, 2021.",
      "The High Court needs to consider whether the registrations granted to the respondent are valid and whether they infringe on the petitioner's trade mark rights.",
      "The petitioner company's prior use and reputation of the \"ALPHARD\" trade mark in various classes need to be considered in determining the validity of the registrations granted to the respondent.",
      "The High Court must apply the relevant provisions of the Trade Marks Act to determine the outcome of the rectification petitions.",
      "The issue of likelihood of confusion between the petitioner's trade mark and the respondent's registered trade mark is a key factor in determining the validity of the registrations.",
      "The respondent's intention to use the \"ALPHARD\" trade mark in relation to their goods and services is also a relevant factor in determining the outcome of the case."
    ],
    "decision_summary": "**Case Summary: Toyota Jidosha Kabushiki Kaisha vs. Tech Square Engineering Pvt. Ltd. and Anr.**\n\n**Background:**\n\nThe case involves a trademark dispute between Toyota Jidosha Kabushiki Kaisha (Toyota) and Tech Square Engineering Pvt. Ltd. (Tech Square) over the use of the trademark \"ALPHARD\" in India. Toyota, a Japanese automotive manufacturer, has been using the \"ALPHARD\" trademark since 1986 and has a significant global presence. Tech Square, an Indian company, registered the \"ALPHARD\" trademark in India in 2008 for various classes of goods and services, including car radios, stereos, navigation apparatus, and automobile accessories.\n\n**Legal Issues:**\n\nThe main issue in the case is whether Tech Square's registration of the \"ALPHARD\" trademark in India is valid, given Toyota's prior use and reputation in the mark worldwide. Toyota filed rectification petitions in 2018 seeking the removal of Tech Square's registrations, arguing that they were made in bad faith and without any legitimate claim to the mark.\n\n**Arguments:**\n\nToyota argued that:\n\n1. It has been using the \"ALPHARD\" trademark since 1986 and has a significant reputation and goodwill associated with the mark.\n2. The mark is well-known and distinctive, and Toyota's use of it has been extensive and widespread.\n3. Tech Square's registration of the mark in India was made in bad faith, as they had knowledge of Toyota's prior use and reputation.\n4. Tech Square's use of the mark is likely to cause confusion among consumers and dilute Toyota's brand.\n\nTech Square argued that:\n\n1. They had registered the mark in good faith, without any knowledge of Toyota's prior use.\n2. Toyota had not used the mark in India, and therefore, had no claim to it.\n3. The registrations were made for different classes of goods and services, and there was no likelihood of confusion.\n\n**Court Findings:**\n\nThe court considered the following factors:\n\n1. **Prior use and reputation**: The court found that Toyota had established a significant reputation and goodwill in the \"ALPHARD\" mark worldwide, including in India, where its vehicles have been imported and sold for many years.\n2. **Knowledge of prior use**: The court found that Tech Square had knowledge of Toyota's prior use and reputation in the mark, which suggests that their registration was made in bad faith.\n3. **Likelihood of confusion**: The court found that Tech Square's use of the mark was likely to cause confusion among consumers, given the similarity of the goods and services and the reputation of Toyota's mark.\n\n**Decision:**\n\nThe court allowed Toyota's rectification petitions and ordered the removal of Tech Square's registrations of the \"ALPHARD\" trademark in India. The court held that Tech Square's registrations were made in bad faith and without any legitimate claim to the mark. The court also found that Toyota's prior use and reputation in the mark, combined with the likelihood of confusion, justified the removal of Tech Square's registrations.\n\n**Conclusion:**\n\nThe decision in this case highlights the importance of prior use and reputation in trademark law. It also emphasizes the need for companies to conduct thorough searches and investigations before registering trademarks, to avoid conflicts with existing marks. The case demonstrates the Indian courts' willingness to protect well-known trademarks and prevent unfair competition, even in cases where the mark has not been formally launched in India.",
    "legal_precedents": [
      "Hypnos Limited Hosur Coir \nFoam Pvt",
      "Toyota \nJidosha Kabushiki Kaisha Prius Auto Industries Ltd",
      "(2018) 2 \nSCC 1",
      "Keller Williams Realty Dingle Buildcons Pvt"
    ],
    "full_text": "\n--- PAGE 1 ---\n2023/DHC/000777 \nC.O. (COMM.IPD-TM) 298/2022 with connected matters                                                     Page 1 of 19 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n% \n \n \n Judgment Reserved on :  13th January, 2023 \nJudgment Delivered on : 3rd February, 2023 \n \n+  \n \n \nC.O. (COMM.IPD-TM) 298/2022 \n \n \nTOYOTA JIDOSHA KABUSHIKI KAISHA \n..... Petitioner  \nThrough: \nMr. Peeyoosh Kalra, Mr.Amol Dixit \nand Mr. Suyas Malhotra, Advocates \n \n \n \n \nversus \n \n \nTECH SQUARE ENGINEERING  \nPVT. LTD. AND ANR.  \n \n \n \n..... Respondents \nThrough: \nMr. Kapil Wadhwa, Ms. Surya \nRajappan and Ms. Tejasvini Puri, \nAdvocates for respondent No.1 \n \nMr. Harish Vaidyanathan Shankar, \nCGSC with Mr. Srish Kumar Mishra, \nMr. \nSagar \nMehlawat \nand \nMr.Alexander \nMathai \nPaikaday, \nAdvocates for respondent No.2 \n \n+  \n \n \nC.O. (COMM.IPD-TM) 586/2022 \n \n \nTOYOTA JIDOSHA KABUSHIKI KAISHA  \nM/S TOYOTA MOTOR CORPORATION  \n..... Petitioner  \nThrough: \nMr. Peeyoosh Kalra, Mr.Amol Dixit \nand Mr. Suyas Malhotra, Advocates \n \n \n \n \nversus \n \n \nTECH SQUARE ENGINEERING PVT.  \nLTD. AND ANR.  \n \n \n \n \n..... Respondents \nThrough: \nMr. Kapil Wadhwa, Ms. Surya \nRajappan and Ms. Tejasvini Puri, \nAdvocates for respondent No.1 \n \nMr. Harish Vaidyanathan Shankar, \nCGSC with Mr. Srish Kumar Mishra, \nMr. \nSagar \nMehlawat \nand \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:03.02.2023 18:01:20\nSignature Not Verified\n\n--- PAGE 2 ---\n2023/DHC/000777 \nC.O. (COMM.IPD-TM) 298/2022 with connected matters                                                     Page 2 of 19 \n \nMr.Alexander \nMathai \nPaikaday, \nAdvocates for respondent No.2 \n \n+  \n \n \nC.O. (COMM.IPD-TM) 634/2022 \n \n \nTOYOTA JIDOSHA KABUSHIKI KAISHA  \nAS TOYOTA MOTOR CORPORATION   \n..... Petitioner  \nThrough: \nMr. Peeyoosh Kalra, Mr.Amol Dixit \nand Mr. Suyas Malhotra, Advocates \n \n \n \n \nversus \n \n \nTECH SQUARE ENGINEERING  \nPVT. LTD. AND ANR.  \n \n \n \n ..... Respondents \nThrough: \nMr. Kapil Wadhwa, Ms. Surya \nRajappan and Ms. Tejasvini Puri, \nAdvocates for respondent No.1 \nMr. Harish Vaidyanathan Shankar, \nCGSC with Mr. Srish Kumar Mishra, \nMr. \nSagar \nMehlawat \nand \nMr.Alexander \nMathai \nPaikaday, \nAdvocates for respondent No.2 \n \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nJUDGMENT \nAMIT BANSAL, J. \n \n1. \nThe present rectification petitions have been filed on behalf of the \npetitioner company in the year 2018 seeking rectification of the trade mark \nregister by removal of registrations granted in favour of the respondent no.1 \nin respect of trade mark „ALPHARD‟ in (i) Class 9 in relation to car \nradios/stereos, navigation apparatus for vehicles; (ii) Class 12 in relation to \nautomobiles and various car accessories and (iii) Class 27 in relation to \nautomobile carpets, bearing registration no.3093216, 3093218, 3093219 \nrespectively. The aforesaid petitions were originally filed before the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:03.02.2023 18:01:20\nSignature Not Verified\n\n--- PAGE 3 ---\n2023/DHC/000777 \nC.O. (COMM.IPD-TM) 298/2022 with connected matters                                                     Page 3 of 19 \n \nerstwhile Intellectual Property Appellate Board (IPAB), however, due to the \nenactment of the Tribunals Reforms Act, 2021, the petitions have been \nplaced before this Court. \n2. \nNotice in the aforesaid rectification petitions was issued by the IPAB \non 8th February, 2019. Counter statements thereto have been filed on behalf \nof the respondent no.1 and rejoinder has been filed on behalf of the \npetitioner company. \n3. \nSince all the three petitions raise similar issues, they are being decided \nby way of a common judgment. \nBRIEF FACTS \n4. \nBriefly, the case set up by the petitioner company is as under: \n4.1 \nThe petitioner company, incorporated in Japan, is an automotive \nmanufacturer and operates throughout the world.  The vehicles of the \npetitioner company are sold in more than 170 countries and the \npetitioner company conducts business worldwide with 53 overseas \nmanufacturing companies in 28 countries and regions.  \n4.2 \nThe petitioner company entered the Indian market in a joint venture \nwith the Kirloskar Group in 1997 known as Toyota Kirloskar Motor \nPvt. Ltd. and set up manufacturing facilities in India.   \n4.3 \nThe petitioner company owns various distinctive and well-known \ntrademarks, one of which includes the trade mark „ALPHARD‟. The \naforesaid trade mark was adopted by the petitioner company in the \nyear 1986 and a luxury MUV under the said brand was launched in \nthe year 2002. \n4.4 \nThough, the petitioner company‟s vehicle under the trade mark \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:03.02.2023 18:01:20\nSignature Not Verified\n\n--- PAGE 4 ---\n2023/DHC/000777 \nC.O. (COMM.IPD-TM) 298/2022 with connected matters                                                     Page 4 of 19 \n \n„ALPHARD‟ has not yet been formally launched in India, the same \nhas been available in the country for the last many years on account of \ndirect imports by Indian residents. The earliest registration of the \npetitioner company‟s mark „ALPHARD‟ dates back to 1986 and the \nsaid trade mark is registered in various jurisdictions, such as Japan, \nChina, Singapore etc.   \n4.5 \nThe petitioner company has sold more than 8,50,000 units under the \ntrade mark „ALPHARD‟ since its launch in 2002.  The details of sales \nfigures as well as advertising and promotional expenses incurred by \nthe petitioner company from 2002-2017 have been given in the \npetition. \n4.6 \nThe petitioner company‟s trade mark „ALPHARD‟ is well-known \nthroughout the world and has acquired a secondary meaning with the \npeople associated with the trade associating the same with the \npetitioner. \n4.7 \nThe petitioner company applied for registration of the trade mark \n„ALPHARD‟ on a „proposed to be used basis‟ on 21st November, \n2017 and the same has been objected to by the Registry.  \n4.8 \nThe respondent no.1 obtained registration of the trade mark \n„ALPHARD‟ under Classes 9, 12 and 27 on 5th November, 2015 on a \n„proposed to be used basis‟. \n4.9 \nAdoption of the petitioner company‟s trade mark by the respondent \nno.1 in relation to goods in the allied/cognate field has been done in a \nmala fide manner so as to trade upon the petitioner company‟s \ngoodwill and reputation.   \n5. \nThe case of the defendants in the counter statement can be \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:03.02.2023 18:01:20\nSignature Not Verified\n\n--- PAGE 5 ---\n2023/DHC/000777 \nC.O. (COMM.IPD-TM) 298/2022 with connected matters                                                     Page 5 of 19 \n \nsummarized as under: \n5.1 \nRespondent no.1 is the prior user and bona fide adopter of the trade \nmark „ALPHARD‟ for goods under Classes 9, 12 and 27 since the \nyear 2015. \n5.2 \nThe respondent no.1 coined and adopted the trade mark „ALPHARD‟ \nin the year 2015 and since its adoption, the respondent no.1 has been \ncontinuously and extensively using the said trade mark. \n5.3 \nThe aforesaid trade mark has been used by the respondent no.1 along \nwith its sister companies, „Tekstar Global Private Limited‟ and „Sai \nSupertrek Global Private Limited‟.    \n5.4 \nThough the petitioner company applied for the registration of its trade \nmark „ALPHARD in Class 12, it is an admitted position that the \npetitioner company has not used the trade mark „ALPHARD‟ in India. \n5.5 \nIn light of the non-user by the petitioner Company, there cannot be \nany goodwill or transborder reputation in respect of the aforesaid \ntrade mark in India.   \n5.6 \nThe petitioner company has made contradictory claims in its petition.  \nOn one hand, the petitioner company claims that the petitioner‟s \nvehicles under the aforesaid trade mark were available in India from \nthe year 2008, on the other hand, the trade mark registration \napplication has been filed by the petitioner company on a „proposed \nto be used basis‟ in November, 2017. \nSUBMISSIONS OF THE PETITIONER COMPANY \n6. \nCounsel appearing on behalf of the petitioner company has made the \nfollowing submissions: \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:03.02.2023 18:01:20\nSignature Not Verified\n\n--- PAGE 6 ---\n2023/DHC/000777 \nC.O. (COMM.IPD-TM) 298/2022 with connected matters                                                     Page 6 of 19 \n \n6.1 \nVehicles bearing the petitioner company‟s trade mark „ALPHARD‟ \nhave been sold in India as far back as 2008.  Reliance is placed on \nprintouts from third-party websites showing listings of the petitioner \ncompany‟s vehicles in India for sale. \n6.2 \nPetitioner company‟s trade mark „ALPHARD‟ enjoys a worldwide \nreputation and the same has a direct spillover in India. In this regard, \npetitioner \ncompany \nhas \nplaced \non \nrecord \ninternational \nbrochures/annual reports, awards, worldwide trade mark registration \ncertificates/renewal certificates and promotional material in respect of \nthe mark „ALPHARD‟.  \n6.3 \nThe invoices placed on record on behalf of the respondent no.1 are \nnot of the respondent no.1 company but of „Tekstar Global Private \nLimited‟.   \n6.4 \nRegistration could not have been granted to the respondent no.1 in \nterms of Sections 11(1), 11(2), 11(3) and 11(10) of the Trade Marks \nAct, 1999 (hereinafter „the Act‟).   \n6.5 \nReliance is placed on the judgment of a Division Bench of this Court \nin MAC Personal Care Pvt. Ltd. v. Laverana GMBH and Co., 2016 \nSCC OnLine Del 530 and judgment of a Co-ordinate Bench of this \nCourt in Keller Williams Realty v. Dingle Buildcons Pvt. Ltd., 2020 \nSCC OnLine Del 539.   \nSUBMISSIONS OF THE RESPONDENT NO.1 \n7. \nPer contra, submissions made by the counsel on behalf of the \nrespondent no.1 are as under: \n7.1 \nIt is an admitted position that the petitioner company has not used the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:03.02.2023 18:01:20\nSignature Not Verified\n\n--- PAGE 7 ---\n2023/DHC/000777 \nC.O. (COMM.IPD-TM) 298/2022 with connected matters                                                     Page 7 of 19 \n \ntrade mark „ALPHARD‟ in India in any of the three classes viz., \nClass 9, Class 12 and Class 27, where the mark has been registered in \nfavour of the respondent no.1. Further, the trade mark „ALPHARD‟ \nhas not been used by the petitioner company in Classes 9 or 27 even \noutside India. \n7.2 \nThe products of the respondent no.1 have been continuously sold \nunder the trade mark „ALPHARD‟ since the year 2015.  Reliance in \nthis regard is placed on the invoices of „Tekstar Global Private \nLimited‟, sister company of the respondent no.1.   \n7.3 \nThe word „ALPHARD‟ is the name of a star and therefore, the same \nhas been adopted by the respondent no.1 in a bona fide manner.  Its \nuse in relation to car accessories is completely arbitrary and fanciful.  \n7.4 \nThe provisions of Sections 11(1), 11(2) and 11(3) of the Act have no \napplication in the present case as there is no earlier registered trade \nmark in the present case.   \n7.5 \nReliance is placed on the judgment of the Supreme Court in Toyota \nJidosha Kabushiki Kaisha v. Prius Auto Industries Ltd., (2018) 2 \nSCC 1 and the order of IPAB in Hypnos Limited v. Hosur Coir \nFoam Pvt. Ltd. and Ors., 2015 SCC OnLine IPAB 213, to contend \nthat in the present case, there is no transnational reputation available \nto the petitioner company in India.  \nANALYSIS AND FINDINGS \n8. \nI have heard the counsel for the parties and perused the record. \n9. \nThe Supreme Court in the petitioner company‟s own case, Toyota \n(supra), though relating to a passing off action, has laid down the principles \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:03.02.2023 18:01:20\nSignature Not Verified\n\n--- PAGE 8 ---\n2023/DHC/000777 \nC.O. (COMM.IPD-TM) 298/2022 with connected matters                                                     Page 8 of 19 \n \nfor determining transnational reputation. It was the case of Toyota that the \ncar under the brand „Prius‟ was launched in Japan in 1997 and in other \ncountries in 2000-2001. However, „Prius‟ was released in India in the year \n2009 and formally launched in the year 2010. The respondent (defendant in \nthe suit), had got the mark „Prius‟ registered in India in 2002 in respect of \nauto parts and accessories and was using the said mark in India since 2001. \nA suit for infringement of the mark „Prius‟ and passing off was filed by \nToyota against the respondent. After a full trial, a Single Judge of this Court \nheld that the acts of the respondent amounted to passing off of the \nrespondent‟s goods under the trade name „Prius‟ and consequently granted a \npermanent injunction in favour of the plaintiff. In appeal, the Division \nBench reversed the judgment of the Single Judge and declined the relief of \npermanent injunction. This was challenged by Toyota before the Supreme \nCourt.  \n10. \nRelying upon the judgments of the Courts in the U.K. and Australia \nand the passages from the book „The Law of Passing-Off‟ by Prof. \nChristopher Wadlow, the Supreme Court applied the „territoriality \nprinciple‟ and held that the transnational reputation of Toyota in respect of \nthe trade mark 'Prius‟ has not spilled over to India and hence, did not grant \npermanent injunction in favour of Toyota. The relevant observations of the \nSupreme Court with regard to the application of the „territoriality principle‟ \nare set out below: \n“32.  \nProf. Cristopher Wadlow's view on the subject appears to \nbe that the test of whether a foreign claimant may succeed in a \npassing-off action is whether his business has a goodwill in a \nparticular jurisdiction, which criterion is broader than the \n“obsolete” test of whether a claimant has a business/place of \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:03.02.2023 18:01:20\nSignature Not Verified\n\n--- PAGE 9 ---\n2023/DHC/000777 \nC.O. (COMM.IPD-TM) 298/2022 with connected matters                                                     Page 9 of 19 \n \nbusiness in that jurisdiction. If there are customers for the \nclaimant's products in that jurisdiction, then the claimant stands \nin the same position as a domestic trader. \n \n33.  \nThe overwhelming judicial and academic opinion all over \nthe globe, therefore, seems to be in favour of the territoriality \nprinciple. We do not see why the same should not apply to this \ncountry. \n \n34.  \nTo give effect to the territoriality principle, the courts \nmust necessarily have to determine if there has been a spillover \nof the reputation and goodwill of the mark used by the claimant \nwho has brought the passing-off action. In the course of such \ndetermination it may be necessary to seek and ascertain the \nexistence of not necessarily a real market but the presence of \nthe claimant through its mark within a particular territorial \njurisdiction in a more subtle form which can best be manifested \nby the following illustrations, though they arise from decisions of \ncourts which may not be final in that particular jurisdiction.” \n \n11. \nApplying the aforesaid principles to the facts of the case before the \nSupreme Court in Toyota (supra), it was observed as under: \n(i) \nUndoubtedly, the trade mark „Prius‟ has acquired a great deal of \ngoodwill in various other jurisdictions in the world before its use and \nregistration by the respondent in India. \n(ii) \nMerely on account of advertisements in automobile magazines, \ninternational business magazines and information on the internet, it \ncannot be said that the aforesaid product has acquired the necessary \ngoodwill and reputation in the Indian market. \n(iii) The evidence on record also showed very limited sales of the product \nin the Indian market and no advertisement prior to the registration by \nthe defendant. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:03.02.2023 18:01:20\nSignature Not Verified\n\n--- PAGE 10 ---\n2023/DHC/000777 \nC.O. (COMM.IPD-TM) 298/2022 with connected matters                                                     Page 10 of 19 \n \n(iv) \nThe plaintiff failed to furnish sufficient proof of knowledge and \ninformation about the product in India. \n(v) \nThe brand name of the car „Prius‟ had not acquired the degree of \ngoodwill, reputation and popularity in the Indian market so as to \ncreate a right of prior user in favour of Toyota against a registered \nowner. \n12. \n To a similar effect is the order of the IPAB in Hypnos Limited \n(supra).  In the said case, the applicant was the registered proprietor of the \nmark „Hypnos‟, adopted several decades ago in relation to beds, mattresses, \npillows, etc.  It was also the case of the applicant that beds bearing the trade \nmark „Hypnos‟ had been supplied by the applicant to hotels in India in the \nyears 2008 to 2010.  The respondent‟s trade mark was registered in Class 20 \nin the year 2007. It was the case of the applicant that the respondent had \ndishonestly adopted and obtained registration of the trade mark „Hypnos‟ in \nIndia and started using the same for selling similar goods. Rejecting the \nsubmission of the applicant that the impugned trade mark „Hypnos‟ is a \n„well-known trademark‟ and carries transborder reputation, which has \nspilled over to India, the IPAB dismissed the rectification petition. The \nrelevant observations are as under: \n“81.  \nWe agree with the proposition propounded in the \njudgment of Hon'ble Supreme Court on same issue, wherein the \nHon'ble Apex court has held that in the case of National Sewing \nThread Co. Ltd. v. James Chadwick & Bros. Ltd. (Supra). \n \n“Wherein the Hon'ble court has taken view that “the suit of \npassing-off and the opposition proceedings pending before \nthe Registrar of Trademarks are different from each other”. \n \n82.  \nWe are also of the same opinion as this proposition lay \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:03.02.2023 18:01:20\nSignature Not Verified\n\n--- PAGE 11 ---\n2023/DHC/000777 \nC.O. (COMM.IPD-TM) 298/2022 with connected matters                                                     Page 11 of 19 \n \ndown in above judgment that the rectification proceeding under \nsection 57 of the trademarks Act is also altogether quite \ndifferent from the suit of passing off or of opposition \nproceedings before the Registrar. The rectification proceedings \nbefore the board under section 57 of the trademarks Act cannot \nbe equated to be similar with as in the case of passing off action, \nwhere the burden rests on the plaintiff to prove whether there is \nlikelihood of the defendant's goods being passed off as the goods \nof the plaintiff but in rectification proceedings under section 57 \nof the trademarks Act it deals with the power to cancel or vary \nregistration on many grounds and to expunge the trademark from \nthe register is based on different tenets altogether not as in the \ncase suit for passing off, as such the rectification application also \nhas inherent different structure in totality than the suit of passing \noff. \n \n83.  \nTo claim Trans-border reputation for a mark in India, \nthe impugned trademark ‘Hypnos’ must be well known \nsubstantial segment of consumers in India must know about the \nexistence of the mark of the foreign entity. Such knowledge \nmay come from free availability of the product to Indian \nconsumers or extensive advertising, which reaches a \nsubstantial segment of Indian consumers because of extensive \ncirculation of those advertisements in India. \n \n84.  \nAfter going through the pleading and rival contention \nof the parties. We have observed that even assuming the \napplicant's trademark acquired reputation in foreign countries, \nwhere their trade mark is registered, but no presumption can be \ndrawn at this juncture that trade mark of the applicant \nregistered in foreign countries has automatically acquired \nreputation in India or trans-border reputation is percolated in \nIndia, as we have already pointed out that no document of the \napplicant shows of its extensive usage of the mark in India or \nany other place of registration. \n \n85.  \nThe applicant has failed to establish that indeed the \napplicant has trans-border reputation due to its long and \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:03.02.2023 18:01:20\nSignature Not Verified\n\n--- PAGE 12 ---\n2023/DHC/000777 \nC.O. (COMM.IPD-TM) 298/2022 with connected matters                                                     Page 12 of 19 \n \nextensive use of the impugned trademark in question and the \nimpugned trademark „Hypnos‟ is well known. The applicant has \nfurther failed to establish that the trademark “Hypnos” has \nattained the reputation and goodwill which has spilled over in to \nother countries and India. The substantial segments of consumers \nin India know about the existence of the mark „Hypnos‟ as of the \nforeign entity. \n \n86.  \nIt is well settled proposition that the onus is on the \napplicant applying rectification to establish by letting his \nevidence about the trans-border reputation, so the burden is on \nthe applicant herein, the applicant has to discharge his burden \nby showing extensive use and making out strong ground for \nrectification. The applicant applying for rectification application \nhas to discharge its onus in removing of registered trademark \nfrom register. \n \nxxx  \n \n \n \nxxx   \n \n \n         xxx \n \n88. We have also gone through the authorities submitted by the \nrespondent in support of his contention. We agree with \npropounded proposition in the above citations that the onus is \non the applicant to discharge by producing substantial evidence \nin his support and it is burden on the applicant to establish \nevidence of extensive, long use of its mark and show the well \nknownness, trans-border reputation and making out strong \nground for rectification.” \n \n13. \nIn light of the principles laid down in the aforesaid judgments, it has \nto be examined whether in the present case, the petitioner company has \nproduced sufficient evidence on record in support of its contention that the \ntrade mark „ALPHARD‟ carries a transborder reputation that has spilled \nover in India.   \n14. \nMerely, the international usage of the trade mark „ALPHARD‟ by the \npetitioner company is not sufficient to prove the spillover of its transnational \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:03.02.2023 18:01:20\nSignature Not Verified\n\n--- PAGE 13 ---\n2023/DHC/000777 \nC.O. (COMM.IPD-TM) 298/2022 with connected matters                                                     Page 13 of 19 \n \nreputation in India.  In the present case, the petitioner company has failed to \nplace on record a single invoice to show that it has sold any car under the \nbrand „ALPHARD‟ in India. In fact, the trade mark application filed on \nbehalf of the petitioner company in November, 2017 was on a „proposed to \nbe used basis‟. It is petitioner company‟s own case that the same model of \nthe car has been launched in India under a different brand name, „Vellfire‟.  \n15. \nIt is also an admitted position that the petitioner company has not \nadvertised the said brand in India in any manner. Various documents placed \non record by the petitioner company such as, international brochures/annual \nreports, awards, worldwide trade mark registration certificates/renewal \ncertificates and promotional material, are in relation to international usage of \nthe aforesaid trade mark. Undoubtedly, these documents show that the trade \nmark „ALPHARD‟ has acquired goodwill and reputation in several other \njurisdictions around the world. However, as per the „territoriality principle‟, \nthe onus is on the petitioner company to show that the trade mark \n„ALPHARD‟ had acquired sufficient goodwill and reputation in the Indian \nmarket also. None of the aforesaid documents filed by the petitioner \ncompany shows that the brand „ALPHARD‟ has acquired goodwill and \nreputation in India. The documents filed by the petitioner company relating \nto India are screenshots from third-party websites showing that a few cars of \nthe petitioner company under the brand „ALPHARD‟ have been listed for \nsale in India. As per the import-export data of India filed on behalf of the \npetitioner company, only fifteen import shipment records have been found \nunder the brand „ALPHARD‟ between the years 2014 to 2016 and not all of \nthem are in respect of vehicles. It may be noted that the aforesaid imports \nhave not been made by the petitioner company itself but by private parties.  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:03.02.2023 18:01:20\nSignature Not Verified\n\n--- PAGE 14 ---\n2023/DHC/000777 \nC.O. (COMM.IPD-TM) 298/2022 with connected matters                                                     Page 14 of 19 \n \n16. \nThe petitioner company has filed certain articles in various \ntrade/automobile magazines and newspaper reports regarding the petitioner \ncompany considering the launch of a vehicle under the brand „ALPHARD‟ \nin India. However, most of these articles are after the trade mark \n„ALPHARD‟ had already been registered by the respondent no.1 in India. It \nis also to be noted that the vehicle under the brand „ALPHARD‟ was never \nlaunched in India. The same model was launched in India in February, 2020 \nunder the brand „Vellfire‟. Therefore, no reliance can be placed on these \narticles to show that the brand „ALPHARD‟ has acquired goodwill and \nreputation in India.  \n17. \nIn Toyota (supra), the „Prius‟ model had been introduced by Toyota in \nthe Indian market in 2009-2010 and there were advertisements in \nautomobile magazines. Despite this, taking note of limited sales of the \nproduct in India and the absence of any advertisement of the product in India \nprior to 2001, the Supreme Court held that the trade mark „Prius‟ cannot be \nsaid to have acquired goodwill and reputation in the Indian market. The \npresent case stands on a worse footing for the petitioner company, as in the \npresent case the petitioner company has neither launched the model under \nthe trade mark „ALPHARD‟ in India nor has advertised the same.  \n18. \nCounsel for the petitioner company has placed reliance on the \njudgments in MAC Personal Care (supra) and Keller Williams Realty \n(supra) in support of his submission that the transborder reputation in respect \nof a trade mark may have a spillover reputation in India as well, despite the \naforesaid brand not having a commercial use in India. In MAC Personal \nCare (supra), the Division Bench enlisted the principles for determining \ninternational reputation. However, the issue of spillover of transnational \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:03.02.2023 18:01:20\nSignature Not Verified\n\n--- PAGE 15 ---\n2023/DHC/000777 \nC.O. (COMM.IPD-TM) 298/2022 with connected matters                                                     Page 15 of 19 \n \nreputation in India was not before the Division Bench. These principles were \nlaid down by the Supreme Court subsequently in Toyota (supra). Both the \naforesaid judgments were in the context of passing off action and not in the \ncontext of rectification petitions. To be noted that in Keller Williams Realty \n(supra), the Co-ordinate Bench of this Court denied the relief of interim \ninjunction in a passing off action. One of the reasons for denial of interim \ninjunction was that the plaintiff therein had been unable to show spillover of \nits reputation and goodwill in India. Therefore, the reliance placed by the \npetitioner company on the aforesaid judgments is misplaced.  \n19. \nAs regards the contention of the petitioner company that the adoption \nof the mark „ALPHARD‟ by the respondent no.1 is mala fide, counsel for \nthe respondent no.1 has drawn the attention of the Court to the dictionary \nmeaning of the word „Alphard‟1.  The word „Alphard‟ has been described in \nthe following manner: \n“an orange star of the second magnitude that is the brightest star \nin the constellation Hydra \nHydra is actually the largest constellation. Despite its size, it has \nonly one bright star named Alphard. It can be found over in the \nsouthwest sky all by itself—hence the name, which in Arabic \nmeans \"the solitary one.” \n \n20. \nExcept for making a bald averment, the petitioner company has failed \nto place any material on record to show that the adoption by the respondent \nno.1 was mala fide. Therefore, on the basis of evidence on record, it cannot \nbe held that the adoption of the trade mark „ALPHARD‟ by the respondent \nno.1 was mala fide or in bad faith. \n                                          \n1 Alphard. 2023. In Merriam-Webster.com. Retrieved on January 13, 2023, from https://www.merriam-\nwebster.com/dictionary/Alphard \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:03.02.2023 18:01:20\nSignature Not Verified\n\n--- PAGE 16 ---\n2023/DHC/000777 \nC.O. (COMM.IPD-TM) 298/2022 with connected matters                                                     Page 16 of 19 \n \n21. \nReliance has been placed by the petitioner company on Section 11(1), \n11(2) and 11(3) of the Act to contend that the trade mark „ALPHARD‟ \nshould not have been granted registration in favour of the respondent no.1 \non account of its identity and similarity with an “earlier trade mark”. To \nappreciate this submission, a reference may be made to the relevant \nprovisions of Section 11 of the Act, which is set out as under: \n“11. Relative grounds for refusal of registration.— (1) Save as \nprovided in section 12, a trade mark shall not be registered if, \nbecause of— \n \n(a) \n its identity with an earlier trade mark and similarity of \ngoods or services covered by the trade mark; or \n \n(b)  \nits similarity to an earlier trade mark and the identity or \nsimilarity of the goods or services covered by the trade mark,  \n \nthere exists a likelihood of confusion on the part of the public, \nwhich includes the likelihood of association with the earlier trade \nmark. \n \n(2)  \nA trade mark which— \n \n(a)  \nis identical with or similar to an earlier trade mark; and \n \n(b)  \nis to be registered for goods or services which are not \nsimilar to those for which the earlier trade mark is registered in \nthe name of a different proprietor,  \n \nshall not be registered, if or to the extent, the earlier trade mark \nis a well-known trade mark in India and the use of the later mark \nwithout due cause would take unfair advantage of or be \ndetrimental to the distinctive character or repute of the earlier \ntrade mark. \n \n(3)  \nA trade mark shall not be registered if, or to the extent \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:03.02.2023 18:01:20\nSignature Not Verified\n\n--- PAGE 17 ---\n2023/DHC/000777 \nC.O. (COMM.IPD-TM) 298/2022 with connected matters                                                     Page 17 of 19 \n \nthat, its use in India is liable to be prevented— \n \n(a)  \nby virtue of any law in particular the law of passing off \nprotecting an unregistered trade mark used in the course of \ntrade; or \n \n(b)  \nby virtue of law of copyright. \n \n(4)  \nNothing in this section shall prevent the registration of a \ntrade mark where the proprietor of the earlier trade mark or \nother earlier right consents to the registration, and in such case \nthe Registrar may register the mark under special circumstances \nunder section 12.  \n \nExplanation.—For the purposes of this section, earlier trade \nmark means— \n \n(a)  \na registered trade mark or an application under Section \n18 bearing an earlier date of filing or an international \nregistration referred to in Section 36E or convention application \nreferred to in section 154 which has a date of application earlier \nthan that of the trade mark in question, taking account, where \nappropriate, of the priorities claimed in respect of the trade \nmarks; \n \n(b) a trade mark which, on the date of the application for \nregistration of the trade mark in question, or where \nappropriate, of the priority claimed in respect of the application, \nwas entitled to protection as a well-known trade mark.” \n \n22. \nThe Explanation to Section 11 of the Act as set out above makes it \nclear that for the purposes of Section 11 of the Act, the phrase „earlier trade \nmark‟ would apply only in respect of a registered trade mark. Admittedly, \nthe trade mark of the petitioner company was not registered in India at the \ntime registration was granted in favour of the respondent no.1. Therefore, \nthe petitioner company cannot take benefit of sub-Sections (1) and (2) of \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:03.02.2023 18:01:20\nSignature Not Verified\n\n--- PAGE 18 ---\n2023/DHC/000777 \nC.O. (COMM.IPD-TM) 298/2022 with connected matters                                                     Page 18 of 19 \n \nSection 11 of the Act. Even the ground of passing off under sub-Section (3) \nof Section 11 of the Act would not be available to the petitioner company as \nit has failed to make out a case of having goodwill and reputation in India in \nrespect of the trade mark „ALPHARD‟.  \n23. \nCounsel for the petitioner company contends that the respondent no.1 \nhas failed to provide any evidence in respect of its use of the trade mark \n„ALPHARD‟. The various invoices filed by respondent no.1 to show the \nuser of the aforesaid trade mark is by another entity, „Tekstar Global Private \nLimited‟. In this regard, it may be noted that in the present case, registration \nhas been obtained by the respondent no.1 on a „proposed to be used basis‟, \nwhich is permissible under Section 18 of the Act. Therefore, user on the date \nof registration would not be a relevant factor. The respondent no.1 has \nplaced on record various photographs of its products bearing the trade mark \n„ALPHARD‟ as also invoices of its sister company, „Tekstar Global Private \nLimited‟ from 12th May, 2015 to 1st June, 2018 showing sales of products \nunder the trade mark „ALPHARD‟. Therefore, based on the material on \nrecord, it cannot be established that the respondent no.1 has registered the \ntrade mark without any bona fide intention to use the same.  \n24. \nIn view of the above, the petitioner company has completely failed to \ndischarge the onus to show the reputation and goodwill of the mark \n„ALPHARD‟ in India. In fact, it is not even the case of the petitioner \ncompany that it is dealing in products under Class 9 and Class 27 anywhere \nin the world. The documents placed on record by the petitioner company do \nnot reflect extensive use of the brand „ALPHARD‟ or establish that the \nbrand „ALPHARD‟ has acquired a transborder reputation in India in Classes \n9, 12 and 27. The evidence on record shows very limited sales and use of the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:03.02.2023 18:01:20\nSignature Not Verified\n\n--- PAGE 19 ---\n2023/DHC/000777 \nC.O. (COMM.IPD-TM) 298/2022 with connected matters                                                     Page 19 of 19 \n \nproduct in the Indian market and that too by private parties. No \nadvertisements have been made by the petitioner company in India. It cannot \nbe stated that a substantial number of consumers in India know about the \nexistence of the brand „ALPHARD‟.  \n25. \nTherefore, in my considered view, the petitioner company has failed \nto make out any ground for rectification of the trade mark „ALPHARD‟ \nregistered in Classes 9, 12 and 27 in the favour of the respondent no.1. I find \nno merit in the present rectification petitions filed on behalf of the petitioner \ncompany. Dismissed.  \n \n \nAMIT BANSAL, J. \nFEBRUARY 03, 2023 \ndk \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:03.02.2023 18:01:20\nSignature Not Verified\n"
  },
  "total_pages": 19,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "According to the PDF document \"Toyota vs Tech Square.pdf\", the case header and parties are as follows: Toyota Jidosha Kabushiki Kaisha (Petitioner) vs Tech Square Engineering Pvt. Ltd. and Anr. (Respondents) in the High Court of Delhi at New Delhi. The case numbers are C.O. (COMM.IPD-TM) 298/2022, C.O. (COMM.IPD-TM) 586/2022, and C.O. (COMM.IPD-TM) 634/2022.\n\nThe judgment was reserved on January 13, 2023, and delivered on February 3, 2023. The petitioners, represented by Mr. Peeyoosh Kalra, Mr. Amol Dixit, and Mr. Suyas Malhotra, Advocates, sought rectification of the trade mark register by removal of registrations granted in favor of the respondent no.1 in respect of the trade mark \"ALPHARD\" in various classes.\n\nThe respondents, represented by Mr. Kapil Wadhwa, Ms. Surya Rajappan, and Ms. Tejasvini Puri, Advocates for respondent No.1, and Mr. Harish Vaidyanathan Shankar, CGSC with Mr. Srish Kumar Mishra, Mr. Sagar Mehlawat, and Mr. Alexander Mathai Paikaday, Advocates for respondent No.2, argued against the petition.\n\nThe court, presided over by Hon'ble Mr. Justice Amit Bansal, considered the petitions filed in 2018 and the registrations granted in favor of the respondent no.1. The judgment, as per the PDF document, provides the court's decision on the matter. (Source: Toyota vs Tech Square.pdf, Page 1-2 of 19)",
      "pdf_source": "7.Toyota vs Tech Square.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "According to page 1 of the PDF \"7.Toyota vs Tech Square.pdf\", a legal case is presented in the High Court of Delhi at New Delhi. The case involves Toyota Jidosha Kabushiki Kaisha (Petitioner) versus Tech Square Engineering Pvt. Ltd. and another (Respondents). The judgment was reserved on January 13, 2023, and delivered on February 3, 2023. The petitioners are represented by Mr. Peeyoosh Kalra, Mr. Amol Dixit, and Mr. Suyas Malhotra, while the respondents are represented by Mr. Kapil Wadhwa and others. The case also includes connected matters C.O. (COMM.IPD-TM) 586/2022. The PDF document is digitally signed by Amit Bansal on February 3, 2023. (Source: 7.Toyota vs Tech Square.pdf, page 1)",
          "content": "2023/DHC/000777 \nC.O. (COMM.IPD-TM) 298/2022 with connected matters                                                     Page 1 of 19 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n% \n \n \n Judgment Reserved on :  13th January, 2023 \nJudgment Delivered on : 3rd February, 2023 \n \n+  \n \n \nC.O. (COMM.IPD-TM) 298/2022 \n \n \nTOYOTA JIDOSHA KABUSHIKI KAISHA \n..... Petitioner  \nThrough: \nMr. Peeyoosh Kalra, Mr.Amol Dixit \nand Mr. Suyas Malhotra, Advocates \n \n \n \n \nversus \n \n \nTECH SQUARE ENGINEERING  \nPVT. LTD. AND ANR.  \n \n \n \n..... Respondents \nThrough: \nMr. Kapil Wadhwa, Ms. Surya \nRajappan and Ms. Tejasvini Puri, \nAdvocates for respondent No.1 \n \nMr. Harish Vaidyanathan Shankar, \nCGSC with Mr. Srish Kumar Mishra, \nMr. \nSagar \nMehlawat \nand \nMr.Alexander \nMathai \nPaikaday, \nAdvocates for respondent No.2 \n \n+  \n \n \nC.O. (COMM.IPD-TM) 586/2022 \n \n \nTOYOTA JIDOSHA KABUSHIKI KAISHA  \nM/S TOYOTA MOTOR CORPORATION  \n..... Petitioner  \nThrough: \nMr. Peeyoosh Kalra, Mr.Amol Dixit \nand Mr. Suyas Malhotra, Advocates \n \n \n \n \nversus \n \n \nTECH SQUARE ENGINEERING PVT.  \nLTD. AND ANR.  \n \n \n \n \n..... Respondents \nThrough: \nMr. Kapil Wadhwa, Ms. Surya \nRajappan and Ms. Tejasvini Puri, \nAdvocates for respondent No.1 \n \nMr. Harish Vaidyanathan Shankar, \nCGSC with Mr. Srish Kumar Mishra, \nMr. \nSagar \nMehlawat \nand \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:03.02.2023 18:01:20\nSignature Not Verified",
          "pdf_source": "7.Toyota vs Tech Square.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "According to page 2 of the PDF \"7.Toyota vs Tech Square.pdf\", the case involves a rectification petition filed by Toyota Jidosha Kabushiki Kaisha (Toyota Motor Corporation) against Tech Square Engineering Pvt. Ltd. and another respondent. The petition, filed in 2018, seeks to remove registrations granted to the respondent in respect of the trademark \"ALPHARD\" in classes 9, 12, and 27. The petitioners are represented by Mr. Peeyoosh Kalra, Mr. Amol Dixit, and Mr. Suyas Malhotra, while the respondents are represented by Mr. Kapil Wadhwa, Ms. Surya Rajappan, and Ms. Tejasvini Puri, among others. The judgment was reserved on January 13, 2023, and delivered on February 3, 2023, by Hon'ble Mr. Justice Amit Bansal. (Source: 7.Toyota vs Tech Square.pdf, page 2)",
          "content": "2023/DHC/000777 \nC.O. (COMM.IPD-TM) 298/2022 with connected matters                                                     Page 2 of 19 \n \nMr.Alexander \nMathai \nPaikaday, \nAdvocates for respondent No.2 \n \n+  \n \n \nC.O. (COMM.IPD-TM) 634/2022 \n \n \nTOYOTA JIDOSHA KABUSHIKI KAISHA  \nAS TOYOTA MOTOR CORPORATION   \n..... Petitioner  \nThrough: \nMr. Peeyoosh Kalra, Mr.Amol Dixit \nand Mr. Suyas Malhotra, Advocates \n \n \n \n \nversus \n \n \nTECH SQUARE ENGINEERING  \nPVT. LTD. AND ANR.  \n \n \n \n ..... Respondents \nThrough: \nMr. Kapil Wadhwa, Ms. Surya \nRajappan and Ms. Tejasvini Puri, \nAdvocates for respondent No.1 \nMr. Harish Vaidyanathan Shankar, \nCGSC with Mr. Srish Kumar Mishra, \nMr. \nSagar \nMehlawat \nand \nMr.Alexander \nMathai \nPaikaday, \nAdvocates for respondent No.2 \n \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nJUDGMENT \nAMIT BANSAL, J. \n \n1. \nThe present rectification petitions have been filed on behalf of the \npetitioner company in the year 2018 seeking rectification of the trade mark \nregister by removal of registrations granted in favour of the respondent no.1 \nin respect of trade mark „ALPHARD‟ in (i) Class 9 in relation to car \nradios/stereos, navigation apparatus for vehicles; (ii) Class 12 in relation to \nautomobiles and various car accessories and (iii) Class 27 in relation to \nautomobile carpets, bearing registration no.3093216, 3093218, 3093219 \nrespectively. The aforesaid petitions were originally filed before the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:03.02.2023 18:01:20\nSignature Not Verified",
          "pdf_source": "7.Toyota vs Tech Square.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0007",
      "start_index": 3,
      "end_index": 5,
      "summary": "According to the \"Toyota vs Tech Square\" PDF document (2023/DHC/000777, C.O. (COMM.IPD-TM) 298/2022), the High Court of Delhi at New Delhi heard a case between Toyota Jidosha Kabushiki Kaisha (Petitioner) and Tech Square Engineering (Respondent). The judgment was reserved on January 13, 2023, and delivered on February 3, 2023.\n\nThe petitioner, Toyota, is an automotive manufacturer that owns the distinctive trademark \"ALPHARD,\" which was adopted in 1986 and launched as a luxury MUV in 2002. Although the vehicle has not been formally launched in India, it has been available in the country through direct imports since 2002. Toyota has sold over 850,000 units under the \"ALPHARD\" trademark worldwide.\n\nThe respondent, Tech Square, obtained registration of the \"ALPHARD\" trademark under Classes 9, 12, and 27 in 2015 on a \"proposed to be used basis.\" Toyota alleges that Tech Square adopted the trademark in a mala fide manner to trade on Toyota's goodwill and reputation.\n\nThe respondent claims to be the prior user and bona fide adopter of the \"ALPHARD\" trademark since 2015. The court considered the petitions, counter-statements, and rejoinders filed by both parties. The case highlights a trademark dispute between Toyota and Tech Square, with Toyota seeking to protect its well-known trademark \"ALPHARD\" in India. (Source: Toyota vs Tech Square.pdf, pages 1-5)",
      "pdf_source": "7.Toyota vs Tech Square.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "According to page 3 of the PDF \"7.Toyota vs Tech Square.pdf\", the case involves Toyota Jidosha Kabushiki Kaisha (Petitioner) versus Tech Square Engineer (Respondent). The petitions were initially filed with the Intellectual Property Appellate Board (IPAB) but were transferred to the High Court of Delhi due to the Tribunals Reforms Act, 2021. Notice was issued on February 8, 2019, and counter statements and rejoinders have been filed. The petitioner, an automotive manufacturer, claims to own the well-known trademark \"ALPHARD\", adopted in 1986 and launched as a luxury MUV in 2002. The case is being decided through a common judgment, as all three petitions raise similar issues. (Source: 7.Toyota vs Tech Square.pdf, page 3)",
          "content": "2023/DHC/000777 \nC.O. (COMM.IPD-TM) 298/2022 with connected matters                                                     Page 3 of 19 \n \nerstwhile Intellectual Property Appellate Board (IPAB), however, due to the \nenactment of the Tribunals Reforms Act, 2021, the petitions have been \nplaced before this Court. \n2. \nNotice in the aforesaid rectification petitions was issued by the IPAB \non 8th February, 2019. Counter statements thereto have been filed on behalf \nof the respondent no.1 and rejoinder has been filed on behalf of the \npetitioner company. \n3. \nSince all the three petitions raise similar issues, they are being decided \nby way of a common judgment. \nBRIEF FACTS \n4. \nBriefly, the case set up by the petitioner company is as under: \n4.1 \nThe petitioner company, incorporated in Japan, is an automotive \nmanufacturer and operates throughout the world.  The vehicles of the \npetitioner company are sold in more than 170 countries and the \npetitioner company conducts business worldwide with 53 overseas \nmanufacturing companies in 28 countries and regions.  \n4.2 \nThe petitioner company entered the Indian market in a joint venture \nwith the Kirloskar Group in 1997 known as Toyota Kirloskar Motor \nPvt. Ltd. and set up manufacturing facilities in India.   \n4.3 \nThe petitioner company owns various distinctive and well-known \ntrademarks, one of which includes the trade mark „ALPHARD‟. The \naforesaid trade mark was adopted by the petitioner company in the \nyear 1986 and a luxury MUV under the said brand was launched in \nthe year 2002. \n4.4 \nThough, the petitioner company‟s vehicle under the trade mark \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:03.02.2023 18:01:20\nSignature Not Verified",
          "pdf_source": "7.Toyota vs Tech Square.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "According to page 4 of the PDF \"7.Toyota vs Tech Square.pdf\", Toyota Jidosha Kabushiki Kaisha has a trade mark \"ALPHARD\" registered in various jurisdictions since 1986. The company has sold over 850,000 units under this mark since its launch in 2002. The petitioner company applied for registration of the trade mark \"ALPHARD\" in India on November 21, 2017, but was objected to by the Registry. Meanwhile, respondent Tech Square Engineeri obtained registration of the same trade mark on November 5, 2015. The petitioner alleges that the respondent adopted the trade mark in a mala fide manner to trade upon Toyota's goodwill and reputation. The case was heard in the High Court of Delhi, with judgment reserved on January 13, 2023, and delivered on February 3, 2023. (Source: 7.Toyota vs Tech Square.pdf, page 4)",
          "content": "2023/DHC/000777 \nC.O. (COMM.IPD-TM) 298/2022 with connected matters                                                     Page 4 of 19 \n \n„ALPHARD‟ has not yet been formally launched in India, the same \nhas been available in the country for the last many years on account of \ndirect imports by Indian residents. The earliest registration of the \npetitioner company‟s mark „ALPHARD‟ dates back to 1986 and the \nsaid trade mark is registered in various jurisdictions, such as Japan, \nChina, Singapore etc.   \n4.5 \nThe petitioner company has sold more than 8,50,000 units under the \ntrade mark „ALPHARD‟ since its launch in 2002.  The details of sales \nfigures as well as advertising and promotional expenses incurred by \nthe petitioner company from 2002-2017 have been given in the \npetition. \n4.6 \nThe petitioner company‟s trade mark „ALPHARD‟ is well-known \nthroughout the world and has acquired a secondary meaning with the \npeople associated with the trade associating the same with the \npetitioner. \n4.7 \nThe petitioner company applied for registration of the trade mark \n„ALPHARD‟ on a „proposed to be used basis‟ on 21st November, \n2017 and the same has been objected to by the Registry.  \n4.8 \nThe respondent no.1 obtained registration of the trade mark \n„ALPHARD‟ under Classes 9, 12 and 27 on 5th November, 2015 on a \n„proposed to be used basis‟. \n4.9 \nAdoption of the petitioner company‟s trade mark by the respondent \nno.1 in relation to goods in the allied/cognate field has been done in a \nmala fide manner so as to trade upon the petitioner company‟s \ngoodwill and reputation.   \n5. \nThe case of the defendants in the counter statement can be \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:03.02.2023 18:01:20\nSignature Not Verified",
          "pdf_source": "7.Toyota vs Tech Square.pdf",
          "nodes": []
        },
        {
          "title": "Page 5",
          "node_id": "0006",
          "start_index": 5,
          "end_index": 5,
          "summary": "According to page 5 of the PDF \"7.Toyota vs Tech Square.pdf\", the respondent, Tech Square, has been using the trademark \"ALPHARD\" since 2015 for goods under Classes 9, 12, and 27. The petitioner, Toyota, applied for registration of the same trademark in Class 12 but has not used it in India. As a result, Toyota cannot claim goodwill or transborder reputation in India. The petitioner made contradictory claims, stating that their vehicles were available in India since 2008, but their trademark registration application was filed on a \"proposed to be used\" basis in November 2017. The court judgment was reserved on January 13, 2023, and delivered on February 3, 2023. (Source: 7.Toyota vs Tech Square.pdf, page 5)",
          "content": "2023/DHC/000777 \nC.O. (COMM.IPD-TM) 298/2022 with connected matters                                                     Page 5 of 19 \n \nsummarized as under: \n5.1 \nRespondent no.1 is the prior user and bona fide adopter of the trade \nmark „ALPHARD‟ for goods under Classes 9, 12 and 27 since the \nyear 2015. \n5.2 \nThe respondent no.1 coined and adopted the trade mark „ALPHARD‟ \nin the year 2015 and since its adoption, the respondent no.1 has been \ncontinuously and extensively using the said trade mark. \n5.3 \nThe aforesaid trade mark has been used by the respondent no.1 along \nwith its sister companies, „Tekstar Global Private Limited‟ and „Sai \nSupertrek Global Private Limited‟.    \n5.4 \nThough the petitioner company applied for the registration of its trade \nmark „ALPHARD in Class 12, it is an admitted position that the \npetitioner company has not used the trade mark „ALPHARD‟ in India. \n5.5 \nIn light of the non-user by the petitioner Company, there cannot be \nany goodwill or transborder reputation in respect of the aforesaid \ntrade mark in India.   \n5.6 \nThe petitioner company has made contradictory claims in its petition.  \nOn one hand, the petitioner company claims that the petitioner‟s \nvehicles under the aforesaid trade mark were available in India from \nthe year 2008, on the other hand, the trade mark registration \napplication has been filed by the petitioner company on a „proposed \nto be used basis‟ in November, 2017. \nSUBMISSIONS OF THE PETITIONER COMPANY \n6. \nCounsel appearing on behalf of the petitioner company has made the \nfollowing submissions: \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:03.02.2023 18:01:20\nSignature Not Verified",
          "pdf_source": "7.Toyota vs Tech Square.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0020",
      "start_index": 6,
      "end_index": 17,
      "summary": "According to the PDF document \"Toyota vs Tech Square.pdf\", a legal proceeding (C.O. (COMM.IPD-TM) 298/2022) was held in the High Court of Delhi at New Delhi. The case involved Toyota Jidosha Kabushiki Kaisha (petitioner) versus Tech Square Engineering (respondent). The judgment was reserved on January 13, 2023, and delivered on February 3, 2023.\n\nThe petitioner argued that their trade mark \"ALPHARD\" has a worldwide reputation and was sold in India as early as 2008. They claimed that the respondent's registration of the mark \"ALPHARD\" in classes 9, 12, and 27 was invalid. The petitioner cited international brochures, annual reports, and awards to support their claim.\n\nThe respondent countered that the petitioner had not used the trade mark \"ALPHARD\" in India in the relevant classes and that their own products had been sold under the mark since 2015. They also argued that the word \"ALPHARD\" is the name of a star and was adopted in a bona fide manner.\n\nThe court analyzed the arguments and referred to previous judgments, including Toyota Jidosha Kabushiki Kaisha v. Prius Auto Industries Ltd. (2018) and Hypnos Limited v. Hosur Coir Foam Pvt. Ltd. (2015). The court's decision is not explicitly stated in the provided section of the PDF document. (Source: Toyota vs Tech Square.pdf, pages 1-8 of 19)",
      "pdf_source": "7.Toyota vs Tech Square.pdf",
      "nodes": [
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "According to page 6 of the PDF \"7.Toyota vs Tech Square.pdf\", the petitioner, Toyota Jidosha Kabushiki Kaisha, has sold vehicles bearing the trade mark \"ALPHARD\" in India since 2008. The petitioner claims that the \"ALPHARD\" trade mark has a worldwide reputation with a direct spillover in India. The respondent's invoices are from a different company, \"Tekstar Global Private Limited\". The petitioner argues that registration could not have been granted to the respondent under Sections 11(1), 11(2), 11(3), and 11(10) of the Trade Marks Act, 1999. The petitioner relies on judgments from MAC Personal Care Pvt. Ltd. v. Laverana GMBH and Co. (2016) and Keller Williams Realty v. Dingle Buildcons Pvt. Ltd. (2020). The respondent's counsel made submissions, including that the petitioner has not used the trade mark in India. (Source: 7.Toyota vs Tech Square.pdf, page 6)",
          "content": "2023/DHC/000777 \nC.O. (COMM.IPD-TM) 298/2022 with connected matters                                                     Page 6 of 19 \n \n6.1 \nVehicles bearing the petitioner company‟s trade mark „ALPHARD‟ \nhave been sold in India as far back as 2008.  Reliance is placed on \nprintouts from third-party websites showing listings of the petitioner \ncompany‟s vehicles in India for sale. \n6.2 \nPetitioner company‟s trade mark „ALPHARD‟ enjoys a worldwide \nreputation and the same has a direct spillover in India. In this regard, \npetitioner \ncompany \nhas \nplaced \non \nrecord \ninternational \nbrochures/annual reports, awards, worldwide trade mark registration \ncertificates/renewal certificates and promotional material in respect of \nthe mark „ALPHARD‟.  \n6.3 \nThe invoices placed on record on behalf of the respondent no.1 are \nnot of the respondent no.1 company but of „Tekstar Global Private \nLimited‟.   \n6.4 \nRegistration could not have been granted to the respondent no.1 in \nterms of Sections 11(1), 11(2), 11(3) and 11(10) of the Trade Marks \nAct, 1999 (hereinafter „the Act‟).   \n6.5 \nReliance is placed on the judgment of a Division Bench of this Court \nin MAC Personal Care Pvt. Ltd. v. Laverana GMBH and Co., 2016 \nSCC OnLine Del 530 and judgment of a Co-ordinate Bench of this \nCourt in Keller Williams Realty v. Dingle Buildcons Pvt. Ltd., 2020 \nSCC OnLine Del 539.   \nSUBMISSIONS OF THE RESPONDENT NO.1 \n7. \nPer contra, submissions made by the counsel on behalf of the \nrespondent no.1 are as under: \n7.1 \nIt is an admitted position that the petitioner company has not used the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:03.02.2023 18:01:20\nSignature Not Verified",
          "pdf_source": "7.Toyota vs Tech Square.pdf",
          "nodes": []
        },
        {
          "title": "Page 7",
          "node_id": "0009",
          "start_index": 7,
          "end_index": 7,
          "summary": "According to page 7 of the PDF \"7.Toyota vs Tech Square.pdf\", the court case involves Toyota Jidosha Kabushiki Kaisha (petitioner) vs Tech Square Engineering (respondent). The respondent has registered the trade mark \"ALPHARD\" in India in classes 9, 12, and 27. The respondent claims to have used the mark since 2015 and argues that its use is arbitrary and fanciful. The petitioner relies on the judgment of the Supreme Court in Toyota Jidosha Kabushiki Kaisha v. Prius Auto Industries Ltd. (2018) to contend that there is no transnational reputation available to the petitioner company in India. The court has reserved judgment on January 13, 2023, and delivered it on February 3, 2023. (Source: 7.Toyota vs Tech Square.pdf, page 7)",
          "content": "2023/DHC/000777 \nC.O. (COMM.IPD-TM) 298/2022 with connected matters                                                     Page 7 of 19 \n \ntrade mark „ALPHARD‟ in India in any of the three classes viz., \nClass 9, Class 12 and Class 27, where the mark has been registered in \nfavour of the respondent no.1. Further, the trade mark „ALPHARD‟ \nhas not been used by the petitioner company in Classes 9 or 27 even \noutside India. \n7.2 \nThe products of the respondent no.1 have been continuously sold \nunder the trade mark „ALPHARD‟ since the year 2015.  Reliance in \nthis regard is placed on the invoices of „Tekstar Global Private \nLimited‟, sister company of the respondent no.1.   \n7.3 \nThe word „ALPHARD‟ is the name of a star and therefore, the same \nhas been adopted by the respondent no.1 in a bona fide manner.  Its \nuse in relation to car accessories is completely arbitrary and fanciful.  \n7.4 \nThe provisions of Sections 11(1), 11(2) and 11(3) of the Act have no \napplication in the present case as there is no earlier registered trade \nmark in the present case.   \n7.5 \nReliance is placed on the judgment of the Supreme Court in Toyota \nJidosha Kabushiki Kaisha v. Prius Auto Industries Ltd., (2018) 2 \nSCC 1 and the order of IPAB in Hypnos Limited v. Hosur Coir \nFoam Pvt. Ltd. and Ors., 2015 SCC OnLine IPAB 213, to contend \nthat in the present case, there is no transnational reputation available \nto the petitioner company in India.  \nANALYSIS AND FINDINGS \n8. \nI have heard the counsel for the parties and perused the record. \n9. \nThe Supreme Court in the petitioner company‟s own case, Toyota \n(supra), though relating to a passing off action, has laid down the principles \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:03.02.2023 18:01:20\nSignature Not Verified",
          "pdf_source": "7.Toyota vs Tech Square.pdf",
          "nodes": []
        },
        {
          "title": "Page 8",
          "node_id": "0010",
          "start_index": 8,
          "end_index": 8,
          "summary": "According to page 8 of the PDF \"7.Toyota vs Tech Square.pdf\", Toyota's car brand \"Prius\" was launched in Japan in 1997 and in India in 2009. The defendant, Tech Square, registered the \"Prius\" mark in India in 2002 for auto parts and accessories. Toyota filed a suit for infringement and passing off, which was initially granted a permanent injunction by a Single Judge. However, the Division Bench reversed the judgment, and the Supreme Court upheld this decision, applying the \"territoriality principle\" and stating that Toyota's transnational reputation did not extend to India. The Supreme Court cited Prof. Christopher Wadlow's book \"The Law of Passing-Off\" in its decision. The case involved advocates Mr. Peeyoosh Kalra, Mr. Amol Dixit, and Mr. Suyas Malhotra for Toyota. (Source: 7.Toyota vs Tech Square.pdf, page 8)",
          "content": "2023/DHC/000777 \nC.O. (COMM.IPD-TM) 298/2022 with connected matters                                                     Page 8 of 19 \n \nfor determining transnational reputation. It was the case of Toyota that the \ncar under the brand „Prius‟ was launched in Japan in 1997 and in other \ncountries in 2000-2001. However, „Prius‟ was released in India in the year \n2009 and formally launched in the year 2010. The respondent (defendant in \nthe suit), had got the mark „Prius‟ registered in India in 2002 in respect of \nauto parts and accessories and was using the said mark in India since 2001. \nA suit for infringement of the mark „Prius‟ and passing off was filed by \nToyota against the respondent. After a full trial, a Single Judge of this Court \nheld that the acts of the respondent amounted to passing off of the \nrespondent‟s goods under the trade name „Prius‟ and consequently granted a \npermanent injunction in favour of the plaintiff. In appeal, the Division \nBench reversed the judgment of the Single Judge and declined the relief of \npermanent injunction. This was challenged by Toyota before the Supreme \nCourt.  \n10. \nRelying upon the judgments of the Courts in the U.K. and Australia \nand the passages from the book „The Law of Passing-Off‟ by Prof. \nChristopher Wadlow, the Supreme Court applied the „territoriality \nprinciple‟ and held that the transnational reputation of Toyota in respect of \nthe trade mark 'Prius‟ has not spilled over to India and hence, did not grant \npermanent injunction in favour of Toyota. The relevant observations of the \nSupreme Court with regard to the application of the „territoriality principle‟ \nare set out below: \n“32.  \nProf. Cristopher Wadlow's view on the subject appears to \nbe that the test of whether a foreign claimant may succeed in a \npassing-off action is whether his business has a goodwill in a \nparticular jurisdiction, which criterion is broader than the \n“obsolete” test of whether a claimant has a business/place of \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:03.02.2023 18:01:20\nSignature Not Verified",
          "pdf_source": "7.Toyota vs Tech Square.pdf",
          "nodes": []
        },
        {
          "title": "Page 9",
          "node_id": "0011",
          "start_index": 9,
          "end_index": 9,
          "summary": "According to page 9 of the PDF \"7.Toyota vs Tech Square.pdf\", the court discusses the territoriality principle in trademark law. The judgment, delivered on February 3, 2023, states that the claimant's reputation and goodwill must be established within a particular territorial jurisdiction. In the case of Toyota, the court observed that the trademark \"Prius\" had acquired goodwill in other jurisdictions, but not in India, despite international advertisements and online information. The court also noted limited sales in the Indian market and no prior advertisements. The case is C.O. (COMM.IPD-TM) 298/2022, with Toyota Jidosha Kabushiki Kaisha as the petitioner, represented by advocates Mr. Peeyoosh Kalra, Mr. Amol Dixit, and Mr. Suyas Malhotra. (Source: 7.Toyota vs Tech Square.pdf, page 9)",
          "content": "2023/DHC/000777 \nC.O. (COMM.IPD-TM) 298/2022 with connected matters                                                     Page 9 of 19 \n \nbusiness in that jurisdiction. If there are customers for the \nclaimant's products in that jurisdiction, then the claimant stands \nin the same position as a domestic trader. \n \n33.  \nThe overwhelming judicial and academic opinion all over \nthe globe, therefore, seems to be in favour of the territoriality \nprinciple. We do not see why the same should not apply to this \ncountry. \n \n34.  \nTo give effect to the territoriality principle, the courts \nmust necessarily have to determine if there has been a spillover \nof the reputation and goodwill of the mark used by the claimant \nwho has brought the passing-off action. In the course of such \ndetermination it may be necessary to seek and ascertain the \nexistence of not necessarily a real market but the presence of \nthe claimant through its mark within a particular territorial \njurisdiction in a more subtle form which can best be manifested \nby the following illustrations, though they arise from decisions of \ncourts which may not be final in that particular jurisdiction.” \n \n11. \nApplying the aforesaid principles to the facts of the case before the \nSupreme Court in Toyota (supra), it was observed as under: \n(i) \nUndoubtedly, the trade mark „Prius‟ has acquired a great deal of \ngoodwill in various other jurisdictions in the world before its use and \nregistration by the respondent in India. \n(ii) \nMerely on account of advertisements in automobile magazines, \ninternational business magazines and information on the internet, it \ncannot be said that the aforesaid product has acquired the necessary \ngoodwill and reputation in the Indian market. \n(iii) The evidence on record also showed very limited sales of the product \nin the Indian market and no advertisement prior to the registration by \nthe defendant. \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:03.02.2023 18:01:20\nSignature Not Verified",
          "pdf_source": "7.Toyota vs Tech Square.pdf",
          "nodes": []
        },
        {
          "title": "Page 10",
          "node_id": "0012",
          "start_index": 10,
          "end_index": 10,
          "summary": "According to page 10 of the PDF \"7.Toyota vs Tech Square.pdf\", the court proceedings involve a case between Toyota Jidosha Kabushiki Kaisha and Tech Square Engineering. The plaintiff, Toyota, failed to provide sufficient proof of knowledge and information about their product in India. Additionally, the brand name \"Prius\" had not acquired enough goodwill and reputation in the Indian market to establish a right of prior user against a registered owner. The court cited a similar case, Hypnos Limited, where the IPAB dismissed a rectification petition, stating that a passing-off suit and opposition proceedings before the Registrar of Trademarks are different. The judgment was reserved on January 13, 2023, and delivered on February 3, 2023. (Source: 7.Toyota vs Tech Square.pdf, page 10)",
          "content": "2023/DHC/000777 \nC.O. (COMM.IPD-TM) 298/2022 with connected matters                                                     Page 10 of 19 \n \n(iv) \nThe plaintiff failed to furnish sufficient proof of knowledge and \ninformation about the product in India. \n(v) \nThe brand name of the car „Prius‟ had not acquired the degree of \ngoodwill, reputation and popularity in the Indian market so as to \ncreate a right of prior user in favour of Toyota against a registered \nowner. \n12. \n To a similar effect is the order of the IPAB in Hypnos Limited \n(supra).  In the said case, the applicant was the registered proprietor of the \nmark „Hypnos‟, adopted several decades ago in relation to beds, mattresses, \npillows, etc.  It was also the case of the applicant that beds bearing the trade \nmark „Hypnos‟ had been supplied by the applicant to hotels in India in the \nyears 2008 to 2010.  The respondent‟s trade mark was registered in Class 20 \nin the year 2007. It was the case of the applicant that the respondent had \ndishonestly adopted and obtained registration of the trade mark „Hypnos‟ in \nIndia and started using the same for selling similar goods. Rejecting the \nsubmission of the applicant that the impugned trade mark „Hypnos‟ is a \n„well-known trademark‟ and carries transborder reputation, which has \nspilled over to India, the IPAB dismissed the rectification petition. The \nrelevant observations are as under: \n“81.  \nWe agree with the proposition propounded in the \njudgment of Hon'ble Supreme Court on same issue, wherein the \nHon'ble Apex court has held that in the case of National Sewing \nThread Co. Ltd. v. James Chadwick & Bros. Ltd. (Supra). \n \n“Wherein the Hon'ble court has taken view that “the suit of \npassing-off and the opposition proceedings pending before \nthe Registrar of Trademarks are different from each other”. \n \n82.  \nWe are also of the same opinion as this proposition lay \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:03.02.2023 18:01:20\nSignature Not Verified",
          "pdf_source": "7.Toyota vs Tech Square.pdf",
          "nodes": []
        },
        {
          "title": "Page 11",
          "node_id": "0013",
          "start_index": 11,
          "end_index": 11,
          "summary": "According to page 11 of the PDF \"7.Toyota vs Tech Square.pdf\", the court distinguishes between rectification proceedings under section 57 of the trademarks Act and a suit for passing off. The burden of proof in rectification proceedings is different from that in a passing off action. To claim trans-border reputation, the mark must be well-known to a substantial segment of consumers in India. The applicant, Toyota, has failed to establish trans-border reputation due to lack of evidence of extensive usage of the mark in India. The court observed this on January 13, 2023, and delivered the judgment on February 3, 2023, in the case C.O. (COMM.IPD-TM) 298/2022. The advocates for the petitioner are Mr. Peeyoosh Kalra, Mr. Amol Dixit, and Mr. Suyas Malhotra. (Source: 7.Toyota vs Tech Square.pdf, page 11)",
          "content": "2023/DHC/000777 \nC.O. (COMM.IPD-TM) 298/2022 with connected matters                                                     Page 11 of 19 \n \ndown in above judgment that the rectification proceeding under \nsection 57 of the trademarks Act is also altogether quite \ndifferent from the suit of passing off or of opposition \nproceedings before the Registrar. The rectification proceedings \nbefore the board under section 57 of the trademarks Act cannot \nbe equated to be similar with as in the case of passing off action, \nwhere the burden rests on the plaintiff to prove whether there is \nlikelihood of the defendant's goods being passed off as the goods \nof the plaintiff but in rectification proceedings under section 57 \nof the trademarks Act it deals with the power to cancel or vary \nregistration on many grounds and to expunge the trademark from \nthe register is based on different tenets altogether not as in the \ncase suit for passing off, as such the rectification application also \nhas inherent different structure in totality than the suit of passing \noff. \n \n83.  \nTo claim Trans-border reputation for a mark in India, \nthe impugned trademark ‘Hypnos’ must be well known \nsubstantial segment of consumers in India must know about the \nexistence of the mark of the foreign entity. Such knowledge \nmay come from free availability of the product to Indian \nconsumers or extensive advertising, which reaches a \nsubstantial segment of Indian consumers because of extensive \ncirculation of those advertisements in India. \n \n84.  \nAfter going through the pleading and rival contention \nof the parties. We have observed that even assuming the \napplicant's trademark acquired reputation in foreign countries, \nwhere their trade mark is registered, but no presumption can be \ndrawn at this juncture that trade mark of the applicant \nregistered in foreign countries has automatically acquired \nreputation in India or trans-border reputation is percolated in \nIndia, as we have already pointed out that no document of the \napplicant shows of its extensive usage of the mark in India or \nany other place of registration. \n \n85.  \nThe applicant has failed to establish that indeed the \napplicant has trans-border reputation due to its long and \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:03.02.2023 18:01:20\nSignature Not Verified",
          "pdf_source": "7.Toyota vs Tech Square.pdf",
          "nodes": []
        },
        {
          "title": "Page 12",
          "node_id": "0014",
          "start_index": 12,
          "end_index": 12,
          "summary": "According to page 12 of the PDF \"7.Toyota vs Tech Square.pdf\", the court states that the applicant has failed to establish the trans-border reputation of the trademark \"Hypnos\" in India. The onus is on the applicant to produce substantial evidence of extensive use and well-knownness of the mark. The court agrees with the respondent's contention that the applicant must discharge its burden by showing strong grounds for rectification. The court will examine if the petitioner company, Toyota, has produced sufficient evidence to support its contention that the trademark \"ALPHARD\" carries a trans-border reputation in India. (Source: 7.Toyota vs Tech Square.pdf, page 12)",
          "content": "2023/DHC/000777 \nC.O. (COMM.IPD-TM) 298/2022 with connected matters                                                     Page 12 of 19 \n \nextensive use of the impugned trademark in question and the \nimpugned trademark „Hypnos‟ is well known. The applicant has \nfurther failed to establish that the trademark “Hypnos” has \nattained the reputation and goodwill which has spilled over in to \nother countries and India. The substantial segments of consumers \nin India know about the existence of the mark „Hypnos‟ as of the \nforeign entity. \n \n86.  \nIt is well settled proposition that the onus is on the \napplicant applying rectification to establish by letting his \nevidence about the trans-border reputation, so the burden is on \nthe applicant herein, the applicant has to discharge his burden \nby showing extensive use and making out strong ground for \nrectification. The applicant applying for rectification application \nhas to discharge its onus in removing of registered trademark \nfrom register. \n \nxxx  \n \n \n \nxxx   \n \n \n         xxx \n \n88. We have also gone through the authorities submitted by the \nrespondent in support of his contention. We agree with \npropounded proposition in the above citations that the onus is \non the applicant to discharge by producing substantial evidence \nin his support and it is burden on the applicant to establish \nevidence of extensive, long use of its mark and show the well \nknownness, trans-border reputation and making out strong \nground for rectification.” \n \n13. \nIn light of the principles laid down in the aforesaid judgments, it has \nto be examined whether in the present case, the petitioner company has \nproduced sufficient evidence on record in support of its contention that the \ntrade mark „ALPHARD‟ carries a transborder reputation that has spilled \nover in India.   \n14. \nMerely, the international usage of the trade mark „ALPHARD‟ by the \npetitioner company is not sufficient to prove the spillover of its transnational \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:03.02.2023 18:01:20\nSignature Not Verified",
          "pdf_source": "7.Toyota vs Tech Square.pdf",
          "nodes": []
        },
        {
          "title": "Page 13",
          "node_id": "0015",
          "start_index": 13,
          "end_index": 13,
          "summary": "According to page 13 of the PDF \"7.Toyota vs Tech Square.pdf\", the court notes that Toyota Jidosha Kabushiki Kaisha has failed to provide evidence of selling cars under the \"ALPHARD\" brand in India. The trade mark application filed in November 2017 was on a \"proposed to be used basis\". The company has not advertised the brand in India and has not shown that it has acquired goodwill and reputation in the Indian market. The documents provided by Toyota, such as international brochures and trade mark registration certificates, relate to international usage, but do not establish reputation in India. The court also notes that only 15 import shipment records of \"ALPHARD\" cars were found between 2014-2016, and these imports were made by private parties, not Toyota itself. (Source: 7.Toyota vs Tech Square.pdf, page 13)",
          "content": "2023/DHC/000777 \nC.O. (COMM.IPD-TM) 298/2022 with connected matters                                                     Page 13 of 19 \n \nreputation in India.  In the present case, the petitioner company has failed to \nplace on record a single invoice to show that it has sold any car under the \nbrand „ALPHARD‟ in India. In fact, the trade mark application filed on \nbehalf of the petitioner company in November, 2017 was on a „proposed to \nbe used basis‟. It is petitioner company‟s own case that the same model of \nthe car has been launched in India under a different brand name, „Vellfire‟.  \n15. \nIt is also an admitted position that the petitioner company has not \nadvertised the said brand in India in any manner. Various documents placed \non record by the petitioner company such as, international brochures/annual \nreports, awards, worldwide trade mark registration certificates/renewal \ncertificates and promotional material, are in relation to international usage of \nthe aforesaid trade mark. Undoubtedly, these documents show that the trade \nmark „ALPHARD‟ has acquired goodwill and reputation in several other \njurisdictions around the world. However, as per the „territoriality principle‟, \nthe onus is on the petitioner company to show that the trade mark \n„ALPHARD‟ had acquired sufficient goodwill and reputation in the Indian \nmarket also. None of the aforesaid documents filed by the petitioner \ncompany shows that the brand „ALPHARD‟ has acquired goodwill and \nreputation in India. The documents filed by the petitioner company relating \nto India are screenshots from third-party websites showing that a few cars of \nthe petitioner company under the brand „ALPHARD‟ have been listed for \nsale in India. As per the import-export data of India filed on behalf of the \npetitioner company, only fifteen import shipment records have been found \nunder the brand „ALPHARD‟ between the years 2014 to 2016 and not all of \nthem are in respect of vehicles. It may be noted that the aforesaid imports \nhave not been made by the petitioner company itself but by private parties.  \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:03.02.2023 18:01:20\nSignature Not Verified",
          "pdf_source": "7.Toyota vs Tech Square.pdf",
          "nodes": []
        },
        {
          "title": "Page 14",
          "node_id": "0016",
          "start_index": 14,
          "end_index": 14,
          "summary": "According to page 14 of the PDF \"7.Toyota vs Tech Square.pdf\", the petitioner, Toyota Jidosha Kabushiki Kaisha, claimed that their brand \"ALPHARD\" had acquired goodwill and reputation in India. However, the court noted that the vehicle was never launched in India under this brand, and instead was launched as \"Vellfire\" in February 2020. The court cited a previous case, Toyota (supra), where the Supreme Court held that the trade mark \"Prius\" had not acquired goodwill and reputation in India due to limited sales and lack of advertisement. The petitioner's counsel relied on judgments in MAC Personal Care (supra) and Keller Williams Realty (supra) to argue that transborder reputation may have a spillover effect in India. (Source: 7.Toyota vs Tech Square.pdf, page 14)",
          "content": "2023/DHC/000777 \nC.O. (COMM.IPD-TM) 298/2022 with connected matters                                                     Page 14 of 19 \n \n16. \nThe petitioner company has filed certain articles in various \ntrade/automobile magazines and newspaper reports regarding the petitioner \ncompany considering the launch of a vehicle under the brand „ALPHARD‟ \nin India. However, most of these articles are after the trade mark \n„ALPHARD‟ had already been registered by the respondent no.1 in India. It \nis also to be noted that the vehicle under the brand „ALPHARD‟ was never \nlaunched in India. The same model was launched in India in February, 2020 \nunder the brand „Vellfire‟. Therefore, no reliance can be placed on these \narticles to show that the brand „ALPHARD‟ has acquired goodwill and \nreputation in India.  \n17. \nIn Toyota (supra), the „Prius‟ model had been introduced by Toyota in \nthe Indian market in 2009-2010 and there were advertisements in \nautomobile magazines. Despite this, taking note of limited sales of the \nproduct in India and the absence of any advertisement of the product in India \nprior to 2001, the Supreme Court held that the trade mark „Prius‟ cannot be \nsaid to have acquired goodwill and reputation in the Indian market. The \npresent case stands on a worse footing for the petitioner company, as in the \npresent case the petitioner company has neither launched the model under \nthe trade mark „ALPHARD‟ in India nor has advertised the same.  \n18. \nCounsel for the petitioner company has placed reliance on the \njudgments in MAC Personal Care (supra) and Keller Williams Realty \n(supra) in support of his submission that the transborder reputation in respect \nof a trade mark may have a spillover reputation in India as well, despite the \naforesaid brand not having a commercial use in India. In MAC Personal \nCare (supra), the Division Bench enlisted the principles for determining \ninternational reputation. However, the issue of spillover of transnational \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:03.02.2023 18:01:20\nSignature Not Verified",
          "pdf_source": "7.Toyota vs Tech Square.pdf",
          "nodes": []
        },
        {
          "title": "Page 15",
          "node_id": "0017",
          "start_index": 15,
          "end_index": 15,
          "summary": "According to page 15 of the PDF \"7.Toyota vs Tech Square.pdf\", the court discusses the petitioner's claim that the respondent's adoption of the mark \"ALPHARD\" was mala fide. The respondent's counsel cited the dictionary meaning of \"Alphard\" as an orange star in the constellation Hydra, which means \"the solitary one\" in Arabic. The petitioner failed to provide evidence to support their claim of mala fide adoption. The court noted that the judgments relied upon by the petitioner were in the context of passing off actions, not rectification petitions, and were therefore misplaced. The court found that the petitioner had not shown sufficient evidence to prove that the respondent's adoption of the trade mark \"ALPHARD\" was in bad faith. (Source: 7.Toyota vs Tech Square.pdf, page 15)",
          "content": "2023/DHC/000777 \nC.O. (COMM.IPD-TM) 298/2022 with connected matters                                                     Page 15 of 19 \n \nreputation in India was not before the Division Bench. These principles were \nlaid down by the Supreme Court subsequently in Toyota (supra). Both the \naforesaid judgments were in the context of passing off action and not in the \ncontext of rectification petitions. To be noted that in Keller Williams Realty \n(supra), the Co-ordinate Bench of this Court denied the relief of interim \ninjunction in a passing off action. One of the reasons for denial of interim \ninjunction was that the plaintiff therein had been unable to show spillover of \nits reputation and goodwill in India. Therefore, the reliance placed by the \npetitioner company on the aforesaid judgments is misplaced.  \n19. \nAs regards the contention of the petitioner company that the adoption \nof the mark „ALPHARD‟ by the respondent no.1 is mala fide, counsel for \nthe respondent no.1 has drawn the attention of the Court to the dictionary \nmeaning of the word „Alphard‟1.  The word „Alphard‟ has been described in \nthe following manner: \n“an orange star of the second magnitude that is the brightest star \nin the constellation Hydra \nHydra is actually the largest constellation. Despite its size, it has \nonly one bright star named Alphard. It can be found over in the \nsouthwest sky all by itself—hence the name, which in Arabic \nmeans \"the solitary one.” \n \n20. \nExcept for making a bald averment, the petitioner company has failed \nto place any material on record to show that the adoption by the respondent \nno.1 was mala fide. Therefore, on the basis of evidence on record, it cannot \nbe held that the adoption of the trade mark „ALPHARD‟ by the respondent \nno.1 was mala fide or in bad faith. \n                                          \n1 Alphard. 2023. In Merriam-Webster.com. Retrieved on January 13, 2023, from https://www.merriam-\nwebster.com/dictionary/Alphard \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:03.02.2023 18:01:20\nSignature Not Verified",
          "pdf_source": "7.Toyota vs Tech Square.pdf",
          "nodes": []
        },
        {
          "title": "Page 16",
          "node_id": "0018",
          "start_index": 16,
          "end_index": 16,
          "summary": "According to page 16 of the PDF \"7.Toyota vs Tech Square.pdf\", the petitioner, Toyota Jidosha Kabushiki Kaisha, relies on Section 11(1), 11(2), and 11(3) of the Act to argue that the trade mark \"ALPHARD\" should not have been registered in favor of the respondent. The section states that a trade mark shall not be registered if it is identical or similar to an earlier trade mark, and there exists a likelihood of confusion on the part of the public. The petitioner argues that the registration of \"ALPHARD\" would take unfair advantage of or be detrimental to the distinctive character or repute of the earlier trade mark. The judgment was reserved on January 13, 2023, and delivered on February 3, 2023. The case is C.O. (COMM.IPD-TM) 298/2022 with connected matters (2023/DHC/000777).",
          "content": "2023/DHC/000777 \nC.O. (COMM.IPD-TM) 298/2022 with connected matters                                                     Page 16 of 19 \n \n21. \nReliance has been placed by the petitioner company on Section 11(1), \n11(2) and 11(3) of the Act to contend that the trade mark „ALPHARD‟ \nshould not have been granted registration in favour of the respondent no.1 \non account of its identity and similarity with an “earlier trade mark”. To \nappreciate this submission, a reference may be made to the relevant \nprovisions of Section 11 of the Act, which is set out as under: \n“11. Relative grounds for refusal of registration.— (1) Save as \nprovided in section 12, a trade mark shall not be registered if, \nbecause of— \n \n(a) \n its identity with an earlier trade mark and similarity of \ngoods or services covered by the trade mark; or \n \n(b)  \nits similarity to an earlier trade mark and the identity or \nsimilarity of the goods or services covered by the trade mark,  \n \nthere exists a likelihood of confusion on the part of the public, \nwhich includes the likelihood of association with the earlier trade \nmark. \n \n(2)  \nA trade mark which— \n \n(a)  \nis identical with or similar to an earlier trade mark; and \n \n(b)  \nis to be registered for goods or services which are not \nsimilar to those for which the earlier trade mark is registered in \nthe name of a different proprietor,  \n \nshall not be registered, if or to the extent, the earlier trade mark \nis a well-known trade mark in India and the use of the later mark \nwithout due cause would take unfair advantage of or be \ndetrimental to the distinctive character or repute of the earlier \ntrade mark. \n \n(3)  \nA trade mark shall not be registered if, or to the extent \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:03.02.2023 18:01:20\nSignature Not Verified",
          "pdf_source": "7.Toyota vs Tech Square.pdf",
          "nodes": []
        },
        {
          "title": "Page 17",
          "node_id": "0019",
          "start_index": 17,
          "end_index": 17,
          "summary": "According to page 17 of the PDF \"7.Toyota vs Tech Square.pdf\", the court discusses Section 11 of the Act, which pertains to the protection of earlier trade marks. The Explanation to Section 11 states that the phrase \"earlier trade mark\" applies only to registered trade marks. Since the petitioner company, Toyota Jidousha Kabushiki Kaisha, did not have a registered trade mark in India at the time of the respondent's registration, they cannot benefit from sub-Sections (1) and (2) of Section 11. The judgment was reserved on January 13, 2023, and delivered on February 3, 2023, in the High Court of Delhi. The case is C.O. (COMM.IPD-TM) 298/2022. (Source: 7.Toyota vs Tech Square.pdf, page 17)",
          "content": "2023/DHC/000777 \nC.O. (COMM.IPD-TM) 298/2022 with connected matters                                                     Page 17 of 19 \n \nthat, its use in India is liable to be prevented— \n \n(a)  \nby virtue of any law in particular the law of passing off \nprotecting an unregistered trade mark used in the course of \ntrade; or \n \n(b)  \nby virtue of law of copyright. \n \n(4)  \nNothing in this section shall prevent the registration of a \ntrade mark where the proprietor of the earlier trade mark or \nother earlier right consents to the registration, and in such case \nthe Registrar may register the mark under special circumstances \nunder section 12.  \n \nExplanation.—For the purposes of this section, earlier trade \nmark means— \n \n(a)  \na registered trade mark or an application under Section \n18 bearing an earlier date of filing or an international \nregistration referred to in Section 36E or convention application \nreferred to in section 154 which has a date of application earlier \nthan that of the trade mark in question, taking account, where \nappropriate, of the priorities claimed in respect of the trade \nmarks; \n \n(b) a trade mark which, on the date of the application for \nregistration of the trade mark in question, or where \nappropriate, of the priority claimed in respect of the application, \nwas entitled to protection as a well-known trade mark.” \n \n22. \nThe Explanation to Section 11 of the Act as set out above makes it \nclear that for the purposes of Section 11 of the Act, the phrase „earlier trade \nmark‟ would apply only in respect of a registered trade mark. Admittedly, \nthe trade mark of the petitioner company was not registered in India at the \ntime registration was granted in favour of the respondent no.1. Therefore, \nthe petitioner company cannot take benefit of sub-Sections (1) and (2) of \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:03.02.2023 18:01:20\nSignature Not Verified",
          "pdf_source": "7.Toyota vs Tech Square.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0023",
      "start_index": 18,
      "end_index": 19,
      "summary": "According to the PDF document \"Toyota vs Tech Square.pdf\", the High Court of Delhi at New Delhi delivered a judgment on February 3, 2023, in the case of Toyota Jidosha Kabushiki Kaisha vs Tech Square Engineering. The court dismissed the rectification petition filed by Toyota, seeking to cancel the registration of the trade mark \"ALPHARD\" in Classes 9, 12, and 27 in favor of Tech Square Engineering.\n\nThe court held that Toyota failed to establish its goodwill and reputation in India in respect of the trade mark \"ALPHARD\". The court noted that Toyota did not provide sufficient evidence to show extensive use of the brand \"ALPHARD\" in India or that it had acquired a transborder reputation in the country. The court also observed that Tech Square Engineering had registered the trade mark on a \"proposed to be used basis\", which is permissible under Section 18 of the Act.\n\nThe court rejected Toyota's argument that Tech Square Engineering had failed to provide evidence of its use of the trade mark \"ALPHARD\". The court noted that Tech Square Engineering had placed on record various photographs of its products bearing the trade mark \"ALPHARD\" and invoices showing sales of products under the trade mark.\n\nIn conclusion, the court dismissed the rectification petition filed by Toyota, holding that it had failed to make out any ground for rectification of the trade mark \"ALPHARD\" registered in favor of Tech Square Engineering. The judgment was delivered by Justice Amit Bansal on February 3, 2023, as stated in the PDF document \"2023/DHC/000777 C.O. (COMM.IPD-TM) 298/2022 with connected matters\".",
      "pdf_source": "7.Toyota vs Tech Square.pdf",
      "nodes": [
        {
          "title": "Page 18",
          "node_id": "0021",
          "start_index": 18,
          "end_index": 18,
          "summary": "According to page 18 of the PDF \"7.Toyota vs Tech Square.pdf\", the court ruled that Toyota Jidosha Kabushiki Kaisha failed to establish goodwill and reputation in India for the trademark \"ALPHARD\". The respondent, Tech Square, had registered the trademark on a \"proposed to be used basis\" under Section 18 of the Act, which makes user on the date of registration irrelevant. The respondent provided evidence of use, including invoices and photographs of products bearing the trademark. The petitioner, Toyota, failed to discharge the onus to show reputation and goodwill of the mark \"ALPHARD\" in India, with limited sales and use of the brand. The judgment was delivered on February 3, 2023, in the High Court of Delhi at New Delhi, in the case C.O. (COMM.IPD-TM) 298/2022.",
          "content": "2023/DHC/000777 \nC.O. (COMM.IPD-TM) 298/2022 with connected matters                                                     Page 18 of 19 \n \nSection 11 of the Act. Even the ground of passing off under sub-Section (3) \nof Section 11 of the Act would not be available to the petitioner company as \nit has failed to make out a case of having goodwill and reputation in India in \nrespect of the trade mark „ALPHARD‟.  \n23. \nCounsel for the petitioner company contends that the respondent no.1 \nhas failed to provide any evidence in respect of its use of the trade mark \n„ALPHARD‟. The various invoices filed by respondent no.1 to show the \nuser of the aforesaid trade mark is by another entity, „Tekstar Global Private \nLimited‟. In this regard, it may be noted that in the present case, registration \nhas been obtained by the respondent no.1 on a „proposed to be used basis‟, \nwhich is permissible under Section 18 of the Act. Therefore, user on the date \nof registration would not be a relevant factor. The respondent no.1 has \nplaced on record various photographs of its products bearing the trade mark \n„ALPHARD‟ as also invoices of its sister company, „Tekstar Global Private \nLimited‟ from 12th May, 2015 to 1st June, 2018 showing sales of products \nunder the trade mark „ALPHARD‟. Therefore, based on the material on \nrecord, it cannot be established that the respondent no.1 has registered the \ntrade mark without any bona fide intention to use the same.  \n24. \nIn view of the above, the petitioner company has completely failed to \ndischarge the onus to show the reputation and goodwill of the mark \n„ALPHARD‟ in India. In fact, it is not even the case of the petitioner \ncompany that it is dealing in products under Class 9 and Class 27 anywhere \nin the world. The documents placed on record by the petitioner company do \nnot reflect extensive use of the brand „ALPHARD‟ or establish that the \nbrand „ALPHARD‟ has acquired a transborder reputation in India in Classes \n9, 12 and 27. The evidence on record shows very limited sales and use of the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:03.02.2023 18:01:20\nSignature Not Verified",
          "pdf_source": "7.Toyota vs Tech Square.pdf",
          "nodes": []
        },
        {
          "title": "Page 19",
          "node_id": "0022",
          "start_index": 19,
          "end_index": 19,
          "summary": "According to page 19 of the PDF \"7.Toyota vs Tech Square.pdf\", the court ruled in favor of the respondent, dismissing the rectification petitions filed by Toyota Jidosha Kabushiki Kaisha. The court stated that the petitioner company failed to prove that a substantial number of consumers in India know about the existence of the brand \"ALPHARD\". The judgment was delivered by Amit Bansal, J. on February 3, 2023. The case number is C.O. (COMM.IPD-TM) 298/2022 with connected matters. The petitioner was represented by advocates Mr. Peeyoosh Kalra, Mr. Amol Dixit, and Mr. Suyas Malhotra. The court found no merit in the petitions and dismissed them. (Source: 7.Toyota vs Tech Square.pdf, page 19)",
          "content": "2023/DHC/000777 \nC.O. (COMM.IPD-TM) 298/2022 with connected matters                                                     Page 19 of 19 \n \nproduct in the Indian market and that too by private parties. No \nadvertisements have been made by the petitioner company in India. It cannot \nbe stated that a substantial number of consumers in India know about the \nexistence of the brand „ALPHARD‟.  \n25. \nTherefore, in my considered view, the petitioner company has failed \nto make out any ground for rectification of the trade mark „ALPHARD‟ \nregistered in Classes 9, 12 and 27 in the favour of the respondent no.1. I find \nno merit in the present rectification petitions filed on behalf of the petitioner \ncompany. Dismissed.  \n \n \nAMIT BANSAL, J. \nFEBRUARY 03, 2023 \ndk \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:03.02.2023 18:01:20\nSignature Not Verified",
          "pdf_source": "7.Toyota vs Tech Square.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-15T18:32:16.908219",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}