{
  "doc_name": "8. NRI Taxi vs Registrar",
  "pdf_source": "8. NRI Taxi vs Registrar.pdf",
  "metadata": {
    "document_name": "8. NRI Taxi vs Registrar",
    "source_pdf": "8. NRI Taxi vs Registrar.pdf",
    "judges": [
      "AMIT BANSAL"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "114/2022",
      "114/2022",
      "114/2022",
      "114/2022",
      "114/2022",
      "114/2022",
      "114/2022",
      "6209/2022"
    ],
    "dhc_numbers": [
      "2023/DHC/000578",
      "2023/DHC/000578",
      "2023/DHC/000578",
      "2023/DHC/000578",
      "2023/DHC/000578"
    ],
    "ia_numbers": [],
    "decision_date": "25 January, 2023",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [],
    "defendants": [],
    "appellants": [
      "NRI Taxi Service Pvt. Ltd."
    ],
    "respondents": [
      "Registrar of Trade Marks, Delhi"
    ],
    "plaintiff_advocates": [],
    "defendant_advocates": [],
    "appellant_advocates": [
      "Dr. Amit George",
      "Mr. Rishabh Dheer",
      "Ms. Manmeet Kaur Sareen"
    ],
    "respondent_advocates": [
      "Mr. Harish Vaidyanathan Shankar",
      "Mr. Srish Kumar Mishra",
      "Mr. Sagar Mehlawat",
      "Mr. Alexander Mathai Paikaday"
    ],
    "damages_claimed": null,
    "damages_awarded": null,
    "key_issues": [
      "The appellant's trademark application was rejected under Section 9(1)(b) of the Trade Marks Act, 1999, for being laudatory and objectionable.",
      "The subject trademark is a device mark that was applied for registration in Class 39, and the appellant claims it is a unique combination of words and therefore distinctive.",
      "The appellant argues that exclusivity is being claimed on the subject trademark as a whole, and not on any of the descriptive elements of the mark.",
      "The Trademark Registry raised an objection under Section 9(1)(b) of the Act, which the appellant replied to with detailed submissions.",
      "The appellant places reliance on the judgment of the Division Bench in Mohd. Rafiq v. Modi Sugar Mills Ltd. to support their claim that the subject trademark is not laudatory.",
      "The court must consider whether the subject trademark is indeed laudatory and objectionable, and whether the appellant's submissions and evidence are sufficient to overcome the objection.",
      "The case involves an appeal under Section 91 of the Trade Marks Act, 1999, against the order of the Senior Examiner of Trade Marks, Delhi.",
      "The court must analyze the provisions of the Trade Marks Act, 1999, particularly Section 9(1)(b), to determine the validity of the appellant's trademark application.",
      "The appellant's claim of distinctiveness and the lack of exclusivity on descriptive elements must be evaluated in light of the statutory provisions and relevant case law."
    ],
    "decision_summary": "**Case Summary: NRI Taxi Service Pvt. Ltd. vs. Registrar of Trade Marks, Delhi**\n\n**Background:**\nThe appellant, NRI Taxi Service Pvt. Ltd., filed a trademark registration application (No. 3547956) on May 12, 2017, for a device mark (not explicitly described in the provided text) in Class 39. The application was rejected by the Senior Examiner of Trade Marks, Delhi, on August 5, 2020, under Section 9(1)(b) of the Trade Marks Act, 1999, citing that the mark is laudatory and objectionable.\n\n**Legal Issues:**\nThe primary issue in this case is whether the subject trademark is laudatory and thus unregistrable under Section 9(1)(b) of the Trade Marks Act, 1999. Section 9(1)(b) states that a trademark shall not be registered if it is devoid of any distinctive character or if it consists exclusively of marks or indications that may serve, in trade, to designate the kind, quality, quantity, intended purpose, value, or geographical origin of the goods or services, or other characteristics of the goods or services.\n\n**Arguments:**\nThe appellant argued that the subject trademark is not laudatory and that the combination of words makes it distinctive. The appellant claimed exclusivity on the subject trademark as a whole and not on any descriptive elements separately. The appellant's counsel relied on the judgment in Mohd. Rafiq v. Modi Sugar Mills Ltd. (1971) to support the argument that the mark is not laudatory.\n\n**Court Findings:**\nThe Hon'ble Mr. Justice Amit Bansal heard the counsels for the parties and perused the record. The court agreed with the appellant's submission that there is nothing laudatory about the subject trademark. The court noted that the impugned order did not provide reasons or justifications for why the trademark was considered laudatory.\n\n**Decision:**\nThe court's decision is not explicitly stated in the provided text, but based on the analysis and findings, it appears that the court is inclined to set aside the order of the Senior Examiner of Trade Marks, Delhi, and allow the registration of the subject trademark. The court's agreement with the appellant's argument and its reference to the judgment in Mohd. Rafiq suggest that the court does not consider the subject trademark to be laudatory and therefore registrable.\n\n**Conclusion:**\nIn conclusion, the case of NRI Taxi Service Pvt. Ltd. vs. Registrar of Trade Marks, Delhi, revolves around the registrability of a trademark under the Trade Marks Act, 1999. The appellant successfully argued that the subject trademark is not laudatory, and the court, based on the provided findings, seems to have accepted this argument, potentially paving the way for the registration of the trademark. However, the exact decision and its implications for trademark law in India would depend on the full judgment, which is not provided here.",
    "legal_precedents": [
      "Rafiq Modi Sugar Mills Ltd"
    ],
    "full_text": "\n--- PAGE 1 ---\n                                       2023/DHC/000578 \nC.A.(COMM.IPD-TM) 114/2022                                                                                                                         Page 1 of 5 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n% \n \n \n \n                 Date of decision: 25th January, 2023. \n \n+  \n \n \nC.A.(COMM.IPD-TM) 114/2022   \n \n \nNRI TAXI SERVICE PVT. LTD. \n \n \n..... Appellant \nThrough: \nDr. Amit George with Mr. Rishabh \nDheer and Ms. Manmeet Kaur \nSareen, Advocates. \n \n \n \n \n \nversus \n \n \nREGISTRAR OF TRADE MARKS, DELHI \n..... Respondent \nThrough: \nMr. Harish Vaidyanathan Shankar, \nCGSC with Mr. Srish Kumar Mishra, \nMr. \nSagar \nMehlawat \nand \nMr.Alexander \nMathai \nPaikaday, \nAdvocates. \n \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \n \n \n \n \nJUDGMENT \nAMIT BANSAL, J. (Oral) \n \nI.A. 6209/2022 (for exemption) \n1. \nSubject to the appellant filing the original/certified/translated copies \nof any documents on which the appellant may seek to place reliance, within \nfour weeks from today, exemption is granted for the present. \n2. \nThe application is disposed of. \nC.A.(COMM.IPD-TM) 114/2022  \n3. \nThe present appeal filed by the appellant under Section 91 of the \nTrade Marks Act, 1999 impugns the order dated 5th August, 2020 passed by \nSigned By:SAKSHI\nRAMOLA\nSigning Date:01.26.2023\n21:41:13\nSignature Not Verified\n\n--- PAGE 2 ---\n                                       2023/DHC/000578 \nC.A.(COMM.IPD-TM) 114/2022                                                                                                                         Page 2 of 5 \n \nthe Senior Examiner of Trade Marks, Delhi whereby the trademark \napplication of the applicant bearing no.3547956 for registration of the device \nmark '\n' (hereinafter ‘subject trademark’) in Class 39 has been \nrejected on the ground that the subject trademark is laudatory and \nobjectionable in terms of Section 9(1)(b) of the Trade Marks Act, 1999 \n(hereinafter referred to as ‘the Act’).  \n4. \nThe details of the appellant’s trade mark application are as under: \nMark \nApplication \nno. \nApplication \nDate \nClass \nApplicant \n \n \n \n3547956 \n12.05.2017 \n39 \nNRI TAXI \nSERVICE \nPRIVATE \nLIMITED \n \nBRIEF FACTS \n5. \nBrief facts necessary for deciding the present appeal are as follows: \ni. \nOn 12th May, 2017, the appellant filed a trademark registration \napplication for registration of the subject trademark in class 39. \nii. \nOn 21st June, 2017, an Examination Report was sent by the \nTrademark Registry raising objection under Section 9(1)(b) of the \nAct. \niii. \nOn 13th July, 2017, the appellant filed a reply to the aforesaid \nExamination Report giving detailed submissions stating that, inter \nSigned By:SAKSHI\nRAMOLA\nSigning Date:01.26.2023\n21:41:13\nSignature Not Verified\n\n--- PAGE 3 ---\n                                       2023/DHC/000578 \nC.A.(COMM.IPD-TM) 114/2022                                                                                                                         Page 3 of 5 \n \nalia, the subject trademark is a unique combination of words and is \ntherefore, distinctive. \niv. \nIt was further stated that exclusivity was being claimed on the subject \ntrademark as a whole and no exclusive proprietorship was being \nclaimed on any of the descriptive elements of the mark. \nv. \nOn 5th October, 2019, a hearing notice was sent to the appellant and \nthe hearing took place on 4th December, 2019. On 29th November, \n2019, the appellant filed additional documents for the hearing. \nvi. \nVide impugned order dated 5th August, 2020, the appellant’s \napplication for registration of the subject trademark was rejected. \n6. \nCounsel appearing on behalf of the appellant submits that the subject \ntrademark cannot by any stretch of imagination be termed as laudatory. He \nplaces reliance on the judgment of the Division Bench in Mohd. Rafiq v. \nModi Sugar Mills Ltd., 1971 SCC OnLine Del 190. \nANALYSIS AND FINDINGS \n7. \nI have heard the counsels for the parties and perused the record. \n8. \nI am in agreement with the submission of the appellant that there is \nnothing laudatory about the subject trademark. In any event, no reasons or \njustifications have been given in the impugned order as to how the aforesaid \ntrademark amounts to being laudatory. \n9. \nCounsel for the appellant has correctly placed reliance on the \njudgment in Mohd. Rafiq (supra), the relevant observations of which are set \nout below: \n“We are unable to accede to the contention that the word “SUN” \nused in respect of the lanterns manufactured by the respondent is a \nlaudatory term having reference to the character and quality of those \nSigned By:SAKSHI\nRAMOLA\nSigning Date:01.26.2023\n21:41:13\nSignature Not Verified\n\n--- PAGE 4 ---\n                                       2023/DHC/000578 \nC.A.(COMM.IPD-TM) 114/2022                                                                                                                         Page 4 of 5 \n \nlanterns. It is no doubt true that the rays of sun dispel darkness and \nlanterns too are used for dispelling darkness, it does not follow from \nthat that the use of trade mark “SUN” for the lanterns has reference \nto the character and quality, of those lanterns. The reference to the \ncharacter and quality, in our opinion, should be direct and plain and \nnot remote and far-fetched. Likewise, the word, which is sought to be \nconstrued as laudatory, should have obvious significant of praise, and \nnot one out of which an inference of praise has to be spelt out by a \nlaboured process. Sun is the body which is the gravitational centre \nand source of light and heat to our planetary system. The element of \npraise is neither self evident in the word “SUN” nor can the said \nword be considered to be descriptive of the character or quality of the \nlanterns. A contrary view must necessarily result in stretching the \nconnotation of the word “sun” to limits which, in our opinion, are \nimpermissible. We, therefore, find it difficult to hold that the word \n“sun” is inherently incapable of being distinctive of the lanterns \nmanufactured by the respondent. In the matter of The Eastmen \nPhotographic Materials Company, Limited and The Comptroller-\nGeneral of Patents, Designs and Trade Marks, 1898 A.C. 571 (5), the \nHouse of Lords held that the word “Solio” when used in respect of \nphotographic paper was capable of registration as a trade mark. The \ncontention that the word indicated the character or quality of the \ngoods was repelled.” \n \n  \n10. \nThe subject trademark in the present case is a device mark, which is \nsought to be registered as a whole. The subject trademark is not a word mark \nsimpliciter but a stylized device containing the text 'NRI Taxi' overlayed on \na blue background with a partial outline of a side profile of a car. The same \nis required to be assessed as a whole. Further, the subject trademark is \nneither descriptive nor generic in respect of the services it is being used for.  \n11. \nIn view of the above, the impugned order dated 5th August, 2022 \nrefusing registration of the Trademark Application No.3547956 is \nunsustainable and is accordingly, set aside. \nSigned By:SAKSHI\nRAMOLA\nSigning Date:01.26.2023\n21:41:13\nSignature Not Verified\n\n--- PAGE 5 ---\n                                       2023/DHC/000578 \nC.A.(COMM.IPD-TM) 114/2022                                                                                                                         Page 5 of 5 \n \n12. \nThe appellant has already given his disclaimer with regard to using \nthe individual components of the subject trademark. The appellant will not \nclaim any rights over the individual components of the trademark i.e., ‘NRI’ \nand ‘TAXI’. \n13. \nThe Registrar of Trade Marks is accordingly directed to proceed for \nregistration of the application. Let the same be advertised within a period of \nthree months. \n14. \nIf there is any opposition to the said application, the same shall be \ndecided on its own merits without being affected by the observations made \nherein. \n15. \nAccordingly, the appeal along with all pending applications is \ndisposed of.  \n16. \nRegistry to supply a copy of the present order to Trade Mark Registry \nat llc-ipo@gov.in for compliance.  \n \n \n \nAMIT BANSAL, J. \nJANUARY 25, 2023 \nat \nSigned By:SAKSHI\nRAMOLA\nSigning Date:01.26.2023\n21:41:13\nSignature Not Verified\n"
  },
  "total_pages": 5,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0002",
      "start_index": 1,
      "end_index": 1,
      "summary": "According to the provided PDF document, \"8. NRI Taxi vs Registrar.pdf,\" a legal proceeding took place in the High Court of Delhi at New Delhi. The case, C.A.(COMM.IPD-TM) 114/2022, involved NRI Taxi Service Pvt. Ltd. as the appellant and the Registrar of Trade Marks, Delhi, as the respondent. \n\nThe decision was made on January 25, 2023. The appellant was represented by Dr. Amit George, Mr. Rishabh Dheer, and Ms. Manmeet Kaur Sareen, while the respondent was represented by Mr. Harish Vaidyanathan Shankar, Mr. Srish Kumar Mishra, Mr. Sagar Mehlawat, and Mr. Alexander Mathai Paikaday.\n\nThe appeal was filed under Section 91 of the Trade Marks Act, 1999, against an order dated August 5, 2020, passed by the Registrar of Trade Marks. The court granted exemption to the appellant, subject to filing original or certified copies of documents within four weeks. The application was disposed of, and the appeal is currently pending.\n\nKey details from the PDF document include:\n- Case number: C.A.(COMM.IPD-TM) 114/2022\n- Date of decision: January 25, 2023\n- Appellant: NRI Taxi Service Pvt. Ltd.\n- Respondent: Registrar of Trade Marks, Delhi\n- Representatives: Dr. Amit George, Mr. Rishabh Dheer, Ms. Manmeet Kaur Sareen (appellant); Mr. Harish Vaidyanathan Shankar, Mr. Srish Kumar Mishra, Mr. Sagar Mehlawat, and Mr. Alexander Mathai Paikaday (respondent)\n- Relevant legislation: Trade Marks Act, 1999 (Section 91)",
      "pdf_source": "8. NRI Taxi vs Registrar.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "According to page 1 of the PDF \"8. NRI Taxi vs Registrar.pdf\", a court case (C.A.(COMM.IPD-TM) 114/2022) was heard in the High Court of Delhi at New Delhi. The appellant, NRI Taxi Service Pvt. Ltd., was represented by Dr. Amit George and others, while the respondent, Registrar of Trade Marks, Delhi, was represented by Mr. Harish Vaidyanathan Shankar and others. The judgment was delivered by Hon'ble Mr. Justice Amit Bansal on January 25, 2023. The appeal was filed under Section 91 of the Trade Marks Act, 1999, against an order dated August 5, 2020. An application (I.A. 6209/2022) for exemption was granted, subject to the appellant filing certain documents within four weeks. The application was disposed of, and the appeal proceeds. (Source: 8. NRI Taxi vs Registrar.pdf, page 1)",
          "content": "2023/DHC/000578 \nC.A.(COMM.IPD-TM) 114/2022                                                                                                                         Page 1 of 5 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n% \n \n \n \n                 Date of decision: 25th January, 2023. \n \n+  \n \n \nC.A.(COMM.IPD-TM) 114/2022   \n \n \nNRI TAXI SERVICE PVT. LTD. \n \n \n..... Appellant \nThrough: \nDr. Amit George with Mr. Rishabh \nDheer and Ms. Manmeet Kaur \nSareen, Advocates. \n \n \n \n \n \nversus \n \n \nREGISTRAR OF TRADE MARKS, DELHI \n..... Respondent \nThrough: \nMr. Harish Vaidyanathan Shankar, \nCGSC with Mr. Srish Kumar Mishra, \nMr. \nSagar \nMehlawat \nand \nMr.Alexander \nMathai \nPaikaday, \nAdvocates. \n \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \n \n \n \n \nJUDGMENT \nAMIT BANSAL, J. (Oral) \n \nI.A. 6209/2022 (for exemption) \n1. \nSubject to the appellant filing the original/certified/translated copies \nof any documents on which the appellant may seek to place reliance, within \nfour weeks from today, exemption is granted for the present. \n2. \nThe application is disposed of. \nC.A.(COMM.IPD-TM) 114/2022  \n3. \nThe present appeal filed by the appellant under Section 91 of the \nTrade Marks Act, 1999 impugns the order dated 5th August, 2020 passed by \nSigned By:SAKSHI\nRAMOLA\nSigning Date:01.26.2023\n21:41:13\nSignature Not Verified",
          "pdf_source": "8. NRI Taxi vs Registrar.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Facts and Arguments",
      "node_id": "0006",
      "start_index": 2,
      "end_index": 4,
      "summary": "According to the provided PDF document, \"NRI Taxi vs Registrar.pdf\", the High Court of Delhi at New Delhi heard a case (C.A.(COMM.IPD-TM) 114/2022) between NRI Taxi Service Pvt. Ltd. (Appellant) and the Registrar of Trade Marks (Respondent). The Appellant's trademark application (no. 3547956) for the mark '' in Class 39 was rejected by the Senior Examiner of Trade Marks, Delhi, on the grounds that it is laudatory and objectionable under Section 9(1)(b) of the Trade Marks Act, 1999.\n\nThe Appellant filed the trademark registration application on May 12, 2017. The Trademark Registry raised objections under Section 9(1)(b) of the Act on June 21, 2017. The Appellant replied to the Examination Report on July 13, 2017, stating that the subject trademark is a unique combination of words and is therefore distinctive.\n\nThe Court heard the Appeal on January 25, 2023, and analyzed the submissions. The Counsel for the Appellant argued that the subject trademark is not laudatory, relying on the judgment in Mohd. Rafiq v. Modi Sugar Mills Ltd. (1971). The Court found that there is nothing laudatory about the subject trademark and that the impugned order did not provide reasons for its rejection.\n\nSource: NRI Taxi vs Registrar.pdf (2023/DHC/000578, C.A.(COMM.IPD-TM) 114/2022)",
      "pdf_source": "8. NRI Taxi vs Registrar.pdf",
      "nodes": [
        {
          "title": "Page 2",
          "node_id": "0003",
          "start_index": 2,
          "end_index": 2,
          "summary": "According to page 2 of the PDF \"8. NRI Taxi vs Registrar.pdf\", the Senior Examiner of Trade Marks, Delhi rejected the trademark application of NRI Taxi Service Pvt. Ltd. (Appellant) bearing no. 3547956 for registration of a device mark in Class 39. The rejection was based on the ground that the subject trademark is laudatory and objectionable under Section 9(1)(b) of the Trade Marks Act, 1999. \n\nThe application details are: \n- Mark: Device mark\n- Application no.: 3547956\n- Application Date: 12.05.2017\n- Class: 39\n- Applicant: NRI Taxi Service Private Limited\n\nKey dates include: \n- 12th May, 2017: Trademark registration application filed\n- 21st June, 2017: Examination Report sent by the Trademark Registry\n- 13th July, 2017: Appellant's reply to the Examination Report filed \n\nSource: 8. NRI Taxi vs Registrar.pdf, Page 2.",
          "content": "2023/DHC/000578 \nC.A.(COMM.IPD-TM) 114/2022                                                                                                                         Page 2 of 5 \n \nthe Senior Examiner of Trade Marks, Delhi whereby the trademark \napplication of the applicant bearing no.3547956 for registration of the device \nmark '\n' (hereinafter ‘subject trademark’) in Class 39 has been \nrejected on the ground that the subject trademark is laudatory and \nobjectionable in terms of Section 9(1)(b) of the Trade Marks Act, 1999 \n(hereinafter referred to as ‘the Act’).  \n4. \nThe details of the appellant’s trade mark application are as under: \nMark \nApplication \nno. \nApplication \nDate \nClass \nApplicant \n \n \n \n3547956 \n12.05.2017 \n39 \nNRI TAXI \nSERVICE \nPRIVATE \nLIMITED \n \nBRIEF FACTS \n5. \nBrief facts necessary for deciding the present appeal are as follows: \ni. \nOn 12th May, 2017, the appellant filed a trademark registration \napplication for registration of the subject trademark in class 39. \nii. \nOn 21st June, 2017, an Examination Report was sent by the \nTrademark Registry raising objection under Section 9(1)(b) of the \nAct. \niii. \nOn 13th July, 2017, the appellant filed a reply to the aforesaid \nExamination Report giving detailed submissions stating that, inter \nSigned By:SAKSHI\nRAMOLA\nSigning Date:01.26.2023\n21:41:13\nSignature Not Verified",
          "pdf_source": "8. NRI Taxi vs Registrar.pdf",
          "nodes": []
        },
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "According to page 3 of the PDF \"8. NRI Taxi vs Registrar.pdf\", the appellant, NRI Taxi Service Pvt. Ltd., claims that their trademark is distinctive and not laudatory. The counsel for the appellant relies on the judgment in Mohd. Rafiq v. Modi Sugar Mills Ltd. (1971) to support this claim. The court agrees with the appellant, stating that there is nothing laudatory about the trademark and that no reasons were given in the impugned order to justify this claim. Key dates mentioned include October 5, 2019, when a hearing notice was sent, and August 5, 2020, when the appellant's application for registration was rejected. The case is C.A.(COMM.IPD-TM) 114/2022, and the decision was made on January 25, 2023. (Source: 8. NRI Taxi vs Registrar.pdf, page 3)",
          "content": "2023/DHC/000578 \nC.A.(COMM.IPD-TM) 114/2022                                                                                                                         Page 3 of 5 \n \nalia, the subject trademark is a unique combination of words and is \ntherefore, distinctive. \niv. \nIt was further stated that exclusivity was being claimed on the subject \ntrademark as a whole and no exclusive proprietorship was being \nclaimed on any of the descriptive elements of the mark. \nv. \nOn 5th October, 2019, a hearing notice was sent to the appellant and \nthe hearing took place on 4th December, 2019. On 29th November, \n2019, the appellant filed additional documents for the hearing. \nvi. \nVide impugned order dated 5th August, 2020, the appellant’s \napplication for registration of the subject trademark was rejected. \n6. \nCounsel appearing on behalf of the appellant submits that the subject \ntrademark cannot by any stretch of imagination be termed as laudatory. He \nplaces reliance on the judgment of the Division Bench in Mohd. Rafiq v. \nModi Sugar Mills Ltd., 1971 SCC OnLine Del 190. \nANALYSIS AND FINDINGS \n7. \nI have heard the counsels for the parties and perused the record. \n8. \nI am in agreement with the submission of the appellant that there is \nnothing laudatory about the subject trademark. In any event, no reasons or \njustifications have been given in the impugned order as to how the aforesaid \ntrademark amounts to being laudatory. \n9. \nCounsel for the appellant has correctly placed reliance on the \njudgment in Mohd. Rafiq (supra), the relevant observations of which are set \nout below: \n“We are unable to accede to the contention that the word “SUN” \nused in respect of the lanterns manufactured by the respondent is a \nlaudatory term having reference to the character and quality of those \nSigned By:SAKSHI\nRAMOLA\nSigning Date:01.26.2023\n21:41:13\nSignature Not Verified",
          "pdf_source": "8. NRI Taxi vs Registrar.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "According to page 4 of the PDF \"8. NRI Taxi vs Registrar.pdf\", the court discusses the registrability of a trademark. The case, C.A.(COMM.IPD-TM) 114/2022, involves NRI Taxi Service Pvt. Ltd. as the appellant. The court cites a precedent from 1898, where the House of Lords held that the word \"Solio\" could be registered as a trademark for photographic paper. The court concludes that the subject trademark, a device mark containing the text 'NRI Taxi' with a car outline, is not descriptive or generic and should be assessed as a whole. The impugned order dated August 5, 2022, refusing registration of the trademark, is set aside. The decision was made on January 25, 2023, and signed by Sakshi Ramola on January 26, 2023. (Source: 8. NRI Taxi vs Registrar.pdf, page 4)",
          "content": "2023/DHC/000578 \nC.A.(COMM.IPD-TM) 114/2022                                                                                                                         Page 4 of 5 \n \nlanterns. It is no doubt true that the rays of sun dispel darkness and \nlanterns too are used for dispelling darkness, it does not follow from \nthat that the use of trade mark “SUN” for the lanterns has reference \nto the character and quality, of those lanterns. The reference to the \ncharacter and quality, in our opinion, should be direct and plain and \nnot remote and far-fetched. Likewise, the word, which is sought to be \nconstrued as laudatory, should have obvious significant of praise, and \nnot one out of which an inference of praise has to be spelt out by a \nlaboured process. Sun is the body which is the gravitational centre \nand source of light and heat to our planetary system. The element of \npraise is neither self evident in the word “SUN” nor can the said \nword be considered to be descriptive of the character or quality of the \nlanterns. A contrary view must necessarily result in stretching the \nconnotation of the word “sun” to limits which, in our opinion, are \nimpermissible. We, therefore, find it difficult to hold that the word \n“sun” is inherently incapable of being distinctive of the lanterns \nmanufactured by the respondent. In the matter of The Eastmen \nPhotographic Materials Company, Limited and The Comptroller-\nGeneral of Patents, Designs and Trade Marks, 1898 A.C. 571 (5), the \nHouse of Lords held that the word “Solio” when used in respect of \nphotographic paper was capable of registration as a trade mark. The \ncontention that the word indicated the character or quality of the \ngoods was repelled.” \n \n  \n10. \nThe subject trademark in the present case is a device mark, which is \nsought to be registered as a whole. The subject trademark is not a word mark \nsimpliciter but a stylized device containing the text 'NRI Taxi' overlayed on \na blue background with a partial outline of a side profile of a car. The same \nis required to be assessed as a whole. Further, the subject trademark is \nneither descriptive nor generic in respect of the services it is being used for.  \n11. \nIn view of the above, the impugned order dated 5th August, 2022 \nrefusing registration of the Trademark Application No.3547956 is \nunsustainable and is accordingly, set aside. \nSigned By:SAKSHI\nRAMOLA\nSigning Date:01.26.2023\n21:41:13\nSignature Not Verified",
          "pdf_source": "8. NRI Taxi vs Registrar.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Decision and Orders",
      "node_id": "0008",
      "start_index": 5,
      "end_index": 5,
      "summary": "According to the PDF document \"NRI Taxi vs Registrar.pdf\", a legal proceeding was held in the High Court of Delhi at New Delhi. The case number is C.A.(COMM.IPD-TM) 114/2022, and the decision was made on January 25, 2023. The appellant, NRI Taxi Service Pvt. Ltd., was represented by Dr. Amit George, Mr. Rishabh Dheer, and Ms. Manmeet Kaur.\n\nThe court directed the Registrar of Trade Marks to proceed with the registration of the application, which is to be advertised within three months. The appellant has given a disclaimer regarding the use of individual components of the subject trademark, \"NRI\" and \"TAXI\", and will not claim any rights over them.\n\nThe court disposed of the appeal along with all pending applications. If there is any opposition to the application, it will be decided on its own merits without being affected by the observations made in this order. The Registry was directed to supply a copy of the present order to the Trade Mark Registry for compliance.\n\nThe key facts of the case are:\n- Case number: C.A.(COMM.IPD-TM) 114/2022\n- Date of decision: January 25, 2023\n- Appellant: NRI Taxi Service Pvt. Ltd.\n- Representatives: Dr. Amit George, Mr. Rishabh Dheer, and Ms. Manmeet Kaur\n- Direction to Registrar of Trade Marks: Proceed with registration and advertise within three months\n- Disclaimer: Appellant will not claim rights over individual components \"NRI\" and \"TAXI\" of the subject trademark.\n\nSource: NRI Taxi vs Registrar.pdf (2023/DHC/000578)",
      "pdf_source": "8. NRI Taxi vs Registrar.pdf",
      "nodes": [
        {
          "title": "Page 5",
          "node_id": "0007",
          "start_index": 5,
          "end_index": 5,
          "summary": "According to page 5 of the PDF \"8. NRI Taxi vs Registrar.pdf\", the High Court of Delhi made the following decisions:\n\n* The appellant, NRI Taxi Service Pvt. Ltd., disclaimed any rights over individual components of the trademark, 'NRI' and 'TAXI' (point 12).\n* The Registrar of Trade Marks was directed to proceed with the registration of the application, with advertisement within three months (point 13).\n* Any opposition to the application will be decided on its own merits (point 14).\n* The appeal and pending applications were disposed of (point 15).\n* The order was issued by Amit Bansal, J. on January 25, 2023.\n \nSource: \"8. NRI Taxi vs Registrar.pdf\" (2023/DHC/000578, C.A.(COMM.IPD-TM) 114/2022)",
          "content": "2023/DHC/000578 \nC.A.(COMM.IPD-TM) 114/2022                                                                                                                         Page 5 of 5 \n \n12. \nThe appellant has already given his disclaimer with regard to using \nthe individual components of the subject trademark. The appellant will not \nclaim any rights over the individual components of the trademark i.e., ‘NRI’ \nand ‘TAXI’. \n13. \nThe Registrar of Trade Marks is accordingly directed to proceed for \nregistration of the application. Let the same be advertised within a period of \nthree months. \n14. \nIf there is any opposition to the said application, the same shall be \ndecided on its own merits without being affected by the observations made \nherein. \n15. \nAccordingly, the appeal along with all pending applications is \ndisposed of.  \n16. \nRegistry to supply a copy of the present order to Trade Mark Registry \nat llc-ipo@gov.in for compliance.  \n \n \n \nAMIT BANSAL, J. \nJANUARY 25, 2023 \nat \nSigned By:SAKSHI\nRAMOLA\nSigning Date:01.26.2023\n21:41:13\nSignature Not Verified",
          "pdf_source": "8. NRI Taxi vs Registrar.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-15T18:27:53.975601",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}