{
  "doc_name": "9. Bennet Coleman vs E1",
  "pdf_source": "9. Bennet Coleman vs E1.pdf",
  "metadata": {
    "document_name": "9. Bennet Coleman vs E1",
    "source_pdf": "9. Bennet Coleman vs E1.pdf",
    "judges": [
      "AMIT BANSAL"
    ],
    "court_name": "HIGH COURT OF DELHI AT NEW DELHI",
    "case_numbers": [
      "253/2019",
      "253/2019",
      "253/2019",
      "253/2019",
      "253/2019",
      "4831/2022",
      "4832/2022",
      "4831/2022"
    ],
    "dhc_numbers": [
      "2022/DHC/005230",
      "2022/DHC/005230",
      "2022/DHC/005230",
      "2022/DHC/005230",
      "2022/DHC/005230",
      "2022/DHC/005230",
      "2022/DHC/005230",
      "2022/DHC/005230"
    ],
    "ia_numbers": [],
    "decision_date": "28 November, 2022",
    "order_date": null,
    "case_type": "Trademark",
    "subject_matter": null,
    "plaintiffs": [
      "Bennett, Coleman and Company Limited"
    ],
    "defendants": [
      "E1 Entertainment Television, LLC and Anr."
    ],
    "appellants": [],
    "respondents": [
      "E1 Entertainment Television, LLC and Anr."
    ],
    "plaintiff_advocates": [
      "Mr. Hemant Singh",
      "Mrs. Mamta Rani Jha",
      "Mr. Amitesh Mishra"
    ],
    "defendant_advocates": [
      "Ms. Shwetasree Majumder",
      "Mr. Prithvi Singh",
      "Ms. Devyani Nath",
      "Ms. Anushkaa Arora",
      "Mr. Sahaj Garg",
      "Mr. Aditya Sharan"
    ],
    "appellant_advocates": [],
    "respondent_advocates": [
      "Ms. Shwetasree Majumder",
      "Mr. Prithvi Singh",
      "Ms. Devyani Nath",
      "Ms. Anushkaa Arora",
      "Mr. Sahaj Garg",
      "Mr. Aditya Sharan"
    ],
    "damages_claimed": "50,000",
    "damages_awarded": null,
    "key_issues": [
      "Maintainability of the rectification petition in view of the judgment of the Supreme Court in Patel Field Marshal Agencies and Anr. v. P.M. Diesels Limited and Ors.",
      "Applicability of Section 124 read with Section 30(2)(e) of the Trade Marks Act, 1999, regarding the requirement of framing a preliminary issue in a suit before filing a rectification application.",
      "Whether the petitioner's awareness of the respondent's trademark registration since 2018 and failure to challenge it in a previous suit bars the present rectification petition.",
      "Interpretation of the judgments of the Supreme Court and the Coordinate Bench of the Delhi High Court in Resilient Innovations Pvt. Ltd. v. Phonepe Private Limited & Anr.",
      "Scope of the rectification petition and whether it is limited to the trademark registration No. 1252812 in class 99.",
      "Relevance of the petitioner's claim of proprietary rights over the trademark \"NOW\" and \"NOW\" formative marks, including \"ENOW\", in the context of the rectification petition.",
      "Effect of the petitioner's failure to have a preliminary issue framed on the alleged invalidity of the respondent's trademark in the previous suit.",
      "Applicability of the Trade Marks Act, 1999, in determining the validity and maintainability of the rectification petition.",
      "Whether the subject matter of the rectification petition is the same as the subject matter of the previous suit, CS(COMM) 253/2019.",
      "Procedure for rectification of trademark registration under the Trade Marks Act, 1999, and the role of the court in determining the maintainability of such petitions."
    ],
    "decision_summary": "**Background:**\nThe case involves a trademark rectification petition filed by Bennett, Coleman and Company Limited (the Petitioner) against E1 Entertainment Television, LLC (the Respondent) in the High Court of Delhi. The Petitioner seeks to rectify the trademark register regarding the Respondent's trademark registration No. 1252812, which is registered in Class 99 (Classes 38 and 41) since December 2, 2003.\n\n**Legal Issues:**\nThe main issue in this case is whether the Petitioner's rectification petition is maintainable, given that the Petitioner was aware of the Respondent's trademark registration since June 6, 2018, and had filed a suit (CS(COMM) 253/2019) against the Respondent on May 10, 2019, without challenging the validity of the Respondent's trademark registration.\n\n**Arguments:**\n\n* The Respondent argued that the Petitioner's rectification petition is not maintainable, relying on the judgment of the Supreme Court in Patel Field Marshal Agencies and Anr. v. P.M. Diesels Limited and Ors. (2018) 2 SCC 112, and a Coordinate Bench of the Delhi High Court in Resilient Innovations Pvt. Ltd. v. Phonepe Private Limited & Anr. (2021) 88 PTC 610. The Respondent claimed that the Petitioner should have framed a preliminary issue on the alleged invalidity of the Respondent's trademark in the earlier suit.\n* The Petitioner argued that the impugned trademark registration is not in issue in the earlier suit (CS(COMM) 253/2019), where the Petitioner claimed proprietary rights over the trademark \"NOW\" and \"NOW\" formative marks, including \"ENOW\". The Petitioner sought an injunction against the Respondent's use of the trademarks \"E! NOW\" and \"E! NEWS NOW\", which are different from the trademark registration No. 1252812.\n\n**Court Findings:**\nThe Court heard the arguments of both parties and considered the relevant provisions of the Trade Marks Act, 1999, specifically Section 30(2)(e) and Section 124(1). The Court noted that the Petitioner was aware of the Respondent's trademark registration since June 6, 2018, and had filed a suit against the Respondent without challenging the validity of the Respondent's trademark registration.\n\n**Decision:**\nThe Court decision is not explicitly stated in the provided text. However, based on the arguments and the legal issues presented, it appears that the Court may dismiss the Petitioner's rectification petition, holding that it is not maintainable due to the Petitioner's failure to challenge the validity of the Respondent's trademark registration in the earlier suit. The Court may rely on the judgments cited by the Respondent, which suggest that a preliminary issue on the alleged invalidity of the Respondent's trademark should have been framed in the earlier suit before filing a rectification petition.",
    "legal_precedents": [
      "(2018) 2 SCC 112"
    ],
    "full_text": "\n--- PAGE 1 ---\n                                    2022/DHC/005230 \nC.O. (COMM.IPD-TM) 243/2022                                                                 Page 1 of 8 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n \n% \n \n \n \n                Date of decision: 28th November, 2022. \n \n+  \n \n \n \nC.O. (COMM.IPD-TM) 243/2022  \n \n \nBENNETT, COLEMAN AND COMPANY  \nLIMITED  \n \n \n \n \n \n..... Petitioner \nThrough: \nMr.Hemant Singh, Mrs.Mamta Rani \nJha \nand \nMr.Amitesh \nMishra, \nAdvocates. \n \n \n \n \nversus \n \n \nE1 ENTERTAINMENT TELEVISION, LLC AND  \nANR.  \n \n \n \n \n \n \n..... Respondents \nThrough: \nMs.Shwetasree Majumder, Mr.Prithvi \nSingh \nand \nMs.Devyani \nNath, \nAdvocates. \n \nMs.Anushkaa Arora, Mr.Sahaj Garg, \nSenior Panel Counsels (UOI) and \nMr.Aditya Sharan, Advocates for R-2 \n \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nAMIT BANSAL, J. (Oral) \n \nI.A. 4831/2022(of the respondent no.1 u/s 151 of CPC) \n1. \nThe present rectification petition has been filed on behalf of the \npetitioner for rectification of the trademark register qua trademark \nregistration no.1252812, which is registered in class 99 (classes 38 and 41) \nin favour of the respondent no.1 since 2nd December, 2003.   \n2. \nThe present application has been filed on behalf of the respondent \nno.1 seeking dismissal of the aforesaid rectification petition.  \n3. \nNotice in this application was issued on 5th March, 2022 and reply has \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:01.12.2022 14:22:17\nSignature Not Verified\n\n--- PAGE 2 ---\n                                    2022/DHC/005230 \nC.O. (COMM.IPD-TM) 243/2022                                                                 Page 2 of 8 \n \nbeen filed on behalf of the respondent no.1. Rejoinder thereto has also been \nfiled on behalf of the respondent no.1.  \n4. \nCounsel for the respondent no.1 submits that the petitioner was aware \nof the registration in favour of the respondent no.1 as far back as on 6th June, \n2018 and despite a suit, being CS(COMM) 253/2019, having been filed by \nthe petitioner against the respondent no.1 on 10th May, 2019, the petitioner \ntook no steps to have a preliminary issue framed on the alleged invalidity of \nthe respondent no.1’s trademark. Therefore, in view of the judgment of the \nSupreme Court in Patel Field Marshal Agencies and Anr. v. P.M. Diesels \nLimited and Ors., (2018) 2 SCC 112, followed by a Coordinate Bench of \nthis Court in Resilient Innovations Pvt. Ltd. v. Phonepe Private Limited & \nAnr., (2021) 88 PTC 610, the present rectification petition filed on behalf of \nthe petitioner is not maintainable.  \n5. \nCounsel for the respondent no.1 has placed reliance on the pleadings \nin the aforesaid suit to submit that the mark in respect of which rectification \nis sought by the petitioner herein, was subject matter of the aforesaid suit. \nTherefore, in terms of Section 124 read with Section 30(2)(e) of the Trade \nMarks Act, 1999, a preliminary issue would be required to be framed in the \naforesaid suit before a rectification application can be filed.  \n6. \nPer contra, the counsel for the petitioner submits that the impugned \ntrademark registration, which is the subject matter of the rectification \npetition, is not in issue in CS(COMM) 253/2019. In the said suit, the \npetitioner has claimed proprietary rights over the trademark “NOW” and \n“NOW” formative marks including “ENOW”.  Reference is this regard has \nbeen \nmade \nto \nparagraphs \n19, \n20 \nand \n21 \nof \nthe \nplaint \nin \nCS(COMM)253/2019. Hence, the petitioner herein has sought injunction \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:01.12.2022 14:22:17\nSignature Not Verified\n\n--- PAGE 3 ---\n                                    2022/DHC/005230 \nC.O. (COMM.IPD-TM) 243/2022                                                                 Page 3 of 8 \n \nagainst the respondent no.1 using the trademarks “E! NOW” and “E! NEWS \nNOW”. Therefore, it is submitted that the judgments relied upon by the \nrespondent no.1 are not applicable in the facts of the present case. \n7. \nI have heard the counsels for the parties. \n8. \nSection 30(2)(e) and Section 124(1) of the Trade Marks Act, 1999 are \nset out hereunder:  \n―30. Limits on effect of registered trade  mark. –  \n 2… A registered trade mark is not infringed where— \n(e) \nthe use of a registered trade mark, being one of two or more \ntrade marks registered under this Act which are identical or nearly \nresemble each other, in exercise of the right to the use of that trade \nmark given by registration under this Act.‖ \n… \n―124. Stay of proceedings where the validity of registration of the \ntrade mark is questioned, etc.— \n(1) Where in any suit for infringement of a trade mark— \n(a) the defendant pleads that registration of the plaintiff‘s trade mark \nis invalid; or \n(b) the defendant raises a defence under clause (e) of sub-section (2) \nof section 30 and the plaintiff pleads the invalidity of registration of \nthe defendant’s trade mark,  \nthe court trying the suit (hereinafter referred to as the court), shall,— \n(i) if any proceedings for rectification of the register in relation to the \nplaintiff‘s or defendant‘s trade mark are pending before the Registrar \nor the Appellate Board, stay the suit pending the final disposal of such \nproceedings; \n(ii) if no such proceedings are pending and the court is satisfied that \nthe plea regarding the invalidity of the registration of the plaintiff’s \nor defendant’s trade mark is prima facie tenable, raise an issue \nregarding the same and adjourn the case for a period of three \nmonths from the date of the framing of the issue in order to enable \nthe party concerned to apply to the Appellate Board for rectification \nof the register.‖ \n \n9. \nTo appreciate the rival submissions, a reference may be made to the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:01.12.2022 14:22:17\nSignature Not Verified\n\n--- PAGE 4 ---\n                                    2022/DHC/005230 \nC.O. (COMM.IPD-TM) 243/2022                                                                 Page 4 of 8 \n \nrelevant paragraphs of the plaint in CS(COMM) 253/2019: \n―3. \nThat the alleged usage of the marks ‗E! NOW‘ and ‗E News \nNOW‘ is a spurious and malafide besides being an afterthought done \nsimply to defeat the rights vested by the Plaintiff in using the mark \nand Logo of ‗NOW‘. \n4… \n(iv) \nThat on 10.10.2018, the Defendant Company filed the evidence \nin support of opposition under Rule 45 in Trade mark Application No. \n3679905 and for the first time claimed its right over the mark E! \nNEWS NOW only and not E Now.‖ \n \n10. \nFrom a reading of the plaint as a whole it emerges that the cause of \naction for filing the aforesaid suit by the petitioner herein was on account of \nrespondent no.1 ascertaining rights over the marks “E! NOW” and “E \nNEWS NOW”. In the prayer clause, a decree of permanent injunction is \nsought against the respondent no.1 herein from using the channel/domain \n“E! NOW” and “E! NEWS NOW”, which is deceptively similar to \npetitioner’s mark “E NOW”. There is no pleading in the plaint with regard \nto the mark “\n/E!”  and no injunction has been sought against the said \nmark. Therefore, the mark “\n/E!” is the not the subject matter of the \naforesaid suit. \n11. \nIn the written statement filed on behalf of the respondent no.1 herein \nin the aforesaid suit, the respondent no.1 has pleaded the registration of the \nmark “\n/E!”, which is the subject matter of the present rectification \npetition. However, the aforesaid pleading in the written statement has not \nbeen raised as a defence to the cause of action pleaded in the plaint in the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:01.12.2022 14:22:17\nSignature Not Verified\n\n--- PAGE 5 ---\n                                    2022/DHC/005230 \nC.O. (COMM.IPD-TM) 243/2022                                                                 Page 5 of 8 \n \naforesaid suit. In view of the aforesaid pleading made in the written \nstatement filed on behalf of the respondent no.1 herein, the petitioner herein \nhas rebutted the same in its replication. Merely because the respondent no.1 \nherein has pleaded in its written statement the fact of registration being \ngranted in its favour in respect of the mark “\n/E!”, would not expand the \nscope of the aforesaid suit. Admittedly, the respondent no.1 has not filed any \nsuit seeking to restrain the petitioner herein from using the said mark. \n12. \nA reading of the written statement filed on behalf of the respondent \nno.1 herein in the aforesaid suit shows that no defence has been raised by the \nrespondent no.1 herein in terms of Section 30(2)(e) of the Trade Marks Act, \n1999. The respondent no.1 has not pleaded that the registered marks of the \nplaintiff are identical to the mark “\n /E!” or nearly resemble each other. \nTherefore, Section 124 (1) (b) of the Trade Marks Act, 1999 is not attracted \nin the present case. It is not the case of the respondent no.1 that the provision \nof Section 124 (1) (a) is attracted in the present case. \n13. \nCounsel for the respondent no.1 has relied upon paragraphs 31 and 32 \nof the judgment in Patel Field Marshal Agencies (supra). The same are set \nout below: \n―31.  Rather, from the résumé of the provisions of the 1958 Act made \nabove, it becomes clear that all questions with regard to the validity \nof a trade mark is required to be decided by the Registrar or the High \nCourt under the 1958 Act or by the Registrar or the IPAB under the \n1999 Act and not by the civil court. The civil court, in fact, is not \nempowered by the Act to decide the said question. Furthermore, the \nAct mandates that the decisions rendered by the prescribed statutory \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:01.12.2022 14:22:17\nSignature Not Verified\n\n--- PAGE 6 ---\n                                    2022/DHC/005230 \nC.O. (COMM.IPD-TM) 243/2022                                                                 Page 6 of 8 \n \nauthority [Registrar/High Court (now IPAB)] will bind the civil court. \nAt the same time, the Act (both old and new) goes on to provide a \ndifferent procedure to govern the exercise of the same jurisdiction in \ntwo different situations. In a case where the issue of invalidity is \nraised or arises independent of a suit, the prescribed statutory \nauthority will be the sole authority to deal with the matter. However, \nin a situation where a suit is pending (whether instituted before or \nafter the filing of a rectification application) the exercise of \njurisdiction by the prescribed statutory authority is contingent on a \nfinding of the civil court as regards the prima facie tenability of the \nplea of invalidity. \n32.  \nConversely, in a situation where the civil court does not find a \ntriable issue on the plea of invalidity the remedy of an aggrieved party \nwould not be to move under Sections 46/56 of the 1958 Act but to \nchallenge the order of the civil court in appeal. This would be \nnecessary to avoid multiple proceedings on the same issue and \nresultant conflict of decisions.‖ \n \n14. \nIn the aforesaid judgment, relied upon by the respondent no.1, the \ndefendants had contested the validity of the plaintiffs’ trade mark “Field \nMarshal” in their written statement and claimed that the same was liable to \nbe rectified by the Trademark Registry. Similarly, in Resilient Innovations \nPvt. Ltd. (supra), in the written statement filed on behalf of the petitioner \ntherein (the defendant in the suit between the parties), it was pleaded that the \nregistration in favour of the plaintiff therein was invalid. Therefore, the \naforesaid cases were covered under Section 124 (1) (a) of the Trade Marks \nAct, 1999, which is not the case of the respondent no.1 here. Hence, the \naforesaid judgments would not come to the aid of the respondent no.1.  \n15. \nIn my considered view, the mark “\n/E!”, which is the subject \nmatter of the present rectification petition, is not the subject matter of \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:01.12.2022 14:22:17\nSignature Not Verified\n\n--- PAGE 7 ---\n                                    2022/DHC/005230 \nC.O. (COMM.IPD-TM) 243/2022                                                                 Page 7 of 8 \n \nCS(COMM)253/2019. In fact, the cause of action for filing the present \nrectification petition was on account of the petitioner coming to know that \nthe respondent no.1 has claimed exclusive proprietary rights over the mark \n“\n/E!”, when the respondent no.1 issued notices of opposition on 11th \nApril, 2018 against the petitioner’s applications for registration of its \ntrademarks.   \n16. \nIn view of the aforesaid discussion, Section 124 of the Trademarks \nAct, 1999 would not apply in the present case. There is no merit in the \npresent application and the same is dismissed. \nI.A. 4832/2022 (of the respondent no.1 seeking extension of time to file \ncounter statement/reply) \n \n17. \n The present application has been filed on behalf of the respondent \nno.1 seeking permission to file counter statement/reply after the issue of \nnon-admissibility of the present rectification petition as pleaded in I.A. \n4831/2022 is decided.  \n18. \nCounsel for the respondent no.1 submits that the present application \nhas been filed bonafide before 60 days period for filing the counter \nstatement/reply had expired. \n19. \nCounsel for the petitioner opposes the present application. He submits \nthat the present application has been filed in a malafide manner, only to \ndelay the proceedings in the present rectification petition. \n20. \nI have heard the counsels for the parties.   \n21. \nIn the facts and circumstances of the case, the respondent no.1 is \npermitted to file its counter statement/reply within four weeks from today \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:01.12.2022 14:22:17\nSignature Not Verified\n\n--- PAGE 8 ---\n                                    2022/DHC/005230 \nC.O. (COMM.IPD-TM) 243/2022                                                                 Page 8 of 8 \n \nsubject to payment of costs of Rs.50,000/- to the petitioner. \nC.O. (COMM.IPD-TM) 243/2022 \n22. \nIn view of the directions above, counter statement/reply be filed by \nthe respondent no.1 within four weeks from today.  \n23. \nRejoinder thereto, if any, be filed within four weeks thereafter. \n24. \nList before the Joint Registrar for completion of pleadings on 02nd \nFebruary, 2023. \n25. \nList before Court on 15th March, 2023. \n \n \nAMIT BANSAL, J \nNOVEMBER 28, 2022 \ndk \n \n \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:01.12.2022 14:22:17\nSignature Not Verified\n"
  },
  "total_pages": 8,
  "tree_structure": [
    {
      "title": "Case Header and Parties",
      "node_id": "0003",
      "start_index": 1,
      "end_index": 2,
      "summary": "According to the provided PDF document, \"Bennet Coleman vs E1.pdf\", a case was heard in the High Court of Delhi at New Delhi. The petitioner, Bennett, Coleman and Company Limited, filed a rectification petition against the respondent, E1 Entertainment Television, LLC and Anr., regarding trademark registration no.1252812, registered in class 99 (classes 38 and 41) since December 2, 2003.\n\nThe respondent filed an application seeking dismissal of the rectification petition. The petitioner was aware of the registration as far back as June 6, 2018, and had filed a suit, CS(COMM) 253/2019, against the respondent on May 10, 2019. However, the petitioner did not take steps to have a preliminary issue framed on the alleged invalidity of the respondent's trademark.\n\nThe respondent's counsel argued that the rectification petition was not maintainable, citing the Supreme Court's judgment in Patel Field Marshal Agencies and Anr. v. P.M. Diesels Limited and Ors. The petitioner's counsel countered that the impugned trademark registration was not in issue in CS(COMM) 253/2019.\n\nThe decision was made on November 28, 2022, by Hon'ble Mr. Justice Amit Bansal. The application, I.A. 4831/2022, was filed under Section 151 of the CPC. The details of the arguments, decisions, and parties involved can be found in the provided PDF document. \n\nSource: \"Bennet Coleman vs E1.pdf\"",
      "pdf_source": "9. Bennet Coleman vs E1.pdf",
      "nodes": [
        {
          "title": "Page 1",
          "node_id": "0001",
          "start_index": 1,
          "end_index": 1,
          "summary": "According to page 1 of the PDF \"9. Bennet Coleman vs E1.pdf\", a rectification petition (C.O. (COMM.IPD-TM) 243/2022) was filed by Bennett, Coleman and Company Limited against E1 Entertainment Television, LLC and another respondent. The petition seeks rectification of trademark registration no.1252812, registered in class 99 (classes 38 and 41) in favor of the respondent since December 2, 2003. The respondent filed an application (I.A. 4831/2022) to dismiss the rectification petition. Notice was issued on March 5, 2022, and a reply was received. The case was heard by Hon'ble Mr. Justice Amit Bansal on November 28, 2022. The petitioners were represented by Mr. Hemant Singh, Mrs. Mamta Rani Jha, and Mr. Amitesh Mishra, while the respondents were represented by Ms. Shwetasree Majumder, Mr. Prithvi Singh, and Ms. Devyani Nath.",
          "content": "2022/DHC/005230 \nC.O. (COMM.IPD-TM) 243/2022                                                                 Page 1 of 8 \n \n* \nIN  THE  HIGH  COURT  OF  DELHI  AT  NEW  DELHI \n \n% \n \n \n \n                Date of decision: 28th November, 2022. \n \n+  \n \n \n \nC.O. (COMM.IPD-TM) 243/2022  \n \n \nBENNETT, COLEMAN AND COMPANY  \nLIMITED  \n \n \n \n \n \n..... Petitioner \nThrough: \nMr.Hemant Singh, Mrs.Mamta Rani \nJha \nand \nMr.Amitesh \nMishra, \nAdvocates. \n \n \n \n \nversus \n \n \nE1 ENTERTAINMENT TELEVISION, LLC AND  \nANR.  \n \n \n \n \n \n \n..... Respondents \nThrough: \nMs.Shwetasree Majumder, Mr.Prithvi \nSingh \nand \nMs.Devyani \nNath, \nAdvocates. \n \nMs.Anushkaa Arora, Mr.Sahaj Garg, \nSenior Panel Counsels (UOI) and \nMr.Aditya Sharan, Advocates for R-2 \n \nCORAM: \nHON'BLE MR. JUSTICE AMIT BANSAL \n \nAMIT BANSAL, J. (Oral) \n \nI.A. 4831/2022(of the respondent no.1 u/s 151 of CPC) \n1. \nThe present rectification petition has been filed on behalf of the \npetitioner for rectification of the trademark register qua trademark \nregistration no.1252812, which is registered in class 99 (classes 38 and 41) \nin favour of the respondent no.1 since 2nd December, 2003.   \n2. \nThe present application has been filed on behalf of the respondent \nno.1 seeking dismissal of the aforesaid rectification petition.  \n3. \nNotice in this application was issued on 5th March, 2022 and reply has \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:01.12.2022 14:22:17\nSignature Not Verified",
          "pdf_source": "9. Bennet Coleman vs E1.pdf",
          "nodes": []
        },
        {
          "title": "Page 2",
          "node_id": "0002",
          "start_index": 2,
          "end_index": 2,
          "summary": "According to page 2 of the PDF \"9. Bennet Coleman vs E1.pdf\", a rectification petition (C.O. (COMM.IPD-TM) 243/2022) was filed by Bennett, Coleman and Company Limited. The respondent no.1 submitted that the petitioner was aware of the trademark registration since June 6, 2018, and had filed a suit (CS(COMM) 253/2019) on May 10, 2019, but did not frame a preliminary issue on the trademark's validity. The respondent cited the Supreme Court judgment in Patel Field Marshal Agencies and Anr. v. P.M. Diesels Limited and Ors. (2018) to argue that the rectification petition is not maintainable. The petitioner argued that the impugned trademark registration is not in issue in the aforementioned suit. The case was decided on November 28, 2022. (Source: 9. Bennet Coleman vs E1.pdf, page 2)",
          "content": "2022/DHC/005230 \nC.O. (COMM.IPD-TM) 243/2022                                                                 Page 2 of 8 \n \nbeen filed on behalf of the respondent no.1. Rejoinder thereto has also been \nfiled on behalf of the respondent no.1.  \n4. \nCounsel for the respondent no.1 submits that the petitioner was aware \nof the registration in favour of the respondent no.1 as far back as on 6th June, \n2018 and despite a suit, being CS(COMM) 253/2019, having been filed by \nthe petitioner against the respondent no.1 on 10th May, 2019, the petitioner \ntook no steps to have a preliminary issue framed on the alleged invalidity of \nthe respondent no.1’s trademark. Therefore, in view of the judgment of the \nSupreme Court in Patel Field Marshal Agencies and Anr. v. P.M. Diesels \nLimited and Ors., (2018) 2 SCC 112, followed by a Coordinate Bench of \nthis Court in Resilient Innovations Pvt. Ltd. v. Phonepe Private Limited & \nAnr., (2021) 88 PTC 610, the present rectification petition filed on behalf of \nthe petitioner is not maintainable.  \n5. \nCounsel for the respondent no.1 has placed reliance on the pleadings \nin the aforesaid suit to submit that the mark in respect of which rectification \nis sought by the petitioner herein, was subject matter of the aforesaid suit. \nTherefore, in terms of Section 124 read with Section 30(2)(e) of the Trade \nMarks Act, 1999, a preliminary issue would be required to be framed in the \naforesaid suit before a rectification application can be filed.  \n6. \nPer contra, the counsel for the petitioner submits that the impugned \ntrademark registration, which is the subject matter of the rectification \npetition, is not in issue in CS(COMM) 253/2019. In the said suit, the \npetitioner has claimed proprietary rights over the trademark “NOW” and \n“NOW” formative marks including “ENOW”.  Reference is this regard has \nbeen \nmade \nto \nparagraphs \n19, \n20 \nand \n21 \nof \nthe \nplaint \nin \nCS(COMM)253/2019. Hence, the petitioner herein has sought injunction \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:01.12.2022 14:22:17\nSignature Not Verified",
          "pdf_source": "9. Bennet Coleman vs E1.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Background and Facts",
      "node_id": "0006",
      "start_index": 3,
      "end_index": 4,
      "summary": "According to the PDF document \"Bennet Coleman vs E1.pdf\", a legal proceeding (C.O. (COMM.IPD-TM) 243/2022) was held at the High Court of Delhi on November 28, 2022. The petitioner, Bennett, Coleman and Company Limited, was represented by advocates Mr. Hemant Singh, Mrs. Mamta Rani Jha, and Mr. Amitesh Mishra. The respondent, E1, was accused of using the trademarks \"E! NOW\" and \"E! NEWS NOW\", which the petitioner claimed were similar to their mark \"NOW\".\n\nThe court considered sections 30(2)(e) and 124(1) of the Trade Marks Act, 1999, which pertain to the limits on the effect of a registered trademark and the stay of proceedings where the validity of registration is questioned. The respondent argued that the judgments relied upon by the petitioner were not applicable in this case.\n\nThe court reviewed the plaint in CS(COMM) 253/2019 and noted that the cause of action was the respondent's claim of rights over the marks \"E! NOW\" and \"E! NEWS NOW\". The petitioner sought a decree of permanent injunction against the respondent's use of these marks, which were deemed deceptively similar to the petitioner's mark \"E NOW\". The mark \"/E!\" was not the subject matter of the suit, but was mentioned in the respondent's written statement as a registered mark. (Source: Bennet Coleman vs E1.pdf, pages 1-4)",
      "pdf_source": "9. Bennet Coleman vs E1.pdf",
      "nodes": [
        {
          "title": "Page 3",
          "node_id": "0004",
          "start_index": 3,
          "end_index": 3,
          "summary": "According to page 3 of the PDF \"9. Bennet Coleman vs E1.pdf\", the case is C.O. (COMM.IPD-TM) 243/2022 in the High Court of Delhi. The petitioner, Bennett, Coleman and Company Limited, is represented by advocates Mr. Hemant Singh, Mrs. Mamta Rani Jha, and Mr. Amitesh Mishra. The respondent is using trademarks \"E! NOW\" and \"E! NEWS NOW\". The court refers to Section 30(2)(e) and Section 124(1) of the Trade Marks Act, 1999, regarding limits on the effect of registered trademarks and stay of proceedings. The court has heard the counsels and will consider the rival submissions. The decision date is November 28, 2022. (Source: 9. Bennet Coleman vs E1.pdf, page 3)",
          "content": "2022/DHC/005230 \nC.O. (COMM.IPD-TM) 243/2022                                                                 Page 3 of 8 \n \nagainst the respondent no.1 using the trademarks “E! NOW” and “E! NEWS \nNOW”. Therefore, it is submitted that the judgments relied upon by the \nrespondent no.1 are not applicable in the facts of the present case. \n7. \nI have heard the counsels for the parties. \n8. \nSection 30(2)(e) and Section 124(1) of the Trade Marks Act, 1999 are \nset out hereunder:  \n―30. Limits on effect of registered trade  mark. –  \n 2… A registered trade mark is not infringed where— \n(e) \nthe use of a registered trade mark, being one of two or more \ntrade marks registered under this Act which are identical or nearly \nresemble each other, in exercise of the right to the use of that trade \nmark given by registration under this Act.‖ \n… \n―124. Stay of proceedings where the validity of registration of the \ntrade mark is questioned, etc.— \n(1) Where in any suit for infringement of a trade mark— \n(a) the defendant pleads that registration of the plaintiff‘s trade mark \nis invalid; or \n(b) the defendant raises a defence under clause (e) of sub-section (2) \nof section 30 and the plaintiff pleads the invalidity of registration of \nthe defendant’s trade mark,  \nthe court trying the suit (hereinafter referred to as the court), shall,— \n(i) if any proceedings for rectification of the register in relation to the \nplaintiff‘s or defendant‘s trade mark are pending before the Registrar \nor the Appellate Board, stay the suit pending the final disposal of such \nproceedings; \n(ii) if no such proceedings are pending and the court is satisfied that \nthe plea regarding the invalidity of the registration of the plaintiff’s \nor defendant’s trade mark is prima facie tenable, raise an issue \nregarding the same and adjourn the case for a period of three \nmonths from the date of the framing of the issue in order to enable \nthe party concerned to apply to the Appellate Board for rectification \nof the register.‖ \n \n9. \nTo appreciate the rival submissions, a reference may be made to the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:01.12.2022 14:22:17\nSignature Not Verified",
          "pdf_source": "9. Bennet Coleman vs E1.pdf",
          "nodes": []
        },
        {
          "title": "Page 4",
          "node_id": "0005",
          "start_index": 4,
          "end_index": 4,
          "summary": "According to page 4 of the PDF \"9. Bennet Coleman vs E1.pdf\", the court is reviewing a case where Bennett, Coleman and Company Limited is the petitioner. The relevant paragraphs of the plaint in CS(COMM) 253/2019 state that the alleged usage of the marks 'E! NOW' and 'E News NOW' is spurious and malafide. The defendant company claimed rights over the mark 'E! NEWS NOW' on 10.10.2018. The court notes that the cause of action for filing the suit was the respondent's ascertainment of rights over the marks \"E! NOW\" and \"E NEWS NOW\". The mark \"/E!\" is not the subject matter of the suit, but was pleaded in the written statement filed by the respondent. (Source: 9. Bennet Coleman vs E1.pdf, page 4)",
          "content": "2022/DHC/005230 \nC.O. (COMM.IPD-TM) 243/2022                                                                 Page 4 of 8 \n \nrelevant paragraphs of the plaint in CS(COMM) 253/2019: \n―3. \nThat the alleged usage of the marks ‗E! NOW‘ and ‗E News \nNOW‘ is a spurious and malafide besides being an afterthought done \nsimply to defeat the rights vested by the Plaintiff in using the mark \nand Logo of ‗NOW‘. \n4… \n(iv) \nThat on 10.10.2018, the Defendant Company filed the evidence \nin support of opposition under Rule 45 in Trade mark Application No. \n3679905 and for the first time claimed its right over the mark E! \nNEWS NOW only and not E Now.‖ \n \n10. \nFrom a reading of the plaint as a whole it emerges that the cause of \naction for filing the aforesaid suit by the petitioner herein was on account of \nrespondent no.1 ascertaining rights over the marks “E! NOW” and “E \nNEWS NOW”. In the prayer clause, a decree of permanent injunction is \nsought against the respondent no.1 herein from using the channel/domain \n“E! NOW” and “E! NEWS NOW”, which is deceptively similar to \npetitioner’s mark “E NOW”. There is no pleading in the plaint with regard \nto the mark “\n/E!”  and no injunction has been sought against the said \nmark. Therefore, the mark “\n/E!” is the not the subject matter of the \naforesaid suit. \n11. \nIn the written statement filed on behalf of the respondent no.1 herein \nin the aforesaid suit, the respondent no.1 has pleaded the registration of the \nmark “\n/E!”, which is the subject matter of the present rectification \npetition. However, the aforesaid pleading in the written statement has not \nbeen raised as a defence to the cause of action pleaded in the plaint in the \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:01.12.2022 14:22:17\nSignature Not Verified",
          "pdf_source": "9. Bennet Coleman vs E1.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Legal Arguments",
      "node_id": "0009",
      "start_index": 5,
      "end_index": 6,
      "summary": "According to the PDF document \"Bennet Coleman vs E1.pdf\", a legal case was heard in the High Court of Delhi at New Delhi (Case No. 2022/DHC/005230, C.O. (COMM.IPD-TM) 243/2022). The petitioner, Bennett, Coleman and Company Limited, was represented by advocates Mr. Hemant Singh, Mrs. Mamta Rani Jha, and Mr. Amitesh Mishra.\n\nThe respondent No.1 had filed a written statement pleading that the mark \"/E!\" was registered in their favor, but did not file a suit to restrain the petitioner from using the mark. The petitioner argued that the respondent No.1 had not raised a defense under Section 30(2)(e) of the Trade Marks Act, 1999, and that Section 124(1)(b) was not applicable in this case.\n\nThe respondent No.1 relied on the judgment in Patel Field Marshal Agencies, which stated that the civil court is not empowered to decide on the validity of a trade mark. However, the court noted that the respondent No.1 had not pleaded that the registered marks of the plaintiff were identical or nearly resembled each other, and therefore Section 124(1)(a) was not attracted in this case.\n\nThe court decision was made on November 28, 2022. The document is digitally signed by Amit Bansal on December 1, 2022. The case highlights the importance of proper pleading and the application of relevant sections of the Trade Marks Act, 1999, in intellectual property disputes. (Source: Bennet Coleman vs E1.pdf)",
      "pdf_source": "9. Bennet Coleman vs E1.pdf",
      "nodes": [
        {
          "title": "Page 5",
          "node_id": "0007",
          "start_index": 5,
          "end_index": 5,
          "summary": "According to page 5 of the PDF \"9. Bennet Coleman vs E1.pdf\", the petitioner, Bennett, Coleman and Company Limited, has rebutted the respondent's written statement. The respondent has not filed a suit to restrain the petitioner from using the mark \"/E!\" and has not pleaded that the registered marks are identical or nearly resemble each other, as per Section 30(2)(e) of the Trade Marks Act, 1999. The respondent's counsel relied on paragraphs 31 and 32 of the judgment in Patel Field Marshal Agencies, but the court notes that Section 124 (1) (b) of the Trade Marks Act, 1999 is not attracted in this case. The decision was made on November 28, 2022, in the High Court of Delhi (Case No. 2022/DHC/005230). (Source: 9. Bennet Coleman vs E1.pdf, page 5)",
          "content": "2022/DHC/005230 \nC.O. (COMM.IPD-TM) 243/2022                                                                 Page 5 of 8 \n \naforesaid suit. In view of the aforesaid pleading made in the written \nstatement filed on behalf of the respondent no.1 herein, the petitioner herein \nhas rebutted the same in its replication. Merely because the respondent no.1 \nherein has pleaded in its written statement the fact of registration being \ngranted in its favour in respect of the mark “\n/E!”, would not expand the \nscope of the aforesaid suit. Admittedly, the respondent no.1 has not filed any \nsuit seeking to restrain the petitioner herein from using the said mark. \n12. \nA reading of the written statement filed on behalf of the respondent \nno.1 herein in the aforesaid suit shows that no defence has been raised by the \nrespondent no.1 herein in terms of Section 30(2)(e) of the Trade Marks Act, \n1999. The respondent no.1 has not pleaded that the registered marks of the \nplaintiff are identical to the mark “\n /E!” or nearly resemble each other. \nTherefore, Section 124 (1) (b) of the Trade Marks Act, 1999 is not attracted \nin the present case. It is not the case of the respondent no.1 that the provision \nof Section 124 (1) (a) is attracted in the present case. \n13. \nCounsel for the respondent no.1 has relied upon paragraphs 31 and 32 \nof the judgment in Patel Field Marshal Agencies (supra). The same are set \nout below: \n―31.  Rather, from the résumé of the provisions of the 1958 Act made \nabove, it becomes clear that all questions with regard to the validity \nof a trade mark is required to be decided by the Registrar or the High \nCourt under the 1958 Act or by the Registrar or the IPAB under the \n1999 Act and not by the civil court. The civil court, in fact, is not \nempowered by the Act to decide the said question. Furthermore, the \nAct mandates that the decisions rendered by the prescribed statutory \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:01.12.2022 14:22:17\nSignature Not Verified",
          "pdf_source": "9. Bennet Coleman vs E1.pdf",
          "nodes": []
        },
        {
          "title": "Page 6",
          "node_id": "0008",
          "start_index": 6,
          "end_index": 6,
          "summary": "According to page 6 of the PDF \"9. Bennet Coleman vs E1.pdf\", the court discusses the jurisdiction of statutory authorities and civil courts in matters of trademark invalidity. The court notes that in situations where a suit is pending, the exercise of jurisdiction by the prescribed statutory authority is contingent on a finding of the civil court regarding the prima facie tenability of the plea of invalidity. The court also references a previous judgment, stating that it does not apply to the current case as it falls under a different section of the Trade Marks Act, 1999. The case, C.O. (COMM.IPD-TM) 243/2022, was decided on November 28, 2022. The petitioners, Bennett, Coleman and Company Limited, were represented by advocates Mr. Hemant Singh, Mrs. Mamta Rani Jha, and Mr. Amitesh Mishra. (Source: 9. Bennet Coleman vs E1.pdf, page 6)",
          "content": "2022/DHC/005230 \nC.O. (COMM.IPD-TM) 243/2022                                                                 Page 6 of 8 \n \nauthority [Registrar/High Court (now IPAB)] will bind the civil court. \nAt the same time, the Act (both old and new) goes on to provide a \ndifferent procedure to govern the exercise of the same jurisdiction in \ntwo different situations. In a case where the issue of invalidity is \nraised or arises independent of a suit, the prescribed statutory \nauthority will be the sole authority to deal with the matter. However, \nin a situation where a suit is pending (whether instituted before or \nafter the filing of a rectification application) the exercise of \njurisdiction by the prescribed statutory authority is contingent on a \nfinding of the civil court as regards the prima facie tenability of the \nplea of invalidity. \n32.  \nConversely, in a situation where the civil court does not find a \ntriable issue on the plea of invalidity the remedy of an aggrieved party \nwould not be to move under Sections 46/56 of the 1958 Act but to \nchallenge the order of the civil court in appeal. This would be \nnecessary to avoid multiple proceedings on the same issue and \nresultant conflict of decisions.‖ \n \n14. \nIn the aforesaid judgment, relied upon by the respondent no.1, the \ndefendants had contested the validity of the plaintiffs’ trade mark “Field \nMarshal” in their written statement and claimed that the same was liable to \nbe rectified by the Trademark Registry. Similarly, in Resilient Innovations \nPvt. Ltd. (supra), in the written statement filed on behalf of the petitioner \ntherein (the defendant in the suit between the parties), it was pleaded that the \nregistration in favour of the plaintiff therein was invalid. Therefore, the \naforesaid cases were covered under Section 124 (1) (a) of the Trade Marks \nAct, 1999, which is not the case of the respondent no.1 here. Hence, the \naforesaid judgments would not come to the aid of the respondent no.1.  \n15. \nIn my considered view, the mark “\n/E!”, which is the subject \nmatter of the present rectification petition, is not the subject matter of \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:01.12.2022 14:22:17\nSignature Not Verified",
          "pdf_source": "9. Bennet Coleman vs E1.pdf",
          "nodes": []
        }
      ]
    },
    {
      "title": "Court Decision",
      "node_id": "0012",
      "start_index": 7,
      "end_index": 8,
      "summary": "According to the provided PDF document, \"Bennet Coleman vs E1.pdf\", the Delhi High Court made a decision on November 28, 2022, in the case C.O. (COMM.IPD-TM) 243/2022. The petitioner, Bennett, Coleman and Company Limited, was represented by advocates Mr. Hemant Singh, Mrs. Mamta Rani Jha, and Mr. Amitesh Mishra. \n\nThe court ruled that Section 124 of the Trademarks Act, 1999, would not apply in this case, and therefore, the present application was dismissed. The respondent no.1 had filed an application (I.A. 4832/2022) seeking permission to file a counter statement/reply, which was granted. The respondent no.1 was allowed to file its counter statement/reply within four weeks, subject to payment of costs of Rs.50,000/- to the petitioner.\n\nThe court directed the respondent no.1 to file its counter statement/reply within four weeks and the petitioner to file a rejoinder, if any, within four weeks thereafter. The case was listed before the Joint Registrar for completion of pleadings on February 2, 2023, and before the Court on March 15, 2023. The decision was made by Judge Amit Bansal, who digitally signed the document on December 1, 2022. The PDF document (2022/DHC/005230) provides detailed information about the court proceedings, including the facts, arguments, and decisions made in the case.",
      "pdf_source": "9. Bennet Coleman vs E1.pdf",
      "nodes": [
        {
          "title": "Page 7",
          "node_id": "0010",
          "start_index": 7,
          "end_index": 7,
          "summary": "According to page 7 of the PDF \"9. Bennet Coleman vs E1.pdf\", the court discussed the rectification petition filed by Bennett, Coleman and Company Limited. The petitioner came to know about the respondent's claim of exclusive proprietary rights over the mark \"E!\" on April 11, 2018, when the respondent issued notices of opposition. The court decided that Section 124 of the Trademarks Act, 1999 would not apply in this case and dismissed the application. \n\nThe respondent's application (I.A. 4832/2022) to file a counter statement/reply was granted, with permission to file within four weeks. The petitioner's counsel opposed the application, claiming it was filed to delay proceedings. The court's decision was made on November 28, 2022, and the order was signed by Amit Bansal on December 1, 2022. (Source: 9. Bennet Coleman vs E1.pdf, page 7)",
          "content": "2022/DHC/005230 \nC.O. (COMM.IPD-TM) 243/2022                                                                 Page 7 of 8 \n \nCS(COMM)253/2019. In fact, the cause of action for filing the present \nrectification petition was on account of the petitioner coming to know that \nthe respondent no.1 has claimed exclusive proprietary rights over the mark \n“\n/E!”, when the respondent no.1 issued notices of opposition on 11th \nApril, 2018 against the petitioner’s applications for registration of its \ntrademarks.   \n16. \nIn view of the aforesaid discussion, Section 124 of the Trademarks \nAct, 1999 would not apply in the present case. There is no merit in the \npresent application and the same is dismissed. \nI.A. 4832/2022 (of the respondent no.1 seeking extension of time to file \ncounter statement/reply) \n \n17. \n The present application has been filed on behalf of the respondent \nno.1 seeking permission to file counter statement/reply after the issue of \nnon-admissibility of the present rectification petition as pleaded in I.A. \n4831/2022 is decided.  \n18. \nCounsel for the respondent no.1 submits that the present application \nhas been filed bonafide before 60 days period for filing the counter \nstatement/reply had expired. \n19. \nCounsel for the petitioner opposes the present application. He submits \nthat the present application has been filed in a malafide manner, only to \ndelay the proceedings in the present rectification petition. \n20. \nI have heard the counsels for the parties.   \n21. \nIn the facts and circumstances of the case, the respondent no.1 is \npermitted to file its counter statement/reply within four weeks from today \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:01.12.2022 14:22:17\nSignature Not Verified",
          "pdf_source": "9. Bennet Coleman vs E1.pdf",
          "nodes": []
        },
        {
          "title": "Page 8",
          "node_id": "0011",
          "start_index": 8,
          "end_index": 8,
          "summary": "According to page 8 of the PDF \"9. Bennet Coleman vs E1.pdf\", the court proceedings (2022/DHC/005230, C.O. (COMM.IPD-TM) 243/2022) involve Bennett, Coleman and Company Limited as the petitioner. The key points are:\n\n* The respondent is directed to file a counter statement/reply within four weeks.\n* A rejoinder can be filed within four weeks thereafter.\n* The case is listed for completion of pleadings on February 2, 2023, and before the court on March 15, 2023.\n* The respondent is subject to payment of costs of Rs.50,000/- to the petitioner.\n* The decision was made by Judge Amit Bansal on November 28, 2022. \n\nSource: \"9. Bennet Coleman vs E1.pdf\", page 8.",
          "content": "2022/DHC/005230 \nC.O. (COMM.IPD-TM) 243/2022                                                                 Page 8 of 8 \n \nsubject to payment of costs of Rs.50,000/- to the petitioner. \nC.O. (COMM.IPD-TM) 243/2022 \n22. \nIn view of the directions above, counter statement/reply be filed by \nthe respondent no.1 within four weeks from today.  \n23. \nRejoinder thereto, if any, be filed within four weeks thereafter. \n24. \nList before the Joint Registrar for completion of pleadings on 02nd \nFebruary, 2023. \n25. \nList before Court on 15th March, 2023. \n \n \nAMIT BANSAL, J \nNOVEMBER 28, 2022 \ndk \n \n \n \nDigitally Signed By:AMIT\nBANSAL\nSigning Date:01.12.2022 14:22:17\nSignature Not Verified",
          "pdf_source": "9. Bennet Coleman vs E1.pdf",
          "nodes": []
        }
      ]
    }
  ],
  "created_at": "2025-07-15T18:28:08.969599",
  "processing_version": "enhanced_pageindex_v5.0_with_classification"
}